{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2015-09-20 - 18-30 Dortmund 3 - 0 Bayer Leverkusen/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. Great display from the home side, you have to say that they were the better side today. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 47:03",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:29",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Hakan Calhanoglu (Bayer Leverkusen), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "2 - 46:22",
            "label": "",
            "description": "One of the Dortmund players unfairly tackled his opponent and conceded a foul. A free kick has been awarded to Bayer Leverkusen."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:39",
            "label": "",
            "description": "OFF THE POST! Gonzalo Castro (Dortmund) drifts into the box to give his teammate support. He receives a fantastic pass and shoots from close range, but it crashes against the right post! It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "2 - 42:52",
            "label": "substitution",
            "description": "That's the end of the game for Pierre Emerick Aubameyang, who is replaced by Gonzalo Castro (Dortmund)."
        },
        {
            "gameTime": "2 - 40:29",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) darts into the penalty area to latch on to a pass, and he unleashes a shot in the direction of the left post. Bernd Leno is alert and denies him with a nice save."
        },
        {
            "gameTime": "2 - 38:40",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) receives a pass and tries his luck with a long range powerful effort. His poorly placed shot lacks accuracy and flies miles wide of the right post."
        },
        {
            "gameTime": "2 - 37:49",
            "label": "attendance",
            "description": "The attendance is 81359."
        },
        {
            "gameTime": "2 - 35:20",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to substitute Henrikh Mkhitaryan and he is replaced by Adrian Ramos (Dortmund)."
        },
        {
            "gameTime": "2 - 34:49",
            "label": "",
            "description": "Flag goes up against Julian Brandt (Bayer Leverkusen) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 32:48",
            "label": "substitution",
            "description": "That will be all from Karim Bellarabi who is being replaced by the fresh legs of Benjamin Henrichs (Bayer Leverkusen)."
        },
        {
            "gameTime": "2 - 32:16",
            "label": "",
            "description": "Adnan Januzaj (Dortmund) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 30:29",
            "label": "",
            "description": "Adnan Januzaj (Dortmund) receives a well played pass inside the penalty area and shoots. He sends the ball into orbit."
        },
        {
            "gameTime": "2 - 28:35",
            "label": "soccer-ball",
            "description": "Pierre Emerick Aubameyang (Dortmund) confidently powers his spot kick into the left side of the goal."
        },
        {
            "gameTime": "2 - 28:30",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 27:30",
            "label": "y-card",
            "description": "Deniz Aytekin shows a yellow card to Wendell (Bayer Leverkusen) for a tough tackle."
        },
        {
            "gameTime": "2 - 27:25",
            "label": "penalty",
            "description": "Dortmund are given a penalty!"
        },
        {
            "gameTime": "2 - 26:07",
            "label": "",
            "description": "Adnan Januzaj (Dortmund) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 25:39",
            "label": "y-card",
            "description": "The foul by Kyriakos Papadopoulos (Bayer Leverkusen) is worthy of a card and a yellow is duly shown by Deniz Aytekin. Dortmund earn a free kick."
        },
        {
            "gameTime": "2 - 24:16",
            "label": "",
            "description": "The free kick from Hakan Calhanoglu (Bayer Leverkusen) is cleared away from danger by one of the defenders."
        },
        {
            "gameTime": "2 - 24:09",
            "label": "",
            "description": "A player from Dortmund brings down an opponent and commits a foul. Bayer Leverkusen have a free kick."
        },
        {
            "gameTime": "2 - 22:15",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the left post."
        },
        {
            "gameTime": "2 - 18:38",
            "label": "substitution",
            "description": "It is time for a substitution. Adnan Januzaj (Dortmund) is on for Jonas Hofmann."
        },
        {
            "gameTime": "2 - 17:15",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Deniz Aytekin with no other option than to blow for a foul."
        },
        {
            "gameTime": "2 - 15:47",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) was close to scoring from the resulting free kick. He unleashed a decent strike from the edge of the box towards the left side of the goal, but the goalkeeper made a great save to keep him out."
        },
        {
            "gameTime": "2 - 15:29",
            "label": "y-card",
            "description": "Sokratis (Dortmund) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Deniz Aytekin didn't think twice about pulling it out of his pocket. A free kick has been awarded to Bayer Leverkusen."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "soccer-ball",
            "description": "Goal 2:0! Henrikh Mkhitaryan laid the ball off to Shinji Kagawa (Dortmund), who shot from close range into the bottom right corner, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 11:59",
            "label": "",
            "description": "Wendell (Bayer Leverkusen) swings a cross into the box, but it's far too close to Roman Burki, who smothers the ball."
        },
        {
            "gameTime": "2 - 08:56",
            "label": "corner",
            "description": "Jonas Hofmann (Dortmund) works the corner short."
        },
        {
            "gameTime": "2 - 08:16",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) fails to convert the free kick after the ball is blocked by the defensive wall. Dortmund will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 07:43",
            "label": "",
            "description": "Poor challenge! Hakan Calhanoglu (Bayer Leverkusen) is penalised for tripping and Deniz Aytekin blows his whistle. Dortmund win a free kick."
        },
        {
            "gameTime": "2 - 06:35",
            "label": "",
            "description": "Chicharito (Bayer Leverkusen) picks up a precise pass deep inside the box, but his strike is saved by the keeper."
        },
        {
            "gameTime": "2 - 05:46",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) receives a precise pass and is given time inside the box to send a promising strike towards the bottom left corner. Bernd Leno guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 04:47",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "2 - 02:01",
            "label": "",
            "description": "Jonas Hofmann (Dortmund) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Stefan Kiessling is replaced by Admir Mehmedi (Bayer Leverkusen)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Roger Schmidt has made a change at the break. Julian Brandt (Bayer Leverkusen) has come on in place of Christoph Kramer."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We have seen a few chances and nice movements, but the overall impression of the game is rather average and not hugely entertaining. The home side dominated the first half in most aspects of the game, but the visitors will surely attempt to turn the situation around in the second half. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 46:18",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:04",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) controls a cross inside the six yard box, but unbelievably sends his shot over the bar."
        },
        {
            "gameTime": "1 - 43:23",
            "label": "",
            "description": "Mats Hummels (Dortmund) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Deniz Aytekin blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "y-card",
            "description": "Kevin Kampl (Bayer Leverkusen) sees a yellow card from Deniz Aytekin after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 39:09",
            "label": "",
            "description": "What an opportunity! Karim Bellarabi (Bayer Leverkusen) picked the ball up and fired a projectile of a shot from long range which threatened the goalkeeper. The shot went painfully close to the left post!"
        },
        {
            "gameTime": "1 - 37:45",
            "label": "",
            "description": "Kevin Kampl (Bayer Leverkusen) meets a pass on the edge of the penalty area and shoots towards right side of the goal. He didn't put enough power into the effort, though, and Roman Burki pulls off an easy save."
        },
        {
            "gameTime": "1 - 36:27",
            "label": "",
            "description": "Christoph Kramer (Bayer Leverkusen) commits a rough foul. Deniz Aytekin stops the game and makes a call."
        },
        {
            "gameTime": "1 - 35:13",
            "label": "",
            "description": "Stefan Kiessling (Bayer Leverkusen) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 33:08",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Hakan Calhanoglu (Bayer Leverkusen). Deniz Aytekin saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "1 - 32:31",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) fashions a shot from the edge of the box after receiving an accurate pass. Bernd Leno makes a comfortable save to stop the effort from flying into the middle of the goal."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "",
            "description": "Chicharito (Bayer Leverkusen) was too forceful with his tackle and Deniz Aytekin interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 27:38",
            "label": "corner",
            "description": "Karim Bellarabi (Bayer Leverkusen) takes a short corner kick."
        },
        {
            "gameTime": "1 - 27:30",
            "label": "",
            "description": "Giulio Donati (Bayer Leverkusen) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. Bayer Leverkusen win a corner."
        },
        {
            "gameTime": "1 - 26:45",
            "label": "",
            "description": "Giulio Donati (Bayer Leverkusen) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 26:06",
            "label": "",
            "description": "Sokratis Papastathopoulos (Dortmund) was holding his opponent and can be glad he didn't receive a yellow card."
        },
        {
            "gameTime": "1 - 23:28",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) makes an overly aggressive challenge and Deniz Aytekin blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 21:48",
            "label": "",
            "description": "A pass from Pierre Emerick Aubameyang (Dortmund) is intercepted by Bernd Leno and the move breaks down."
        },
        {
            "gameTime": "1 - 20:06",
            "label": "",
            "description": "Chicharito (Bayer Leverkusen) receives a precise pass inside the box and takes a shot that flies just wide of the right post."
        },
        {
            "gameTime": "1 - 18:48",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Jonas Hofmann (Dortmund) was set free in the area by Shinji Kagawa and he made no mistake with a lovely finish into the bottom left corner. 1:0."
        },
        {
            "gameTime": "1 - 17:08",
            "label": "",
            "description": "Jonas Hofmann (Dortmund) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Bernd Leno to get hold of the ball."
        },
        {
            "gameTime": "1 - 14:49",
            "label": "",
            "description": "That was close by Ilkay Gundogan (Dortmund)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "1 - 13:28",
            "label": "corner",
            "description": "Jonas Hofmann (Dortmund) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 13:12",
            "label": "",
            "description": "Great solo effort by Henrikh Mkhitaryan (Dortmund) as he beats two defenders before firing in a drive from just outside of the box towards the top right corner. The goalkeeper is ready and makes an amazing save. The ball goes out of play. Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 11:29",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) sends a teasing cross into the area, but Bernd Leno intercepts the ball."
        },
        {
            "gameTime": "1 - 10:02",
            "label": "",
            "description": "The ball is cleared after Henrikh Mkhitaryan (Dortmund) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 08:21",
            "label": "",
            "description": "Chicharito (Bayer Leverkusen) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "1 - 07:06",
            "label": "",
            "description": "Deniz Aytekin blows his whistle after Stefan Kiessling (Bayer Leverkusen) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 06:28",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "1 - 06:09",
            "label": "",
            "description": "A player from Bayer Leverkusen pulled an opponent down, forcing the referee to blow his whistle."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "Jonas Hofmann (Dortmund) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 00:23",
            "label": "",
            "description": "The linesman signals that Stefan Kiessling (Bayer Leverkusen) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bayer Leverkusen will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Deniz Aytekin will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bayer Leverkusen have 60 points so far in the competition, of which 27 from away games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang is Dortmund's leading goal scorer with 25 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let's have a look at Dortmund's goals for and against 82:34."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. Great display from the home side, you have to say that they were the better side today. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "Bayer Leverkusen",
    "gameDate": "20/09/2015 - 18:30",
    "gameHomeTeam": "Dortmund",
    "gameScore": "3 - 0"
}