{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-04 - 22-45 Maccabi Tel Aviv 1 - 3 FC Porto/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. FC Porto had more of the game and were superior. Their manager will certainly be the happier of the two managers. Both teams were applying strong pressure, leaving each other little space for combination play."
        },
        {
            "gameTime": "2 - 47:13",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 46:52",
            "label": "",
            "description": "Danilo Pereira (FC Porto) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 46:17",
            "label": "injury",
            "description": "Danilo Pereira (FC Porto) picks up an injury."
        },
        {
            "gameTime": "2 - 45:35",
            "label": "",
            "description": "Ruben Neves (FC Porto) stands over the resultant free kick from 21 metres out and his shot goes well over the bar."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:23",
            "label": "",
            "description": "Carlos Garcia (Maccabi Tel Aviv) is penalised after knocking an opponent down. FC Porto are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 43:26",
            "label": "substitution",
            "description": "Julen Lopetegui has decided to make a change. Gianelli Imbula Wanga (FC Porto) replaces Andre."
        },
        {
            "gameTime": "2 - 42:52",
            "label": "y-card",
            "description": "Tal Ben Haim II. (Maccabi Tel Aviv) sees a yellow card from Anasthasios Sidiropoulos after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 41:13",
            "label": "",
            "description": "Silvestre Varela (FC Porto) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 40:44",
            "label": "",
            "description": "The FC Porto players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 39:30",
            "label": "",
            "description": "Close! Miguel Layun (FC Porto) takes the resulting free kick from a promising positon, but his effort flies inches wide of the right post. The ball goes out of play and Maccabi Tel Aviv will have a goal kick."
        },
        {
            "gameTime": "2 - 39:12",
            "label": "",
            "description": "Tal Ben Haim II. (Maccabi Tel Aviv) brings down his opponent with a very late tackle. FC Porto get a free kick."
        },
        {
            "gameTime": "2 - 38:00",
            "label": "",
            "description": "Eden Ben Basat (Maccabi Tel Aviv) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 36:28",
            "label": "substitution",
            "description": "Here comes a substitution. Nosa Igiebor (Maccabi Tel Aviv) is brought on as a substitute for Dor Peretz."
        },
        {
            "gameTime": "2 - 35:20",
            "label": "",
            "description": "Ivan Marcano (FC Porto) commits a rough challenge and Anasthasios Sidiropoulos blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 34:50",
            "label": "",
            "description": "OFF THE BAR! Vincent Aboubakar (FC Porto) finds some space to meet the corner kick and unleashes a shot that only crashes against the bar!"
        },
        {
            "gameTime": "2 - 34:21",
            "label": "corner",
            "description": "Ruben Neves (FC Porto) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "",
            "description": "Miguel Layun (FC Porto) sends a pass into the box, but his attempt is thwarted and cleared. The referee signals a corner kick to FC Porto."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Ruben Neves (FC Porto) takes it short."
        },
        {
            "gameTime": "2 - 31:30",
            "label": "",
            "description": "FC Porto are playing some nice combination football, sending it precisely from player to player, but a defender shows good anticipation and ends the move with a good block. FC Porto will take a corner kick."
        },
        {
            "gameTime": "2 - 30:33",
            "label": "substitution",
            "description": "We are about to witness a substitution. Silvestre Varela (FC Porto) is replacing Cristian Tello."
        },
        {
            "gameTime": "2 - 29:28",
            "label": "soccer-ball",
            "description": "Eran Zahavi (Maccabi Tel Aviv) coolly converts the penalty. His precise shot goes inside the left post, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 28:48",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 28:36",
            "label": "y-card",
            "description": "Maximiliano Pereira (FC Porto) gets a yellow card. The referee Anasthasios Sidiropoulos made the right call."
        },
        {
            "gameTime": "2 - 28:35",
            "label": "penalty",
            "description": "Maximiliano Pereira (FC Porto) makes a rough challenge and the referee blows for a foul. The referee gives a penalty kick to Maccabi Tel Aviv!"
        },
        {
            "gameTime": "2 - 26:51",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Miguel Layun (FC Porto) was set free in the area by Cristian Tello and made no mistake with a lovely finish into the right side of the net. 0:3."
        },
        {
            "gameTime": "2 - 24:29",
            "label": "",
            "description": "Andre (FC Porto) is having a lively performance. He is causing problems and wanting the ball at every opportunity."
        },
        {
            "gameTime": "2 - 22:19",
            "label": "",
            "description": "Anasthasios Sidiropoulos blows his whistle after Maximiliano Pereira (FC Porto) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "2 - 20:54",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) knew what to do with the ball, but was just a bit unlucky. After receiving a pass, he sent the ball goalwards from some 20 metres out, but it missed the left post by a whisker."
        },
        {
            "gameTime": "2 - 18:13",
            "label": "corner",
            "description": "Ruben Neves (FC Porto) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "2 - 17:51",
            "label": "",
            "description": "Maximiliano Pereira (FC Porto) finds himself in a promising position after receiving an excellent pass into the box, but one of the defenders produces a timely intervention to avert the threat. The ball goes out of play and FC Porto have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 17:04",
            "label": "",
            "description": "Eitan Tibi (Maccabi Tel Aviv) commits a foul after unfairly pressing his opponent during an attacking move."
        },
        {
            "gameTime": "2 - 16:33",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Evandro trots off the pitch and is replaced by Hector Herrera (FC Porto)."
        },
        {
            "gameTime": "2 - 16:16",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) is unlucky with a goal bound effort from the edge of the box. A fortuitous save from Iker Casillas stops the ball from going into the middle of the goal."
        },
        {
            "gameTime": "2 - 14:52",
            "label": "funfact",
            "description": "Total attempts – 9:19. The statistic for corner kicks – 4:10."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "",
            "description": "Unbelievable miss! Evandro (FC Porto) reacts superbly to latch on to a rebound, but he blazes the ball high over the crossbar!"
        },
        {
            "gameTime": "2 - 12:08",
            "label": "",
            "description": "Cristian Tello (FC Porto) drills a low shot from the edge of the box after a brilliant solo effort. The ball heads towards the left post, but the goalkeeper denies him with a fantastic save."
        },
        {
            "gameTime": "2 - 11:32",
            "label": "",
            "description": "A cross following the corner kick finds its way to Eran Zahavi (Maccabi Tel Aviv) inside the box and he manages to steer it to the middle of the target. He is about to start celebrating a goal, but Iker Casillas makes a save in the nick of time and maintains the current score."
        },
        {
            "gameTime": "2 - 11:20",
            "label": "corner",
            "description": "Nikola Mitrovic (Maccabi Tel Aviv) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 11:06",
            "label": "",
            "description": "Tal Ben Haim II. (Maccabi Tel Aviv) slaloms his way past challenges, but an opposing player does well to get the ball away. Maccabi Tel Aviv will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 09:43",
            "label": "corner",
            "description": "Eran Zahavi (Maccabi Tel Aviv) fails to deliver a decent cross from the corner and the ball goes out of play."
        },
        {
            "gameTime": "2 - 09:30",
            "label": "",
            "description": "What a great touch by Eran Zahavi (Maccabi Tel Aviv) as he controls a fine pass into the box and takes a shot to the bottom left corner, but an opposing player makes a clearance. Great defending. Corner kick. Maccabi Tel Aviv will have an opportunity."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "",
            "description": "Dor Peretz (Maccabi Tel Aviv) gets the ball from a rebound and shoots from long range, but sends the ball high over the crossbar. The goalkeeper doesn't have to worry about this one. Very poor attempt."
        },
        {
            "gameTime": "2 - 08:13",
            "label": "",
            "description": "Andre (FC Porto) flashes a in volley from just outside the box, but it goes well wide of the left post. The goalkeeper can stay calm."
        },
        {
            "gameTime": "2 - 07:51",
            "label": "",
            "description": "Eden Ben Basat (Maccabi Tel Aviv) does his best to latch onto a cross into the box, but he can't get to the ball. The ball goes out of play and FC Porto will have a goal kick."
        },
        {
            "gameTime": "2 - 07:28",
            "label": "",
            "description": "Tal Ben Haim II. (Maccabi Tel Aviv) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 06:41",
            "label": "",
            "description": "Tal Ben Haim II. (Maccabi Tel Aviv) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 03:59",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Maximiliano Pereira finds Andre (FC Porto), who jumps highest and steers a close range header into the left side of the goal. His effort was both strong and precise, and Predrag Rajkovic had no chance of stopping that. 0:1."
        },
        {
            "gameTime": "2 - 02:58",
            "label": "corner",
            "description": "Ruben Neves (FC Porto) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 02:23",
            "label": "",
            "description": "Evandro (FC Porto) receives a precise low pass inside the box, controls it and sends it straight at Predrag Rajkovic, who makes a comfortable save. The linesman makes the right call and FC Porto will have a corner."
        },
        {
            "gameTime": "2 - 02:11",
            "label": "",
            "description": "Maccabi Tel Aviv show off their ball retention skills as they exchange one two passes and the move is only interrupted when the final pass is intercepted."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Gil Vermouth will not participate anymore and Nikola Mitrovic (Maccabi Tel Aviv) is coming on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The game is over for Omri Ben Harush. Eden Ben Basat (Maccabi Tel Aviv) comes on for the second half."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Anasthasios Sidiropoulos blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "There was plenty of entertainment during the first 45 minutes. Hopefully more of the same in the second half. Great display from FC Porto so far, looking at stats you have to say that they were the better side during that opening 45 minutes. The home side relies on counter attacks for most of their chances, while the away team try to constantly keep their opponents under pressure."
        },
        {
            "gameTime": "1 - 45:02",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Anasthasios Sidiropoulos has ended it."
        },
        {
            "gameTime": "1 - 43:50",
            "label": "",
            "description": "The ball from the corner kick lands at the feet of Evandro (FC Porto) just outside the box, who takes a shot. The strike heads towards the right post, but it's deflected away thanks to a wonderful intervention by one of the defenders."
        },
        {
            "gameTime": "1 - 43:11",
            "label": "corner",
            "description": "Ruben Neves (FC Porto) takes the corner."
        },
        {
            "gameTime": "1 - 42:59",
            "label": "",
            "description": "Danilo Pereira (FC Porto) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. The ball is out of play and FC Porto manage to earn a corner."
        },
        {
            "gameTime": "1 - 42:48",
            "label": "",
            "description": "Miguel Layun (FC Porto) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "1 - 41:57",
            "label": "y-card",
            "description": "What was Omri Ben Harush (Maccabi Tel Aviv) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "corner",
            "description": "Ruben Neves (FC Porto) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 40:45",
            "label": "",
            "description": "Ruben Neves (FC Porto) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. Good work from FC Porto as they win a corner."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Carlos Garcia (Maccabi Tel Aviv) brings an opponent down and Anasthasios Sidiropoulos interrupts the game."
        },
        {
            "gameTime": "1 - 38:58",
            "label": "corner",
            "description": "Ruben Neves (FC Porto) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 38:28",
            "label": "",
            "description": "Maximiliano Pereira (FC Porto) crosses the ball forward but it is intercepted. FC Porto force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 37:24",
            "label": "",
            "description": "Danilo Pereira (FC Porto) sends a long ball in, but Predrag Rajkovic comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 35:53",
            "label": "",
            "description": "Maximiliano Pereira (FC Porto) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 35:23",
            "label": "corner",
            "description": "The resulting corner from Ruben Neves (FC Porto) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 35:08",
            "label": "",
            "description": "Evandro (FC Porto) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The referee points to the corner flag. It's a corner to FC Porto."
        },
        {
            "gameTime": "1 - 33:39",
            "label": "",
            "description": "What a chance that is! Vincent Aboubakar (FC Porto) wastes a huge opportunity as he receives a beautiful pass inside the box but is somehow only able to prod the ball onto the left post!"
        },
        {
            "gameTime": "1 - 31:10",
            "label": "",
            "description": "Vincent Aboubakar (FC Porto) receives the ball from the set piece on the edge of the box, but fails to score because his shot is blocked."
        },
        {
            "gameTime": "1 - 30:38",
            "label": "",
            "description": "Miguel Layun (FC Porto) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 30:17",
            "label": "",
            "description": "Anasthasios Sidiropoulos interrupts the game for a tactical foul by Eitan Tibi (Maccabi Tel Aviv)."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "",
            "description": "Vincent Aboubakar (FC Porto) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 27:17",
            "label": "",
            "description": "Miguel Layun (FC Porto) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 25:13",
            "label": "",
            "description": "Maximiliano Pereira (FC Porto) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 22:44",
            "label": "",
            "description": "FC Porto seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "1 - 21:35",
            "label": "",
            "description": "Danilo Pereira (FC Porto) fails to find a teammate across the pitch with a long ball. The ball goes out of play and Maccabi Tel Aviv will have a goal kick."
        },
        {
            "gameTime": "1 - 20:51",
            "label": "",
            "description": "Carlos Garcia (Maccabi Tel Aviv) tackles a bit over zealously and Anasthasios Sidiropoulos blows for a foul."
        },
        {
            "gameTime": "1 - 18:39",
            "label": "soccer-ball",
            "description": "Goal! Andre gets to the ball, slips Cristian Tello (FC Porto) into the area and he scores with a delightful chipped finish to make it 0:1."
        },
        {
            "gameTime": "1 - 17:55",
            "label": "funfact",
            "description": "9:19 – this is the total number of shots produced by both teams."
        },
        {
            "gameTime": "1 - 16:59",
            "label": "",
            "description": "Evandro (FC Porto) picks up a pass, lines up a shot and strikes from 25 metres out, but Predrag Rajkovic thwarts the effort which is headed low to the middle of the goal."
        },
        {
            "gameTime": "1 - 15:07",
            "label": "",
            "description": "Eran Zahavi sends over an inswinging corner and Tal Ben Haim II. (Maccabi Tel Aviv) gets his head on the ball, but it goes just wide of the right post."
        },
        {
            "gameTime": "1 - 14:49",
            "label": "corner",
            "description": "There's an opportunity for Eran Zahavi (Maccabi Tel Aviv) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 14:28",
            "label": "",
            "description": "Tal Ben Haim II. (Maccabi Tel Aviv) wasted a huge opportunity! The fans already began to celebrate as he unleashed a powerful shot from the edge of the box after a brilliant solo effort. The ball went towards the bottom left corner, but Iker Casillas made a crucial save! The ball is out of play. A goal scoring opportunity from a corner for Maccabi Tel Aviv."
        },
        {
            "gameTime": "1 - 12:32",
            "label": "corner",
            "description": "Eran Zahavi (Maccabi Tel Aviv) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 12:17",
            "label": "",
            "description": "Gil Vermouth (Maccabi Tel Aviv) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Maccabi Tel Aviv have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 11:23",
            "label": "",
            "description": "Vincent Aboubakar (FC Porto) misses a rebound from close range. His effort floats narrowly over the crossbar!"
        },
        {
            "gameTime": "1 - 11:20",
            "label": "",
            "description": "Miguel Layun (FC Porto) is unlucky with a low drive from the edge of the box. A decent save by Predrag Rajkovic stops the ball from hitting the middle of the net."
        },
        {
            "gameTime": "1 - 11:12",
            "label": "corner",
            "description": "Ruben Neves (FC Porto) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 10:37",
            "label": "corner",
            "description": "Ruben Neves (FC Porto) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger. The referee points to the corner flag and FC Porto will take a corner."
        },
        {
            "gameTime": "1 - 09:56",
            "label": "",
            "description": "Vincent Aboubakar (FC Porto) picks up a pass, lines up a shot and strikes from 22 metres out, but Predrag Rajkovic thwarts the effort which is headed to the right side of the goal. The referee and one of his assistants signal for a corner kick to FC Porto."
        },
        {
            "gameTime": "1 - 09:20",
            "label": "",
            "description": "Bruno Martins Indi (FC Porto) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 09:07",
            "label": "",
            "description": "Ruben Neves (FC Porto) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 08:34",
            "label": "",
            "description": "Anasthasios Sidiropoulos has a clear sight and sees a foul from Omri Ben Harush (Maccabi Tel Aviv). A free kick has been awarded to FC Porto."
        },
        {
            "gameTime": "1 - 07:37",
            "label": "",
            "description": "Ivan Marcano (FC Porto) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 06:04",
            "label": "",
            "description": "What a big chance! Vincent Aboubakar (FC Porto) picks up an inch perfect pass inside the box and fires the ball just over the crossbar. The ball is off of the pitch and it's a goal kick for Maccabi Tel Aviv."
        },
        {
            "gameTime": "1 - 04:17",
            "label": "",
            "description": "Maximiliano Pereira (FC Porto) has the ability to send the ball deep into the penalty area from throw ins and it can lead to very promising situations for his team."
        },
        {
            "gameTime": "1 - 04:05",
            "label": "",
            "description": "Carlos Garcia (Maccabi Tel Aviv) was trying to get to the ball but clattered into the legs of the opponent as well. Anasthasios Sidiropoulos blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 03:20",
            "label": "",
            "description": "Tal Ben Haim II. (Maccabi Tel Aviv) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 02:44",
            "label": "",
            "description": "The FC Porto players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition."
        },
        {
            "gameTime": "1 - 01:06",
            "label": "",
            "description": "Eran Zahavi slides a brilliant pass into Tal Ben Haim II. (Maccabi Tel Aviv), but his shot from inside the box goes a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Maccabi Tel Aviv will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Anasthasios Sidiropoulos."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. FC Porto had more of the game and were superior. Their manager will certainly be the happier of the two managers. Both teams were applying strong pressure, leaving each other little space for combination play."
        }
    ],
    "gameAwayTeam": "FC Porto",
    "gameDate": "04/11/2015 - 22:45",
    "gameHomeTeam": "Maccabi Tel Aviv",
    "gameScore": "1 - 3"
}