{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-09-24 - 21-45 Las Palmas 2 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. We witnessed the away side dominate today's game. The home team really focused on a well organized defence. The away team tried to find the weakness in their opponents defence mainly using rapid counter attacks."
        },
        {
            "gameTime": "2 - 49:09",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 48:16",
            "label": "",
            "description": "Daniel Carvajal clips a neat ball into the box towards Isco (Real Madrid), whose header from the centre of the box goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 46:06",
            "label": "",
            "description": "Karim Benzema (Real Madrid) makes some space to meet a perfect cross inside the box, but he blazes his shot over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "2 - 45:41",
            "label": "y-card",
            "description": "Javier Estrada Fernandez shows a yellow card to for a tough tackle."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:23",
            "label": "",
            "description": "Karim Benzema (Real Madrid) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 43:12",
            "label": "",
            "description": "An unsuccessful long range effort by Luka Modric (Real Madrid) after he collected a pass and unleashed a shot. The ball was directed into the middle of the goal, but the goalkeeper made an easy save."
        },
        {
            "gameTime": "2 - 42:28",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Mauricio Lemos (UD Las Palmas) is coming onto the pitch as Marko Livaja cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 39:31",
            "label": "soccer-ball",
            "description": "Goal 2:2! Sergio Araujo (UD Las Palmas) taps home from close range after the rebound fell kindly into his path."
        },
        {
            "gameTime": "2 - 39:30",
            "label": "",
            "description": "Francisco Casilla pulls off a great save to deny Sergio Araujo (UD Las Palmas), who makes himself some space inside the box and unleashes a quick low drive to the bottom left corner."
        },
        {
            "gameTime": "2 - 36:43",
            "label": "",
            "description": "Gareth Bale (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "2 - 36:31",
            "label": "",
            "description": "Gareth Bale (Real Madrid) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 34:47",
            "label": "substitution",
            "description": "It is time for a substitution. Isco (Real Madrid) is on for Alvaro Morata."
        },
        {
            "gameTime": "2 - 33:56",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 33:27",
            "label": "",
            "description": "Gareth Bale (Real Madrid) rises high to connect with a lofted pass inside the box, but one of his opponents is in the right place at the right time to thwart him. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 31:14",
            "label": "y-card",
            "description": "Daniel Carvajal (Real Madrid) sees a yellow card from Javier Estrada Fernandez after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 28:58",
            "label": "funfact",
            "description": "The total number of attempts is 8:27."
        },
        {
            "gameTime": "2 - 26:37",
            "label": "substitution",
            "description": "Today's match ends for Cristiano Ronaldo who will be replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 25:59",
            "label": "",
            "description": "Luka Modric (Real Madrid) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 25:50",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Luka Modric (Real Madrid)."
        },
        {
            "gameTime": "2 - 25:14",
            "label": "",
            "description": "Karim Benzema (Real Madrid) dribbles into the box, but Javi Varas is quick enough to come off his line and stop him. Real Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 24:07",
            "label": "",
            "description": "Karim Benzema (Real Madrid) is caught offside!"
        },
        {
            "gameTime": "2 - 22:50",
            "label": "substitution",
            "description": "Quique Setien has decided to introduce fresh legs, with Sergio Araujo (UD Las Palmas) replacing Figueroa Cabrera Momo."
        },
        {
            "gameTime": "2 - 21:57",
            "label": "soccer-ball",
            "description": "Goal! Karim Benzema (Real Madrid) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball into the top of the net. It's 1:2."
        },
        {
            "gameTime": "2 - 21:55",
            "label": "",
            "description": "Javi Varas pulls off a great save to deny Cristiano Ronaldo (Real Madrid) after receiving a precise defence splitting pass. The effort is headed for the bottom right corner, but the goalkeeper dives superbly to stop it. Definitely the best save of this match so far!"
        },
        {
            "gameTime": "2 - 19:52",
            "label": "",
            "description": "What a poor attempt! Toni Kroos (Real Madrid) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "2 - 19:30",
            "label": "",
            "description": "Karim Benzema (Real Madrid) receives a precise pass inside the box and drills a promising first time blast towards the middle of the goal. His effort is blocked by Javi Varas who dives to keep the ball out. What a save!"
        },
        {
            "gameTime": "2 - 18:34",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 18:29",
            "label": "substitution",
            "description": "Karim Benzema (Real Madrid) joins the action as a substitute, replacing Marco Asensio."
        },
        {
            "gameTime": "2 - 17:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to find any of his teammates inside the box as his pass is blocked. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "2 - 16:38",
            "label": "",
            "description": "That didn't go as planned! Vicente Gomez (UD Las Palmas) tried his luck from the edge of the box, but his effort low towards the middle of the goal was too weak to get past Francisco Casilla, who easily kept it out."
        },
        {
            "gameTime": "2 - 16:27",
            "label": "",
            "description": "Marco Asensio (Real Madrid) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "2 - 14:04",
            "label": "",
            "description": "Michel (UD Las Palmas) receives a reproachful look from Nabil El Zhar. He latches on to his pass, but the effort from the edge of the box sails high over the crossbar."
        },
        {
            "gameTime": "2 - 13:31",
            "label": "attendance",
            "description": "The attendance is 22520."
        },
        {
            "gameTime": "2 - 12:15",
            "label": "y-card",
            "description": "Javier Estrada Fernandez shows the yellow card to Toni Kroos (Real Madrid) for a heavy challenge."
        },
        {
            "gameTime": "2 - 10:43",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) has a goal ruled out for offside!"
        },
        {
            "gameTime": "2 - 10:33",
            "label": "substitution",
            "description": "Problems for Quique Setien as Jonathan Viera is not able to play anymore. His injury is too serious and Nabil El Zhar (UD Las Palmas) replaces him."
        },
        {
            "gameTime": "2 - 08:32",
            "label": "y-card",
            "description": "The main referee, Javier Estrada Fernandez, is apparently not going to tolerate any discussions. David Garcia (UD Las Palmas) is given a yellow card for dissent."
        },
        {
            "gameTime": "2 - 08:27",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) handles the ball and everyone in the stadium shouts 'handball'."
        },
        {
            "gameTime": "2 - 07:31",
            "label": "",
            "description": "Nacho (Real Madrid) makes an unfair challenge by holding his opponent to prevent him from getting the ball."
        },
        {
            "gameTime": "2 - 05:44",
            "label": "injury",
            "description": "Jonathan Viera (UD Las Palmas) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 05:21",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "2 - 04:38",
            "label": "",
            "description": "Javier Estrada Fernandez blows his whistle as Nacho (Real Madrid) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 02:14",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 01:38",
            "label": "",
            "description": "Gareth Bale (Real Madrid) latches on to a precise defence splitting pass and drills a nice strike from a promising distance towards the middle of the goal. Javi Varas has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Javier Estrada Fernandez blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. Neither team has really been able to control the flow of the game. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 45:07",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:05",
            "label": "",
            "description": "Jonathan Viera (UD Las Palmas) pulls the jersey of one of the opposition players and Javier Estrada Fernandez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 43:09",
            "label": "",
            "description": "Nacho (Real Madrid) wins the ball from the resulting corner but blazes it well over the bar."
        },
        {
            "gameTime": "1 - 43:01",
            "label": "corner",
            "description": "Marco Asensio (Real Madrid) takes the corner."
        },
        {
            "gameTime": "1 - 42:37",
            "label": "",
            "description": "Gareth Bale (Real Madrid) controls a nice lofted pass and shoots from the edge of the box, but his attempt only went low to the middle of the goal, so Javi Varas stops it easily. Real Madrid force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 42:07",
            "label": "funfact",
            "description": "55:45 – the latest ball possession ratio."
        },
        {
            "gameTime": "1 - 41:03",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Javier Estrada Fernandez with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 40:24",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) produces an attempt from the edge of the box which would have most likely endangered the goalkeeper, but one of the defending players blocked it, so we can only speculate about the outcome."
        },
        {
            "gameTime": "1 - 39:52",
            "label": "",
            "description": "Dominguez Tanausu (UD Las Palmas) is penalised for holding. Javier Estrada Fernandez signals a set piece."
        },
        {
            "gameTime": "1 - 37:24",
            "label": "soccer-ball",
            "description": "Goal! Dominguez Tanausu (UD Las Palmas) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball low inside the left post. It's 1:1."
        },
        {
            "gameTime": "1 - 37:20",
            "label": "",
            "description": "Figueroa Cabrera Momo (UD Las Palmas) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 36:50",
            "label": "",
            "description": "Las Palmas seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 32:45",
            "label": "soccer-ball",
            "description": "An unlucky rebound falls to Marco Asensio (Real Madrid) and he scores with a bullet header."
        },
        {
            "gameTime": "1 - 32:40",
            "label": "",
            "description": "Nacho (Real Madrid) goes on a mazy run, skips past two defenders and pulls the trigger in front of the keeper. Javi Varas makes a decent save to deny his effort directed to the bottom right corner."
        },
        {
            "gameTime": "1 - 30:09",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) commits a foul and Javier Estrada Fernandez immediately signals a free kick."
        },
        {
            "gameTime": "1 - 29:54",
            "label": "",
            "description": "Half chance! Gareth Bale (Real Madrid) plays a pass into the box, but Javi Varas reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 29:09",
            "label": "",
            "description": "is clearly in an offside position after the ball is played through to him and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 27:16",
            "label": "",
            "description": "Francisco Casilla gets a well deserved ovation! He pulls off a remarkable save to block a long range effort from Jonathan Viera (UD Las Palmas) towards the bottom left corner. Nice goalkeeping skills!"
        },
        {
            "gameTime": "1 - 26:37",
            "label": "",
            "description": "had a golden opportunity. He volleyed from point blank range towards the middle of the goal, but Francisco Casilla (Real Madrid) was alert and made an amazing save!"
        },
        {
            "gameTime": "1 - 24:17",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) commits a foul after unfairly pressing his opponent during an attacking move."
        },
        {
            "gameTime": "1 - 23:49",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "1 - 22:52",
            "label": "y-card",
            "description": "Roque Mesa (UD Las Palmas) receives a yellow card for infringement."
        },
        {
            "gameTime": "1 - 22:50",
            "label": "",
            "description": "Unsporting behaviour by Roque Mesa (UD Las Palmas)."
        },
        {
            "gameTime": "1 - 21:16",
            "label": "",
            "description": "Javier Estrada Fernandez interrupts the game for a tactical foul by Raphael Varane (Real Madrid)."
        },
        {
            "gameTime": "1 - 20:23",
            "label": "",
            "description": "Luka Modric (Real Madrid) brings his opponent down. Javier Estrada Fernandez has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 18:46",
            "label": "",
            "description": "Jonathan Viera (UD Las Palmas) takes a first time shot from inside the box, but his poor effort flies way wide of the right post."
        },
        {
            "gameTime": "1 - 18:22",
            "label": "",
            "description": "Gareth Bale (Real Madrid) goes on a mazy run and tries his luck with a mid range strike, but one of the defending players steps in and makes a block."
        },
        {
            "gameTime": "1 - 17:14",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) picks up a pass and unleashes a low shot towards goal, but he can't generate enough power to trouble Javi Varas."
        },
        {
            "gameTime": "1 - 14:54",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) was close to scoring after he unleashed a powerful shot which went a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 13:39",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "1 - 12:13",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 08:27",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but he sent it well over the bar."
        },
        {
            "gameTime": "1 - 08:10",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 06:46",
            "label": "",
            "description": "Toni Kroos (Real Madrid) is going to send the ball in from the free kick. Alvaro Morata (Real Madrid) leaps highest around the penalty spot to meet a cross from the free kick and produces a promising goal bound header towards the top right corner, but Javi Varas pulls off a fine save to deny him. Real Madrid earn a corner."
        },
        {
            "gameTime": "1 - 06:28",
            "label": "",
            "description": "Referee Javier Estrada Fernandez sees the trip by Michel (UD Las Palmas) and doesn't hesitate to blow his whistle. A free kick has been awarded to Real Madrid."
        },
        {
            "gameTime": "1 - 05:41",
            "label": "",
            "description": "Toni Kroos (Real Madrid) shoots from the edge of the penalty area. The ball travels low towards the middle of the target, but Javi Varas easily deals with the threat."
        },
        {
            "gameTime": "1 - 03:03",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) creates a good chance for himself and goes for goal from mid range, but the effort is well wide of the right post."
        },
        {
            "gameTime": "1 - 01:55",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 01:32",
            "label": "",
            "description": "Marco Asensio (Real Madrid) makes a rough challenge and Javier Estrada Fernandez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Real Madrid will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Javier Estrada Fernandez will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Toni Kroos has the most assists (12) for Real Madrid this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sergio Ramos from Real Madrid has already received 4 yellow cards this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "From a total of 37 games that Las Palmas played there were 22 matches with over 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. We witnessed the away side dominate today's game. The home team really focused on a well organized defence. The away team tried to find the weakness in their opponents defence mainly using rapid counter attacks."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "24/09/2016 - 21:45",
    "gameHomeTeam": "Las Palmas",
    "gameScore": "2 - 2"
}