{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-24 - 22-45 Barcelona 6 - 1 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. Barcelona were dominant and more threatening of the two sides. It was a fairly one sided match. The visitors couldn't keep pace with the hosts, who excelled in virtually every aspect of the game. They fully deserved their win."
        },
        {
            "gameTime": "2 - 46:07",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "soccer-ball",
            "description": "Edin Dzeko (AS Roma) jumps for a cross and plants a perfect header inside the left post."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:38",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Neymar (Barcelona) takes it short."
        },
        {
            "gameTime": "2 - 44:22",
            "label": "",
            "description": "Neymar (Barcelona) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. The referee points to the corner flag and Barcelona will take a corner."
        },
        {
            "gameTime": "2 - 43:12",
            "label": "",
            "description": "A pass from Dani Alves (Barcelona) is intercepted by Wojciech Szczesny and the move breaks down."
        },
        {
            "gameTime": "2 - 41:51",
            "label": "",
            "description": "Adriano (Barcelona) is flagged for offside."
        },
        {
            "gameTime": "2 - 41:10",
            "label": "",
            "description": "Adriano (Barcelona) makes an overly aggressive challenge and Cuneyt Cakir blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 39:15",
            "label": "",
            "description": "Neat link up play between Dani Alves (Barcelona) and Luis Suarez, but Wojciech Szczesny reads the game well and the move breaks down."
        },
        {
            "gameTime": "2 - 38:41",
            "label": "attendance",
            "description": "The attendance is 71433."
        },
        {
            "gameTime": "2 - 36:59",
            "label": "penalty-missed",
            "description": "Edin Dzeko (AS Roma) doesn't take advantage of the chance to score from the penalty spot. He shoots to the bottom right corner, but Marc Andre ter Stegen leaps out to thwart his effort."
        },
        {
            "gameTime": "2 - 36:53",
            "label": "",
            "description": "Edin Dzeko (AS Roma) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 36:15",
            "label": "penalty",
            "description": "Thomas Vermaelen (Barcelona) brings down his opponent with a very late tackle. The referee uncompromisingly points to the spot and it's a penalty to AS Roma."
        },
        {
            "gameTime": "2 - 35:24",
            "label": "funfact",
            "description": "18:8 – this is the total number of shots produced by both teams."
        },
        {
            "gameTime": "2 - 35:08",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 34:43",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a precise low pass inside the box, controls the ball and drills it to the middle of the goal, but Wojciech Szczesny makes a comfortable save to stop his effort. The ball goes out of play and Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 34:15",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) sends a cross into the box, but Wojciech Szczesny comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 33:33",
            "label": "",
            "description": "Flag up against Lionel Messi (Barcelona). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 33:08",
            "label": "",
            "description": "Edin Dzeko (AS Roma) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball sails well over the bar!"
        },
        {
            "gameTime": "2 - 32:56",
            "label": "",
            "description": "Adriano (Barcelona) commits a foul after bringing down his opponent with a slide tackle."
        },
        {
            "gameTime": "2 - 31:43",
            "label": "soccer-ball",
            "description": "Goal! Adriano (Barcelona) fires the rebound into the top left corner after the ball breaks to him in the box. The score is 6:0."
        },
        {
            "gameTime": "2 - 31:30",
            "label": "penalty-missed",
            "description": "Neymar (Barcelona) wastes a huge opportunity to score from the penalty spot. He attempts to slot into the bottom left corner, but Wojciech Szczesny pulls off a superb save."
        },
        {
            "gameTime": "2 - 31:19",
            "label": "",
            "description": "Neymar (Barcelona) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 30:44",
            "label": "penalty",
            "description": "Salih Ucan (AS Roma) commits an ugly challenge. The referee sees it and immediately blows his whistle. Joy for one side, despair for the other as the referee gives a penalty to Barcelona!"
        },
        {
            "gameTime": "2 - 29:46",
            "label": "substitution",
            "description": "Miralem Pjanic will be replaced by Salih Ucan (AS Roma)."
        },
        {
            "gameTime": "2 - 28:36",
            "label": "",
            "description": "The Barcelona players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 26:35",
            "label": "corner",
            "description": "Neymar (Barcelona) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 26:21",
            "label": "",
            "description": "Adriano (Barcelona) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender. The ball is out of play and Barcelona manage to earn a corner."
        },
        {
            "gameTime": "2 - 25:04",
            "label": "",
            "description": "Neymar (Barcelona) spurned a good chance! He gets a shot away from inside the penalty box, but it goes inches wide of the right post."
        },
        {
            "gameTime": "2 - 22:42",
            "label": "",
            "description": "Neymar (Barcelona) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "2 - 21:52",
            "label": "",
            "description": "Edin Dzeko (AS Roma) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 21:15",
            "label": "",
            "description": "The flag is raised and Neymar (Barcelona) is offside again, not for the first time today."
        },
        {
            "gameTime": "2 - 19:16",
            "label": "",
            "description": "Miralem Pjanic (AS Roma) decides to have a shot at goal from the free kick, but it hits the defensive wall."
        },
        {
            "gameTime": "2 - 18:48",
            "label": "substitution",
            "description": "Substitution. Adriano (Barcelona) on for Sergi Roberto."
        },
        {
            "gameTime": "2 - 18:28",
            "label": "",
            "description": "AS Roma win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 18:08",
            "label": "y-card",
            "description": "Lionel Messi (Barcelona) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 16:28",
            "label": "y-card",
            "description": "William Vainqueur (AS Roma) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 14:20",
            "label": "soccer-ball",
            "description": "Goal 5:0! Lionel Messi (Barcelona) taps home from close range after the rebound fell kindly into his path."
        },
        {
            "gameTime": "2 - 14:15",
            "label": "",
            "description": "Wojciech Szczesny can hear the fans clapping for his superb goalkeeping after he magnificently stops the close range effort from Lionel Messi (Barcelona). The ball would have probably ended up in the bottom left corner."
        },
        {
            "gameTime": "2 - 13:44",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "2 - 12:52",
            "label": "substitution",
            "description": "Substitution. William Vainqueur (AS Roma) replaces Alessandro Florenzi."
        },
        {
            "gameTime": "2 - 11:59",
            "label": "y-card",
            "description": "Dani Alves (Barcelona) has received a yellow card for his foul."
        },
        {
            "gameTime": "2 - 10:55",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Gerard Pique leaves the pitch and Marc Bartra (Barcelona) comes on."
        },
        {
            "gameTime": "2 - 10:27",
            "label": "soccer-ball",
            "description": "Goal! Gerard Pique (Barcelona) fires home from very close range after latching on to a pass from Lionel Messi. The score is 4:0."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Lionel Messi (Barcelona)."
        },
        {
            "gameTime": "2 - 09:53",
            "label": "",
            "description": "Lionel Messi (Barcelona) has a great chance inside the six yard box, shoots to the bottom right corner, but Wojciech Szczesny pulls off an exquisite save to deny him. Now Barcelona have a corner."
        },
        {
            "gameTime": "2 - 09:21",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "2 - 08:58",
            "label": "corner",
            "description": "AS Roma force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 08:45",
            "label": "",
            "description": "Marc Andre ter Stegen was forced into action to thwart Iago Falque (AS Roma). He found himself some space after picking up a pass and unleashed a shot to the left post but couldn't beat the keeper."
        },
        {
            "gameTime": "2 - 08:04",
            "label": "",
            "description": "A cross into the box from Lucas Digne (AS Roma) is cleared."
        },
        {
            "gameTime": "2 - 07:12",
            "label": "",
            "description": "The ball spins up and hits the hand of Dani Alves (Barcelona) after he fails to control it and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 06:40",
            "label": "",
            "description": "Sergi Samper (Barcelona) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 06:26",
            "label": "",
            "description": "The game is interrupted. Iago Falque (AS Roma) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "2 - 06:05",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards over the bar."
        },
        {
            "gameTime": "2 - 05:27",
            "label": "corner",
            "description": "Sergi Roberto (Barcelona) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 05:12",
            "label": "",
            "description": "Neymar (Barcelona) strikes the ball towards the top left corner of the goal, but the goalkeeper is alert and makes a superb save. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 04:25",
            "label": "",
            "description": "Foul! Lucas Digne (AS Roma) is penalised for pulling back his opponent. Barcelona quickly take the free kick with a short pass."
        },
        {
            "gameTime": "2 - 03:32",
            "label": "",
            "description": "This was a piece of cake for Wojciech Szczesny. Lionel Messi (Barcelona) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 03:22",
            "label": "corner",
            "description": "Neymar (Barcelona) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 03:00",
            "label": "",
            "description": "Neymar (Barcelona) looks to break free, but an opposing player clears the ball away. Barcelona will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Sergio Busquets will not participate anymore and Sergi Samper (Barcelona) is coming on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here is a change after the half time break. Radja Nainggolan is replaced by Juan Iturbe (AS Roma)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have seen an attractive offensive game so far and the fans have nothing to complain about. It was a fairly one sided opening 45 minutes, with Barcelona much the better side better so far. The visitors have been very flat and lacked creativity in their attack. Let's see if they change something in the second period."
        },
        {
            "gameTime": "1 - 45:07",
            "label": "whistle",
            "description": "Cuneyt Cakir has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 44:10",
            "label": "",
            "description": "Iago Falque (AS Roma) is caught offside!"
        },
        {
            "gameTime": "1 - 43:52",
            "label": "soccer-ball",
            "description": "What a hit! Luis Suarez (Barcelona) shows good composure inside the box to fire a first time shot inside the left post. 3:0."
        },
        {
            "gameTime": "1 - 43:45",
            "label": "",
            "description": "Neymar (Barcelona) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 43:23",
            "label": "corner",
            "description": "Neymar (Barcelona) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 43:09",
            "label": "",
            "description": "Dani Alves (Barcelona) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball. Barcelona force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 42:40",
            "label": "",
            "description": "The free kick from Miralem Pjanic (AS Roma) failed to provide any scoring opportunity, as one of the defenders did a good job and knocked it out."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "",
            "description": "Sergio Busquets (Barcelona) brings his opponent down. Cuneyt Cakir has a clear sight of it and blows his whistle for a foul. A free kick has been awarded to AS Roma."
        },
        {
            "gameTime": "1 - 41:47",
            "label": "",
            "description": "Luis Suarez (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 41:29",
            "label": "corner",
            "description": "Miralem Pjanic (AS Roma) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 41:11",
            "label": "",
            "description": "Miralem Pjanic (AS Roma) crosses the ball into the box from the free kick, but the defence clears the danger. The linesman makes the right call and AS Roma will have a corner."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "y-card",
            "description": "Cuneyt Cakir shows the yellow card to Gerard Pique (Barcelona) for a heavy challenge."
        },
        {
            "gameTime": "1 - 39:38",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Miralem Pjanic (AS Roma), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "1 - 38:58",
            "label": "",
            "description": "Cuneyt Cakir blows his whistle after Dani Alves (Barcelona) kicks an opponent's legs instead of the ball. AS Roma are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 38:26",
            "label": "funfact",
            "description": "66:34 – the latest ball possession ratio."
        },
        {
            "gameTime": "1 - 36:05",
            "label": "corner",
            "description": "Neymar (Barcelona) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 35:45",
            "label": "",
            "description": "Neymar (Barcelona) races towards goal but the defender gets back well to make a challenge. Barcelona earn a corner."
        },
        {
            "gameTime": "1 - 34:58",
            "label": "",
            "description": "Thomas Vermaelen (Barcelona) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone. The ball is off of the pitch and it's a goal kick for AS Roma."
        },
        {
            "gameTime": "1 - 33:03",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Neymar (Barcelona) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "1 - 32:09",
            "label": "",
            "description": "Flag goes up against Jordi Alba (Barcelona) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 31:04",
            "label": "",
            "description": "Barcelona seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "1 - 28:11",
            "label": "",
            "description": "Neymar (Barcelona) plays a one two with Thomas Vermaelen, but the move breaks down."
        },
        {
            "gameTime": "1 - 26:01",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 23:42",
            "label": "",
            "description": "Lionel Messi (Barcelona) attempts to slip the ball through the defence, but is unable to find any of his teammates. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "1 - 21:44",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 21:13",
            "label": "",
            "description": "Luis Suarez (Barcelona) and Lionel Messi try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move. The ball goes out for a corner. Barcelona can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 20:31",
            "label": "",
            "description": "Seydou Keita (AS Roma) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 19:49",
            "label": "",
            "description": "AS Roma produce a short pass from the free kick."
        },
        {
            "gameTime": "1 - 19:37",
            "label": "",
            "description": "Sergio Busquets (Barcelona) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Cuneyt Cakir with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 17:35",
            "label": "soccer-ball",
            "description": "GOAL 2:0! Luis Suarez found Lionel Messi (Barcelona) inside the box, he spotted goalkeeper Wojciech Szczesny off his line and chipped the ball into the net. What a cheeky lob!"
        },
        {
            "gameTime": "1 - 15:58",
            "label": "",
            "description": "Lucas Digne (AS Roma) is adjudged offside."
        },
        {
            "gameTime": "1 - 14:57",
            "label": "soccer-ball",
            "description": "Goal! Dani Alves feeds Luis Suarez (Barcelona), who taps the ball into an empty net. He makes it 1:0."
        },
        {
            "gameTime": "1 - 13:14",
            "label": "",
            "description": "Luis Suarez (Barcelona) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 12:18",
            "label": "",
            "description": "What a chance that is! Edin Dzeko (AS Roma) displays good awareness near the penalty spot to get on the end of a cross, but he sends his header just over the crossbar."
        },
        {
            "gameTime": "1 - 12:00",
            "label": "corner",
            "description": "Miralem Pjanic (AS Roma) takes a short corner kick."
        },
        {
            "gameTime": "1 - 11:36",
            "label": "",
            "description": "Edin Dzeko (AS Roma) goes on a solo run, but he fails to create a chance as an opposition player blocks him. AS Roma have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 10:29",
            "label": "",
            "description": "Half chance! Neymar (Barcelona) plays a pass into the box, but Wojciech Szczesny reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 10:18",
            "label": "",
            "description": "The foul by Edin Dzeko (AS Roma) was seen by Cuneyt Cakir who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 09:53",
            "label": "",
            "description": "The linesman raises his flag for offside before Jordi Alba (Barcelona) heads on."
        },
        {
            "gameTime": "1 - 08:52",
            "label": "",
            "description": "What a big chance! Lionel Messi (Barcelona) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 08:43",
            "label": "",
            "description": "Dani Alves (Barcelona) attempted to pick out a free teammate inside the box, but Wojciech Szczesny comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 06:41",
            "label": "",
            "description": "The game is interrupted as Neymar (Barcelona) is flagged offside."
        },
        {
            "gameTime": "1 - 05:40",
            "label": "",
            "description": "Barcelona seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 03:54",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 03:19",
            "label": "",
            "description": "Wojciech Szczesny hears the fans clapping his superb goalkeeping. Lionel Messi (Barcelona) shoots from the edge of the box towards the top right corner, but the goalkeeper makes a magnificent save. The ball is out of play and the linesman points at the corner flag. Corner to Barcelona."
        },
        {
            "gameTime": "1 - 03:06",
            "label": "",
            "description": "A lofted cross from Luis Suarez (Barcelona) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 02:27",
            "label": "",
            "description": "Neymar (Barcelona) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 02:04",
            "label": "corner",
            "description": "The resulting corner, taken by Neymar (Barcelona), comes to nothing."
        },
        {
            "gameTime": "1 - 01:40",
            "label": "",
            "description": "The ball is cleared after Neymar (Barcelona) attempted to dribble past an opposing player. Good work from Barcelona as they win a corner."
        },
        {
            "gameTime": "1 - 01:15",
            "label": "",
            "description": "Seydou Keita (AS Roma) should know this behaviour is beyond the rules. He was too careless with his challenge and left Cuneyt Cakir no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 00:51",
            "label": "",
            "description": "Barcelona try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "1 - 00:22",
            "label": "",
            "description": "Miralem Pjanic (AS Roma) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Cuneyt Cakir is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. Barcelona were dominant and more threatening of the two sides. It was a fairly one sided match. The visitors couldn't keep pace with the hosts, who excelled in virtually every aspect of the game. They fully deserved their win."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "24/11/2015 - 22:45",
    "gameHomeTeam": "Barcelona",
    "gameScore": "6 - 1"
}