{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2017-02-11 - 17-30 Darmstadt 2 - 1 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:06",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 48:41",
            "label": "",
            "description": "Hamit Altintop (Darmstadt) strikes the rebound, but it goes well over the bar."
        },
        {
            "gameTime": "2 - 47:49",
            "label": "",
            "description": "Antonio Mirko Colak (Darmstadt) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play. Darmstadt will have a throw in."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "Antonio Mirko Colak (Darmstadt) makes a strong challenge and Wolfgang Stark blows for a foul."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:48",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 42:31",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 41:39",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Dortmund."
        },
        {
            "gameTime": "2 - 40:03",
            "label": "",
            "description": "Wolfgang Stark blows his whistle for a foul after Julian Weigl (Dortmund) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 39:12",
            "label": "substitution",
            "description": "Substitution. Artem Fedetsky makes way for Markus Steinhofer (Darmstadt)."
        },
        {
            "gameTime": "2 - 38:46",
            "label": "attendance",
            "description": "The attendance is 17400."
        },
        {
            "gameTime": "2 - 36:05",
            "label": "substitution",
            "description": "Torsten Frings has decided to introduce fresh legs, with Leon Guwara (Darmstadt) replacing Fabian Holland."
        },
        {
            "gameTime": "2 - 33:57",
            "label": "y-card",
            "description": "Dzenis Burnic (Dortmund) shouldn't be surprised it's a yellow from the ref, who cooled the situation down well."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "y-card",
            "description": "Aytac Sulu (Darmstadt) will have to be careful for the rest of the match as he is shown a yellow card."
        },
        {
            "gameTime": "2 - 31:36",
            "label": "substitution",
            "description": "Marco Reus goes off the pitch and Andre Schurrle (Dortmund) comes on."
        },
        {
            "gameTime": "2 - 29:54",
            "label": "y-card",
            "description": "Michael Esser (Darmstadt) picks up a caution."
        },
        {
            "gameTime": "2 - 29:39",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) brings an opponent down and Wolfgang Stark interrupts the game."
        },
        {
            "gameTime": "2 - 27:17",
            "label": "y-card",
            "description": "Pierre Emerick Aubameyang (Dortmund) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "",
            "description": "Antonio Mirko Colak (Darmstadt) is the first to arrive to a rebound inside the penalty area and unleashes a quick strike towards the right side of the target that beats the keeper. One of the defenders, however, makes a goal line clearance."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "",
            "description": "Jerome Gondorf (Darmstadt) blew a promising chance when he got to a rebound just outside the penalty area. He struck it towards the middle of the target, but Roman Burki pulled off a nice save to stop the attempt."
        },
        {
            "gameTime": "2 - 24:44",
            "label": "",
            "description": "What a sweet touch by Antonio Mirko Colak (Darmstadt) after latching on to a fine pass on the edge of the box! He finds some space and unleashes a cannonball towards the roof of the net. The goalkeeper makes a brilliant save, pushing the ball onto the post."
        },
        {
            "gameTime": "2 - 24:18",
            "label": "",
            "description": "Erik Durm (Dortmund) swings a cross into the box, but it's far too close to Michael Esser, who smothers the ball."
        },
        {
            "gameTime": "2 - 23:56",
            "label": "corner",
            "description": "Shinji Kagawa (Dortmund) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 23:32",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Marco Reus (Dortmund)."
        },
        {
            "gameTime": "2 - 23:10",
            "label": "corner",
            "description": "Marco Reus (Dortmund) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 21:48",
            "label": "soccer-ball",
            "description": "Goal! Sidney Sam plays in Antonio Mirko Colak (Darmstadt), who shows great determination to get to the ball before a couple of defenders and from inside the box slots it into the bottom left corner 2:1."
        },
        {
            "gameTime": "2 - 19:40",
            "label": "",
            "description": "A pass by Artem Fedetsky (Darmstadt) ends up in no man's land, and the attacking effort comes to an end. The ball goes out of play and Dortmund will have a goal kick."
        },
        {
            "gameTime": "2 - 18:37",
            "label": "",
            "description": "Christian Pulisic (Dortmund) commits a rough challenge and Wolfgang Stark blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 17:00",
            "label": "substitution",
            "description": "Here comes a substitution. Emre Mor is given a rest as he is replaced by Ousmane Dembele (Dortmund)."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "substitution",
            "description": "Thomas Tuchel prepares a substitution. Raphael Guerreiro is replaced by Shinji Kagawa (Dortmund)."
        },
        {
            "gameTime": "2 - 16:10",
            "label": "funfact",
            "description": "The actual number of corner kicks in this match – 0:12."
        },
        {
            "gameTime": "2 - 14:21",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Jan Rosenthal (Darmstadt), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "2 - 12:45",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Antonio Mirko Colak (Darmstadt) replaces Terrance Boyd."
        },
        {
            "gameTime": "2 - 12:01",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) is penalised for holding. Wolfgang Stark signals a set piece."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "",
            "description": "Dortmund are playing excellent possession football at the moment by exchanging some long passes."
        },
        {
            "gameTime": "2 - 07:55",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 07:11",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) misses a good chance to score. An inch perfect cross into the box finds Raphael Guerreiro (Dortmund) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 05:34",
            "label": "",
            "description": "Great chance! Jan Rosenthal (Darmstadt) collects a great pass inside the box, but the goalkeeper does well to stop his effort."
        },
        {
            "gameTime": "2 - 04:11",
            "label": "",
            "description": "Dortmund enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 02:09",
            "label": "",
            "description": "Wolfgang Stark blows his whistle after Fabian Holland (Darmstadt) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:08",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:44",
            "label": "soccer-ball",
            "description": "Raphael Guerreiro (Dortmund) gets to the ball on the edge of the box and fires in a first time shot without any hesitation. The strike is excellent and goes inside the left post. He couldn't have done it any better. 1:1."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 41:35",
            "label": "",
            "description": "It's unbelievable, Pierre Emerick Aubameyang (Dortmund) blows a huge opportunity! He is totally unmarked and fires a first time shot towards the roof of the net, but Michael Esser reacts superbly to keep the ball out. Dortmund force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Raphael Guerreiro (Dortmund). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 40:48",
            "label": "corner",
            "description": "Marco Reus (Dortmund) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 39:11",
            "label": "",
            "description": "Emre Mor (Dortmund) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 36:03",
            "label": "",
            "description": "Marcel Heller (Darmstadt) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "1 - 32:20",
            "label": "corner",
            "description": "Marco Reus (Dortmund) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 32:00",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) takes the corner which is cleared. Dortmund will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 31:07",
            "label": "",
            "description": "Marco Reus (Dortmund) takes the resulting free kick from the edge of the box. His rocket of a shot crashes against the crossbar! What a shot."
        },
        {
            "gameTime": "1 - 27:42",
            "label": "",
            "description": "The linesman raises his flag. Marcel Heller (Darmstadt) is adjudged offside."
        },
        {
            "gameTime": "1 - 27:12",
            "label": "",
            "description": "Darmstadt seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 25:20",
            "label": "",
            "description": "Wolfgang Stark has a clear sight and sees a foul from Marco Reus (Dortmund)."
        },
        {
            "gameTime": "1 - 24:06",
            "label": "",
            "description": "Marco Reus (Dortmund) goes on a mazy run, skips past two defenders and pulls the trigger in front of the keeper. Michael Esser makes a great save to stop the effort going into the bottom right corner."
        },
        {
            "gameTime": "1 - 23:11",
            "label": "",
            "description": "A pass by Sidney Sam (Darmstadt) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 20:50",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Terrance Boyd (Darmstadt) gets on the end of a brilliant pass and scores a great goal after finding the back of the net by striking the ball past the goalkeeper!"
        },
        {
            "gameTime": "1 - 19:09",
            "label": "",
            "description": "Erik Durm (Dortmund) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 17:59",
            "label": "",
            "description": "The linesman signals that Terrance Boyd (Darmstadt) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 17:08",
            "label": "",
            "description": "Emre Mor (Dortmund) was too fierce in his attempt to get the ball from his opponent and Wolfgang Stark blows for a foul."
        },
        {
            "gameTime": "1 - 16:26",
            "label": "",
            "description": "Nice passing game by Dortmund. They are increasing their possession with a series of long passes and waiting for the right moment to create an attacking opportunity."
        },
        {
            "gameTime": "1 - 13:00",
            "label": "",
            "description": "Good clearance! Jan Rosenthal (Darmstadt) receives a brilliant short pass and finds himself in a good position inside the box, but he's robbed of the ball by one of the defending players."
        },
        {
            "gameTime": "1 - 12:21",
            "label": "",
            "description": "Marco Reus (Dortmund) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again."
        },
        {
            "gameTime": "1 - 11:08",
            "label": "",
            "description": "Sidney Sam (Darmstadt) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 10:00",
            "label": "",
            "description": "Emre Mor (Dortmund) sends a cross into the box, but Michael Esser comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 09:17",
            "label": "",
            "description": "Artem Fedetsky (Darmstadt) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "1 - 07:24",
            "label": "",
            "description": "What a chance that is! Jan Rosenthal (Darmstadt) wastes a huge opportunity as he receives a beautiful pass inside the box but is somehow only able to prod the ball onto the right post!"
        },
        {
            "gameTime": "1 - 06:44",
            "label": "",
            "description": "Marco Reus (Dortmund) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 05:58",
            "label": "corner",
            "description": "The resulting corner, taken by Marco Reus (Dortmund), comes to nothing."
        },
        {
            "gameTime": "1 - 04:59",
            "label": "",
            "description": "Jan Rosenthal (Darmstadt) latches on to a cross from the free kick and attempts to direct a bullet header into the top of the net. Roman Burki is alert, though, and makes a great save to deny him."
        },
        {
            "gameTime": "1 - 04:17",
            "label": "",
            "description": "Matthias Ginter (Dortmund) was too forceful with his tackle and Wolfgang Stark interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 03:20",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) trips an opposition player and Wolfgang Stark signals a foul."
        },
        {
            "gameTime": "1 - 01:52",
            "label": "",
            "description": "Julian Weigl (Dortmund) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play."
        },
        {
            "gameTime": "1 - 01:27",
            "label": "",
            "description": "Dortmund control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Wolfgang Stark will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund have not tasted defeat in their last 7 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "12:38 That's the goals for and against record for Darmstadt. They need some improvement in the defence."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's the end of the match."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "11/02/2017 - 17:30",
    "gameHomeTeam": "Darmstadt",
    "gameScore": "2 - 1"
}