{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-03-05 - 18-00 Real Madrid 7 - 1 Celta Vigo/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The home side dominated today's game. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        },
        {
            "gameTime": "2 - 46:54",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 45:54",
            "label": "corner",
            "description": "Gareth Bale (Real Madrid) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 45:37",
            "label": "corner",
            "description": "The resulting corner from Gareth Bale (Real Madrid) is cleared. Good work from Real Madrid as they win a corner."
        },
        {
            "gameTime": "2 - 45:11",
            "label": "",
            "description": "Wow, what an escape. Lucas (Real Madrid) has an effort from inside the box but it's brilliantly blocked. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "Carles Planas (Celta Vigo) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play."
        },
        {
            "gameTime": "2 - 43:12",
            "label": "",
            "description": "Marcelo (Real Madrid) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 41:45",
            "label": "",
            "description": "Nolito (Celta Vigo) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows a yellow card to Fabian Orellana (Celta Vigo) for his blatant foul."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "corner",
            "description": "Duran Nolito (Celta Vigo) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 37:32",
            "label": "",
            "description": "Nolito (Celta Vigo) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort."
        },
        {
            "gameTime": "2 - 35:14",
            "label": "soccer-ball",
            "description": "Gareth Bale (Real Madrid) demonstrates how to play football! He collects the ball and decides to go alone. He weaves through the defence and gets to the edge of the box from where he finishes with a low effort into the bottom right corner, deflecting in off the post."
        },
        {
            "gameTime": "2 - 34:16",
            "label": "funfact",
            "description": "We can have a look at the statistics now, shots on target are 12:3."
        },
        {
            "gameTime": "2 - 31:58",
            "label": "soccer-ball",
            "description": "An amazing individual effort from Jese (Real Madrid) ends with a strike from inside the penalty area. He sends the ball precisely into the bottom left corner and makes it 6:1. Ruben Blanco was helpless."
        },
        {
            "gameTime": "2 - 31:31",
            "label": "substitution",
            "description": "It is time for a substitution. Marcelo (Real Madrid) is on for Daniel Carvajal."
        },
        {
            "gameTime": "2 - 31:20",
            "label": "substitution",
            "description": "That's the end of the game for Daniel Wass, who is replaced by Claudio Beauvue (Celta Vigo)."
        },
        {
            "gameTime": "2 - 30:53",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) jumped highest to meet a perfectly executed corner kick by Jese. His header was precise and ended up in the back of the net, leaving the goalkeeper flapping in the wind. The score is 3:0."
        },
        {
            "gameTime": "2 - 30:50",
            "label": "corner",
            "description": "Jese (Real Madrid) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "2 - 30:14",
            "label": "corner",
            "description": "Gareth Bale (Real Madrid) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 29:55",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Gareth Bale (Real Madrid). The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 29:38",
            "label": "",
            "description": "Carles Planas (Celta Vigo) did his best to latch onto a through ball, but it was too strong."
        },
        {
            "gameTime": "2 - 28:06",
            "label": "corner",
            "description": "Daniel Wass (Celta Vigo) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "",
            "description": "John Guidetti (Celta Vigo) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. Celta Vigo have a corner."
        },
        {
            "gameTime": "2 - 25:46",
            "label": "",
            "description": "Celta Vigo keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "2 - 24:56",
            "label": "substitution",
            "description": "Borja Mayoral Moya comes off the pitch to be replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 22:43",
            "label": "",
            "description": "Danilo (Real Madrid) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 21:07",
            "label": "substitution",
            "description": "Eduardo Berizzo prepares a substitution. Iago Aspas is replaced by John Guidetti (Celta Vigo)."
        },
        {
            "gameTime": "2 - 19:03",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Gareth Bale (Real Madrid) will replace Isco."
        },
        {
            "gameTime": "2 - 18:44",
            "label": "soccer-ball",
            "description": "Goal! Isco passes the ball to the feet of Cristiano Ronaldo (Real Madrid), who has an empty net in front of him and has no problems in tapping the ball in. 4:1."
        },
        {
            "gameTime": "2 - 18:30",
            "label": "",
            "description": "Real Madrid are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 16:55",
            "label": "soccer-ball",
            "description": "GOAL 3:1! Sergio Gomez Sola found Iago Aspas (Celta Vigo) inside the box, he spotted goalkeeper Keylor Navas off his line and chipped the ball into the net. What a cheeky lob!"
        },
        {
            "gameTime": "2 - 14:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes the set piece from outside the box. His shot heads towards the top left corner, but Ruben Blanco dives and saves the effort, punching it onto the post."
        },
        {
            "gameTime": "2 - 13:36",
            "label": "y-card",
            "description": "Jonny (Celta Vigo) got a yellow card."
        },
        {
            "gameTime": "2 - 12:33",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) scores from a free kick after smashing the ball over the defensive wall and into the top left corner of the goal!"
        },
        {
            "gameTime": "2 - 11:32",
            "label": "",
            "description": "Daniel Wass (Celta Vigo) is penalised for holding. Jesus Gil Manzano signals a set piece. Real Madrid have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 11:04",
            "label": "",
            "description": "Isco (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 10:42",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is able to continue to play."
        },
        {
            "gameTime": "2 - 09:49",
            "label": "injury",
            "description": "The game is interrupted now, Cristiano Ronaldo (Real Madrid) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 09:12",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) makes a reckless foul in order to win the ball from his opponent. Jesus Gil Manzano has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 08:33",
            "label": "attendance",
            "description": "The attendance is 68467."
        },
        {
            "gameTime": "2 - 06:50",
            "label": "",
            "description": "Danilo (Real Madrid) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 04:06",
            "label": "soccer-ball",
            "description": "The defending players give Cristiano Ronaldo (Real Madrid) far too much free space and he knows how to take advantage of it. He produces a howitzer which goes into the top of the net. Ruben Blanco was taken unawares by his effort and the score is 1:0."
        },
        {
            "gameTime": "2 - 01:58",
            "label": "",
            "description": "Lucas (Real Madrid) dribbles into space and finds himself in a shooting position, but his shot from the edge of the box is bravely blocked."
        },
        {
            "gameTime": "2 - 01:26",
            "label": "",
            "description": "Fabian Orellana (Celta Vigo) swings a cross into the box, but it's far too close to Keylor Navas, who smothers the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Jesus Gil Manzano blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. The home side is in control of this game. The home side have dominated the possession and midfield so far. The visitors have spent most of their time defending and waiting for the right moment to launch counter attacks."
        },
        {
            "gameTime": "1 - 46:52",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 46:23",
            "label": "corner",
            "description": "The corner from Isco (Real Madrid) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 45:39",
            "label": "corner",
            "description": "Isco (Real Madrid) whips in the corner, but one of the defending players gets a head on it and intercepts. The referee blows his whistle, Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 43:59",
            "label": "corner",
            "description": "Nolito (Celta Vigo) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 43:38",
            "label": "",
            "description": "Fabian Orellana (Celta Vigo) smashes the ball towards goal from the edge of the penalty box, but it fails to bother the goalkeeper as it hits the defensive wall. Celta Vigo have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 42:38",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) pulls the jersey of one of the opposition players and Jesus Gil Manzano blows his whistle for a foul. Celta Vigo win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 40:57",
            "label": "soccer-ball",
            "description": "Isco takes the corner and Pepe (Real Madrid) rises highest near the penalty spot to plant a brilliant header into the left side of the goal. The score is 1:0."
        },
        {
            "gameTime": "1 - 40:30",
            "label": "corner",
            "description": "Isco (Real Madrid) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 40:06",
            "label": "",
            "description": "Casemiro (Real Madrid) latches on to a lofted pass from the resulting set piece and pulls the trigger from around the penalty spot. His effort towards the roof of the net is saved by the excellent Ruben Blanco."
        },
        {
            "gameTime": "1 - 39:37",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows a yellow card to Nolito (Celta Vigo) for a tough tackle."
        },
        {
            "gameTime": "1 - 39:15",
            "label": "",
            "description": "Danilo (Real Madrid) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 38:25",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "1 - 37:45",
            "label": "",
            "description": "Nolito (Celta Vigo) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 34:59",
            "label": "substitution",
            "description": "Nemanja Radoja (Celta Vigo) comes onto the pitch after Pablo Pedro Hernandez signals to the bench that he cannot continue any longer after picking up an injury."
        },
        {
            "gameTime": "1 - 34:15",
            "label": "",
            "description": "Fabian Orellana (Celta Vigo) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 33:49",
            "label": "",
            "description": "Casemiro (Real Madrid) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety."
        },
        {
            "gameTime": "1 - 32:30",
            "label": "injury",
            "description": "Looks like Pablo Pedro Hernandez (Celta Vigo) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 31:07",
            "label": "",
            "description": "An attempted cross from Mateo Kovacic (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 28:57",
            "label": "y-card",
            "description": "Pepe (Real Madrid) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Jesus Gil Manzano ignores the protests."
        },
        {
            "gameTime": "1 - 27:58",
            "label": "",
            "description": "Jesus Gil Manzano interrupts the game for a tactical foul by Duran Nolito (Celta Vigo)."
        },
        {
            "gameTime": "1 - 25:39",
            "label": "corner",
            "description": "Duran Nolito (Celta Vigo) takes a short corner kick."
        },
        {
            "gameTime": "1 - 25:28",
            "label": "corner",
            "description": "Nolito (Celta Vigo) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 25:25",
            "label": "",
            "description": "Duran Nolito (Celta Vigo) races towards goal but the defender gets back well to make a challenge. Celta Vigo will take a corner kick."
        },
        {
            "gameTime": "1 - 24:38",
            "label": "y-card",
            "description": "A yellow card for a tackle by Danilo (Real Madrid). Jesus Gil Manzano doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 23:45",
            "label": "",
            "description": "What a poor attempt! Fabian Orellana (Celta Vigo) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "1 - 21:39",
            "label": "",
            "description": "Isco (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Ruben Blanco is alert and denies him."
        },
        {
            "gameTime": "1 - 21:21",
            "label": "corner",
            "description": "Isco (Real Madrid) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 21:15",
            "label": "corner",
            "description": "Isco (Real Madrid) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 20:35",
            "label": "",
            "description": "Casemiro (Real Madrid) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. The referee points to the corner flag. It's a corner to Real Madrid."
        },
        {
            "gameTime": "1 - 19:11",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) wasted a huge opportunity! The fans already began to celebrate as he produced a shot from the edge of the box after a brilliant solo effort. The ball went towards the left side of the goal, but Ruben Blanco made an astonishing save!"
        },
        {
            "gameTime": "1 - 15:33",
            "label": "",
            "description": "Iago Aspas (Celta Vigo) gets to a rebound in front of goal and sends the ball towards the bottom right corner. However, he couldn't beat Keylor Navas, who shows off his superb goalkeeping ability by pulling off a great save."
        },
        {
            "gameTime": "1 - 15:01",
            "label": "",
            "description": "Iago Aspas (Celta Vigo) had a good opportunity when he latched on to a cross from the wing, but his header from the six yard box wasn't accurate enough and the ball glanced away off the right post."
        },
        {
            "gameTime": "1 - 13:11",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 12:24",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear."
        },
        {
            "gameTime": "1 - 09:20",
            "label": "",
            "description": "The ball is cleared after Cristiano Ronaldo (Real Madrid) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 06:30",
            "label": "",
            "description": "Real Madrid are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "1 - 04:12",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Isco (Real Madrid). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 03:57",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The ball is out of play. Real Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 02:07",
            "label": "",
            "description": "Danilo (Real Madrid) tries a shot from distance, but the goalkeeper can stay calm as it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Celta Vigo will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Jesus Gil Manzano."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The home side dominated today's game. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        }
    ],
    "gameAwayTeam": "Celta Vigo",
    "gameDate": "05/03/2016 - 18:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "7 - 1"
}