{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2014-2015/2015-04-25 - 16-30 Dortmund 2 - 0 Eintracht Frankfurt/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The home team had more of the game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 46:41",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:39",
            "label": "",
            "description": "Takashi Inui (Eintracht Frankfurt) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:38",
            "label": "",
            "description": "Ciro Immobile (Dortmund) knew what to do with the ball, but was just a bit unlucky. After receiving a pass, he sent the ball goalwards from some 22 metres out, but it missed the left post by a whisker."
        },
        {
            "gameTime": "2 - 42:14",
            "label": "",
            "description": "Ciro Immobile (Dortmund) is penalised for a foul. Michael Weiner had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 41:24",
            "label": "substitution",
            "description": "It's time for a substitution. Ciro Immobile (Dortmund) comes on in place of Henrikh Mkhitaryan."
        },
        {
            "gameTime": "2 - 40:24",
            "label": "",
            "description": "Haris Seferovic (Eintracht Frankfurt) finds himself beyond the last defender but the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 39:31",
            "label": "",
            "description": "Marco Reus sprays a pass out to Henrikh Mkhitaryan (Dortmund), but he produces a poor effort from inside the box which goes well wide of the left post."
        },
        {
            "gameTime": "2 - 38:01",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 12:11."
        },
        {
            "gameTime": "2 - 35:31",
            "label": "corner",
            "description": "Marco Reus (Dortmund) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 35:13",
            "label": "",
            "description": "Marco Reus (Dortmund) produces a dangerous low pass into the penalty area, but the defence manage to cut it out. The ball is out of play. Dortmund win a corner kick."
        },
        {
            "gameTime": "2 - 33:43",
            "label": "substitution",
            "description": "Marc Stendera (Eintracht Frankfurt) is leaving the pitch due to injury. Takashi Inui (Eintracht Frankfurt) will take his place on the pitch."
        },
        {
            "gameTime": "2 - 33:30",
            "label": "substitution",
            "description": "Substitution. Pierre Emerick Aubameyang walks off the pitch and Kevin Kampl (Dortmund) comes on as a substitute."
        },
        {
            "gameTime": "2 - 31:18",
            "label": "injury",
            "description": "Marc Stendera (Eintracht Frankfurt) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 31:17",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 30:28",
            "label": "attendance",
            "description": "The attendance is 80667."
        },
        {
            "gameTime": "2 - 30:12",
            "label": "",
            "description": "A pass by Henrikh Mkhitaryan (Dortmund) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 29:15",
            "label": "corner",
            "description": "Marc Stendera (Eintracht Frankfurt) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 28:59",
            "label": "",
            "description": "Makoto Hasebe (Eintracht Frankfurt) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Eintracht Frankfurt have a corner."
        },
        {
            "gameTime": "2 - 27:33",
            "label": "substitution",
            "description": "Today's match ends for Sonny Kittel who will be replaced by Gian Luca Waldschmidt (Eintracht Frankfurt)."
        },
        {
            "gameTime": "2 - 25:24",
            "label": "",
            "description": "Marco Reus (Dortmund) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 25:04",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 24:33",
            "label": "",
            "description": "A lofted cross from Marco Reus (Dortmund) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 23:15",
            "label": "",
            "description": "Marco Reus (Dortmund) gets on the end of a cross from Henrikh Mkhitaryan, but his shot goes a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "substitution",
            "description": "Substitution. Jakub Blaszczykowski leaves the pitch and is replaced by Marco Reus (Dortmund)."
        },
        {
            "gameTime": "2 - 21:17",
            "label": "",
            "description": "Nelson Valdez (Eintracht Frankfurt) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "2 - 19:58",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 18:29",
            "label": "",
            "description": "This was a piece of cake for Kevin Trapp. Erik Durm (Dortmund) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "",
            "description": "Jakub Blaszczykowski (Dortmund) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Kevin Trapp was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 15:38",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) delivers a long cross in an attempt to surprise the opponent's sleepy defence."
        },
        {
            "gameTime": "2 - 12:05",
            "label": "y-card",
            "description": "Alexander Madlung (Eintracht Frankfurt) is shown a yellow card after a horrible tackle."
        },
        {
            "gameTime": "2 - 10:43",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) fires the ball in from a mid range free kick, but it blazes over the bar."
        },
        {
            "gameTime": "2 - 09:55",
            "label": "",
            "description": "Michael Weiner blows the whistle, Alexander Madlung (Eintracht Frankfurt) is penalised for a foul. Dortmund earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 08:49",
            "label": "",
            "description": "Haris Seferovic (Eintracht Frankfurt) commits a rough foul. Michael Weiner stops the game and makes a call."
        },
        {
            "gameTime": "2 - 07:16",
            "label": "corner",
            "description": "Sonny Kittel (Eintracht Frankfurt) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 06:58",
            "label": "",
            "description": "Timothy Chandler (Eintracht Frankfurt) crosses the ball forward but it is intercepted. Eintracht Frankfurt will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 05:07",
            "label": "",
            "description": "Jakub Blaszczykowski (Dortmund) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "2 - 04:12",
            "label": "",
            "description": "Marc Stendera (Eintracht Frankfurt) sends a long ball in, but Mitchell Langerak comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 03:06",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Pierre Emerick Aubameyang (Dortmund)."
        },
        {
            "gameTime": "2 - 02:12",
            "label": "",
            "description": "Jakub Blaszczykowski (Dortmund) attempts to send a defence splitting pass in order to find free space for his teammate."
        },
        {
            "gameTime": "2 - 00:11",
            "label": "y-card",
            "description": "It's a yellow card for Sokratis (Dortmund)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Thomas Schaaf has decided to make a substitution during the half time break. Marc Stendera (Eintracht Frankfurt) comes on the pitch for Slobodan Medojevic."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Michael Weiner blows his whistle and the second half starts."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "",
            "description": "We have seen an attractive offensive game so far and the fans have nothing to complain about. The home side were more active and dominant in the first half. The opposition found it tough to keep up. The home team are making a lot of passes and attempting to maintain possession, while the away side's tactic is 'kick and rush' football."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 41:22",
            "label": "y-card",
            "description": "Michael Weiner has issued a yellow card to Carlos Zambrano (Eintracht Frankfurt)."
        },
        {
            "gameTime": "1 - 41:07",
            "label": "y-card",
            "description": "Michael Weiner shows a yellow card to Henrikh Mkhitaryan (Dortmund), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 39:54",
            "label": "",
            "description": "Nelson Valdez (Eintracht Frankfurt) wastes a big chance! He unleashes a shot from the edge of the box and it goes narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 39:11",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 38:52",
            "label": "",
            "description": "Timothy Chandler (Eintracht Frankfurt) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 37:24",
            "label": "",
            "description": "A long pass, executed by Slobodan Medojevic (Eintracht Frankfurt), missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 34:53",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "1 - 32:21",
            "label": "",
            "description": "Dortmund hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 31:54",
            "label": "soccer-ball",
            "description": "Goal! Pierre Emerick Aubameyang displays great vision and sends a pass to Shinji Kagawa (Dortmund), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 2:0."
        },
        {
            "gameTime": "1 - 30:24",
            "label": "",
            "description": "Sonny Kittel (Eintracht Frankfurt) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 26:25",
            "label": "y-card",
            "description": "Sven Bender (Dortmund) sees a yellow card from Michael Weiner after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 24:19",
            "label": "y-card",
            "description": "Today's referee Michael Weiner rightly decides to book Sonny Kittel (Eintracht Frankfurt) for his harsh tackle."
        },
        {
            "gameTime": "1 - 23:57",
            "label": "soccer-ball",
            "description": "With a cheeky finish ala Antonin Panenka, Pierre Emerick Aubameyang (Dortmund) scores from the penalty spot."
        },
        {
            "gameTime": "1 - 23:52",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 23:18",
            "label": "penalty",
            "description": "The referee blows his whistle after Sonny Kittel (Eintracht Frankfurt) does a good impression of a basketball player and handles the ball. PENALTY to Dortmund! Almost the entire opposition team is gathered around the referee and complaining. However, the decision has been made and it's final."
        },
        {
            "gameTime": "1 - 22:40",
            "label": "",
            "description": "A crossfield pass from Carlos Zambrano (Eintracht Frankfurt) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 20:20",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) sends a long ball in, but Kevin Trapp comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 19:39",
            "label": "",
            "description": "Sonny Kittel (Eintracht Frankfurt) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Michael Weiner with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 17:49",
            "label": "",
            "description": "Alexander Madlung (Eintracht Frankfurt) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 16:40",
            "label": "",
            "description": "Jakub Blaszczykowski swings the cross over. Pierre Emerick Aubameyang (Dortmund) gets his head to it but it goes just over the crossbar."
        },
        {
            "gameTime": "1 - 16:20",
            "label": "corner",
            "description": "Jakub Blaszczykowski (Dortmund) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 16:03",
            "label": "",
            "description": "Jakub Blaszczykowski (Dortmund) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball goes out of play. Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 13:59",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 13:03",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 12:49",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety."
        },
        {
            "gameTime": "1 - 10:05",
            "label": "",
            "description": "Dortmund keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 07:54",
            "label": "",
            "description": "Aleksandar Ignjovski (Eintracht Frankfurt) sends a cross into the box, but Mitchell Langerak comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 07:00",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Sonny Kittel (Eintracht Frankfurt) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "1 - 05:54",
            "label": "",
            "description": "Carlos Zambrano (Eintracht Frankfurt) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "The linesman raises his flag for offside before Henrikh Mkhitaryan (Dortmund) heads on."
        },
        {
            "gameTime": "1 - 03:24",
            "label": "",
            "description": "Matthias Ginter (Dortmund) makes a strong challenge and Michael Weiner blows for a foul."
        },
        {
            "gameTime": "1 - 02:43",
            "label": "",
            "description": "Sven Bender (Dortmund) finds space on the edge of the box, but his wild shot goes high over the bar."
        },
        {
            "gameTime": "1 - 01:53",
            "label": "",
            "description": "A long pass, executed by Lucas Piazon (Eintracht Frankfurt), missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Dortmund will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Michael Weiner will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The home team had more of the game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "Eintracht Frankfurt",
    "gameDate": "25/04/2015 - 16:30",
    "gameHomeTeam": "Dortmund",
    "gameScore": "2 - 0"
}