{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-11-08 - 18-00 Barcelona 3 - 0 Villarreal/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side dominated the game. The tactic of the home side was to keep the ball at their feet as much as possible, while the away team tried to attack as quickly and accurately as possible."
        },
        {
            "gameTime": "2 - 47:09",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 45:25",
            "label": "",
            "description": "Luis Suarez (Barcelona) spurns a great opportunity from inside the 6 yard box. The ball flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 39:41",
            "label": "soccer-ball",
            "description": "Goal 3:0! Luis Suarez tees up Neymar (Barcelona) inside the box and he rolls the ball into the bottom right corner and past Alphonse Areola."
        },
        {
            "gameTime": "2 - 36:14",
            "label": "substitution",
            "description": "The manager makes a subsitution with Marc Bartra (Barcelona) coming on for Gerard Pique."
        },
        {
            "gameTime": "2 - 35:32",
            "label": "",
            "description": "Sergi Roberto (Barcelona) got the ball on the edge of the box and fired in a first time shot on goal, but his effort floated well over the bar. High, wide and not at all handsome. The ball goes out of play and Villarreal will have a goal kick."
        },
        {
            "gameTime": "2 - 34:13",
            "label": "",
            "description": "Sergi Roberto (Barcelona) has a go from a long way out but it sails way over."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Samuel (Villarreal) comes onto the pitch for Samu Castillejo."
        },
        {
            "gameTime": "2 - 33:35",
            "label": "substitution",
            "description": "Here is a change. Munir El Haddadi is going off and Luis Enrique gives the last tactical orders to Sandro Ramirez (Barcelona)."
        },
        {
            "gameTime": "2 - 32:24",
            "label": "",
            "description": "Luis Suarez (Barcelona) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the left post. Alphonse Areola is alert and denies him with a nice save."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "corner",
            "description": "Neymar (Barcelona) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 30:47",
            "label": "",
            "description": "Neymar (Barcelona) fails to send a pass into the box as his effort is cut out. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 29:47",
            "label": "",
            "description": "Luis Suarez (Barcelona) swings a cross into the box, but it's far too close to Alphonse Areola, who smothers the ball."
        },
        {
            "gameTime": "2 - 26:53",
            "label": "y-card",
            "description": "Carlos Clos Gomez shows a yellow card to Daniele Bonera (Villarreal), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "soccer-ball",
            "description": "Luis Suarez (Barcelona) smoothly converts the penalty with a beautiful low drive into the left side of the net."
        },
        {
            "gameTime": "2 - 24:38",
            "label": "",
            "description": "Luis Suarez (Barcelona) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "y-card",
            "description": "The whistle is blown for an infringement and Jaume Costa (Villarreal) receives a yellow card!"
        },
        {
            "gameTime": "2 - 23:50",
            "label": "penalty",
            "description": "Carlos Clos Gomez blows his whistle after Alphonse Areola (Villarreal) kicks an opponent's legs instead of the ball. Barcelona are awarded a penalty kick!"
        },
        {
            "gameTime": "2 - 23:30",
            "label": "",
            "description": "Barcelona players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "funfact",
            "description": "9:2 – this is the current number of shots on target."
        },
        {
            "gameTime": "2 - 20:14",
            "label": "substitution",
            "description": "Marcelino Garcia Toral prepares a substitution. Tomas Pina is replaced by Cedric Bakambu (Villarreal)."
        },
        {
            "gameTime": "2 - 19:22",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from 23 metres out by Bruno (Villarreal) as his effort only hit the wall."
        },
        {
            "gameTime": "2 - 18:51",
            "label": "y-card",
            "description": "Gerard Pique (Barcelona) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 18:34",
            "label": "",
            "description": "Gerard Pique (Barcelona) fouls an opponent. At least that's what referee Carlos Clos Gomez signals. Villarreal earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 18:02",
            "label": "",
            "description": "Andres Iniesta (Barcelona) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Alphonse Areola guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 14:56",
            "label": "soccer-ball",
            "description": "It's 1:0! Sergio Busquets feeds Neymar (Barcelona) inside the box, who is unmarked and buries the ball in the left side of the net."
        },
        {
            "gameTime": "2 - 12:33",
            "label": "corner",
            "description": "Neymar (Barcelona) sends in a poor cross from the corner and Alphonse Areola has no trouble gathering it."
        },
        {
            "gameTime": "2 - 12:01",
            "label": "",
            "description": "Luis Suarez (Barcelona) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball goes out of play. Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "2 - 08:37",
            "label": "",
            "description": "Luis Suarez (Barcelona) creates himself some space around the penalty spot and connects with the free kick. His header is badly mistimed and sails high over the bar."
        },
        {
            "gameTime": "2 - 08:29",
            "label": "",
            "description": "Neymar (Barcelona) will take the free kick."
        },
        {
            "gameTime": "2 - 07:19",
            "label": "",
            "description": "A clumsy foul by Jonathan dos Santos (Villarreal) and Carlos Clos Gomez blows his whistle. A free kick to Barcelona."
        },
        {
            "gameTime": "2 - 04:46",
            "label": "attendance",
            "description": "The attendance for today's match is 74109."
        },
        {
            "gameTime": "2 - 03:19",
            "label": "corner",
            "description": "Neymar (Barcelona) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 02:52",
            "label": "",
            "description": "Dani Alves (Barcelona) meets a cross inside the penalty area and unloads a good attempt towards the right side of the goal. Alphonse Areola is prepared, though, and denies him with a fantastic save. Barcelona force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 01:29",
            "label": "y-card",
            "description": "The main referee, Carlos Clos Gomez, is apparently not going to tolerate any discussions. Neymar (Barcelona) is given a yellow card for dissent."
        },
        {
            "gameTime": "2 - 01:16",
            "label": "y-card",
            "description": "Luis Suarez (Barcelona) attempts to discuss the decision with Carlos Clos Gomez, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Carlos Clos Gomez starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have been witnesses to an ordinary game without many breathtaking situations, but there is still time for improvement in the second half. The home team were mostly in control in the first half. The home players have grown in confidence and started to string some passes together. The visiting side have relied on their defence and counter attacks."
        },
        {
            "gameTime": "1 - 45:04",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 44:32",
            "label": "",
            "description": "Samu Castillejo (Villarreal) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Claudio Bravo."
        },
        {
            "gameTime": "1 - 43:33",
            "label": "",
            "description": "Barcelona control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 38:49",
            "label": "y-card",
            "description": "Carlos Clos Gomez shows a yellow card to Mario Gaspar (Villarreal) for a tough tackle."
        },
        {
            "gameTime": "1 - 36:58",
            "label": "y-card",
            "description": "Andres Iniesta (Barcelona) receives a yellow card for chasing the referee and shouting at him."
        },
        {
            "gameTime": "1 - 36:18",
            "label": "",
            "description": "Roberto Soldado (Villarreal) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the left post."
        },
        {
            "gameTime": "1 - 29:40",
            "label": "funfact",
            "description": "20:5 – the total goal attempt statistics."
        },
        {
            "gameTime": "1 - 27:55",
            "label": "",
            "description": "Denis Suarez (Villarreal) misses a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball floats high over the crossbar!"
        },
        {
            "gameTime": "1 - 26:57",
            "label": "y-card",
            "description": "The foul by Jeremy Mathieu (Barcelona) is worthy of a card and a yellow is duly shown by Carlos Clos Gomez."
        },
        {
            "gameTime": "1 - 26:09",
            "label": "",
            "description": "Alphonse Areola pulls off a great save to deny Jeremy Mathieu (Barcelona), who makes himself some space inside the box and unleashes a quick low drive to the bottom left corner."
        },
        {
            "gameTime": "1 - 25:58",
            "label": "corner",
            "description": "The corner from Jonathan dos Santos (Villarreal) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 25:49",
            "label": "",
            "description": "Jaume Costa (Villarreal) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball. Villarreal will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 24:43",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Andres Iniesta (Barcelona)."
        },
        {
            "gameTime": "1 - 24:00",
            "label": "",
            "description": "Andres Iniesta (Barcelona) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Alphonse Areola. The referee signals a corner kick to Barcelona."
        },
        {
            "gameTime": "1 - 23:27",
            "label": "",
            "description": "Roberto Soldado (Villarreal) fails to beat the offside trap. The flag goes up and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 21:47",
            "label": "corner",
            "description": "Neymar (Barcelona) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 21:11",
            "label": "",
            "description": "Munir El Haddadi (Barcelona) looks to break free, but an opposing player clears the ball away. Barcelona have a corner."
        },
        {
            "gameTime": "1 - 20:16",
            "label": "corner",
            "description": "Neymar (Barcelona) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 20:03",
            "label": "",
            "description": "Dani Alves (Barcelona) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 18:43",
            "label": "corner",
            "description": "Neymar (Barcelona) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 18:31",
            "label": "",
            "description": "Dani Alves (Barcelona) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "1 - 16:05",
            "label": "corner",
            "description": "Jonathan dos Santos (Villarreal) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 15:30",
            "label": "",
            "description": "Denis Suarez (Villarreal) tries to slide the ball through to a teammate but it's well blocked by a defender. The ball is out of play and the linesman points at the corner flag. Corner to Villarreal."
        },
        {
            "gameTime": "1 - 14:59",
            "label": "",
            "description": "Dani Alves (Barcelona) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball is off of the pitch and it's a goal kick for Villarreal."
        },
        {
            "gameTime": "1 - 13:11",
            "label": "",
            "description": "The linesman raises his flag for offside before Munir El Haddadi (Barcelona) heads on."
        },
        {
            "gameTime": "1 - 11:17",
            "label": "",
            "description": "Jonathan dos Santos (Villarreal) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger."
        },
        {
            "gameTime": "1 - 09:26",
            "label": "",
            "description": "Neymar (Barcelona) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 08:05",
            "label": "",
            "description": "Luis Suarez (Barcelona) receives a reproachful look from Neymar. He latches on to his pass, but the effort from the edge of the box sails well wide of the right post."
        },
        {
            "gameTime": "1 - 07:11",
            "label": "",
            "description": "Luis Suarez (Barcelona) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the left post."
        },
        {
            "gameTime": "1 - 05:54",
            "label": "",
            "description": "Roberto Soldado (Villarreal) finds himself beyond the last defender but the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 03:19",
            "label": "",
            "description": "Neymar (Barcelona) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "1 - 02:44",
            "label": "",
            "description": "Victor Ruiz (Villarreal) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul. That's a free kick to Barcelona."
        },
        {
            "gameTime": "1 - 00:59",
            "label": "",
            "description": "Tomas Pina (Villarreal) makes an overly aggressive challenge and Carlos Clos Gomez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Barcelona will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Clos Gomez is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side dominated the game. The tactic of the home side was to keep the ball at their feet as much as possible, while the away team tried to attack as quickly and accurately as possible."
        }
    ],
    "gameAwayTeam": "Villarreal",
    "gameDate": "08/11/2015 - 18:00",
    "gameHomeTeam": "Barcelona",
    "gameScore": "3 - 0"
}