{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-11-05 - 22-45 Manchester City 1 - 2 CSKA Moscow/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The fans could demand a bit more entertainment for their money. This game was average. The host team were superior on the pitch today. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 48:16",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 48:10",
            "label": "",
            "description": "Gael Clichy (Manchester City) has an effort from the edge of the area, but he skies the ball over the top."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:53",
            "label": "",
            "description": "Ambitious effort from Dmitri Efremov (CSKA Moscow). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well over the bar."
        },
        {
            "gameTime": "2 - 44:15",
            "label": "y-card",
            "description": "Sergio Aguero (Manchester City) receives a yellow card."
        },
        {
            "gameTime": "2 - 43:08",
            "label": "",
            "description": "Dmitri Efremov (CSKA Moscow) was too fierce in his attempt to get the ball from his opponent and Anasthasios Sidiropoulos blows for a foul. Manchester City win a free kick."
        },
        {
            "gameTime": "2 - 41:19",
            "label": "",
            "description": "Samir Nasri (Manchester City) should know this behaviour is beyond the rules. He was too careless with his challenge and left Anasthasios Sidiropoulos no option but to blow his whistle. There is a free kick near the sideline to CSKA Moscow."
        },
        {
            "gameTime": "2 - 40:40",
            "label": "corner",
            "description": "Bibras Natcho (CSKA Moscow) takes a short corner kick."
        },
        {
            "gameTime": "2 - 40:39",
            "label": "substitution",
            "description": "Alan Dzagoev comes off the pitch to be replaced by Dmitri Efremov (CSKA Moscow)."
        },
        {
            "gameTime": "2 - 40:04",
            "label": "",
            "description": "Joe Hart hears the fans clapping his superb goalkeeping. Ahmed Musa (CSKA Moscow) shoots from the edge of the box towards the top of the net, but the goalkeeper makes a magnificent save. The referee signals a corner kick to CSKA Moscow."
        },
        {
            "gameTime": "2 - 39:44",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "2 - 38:21",
            "label": "",
            "description": "Edin Dzeko (Manchester City) passes the ball into the box but an opposing player clears."
        },
        {
            "gameTime": "2 - 36:15",
            "label": "r-card",
            "description": "Red card! Yaya Toure (Manchester City) is given a red card for his behaviour."
        },
        {
            "gameTime": "2 - 33:39",
            "label": "y-card",
            "description": "Roman Eremenko (CSKA Moscow) is booked."
        },
        {
            "gameTime": "2 - 32:21",
            "label": "",
            "description": "Yaya Toure (Manchester City) powerfully strikes the ball from the free kick, but it's straight at the goalkeeper who easily saves."
        },
        {
            "gameTime": "2 - 31:43",
            "label": "y-card",
            "description": "Sergey Ignashevich (CSKA Moscow) has received a yellow card for his foul. Manchester City have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 29:42",
            "label": "",
            "description": "Igor Akinfeev displays his ability to read the game and clears the danger after Edin Dzeko (Manchester City) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "2 - 27:54",
            "label": "",
            "description": "Edin Dzeko (Manchester City) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 27:33",
            "label": "corner",
            "description": "The ball is out of play and the linesman points at the corner flag. Corner to Manchester City. Corner kick. Samir Nasri (Manchester City) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 27:24",
            "label": "",
            "description": "Samir Nasri (Manchester City) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "2 - 26:47",
            "label": "",
            "description": "Yaya Toure (Manchester City) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 25:26",
            "label": "",
            "description": "The free kick from the edge of the box is taken by Georgi Milanov (CSKA Moscow), who fires in a direct effort just wide of the right post. What a chance!"
        },
        {
            "gameTime": "2 - 24:35",
            "label": "yr-card",
            "description": "Anasthasios Sidiropoulos blows his whistle and Fernandinho (Manchester City) is shown a second yellow card for his foul. His manager will not be pleased. He has lot of time to think about it as he walks off. CSKA Moscow earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 22:14",
            "label": "",
            "description": "Sergio Aguero (Manchester City) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "2 - 20:59",
            "label": "substitution",
            "description": "Seydou Doumbia goes off the pitch and Georgi Milanov (CSKA Moscow) comes on."
        },
        {
            "gameTime": "2 - 20:33",
            "label": "y-card",
            "description": "What was Yaya Toure (Manchester City) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "2 - 19:45",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Fernando departs the field of play to be replaced by Edin Dzeko (Manchester City)."
        },
        {
            "gameTime": "2 - 19:08",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) goes for goal, but his effort isn't precise at all and it flies yards wide of the right post."
        },
        {
            "gameTime": "2 - 16:55",
            "label": "y-card",
            "description": "Anasthasios Sidiropoulos shows a yellow card to Fernandinho (Manchester City) for a tough tackle."
        },
        {
            "gameTime": "2 - 16:40",
            "label": "",
            "description": "Igor Akinfeev pulls off a great save to deny James Milner (Manchester City) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "2 - 14:22",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Yaya Toure (Manchester City), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 13:24",
            "label": "",
            "description": "James Milner (Manchester City) finds himself with a great opportunity! He unleashes a shot from the edge of the box, which whizzes just wide of the right post!"
        },
        {
            "gameTime": "2 - 10:26",
            "label": "",
            "description": "Samir Nasri (Manchester City) is flagged for offside."
        },
        {
            "gameTime": "2 - 07:54",
            "label": "",
            "description": "Fernandinho (Manchester City) passes the ball onto James Milner, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "2 - 06:21",
            "label": "",
            "description": "Georgi Schennikov (CSKA Moscow) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 02:58",
            "label": "",
            "description": "Great teamplay by Manchester City as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Jesus Navas is replaced by Samir Nasri (Manchester City)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here is a change after the half time break. Stevan Jovetic is replaced by Fernandinho (Manchester City)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We can hope that the managers will be able to motivate the players and stir them to improve their performance for after the half time break. We haven't seen really exciting football in the previous 45 minutes. The hosts are enjoying a clear advantage over the opposition. The home side are keeping possession of the ball with some short passes, while the visitors are waiting to open up their defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 45:08",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 44:37",
            "label": "",
            "description": "Anasthasios Sidiropoulos blows his whistle after Yaya Toure (Manchester City) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 42:08",
            "label": "",
            "description": "The linesman signals that James Milner (Manchester City) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 40:15",
            "label": "",
            "description": "Fernando (Manchester City) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "1 - 38:44",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 38:31",
            "label": "",
            "description": "Sergio Aguero (Manchester City) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Manchester City will take a corner kick."
        },
        {
            "gameTime": "1 - 37:09",
            "label": "",
            "description": "Martin Demichelis (Manchester City) makes a reckless foul in order to win the ball from his opponent. Anasthasios Sidiropoulos has a clear sight of it and blows his whistle. Bibras Natcho (CSKA Moscow) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 17:7."
        },
        {
            "gameTime": "1 - 33:53",
            "label": "soccer-ball",
            "description": "Goal! Bibras Natcho plays a pass to the feet of Seydou Doumbia (CSKA Moscow), and he shoots into the bottom left corner from inside the box. It's 1:2."
        },
        {
            "gameTime": "1 - 33:17",
            "label": "",
            "description": "James Milner (Manchester City) sprays a pass out to Yaya Toure, but he can't beat his man to get to the ball."
        },
        {
            "gameTime": "1 - 32:57",
            "label": "",
            "description": "The linesman raises his flag for offside before Ahmed Musa (CSKA Moscow) heads on."
        },
        {
            "gameTime": "1 - 32:40",
            "label": "",
            "description": "Igor Akinfeev pulls off a superb save! He leapt to block the shot Martin Demichelis (Manchester City) fired on target from the rebound. His effort from inside the box was directed low to the middle of the goal."
        },
        {
            "gameTime": "1 - 31:17",
            "label": "corner",
            "description": "James Milner (Manchester City) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 31:01",
            "label": "",
            "description": "Sergio Aguero (Manchester City) sends a cross into the box, but the opposition's defence clears the ball to safety. The linesman points to the corner flag, Manchester City are going to take it."
        },
        {
            "gameTime": "1 - 30:48",
            "label": "corner",
            "description": "The resulting corner from James Milner (Manchester City) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 30:29",
            "label": "",
            "description": "Manchester City players perform combination football, attempting to create a goal scoring opportunity, but they will have to wait for that as they just lose possession due to an inaccurate pass. Manchester City have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 29:40",
            "label": "",
            "description": "Yaya Toure (Manchester City) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 27:26",
            "label": "y-card",
            "description": "Pontus Wernbloom (CSKA Moscow) makes a bad challenge and receives a yellow card. The referee had no doubt."
        },
        {
            "gameTime": "1 - 25:37",
            "label": "",
            "description": "Roman Eremenko (CSKA Moscow) tackles a bit over zealously and Anasthasios Sidiropoulos blows for a foul."
        },
        {
            "gameTime": "1 - 22:40",
            "label": "",
            "description": "Sergey Ignashevich (CSKA Moscow) makes a strong challenge and Anasthasios Sidiropoulos blows for a foul."
        },
        {
            "gameTime": "1 - 21:54",
            "label": "",
            "description": "Yaya Toure (Manchester City) takes a mid range shot, but it lacks accuracy and it goes way over the bar."
        },
        {
            "gameTime": "1 - 21:40",
            "label": "corner",
            "description": "James Milner (Manchester City) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 21:10",
            "label": "",
            "description": "Igor Akinfeev can hear the fans clapping for his superb goalkeeping after he magnificently stopped the close range effort from James Milner (Manchester City). The ball would have probably ended up in the bottom right corner. Manchester City have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 20:04",
            "label": "",
            "description": "Jesus Navas (Manchester City) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the right post."
        },
        {
            "gameTime": "1 - 19:52",
            "label": "",
            "description": "Igor Akinfeev displays his ability to read the game and clears the danger after Sergio Aguero (Manchester City) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "1 - 17:56",
            "label": "",
            "description": "What a chance that is! Seydou Doumbia (CSKA Moscow) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 15:28",
            "label": "",
            "description": "Bibras Natcho (CSKA Moscow) receives a pass and unleashes a shot which goes well wide of the right post."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "corner",
            "description": "James Milner (Manchester City) whips in a cross from the corner, but Igor Akinfeev is well positioned and punches the ball away."
        },
        {
            "gameTime": "1 - 11:54",
            "label": "",
            "description": "Gael Clichy (Manchester City) swings in a cross, but the ball is cleared to safety by one of the defending players. Good work from Manchester City as they win a corner."
        },
        {
            "gameTime": "1 - 11:53",
            "label": "",
            "description": "James Milner (Manchester City) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "1 - 11:04",
            "label": "",
            "description": "Anasthasios Sidiropoulos blows his whistle and signals a foul after Pontus Wernbloom (CSKA Moscow) brought his opponent down. Manchester City have a free kick."
        },
        {
            "gameTime": "1 - 10:43",
            "label": "",
            "description": "The Manchester City players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 07:57",
            "label": "soccer-ball",
            "description": "Yaya Toure (Manchester City) scores a beautiful goal from the resulting free kick. He bends the ball into the top left corner. A technically stunning goal."
        },
        {
            "gameTime": "1 - 06:54",
            "label": "",
            "description": "Vasili Berezutski (CSKA Moscow) brings his opponent down. Anasthasios Sidiropoulos has a clear sight of it and blows his whistle for a foul. Manchester City are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 05:25",
            "label": "",
            "description": "Jesus Navas (Manchester City) latches on to an accurate pass inside the box and immediately unleashes a shot towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 04:42",
            "label": "",
            "description": "James Milner (Manchester City) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "1 - 03:09",
            "label": "",
            "description": "Flag up against Sergio Aguero (Manchester City). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 01:52",
            "label": "soccer-ball",
            "description": "Perfectly taken free kick!Bibras Natcho sends a cross in and Seydou Doumbia (CSKA Moscow) leaps high to connect with it on the edge of the 6 yard box. His close range header goes into the top of the net and the score changes to 0:1."
        },
        {
            "gameTime": "1 - 01:18",
            "label": "",
            "description": "Handball by Gael Clichy (Manchester City). CSKA Moscow are awarded a free kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Manchester City will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Anasthasios Sidiropoulos."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans could demand a bit more entertainment for their money. This game was average. The host team were superior on the pitch today. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "CSKA Moscow",
    "gameDate": "05/11/2014 - 22:45",
    "gameHomeTeam": "Manchester City",
    "gameScore": "1 - 2"
}