{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2014-2015/2015-04-11 - 21-45 Verona 0 - 3 Inter/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. The superiority of the away team was evident on the pitch today. The home team played long ball football unlike the away side who attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 48:01",
            "label": "whistle",
            "description": "That's it for today, Paolo Tagliavento has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 46:24",
            "label": "soccer-ball-own",
            "description": "An unfortunate own goal is conceded by Vangelis Moras (Verona), who attempted to smack the ball away after a cross, but instead he sends it into the bottom right corner of his own goal."
        },
        {
            "gameTime": "2 - 45:48",
            "label": "",
            "description": "Mattia Valoti (Verona) makes a rough challenge and the referee blows for a foul. Inter win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:56",
            "label": "",
            "description": "Marcelo Brozovic (Inter) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "",
            "description": "Mattia Valoti (Verona) makes an overly aggressive challenge and Paolo Tagliavento blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 43:43",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 43:12",
            "label": "",
            "description": "The game is interrupted. One of the players from Verona is cautioned for aggressive play."
        },
        {
            "gameTime": "2 - 42:54",
            "label": "substitution",
            "description": "It's time for a substitution. Felipe (Inter) comes on in place of Hernanes."
        },
        {
            "gameTime": "2 - 42:15",
            "label": "",
            "description": "Panagiotis Tachtsidis (Verona) got the ball on the edge of the box and smashed a first time shot, but his effort flew high over the crossbar."
        },
        {
            "gameTime": "2 - 41:40",
            "label": "",
            "description": "Mattia Valoti (Verona) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "2 - 40:41",
            "label": "",
            "description": "Mattia Valoti (Verona) tries his luck with a shot from long distance after receiving a good pass. He hits the ball poorly and sends it into orbit."
        },
        {
            "gameTime": "2 - 39:13",
            "label": "corner",
            "description": "Leandro Greco (Verona) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 38:32",
            "label": "",
            "description": "A neat pass is well received by Panagiotis Tachtsidis (Verona), who is lurking on the edge of the box and strikes the ball towards the bottom left corner, but the goalkeeper makes an incredible save to block his shot. Verona force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 38:13",
            "label": "",
            "description": "Jacopo Sala (Verona) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "2 - 36:58",
            "label": "",
            "description": "Javier Saviola (Verona) dribbles into the box, but Samir Handanovic is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 36:23",
            "label": "",
            "description": "Javier Saviola (Verona) sends a teasing cross into the area, but Samir Handanovic intercepts the ball."
        },
        {
            "gameTime": "2 - 35:09",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Mattia Valoti (Verona) for Mounir Obbadi."
        },
        {
            "gameTime": "2 - 34:35",
            "label": "substitution",
            "description": "Roberto Mancini has decided to make a change. Mateo Kovacic (Inter) replaces Rodrigo Palacio."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Assane Gnoukouri (Inter) comes onto the pitch so that Gary Medel can be given a rest."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "",
            "description": "An attempted cross from Bosko Jankovic (Verona) is cleared."
        },
        {
            "gameTime": "2 - 31:45",
            "label": "penalty-missed",
            "description": "Penalty saved! Luca Toni (Verona) sends the penalty towards the bottom left corner, but Samir Handanovic pulls off a wonderful save to deny him."
        },
        {
            "gameTime": "2 - 31:38",
            "label": "",
            "description": "Luca Toni (Verona) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 30:50",
            "label": "y-card",
            "description": "It's like he was asking for a caution. Nemanja Vidic (Inter) receives a yellow card."
        },
        {
            "gameTime": "2 - 30:40",
            "label": "penalty",
            "description": "Referee Paolo Tagliavento sees the trip by Nemanja Vidic (Inter) and doesn't hesitate to blow his whistle. Verona are about to take a penalty!"
        },
        {
            "gameTime": "2 - 29:51",
            "label": "substitution",
            "description": "Substitution. Javier Saviola (Verona) on for Juan Ignacio Gomez Taleb."
        },
        {
            "gameTime": "2 - 29:22",
            "label": "",
            "description": "Luca Toni (Verona) finds himself some space around the penalty spot to connect with a fine free kick. His header is slightly mistimed and sails inches past the right post."
        },
        {
            "gameTime": "2 - 28:41",
            "label": "",
            "description": "Paolo Tagliavento interrupts the game for a tactical foul by Marcelo Brozovic (Inter). It's a free kick to Verona, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 26:59",
            "label": "substitution",
            "description": "Substitution. Leandro Greco (Verona) receives a signal from the referee and is now allowed to enter the pitch as Emil Hallfredsson walks off."
        },
        {
            "gameTime": "2 - 26:07",
            "label": "",
            "description": "OFF THE POST! Rodrigo Palacio (Inter) drifts into the box to give his teammate support. He receives a fantastic pass and shoots from close range, but it crashes against the left post. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "2 - 25:16",
            "label": "",
            "description": "Juan Ignacio Gomez Taleb (Verona) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 24:34",
            "label": "",
            "description": "Nemanja Vidic (Inter) makes a strong challenge and Paolo Tagliavento blows for a foul."
        },
        {
            "gameTime": "2 - 23:57",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) clips an inviting cross into the box, but there's no one in a position to get on the end of it. The ball is off of the pitch and it's a goal kick for Verona."
        },
        {
            "gameTime": "2 - 21:02",
            "label": "",
            "description": "Panagiotis Tachtsidis (Verona) misses a rebound from the penalty spot. The ball flies just a few inches over the bar."
        },
        {
            "gameTime": "2 - 20:30",
            "label": "",
            "description": "Vangelis Moras (Verona) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "2 - 18:06",
            "label": "",
            "description": "Andrea Ranocchia (Inter) was the quickest one to orientate himself inside the box and leaps to connect with a cross from the corner kick. He produces a fine header, but it flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "corner",
            "description": "Hernanes (Inter) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 17:54",
            "label": "",
            "description": "Rodrigo Palacio (Inter) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Inter get a corner."
        },
        {
            "gameTime": "2 - 17:09",
            "label": "",
            "description": "Mounir Obbadi (Verona) picks up the rebound inside the penalty area and releases a good shot to the bottom left corner. Unfortunately for him, Samir Handanovic shows how quick his reflexes are and dives superbly to stop his effort. What a save but what a wasted opportunity!"
        },
        {
            "gameTime": "2 - 16:40",
            "label": "",
            "description": "Panagiotis Tachtsidis (Verona) finds himself some space just outside the box, collects a rebound and sends an effort in on goal. Samir Handanovic pulls off a fantastic reflex save to stop the ball going low into the middle of the target."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "corner",
            "description": "Jacopo Sala (Verona) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 15:58",
            "label": "",
            "description": "A raking crossfield pass from Bosko Jankovic (Verona) lacks accuracy and the opposition gain possession. Verona force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 15:38",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Hernanes (Inter), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "2 - 14:36",
            "label": "",
            "description": "Hernanes (Inter) tries to slide the ball through to a teammate but it's well blocked by a defender. The linesman signals a throw in for Inter."
        },
        {
            "gameTime": "2 - 12:42",
            "label": "corner",
            "description": "Hernanes (Inter) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 12:31",
            "label": "",
            "description": "Hernanes (Inter) sends a cross into the box, but the opposition's defence clears the ball to safety. The linesman makes the right call and Inter will have a corner."
        },
        {
            "gameTime": "2 - 10:59",
            "label": "y-card",
            "description": "Is that a yellow card in the referee's hand? It is! Mounir Obbadi (Verona) gets booked."
        },
        {
            "gameTime": "2 - 10:39",
            "label": "",
            "description": "A precise low pass is received by Fredy Guarin (Inter), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well over the bar."
        },
        {
            "gameTime": "2 - 09:54",
            "label": "",
            "description": "Rodrigo Palacio (Inter) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 09:35",
            "label": "",
            "description": "One of the Verona players unfairly tackled his opponent and conceded a foul."
        },
        {
            "gameTime": "2 - 08:52",
            "label": "",
            "description": "Bosko Jankovic (Verona) attempts to convert a cross into a goal, but his promising header from near the penalty spot towards the left post is denied by a decent save from Samir Handanovic."
        },
        {
            "gameTime": "2 - 08:35",
            "label": "",
            "description": "Marcelo Brozovic (Inter) plays a one two with Mauro Icardi, but the move breaks down."
        },
        {
            "gameTime": "2 - 08:06",
            "label": "",
            "description": "Bosko Jankovic (Verona) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 07:14",
            "label": "",
            "description": "Mauro Icardi (Inter) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "",
            "description": "Bosko Jankovic (Verona) holds his head in his hands after missing a big chance. He latches on to a rebound, creates some space from himself and fires the ball from the edge of the box well wide of the right post."
        },
        {
            "gameTime": "2 - 02:29",
            "label": "soccer-ball",
            "description": "It's a goal! Mauro Icardi plays a lovely pass into the box and finds Rodrigo Palacio (Inter). He tries his luck from close range and coolly strikes the ball into the back of the net. 0:2."
        },
        {
            "gameTime": "2 - 01:25",
            "label": "",
            "description": "Nemanja Vidic (Inter) breaks past challenges inside the box, but puts too much pace on his pass to ."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "In the previous 45 minutes, we have witnessed a rather boring football match with almost no goalscoring opportunities nor exciting moments on either side. The visitors were more active and dominated the home side in the first half, who weren't able to keep up. The home team are playing long ball football unlike the away side, who are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:39",
            "label": "",
            "description": "Marcelo Brozovic (Inter) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 45:12",
            "label": "",
            "description": "Nemanja Vidic (Inter) smashes the ball upfield and Rodrigo Palacio brings it down with a fine first touch."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 41:59",
            "label": "",
            "description": "Mauro Icardi (Inter) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 41:14",
            "label": "",
            "description": "Juan Ignacio Gomez Taleb (Verona) finds himself behind the opposition's defence, but the game is stopped for offside."
        },
        {
            "gameTime": "1 - 39:21",
            "label": "y-card",
            "description": "The game is interrupted. Fredy Guarin (Inter) is given a yellow card. He has to be more careful now."
        },
        {
            "gameTime": "1 - 39:20",
            "label": "",
            "description": "Handball by Fredy Guarin (Inter)."
        },
        {
            "gameTime": "1 - 37:25",
            "label": "y-card",
            "description": "Marcelo Brozovic (Inter) is very lucky to stay on the pitch after using excessive force to bring down his opponent with a two footed challenge."
        },
        {
            "gameTime": "1 - 37:04",
            "label": "",
            "description": "Marcelo Brozovic (Inter) commits a foul with a sliding tackle but escaped any punishment. No yellow card. A free kick to Verona."
        },
        {
            "gameTime": "1 - 35:59",
            "label": "y-card",
            "description": "Vangelis Moras (Verona) makes a bad challenge and receives a yellow card. The referee had no doubt."
        },
        {
            "gameTime": "1 - 35:26",
            "label": "",
            "description": "Rodrigo Palacio picks out Marcelo Brozovic (Inter), who drives a shot just wide of the left post from the edge of the box."
        },
        {
            "gameTime": "1 - 33:47",
            "label": "",
            "description": "The foul by Luca Toni (Verona) was seen by Paolo Tagliavento who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 33:17",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 32:04",
            "label": "",
            "description": "Luca Toni (Verona) plants a header from the edge of the box after a nice cross from the free kick. It lacks accuracy and the ball flies way over the bar."
        },
        {
            "gameTime": "1 - 31:30",
            "label": "",
            "description": "Paolo Tagliavento blows his whistle after Andrea Ranocchia (Inter) kicks an opponent's legs instead of the ball. Verona are awarded a free kick."
        },
        {
            "gameTime": "1 - 31:00",
            "label": "",
            "description": "Mounir Obbadi (Verona) blows a huge chance! The ball rebounded out to the edge of the box and he misdirects his shot well wide of the right post."
        },
        {
            "gameTime": "1 - 30:44",
            "label": "corner",
            "description": "The corner by Jacopo Sala (Verona) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 30:18",
            "label": "",
            "description": "Mounir Obbadi (Verona) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The referee blows his whistle, Verona are awarded a corner kick."
        },
        {
            "gameTime": "1 - 29:25",
            "label": "",
            "description": "Marcelo Brozovic (Inter) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the left post."
        },
        {
            "gameTime": "1 - 28:24",
            "label": "",
            "description": "A cross by Danilo D'Ambrosio (Inter) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "1 - 27:53",
            "label": "",
            "description": "Bosko Jankovic (Verona) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 26:40",
            "label": "",
            "description": "Rodrigo Palacio (Inter) should know this behaviour is beyond the rules. He was too careless with his challenge and left Paolo Tagliavento no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 23:28",
            "label": "",
            "description": "Rodrigo Palacio (Inter) swings a cross into the box, but it's far too close to Rafael, who smothers the ball."
        },
        {
            "gameTime": "1 - 23:00",
            "label": "",
            "description": "Jacopo Sala (Verona) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "1 - 21:45",
            "label": "",
            "description": "A player from Inter takes his opponent down, the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 21:32",
            "label": "",
            "description": "Luca Toni (Verona) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 20:55",
            "label": "",
            "description": "Rodrigo Palacio (Inter) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 19:55",
            "label": "",
            "description": "Rodrigo Palacio (Inter) dribbles into the box, but Rafael is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "1 - 18:55",
            "label": "",
            "description": "What an opportunity! Luca Toni (Verona) leaps high to meet a beautiful cross into the box from the free kick, and he plants a header from near the penalty spot which goes a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 17:54",
            "label": "y-card",
            "description": "Juan Jesus (Inter) is yellow carded."
        },
        {
            "gameTime": "1 - 17:29",
            "label": "",
            "description": "is penalised for holding. Paolo Tagliavento signals a set piece. Verona will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 17:06",
            "label": "corner",
            "description": "Panagiotis Tachtsidis (Verona) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 16:39",
            "label": "",
            "description": "Mounir Obbadi (Verona) flights in the cross, but the defender is alert and clears to safety. Verona earn a corner."
        },
        {
            "gameTime": "1 - 15:22",
            "label": "",
            "description": "Juan Ignacio Gomez Taleb (Verona) fails to find a teammate across the pitch with a long ball. The ball goes out of play and Inter will have a goal kick."
        },
        {
            "gameTime": "1 - 14:35",
            "label": "",
            "description": "Emil Hallfredsson (Verona) sends a chip pass into the box, but Samir Handanovic is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 13:53",
            "label": "",
            "description": "Emil Hallfredsson (Verona) sends a cross into the box, but Samir Handanovic comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 13:20",
            "label": "",
            "description": "Gary Medel (Inter) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "1 - 10:53",
            "label": "soccer-ball",
            "description": "Goal! Rodrigo Palacio puts the ball on a plate for Mauro Icardi (Inter), who scores with a simple close range finish. It's 0:1."
        },
        {
            "gameTime": "1 - 09:16",
            "label": "",
            "description": "Good defending. Fredy Guarin (Inter) tries to find Mauro Icardi inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 08:34",
            "label": "",
            "description": "Eros Pisano (Verona) races towards goal but the defender gets back well to make a challenge. The ball is behind the touchline and Inter will take a throw in."
        },
        {
            "gameTime": "1 - 07:48",
            "label": "corner",
            "description": "The resulting corner, taken by Hernanes (Inter), comes to nothing."
        },
        {
            "gameTime": "1 - 07:21",
            "label": "",
            "description": "Hernanes (Inter) connects with a cross from the side and steers a header from around the penalty spot towards the goal. The ball goes in the right direction, but it's stopped by one of the defenders. The linesman points to the corner flag, Inter are going to take it."
        },
        {
            "gameTime": "1 - 05:27",
            "label": "",
            "description": "A clumsy foul by Marcelo Brozovic (Inter) and Paolo Tagliavento blows his whistle."
        },
        {
            "gameTime": "1 - 05:14",
            "label": "corner",
            "description": "Fredy Guarin (Inter) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 04:58",
            "label": "",
            "description": "Hernanes (Inter) looks to break free, but an opposing player clears the ball away. Now Inter have a corner."
        },
        {
            "gameTime": "1 - 03:41",
            "label": "",
            "description": "Bosko Jankovic (Verona) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 03:21",
            "label": "corner",
            "description": "Hernanes (Inter) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 02:52",
            "label": "",
            "description": "Hernanes (Inter) weaves his way through opponents and strikes the ball from the edge of the area, but it's blocked by a defender. The referee signals a corner kick to Inter."
        },
        {
            "gameTime": "1 - 02:07",
            "label": "",
            "description": "Nemanja Vidic (Inter) breaks past challenges inside the box, but puts too much pace on his pass to ."
        },
        {
            "gameTime": "1 - 02:02",
            "label": "",
            "description": "The ball is cleared after Fredy Guarin (Inter) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 01:37",
            "label": "",
            "description": "Nemanja Vidic (Inter) breaks past challenges inside the box, but puts too much pace on his pass to ."
        },
        {
            "gameTime": "1 - 00:57",
            "label": "",
            "description": "The Inter players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Inter will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paolo Tagliavento will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. The superiority of the away team was evident on the pitch today. The home team played long ball football unlike the away side who attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Inter",
    "gameDate": "11/04/2015 - 21:45",
    "gameHomeTeam": "Verona",
    "gameScore": "0 - 3"
}