{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2015-2016/2015-08-29 - 21-45 AC Milan 2 - 1 Empoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The game was pretty even. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 48:12",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 46:54",
            "label": "",
            "description": "Riccardo Saponara (Empoli) pulls the jersey of one of the opposition players and Piero Giacomelli blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:39",
            "label": "",
            "description": "commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "2 - 41:10",
            "label": "",
            "description": "A pass into the penalty area from Daniele Croce (Empoli) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 39:38",
            "label": "",
            "description": "Daniele Croce (Empoli) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 38:29",
            "label": "",
            "description": "Mario Rui (Empoli) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "substitution",
            "description": "We are about to witness a substitution. Andrea Poli (AC Milan) is replacing Andrea Bertolacci."
        },
        {
            "gameTime": "2 - 36:55",
            "label": "",
            "description": "Riccardo Saponara (Empoli) strikes from the edge of the box, but hits it really poorly and sends the ball way over the bar."
        },
        {
            "gameTime": "2 - 36:24",
            "label": "",
            "description": "Marco Zambelli (Empoli) swings a cross into the box, but it's far too close to Diego Lopez, who smothers the ball."
        },
        {
            "gameTime": "2 - 34:15",
            "label": "substitution",
            "description": "Problems for Marco Giampaolo as Federico Barba is not able to play anymore. His injury is too serious and Andrea Costa (Empoli) replaces him."
        },
        {
            "gameTime": "2 - 33:24",
            "label": "injury",
            "description": "The game is interrupted now, Federico Barba (Empoli) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 30:48",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Raffaele Maiello (Empoli) comes onto the pitch so that Assane Diousse can be given a rest."
        },
        {
            "gameTime": "2 - 29:14",
            "label": "",
            "description": "Luiz Adriano (AC Milan) is clearly in an offside position and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 27:06",
            "label": "",
            "description": "Federico Barba (Empoli) goes for goal, but slices it wide of the target."
        },
        {
            "gameTime": "2 - 26:53",
            "label": "corner",
            "description": "There's an opportunity for to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 26:09",
            "label": "",
            "description": "Levan Mchedlidze (Empoli) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger. The ball goes out of play. Empoli are awarded a corner kick."
        },
        {
            "gameTime": "2 - 23:45",
            "label": "soccer-ball",
            "description": "Luiz Adriano (AC Milan) meets the corner and displays his eye for goal as he coolly plants a header into the roof of the net from close range. The score is 2:1."
        },
        {
            "gameTime": "2 - 23:44",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 22:29",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) floats the free kick into the box, but it's easily cleared by the first man. AC Milan force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 21:52",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 20:30",
            "label": "corner",
            "description": "The corner by Giacomo Bonaventura (AC Milan) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "2 - 20:04",
            "label": "",
            "description": "Carlos Bacca (AC Milan) crosses the ball into the box, but one of the defending players averts the threat. The referee signals a corner kick to AC Milan."
        },
        {
            "gameTime": "2 - 18:29",
            "label": "",
            "description": "Andrea Bertolacci (AC Milan) serves up a nice cross, but Lukasz Skorupski punches the ball away."
        },
        {
            "gameTime": "2 - 16:52",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Levan Mchedlidze (Empoli) is coming onto the pitch as Massimo Maccarone cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 14:36",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 14:20",
            "label": "",
            "description": "Luiz Adriano (AC Milan) passes the ball into the box but an opposing player clears. The ball goes behind for a corner. AC Milan will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 13:34",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 13:15",
            "label": "",
            "description": "Andrea Bertolacci (AC Milan) sends the ball into the box from the side of the pitch, but his cross is blocked. AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:34",
            "label": "",
            "description": "Massimo Maccarone (Empoli) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 09:48",
            "label": "substitution",
            "description": "Substitution. Suso leaves the pitch and is replaced by Giacomo Bonaventura (AC Milan)."
        },
        {
            "gameTime": "2 - 09:04",
            "label": "corner",
            "description": "Suso (AC Milan) swings the ball into the box from the corner kick but it's a bit too strong and it goes out of play."
        },
        {
            "gameTime": "2 - 08:52",
            "label": "",
            "description": "AC Milan force their opponents to concede a corner. Luiz Adriano (AC Milan) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net."
        },
        {
            "gameTime": "2 - 08:08",
            "label": "",
            "description": "Juraj Kucka (AC Milan) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "2 - 06:04",
            "label": "",
            "description": "Massimo Maccarone (Empoli) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 04:15",
            "label": "",
            "description": "Assane Diousse (Empoli) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "2 - 02:41",
            "label": "",
            "description": "Alessio Romagnoli (AC Milan) trips an opponent with a slide tackle. Piero Giacomelli stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "2 - 00:20",
            "label": "substitution",
            "description": "Half time substitution. Sinisa Mihajlovic decided to make a change. Antonio Nocerino is replaced by Juraj Kucka (AC Milan)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Piero Giacomelli starts the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The performance from both teams could be described as average. There have been only a few exciting situations and the fans will be expecting more in the second half. The away team controlled the game for most of the first half. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 46:06",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Piero Giacomelli has ended it."
        },
        {
            "gameTime": "1 - 45:44",
            "label": "corner",
            "description": "fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "1 - 45:43",
            "label": "",
            "description": "Massimo Maccarone (Empoli) sends a pass into the penalty area, but the opponent manages to cut it out. The ball is out of play and Empoli manage to earn a corner."
        },
        {
            "gameTime": "1 - 45:42",
            "label": "corner",
            "description": "sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 45:41",
            "label": "",
            "description": "Manuel Pucciarelli (Empoli) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety. Now Empoli have a corner."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:44",
            "label": "injury",
            "description": "Mattia De Sciglio (AC Milan) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 44:14",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) was too forceful with his tackle and Piero Giacomelli interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 43:04",
            "label": "",
            "description": "Manuel Pucciarelli (Empoli) unleashes a shot, but his effort isn't precise at all and it flies well wide of the left post."
        },
        {
            "gameTime": "1 - 42:26",
            "label": "",
            "description": "Piero Giacomelli interrupts the game for a tactical foul by Nigel De Jong (AC Milan)."
        },
        {
            "gameTime": "1 - 41:20",
            "label": "y-card",
            "description": "The whistle blows and Massimo Maccarone (Empoli) is booked for an infringement."
        },
        {
            "gameTime": "1 - 40:43",
            "label": "",
            "description": "Suso (AC Milan) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "1 - 38:45",
            "label": "",
            "description": "Suso (AC Milan) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "1 - 37:35",
            "label": "",
            "description": "Riccardo Saponara (Empoli) unleashes a shot from the edge of the box, but it goes straight at Diego Lopez."
        },
        {
            "gameTime": "1 - 35:16",
            "label": "corner",
            "description": "Antonio Nocerino (AC Milan) fails to deliver a decent cross from the corner and the ball goes out of play."
        },
        {
            "gameTime": "1 - 33:43",
            "label": "",
            "description": "Suso (AC Milan) finds space on the edge of the box, but his wild shot goes high over the bar."
        },
        {
            "gameTime": "1 - 29:07",
            "label": "",
            "description": "Antonio Nocerino (AC Milan) sends a cross into the box, but Lukasz Skorupski comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 26:39",
            "label": "y-card",
            "description": "Lorenzo Tonelli (Empoli) is punished with a yellow card for violating the rules."
        },
        {
            "gameTime": "1 - 23:23",
            "label": "",
            "description": "Luiz Adriano (AC Milan) is strong enough to get to the ball and produces a header from close range. Even though it was aimed precisely towards the middle of the goal, Lukasz Skorupski didn't have a hard time stopping the attempt as it wasn't powerful enough."
        },
        {
            "gameTime": "1 - 21:57",
            "label": "",
            "description": "Manuel Pucciarelli (Empoli) wastes a big chance! He unleashes a shot from the edge of the box and it goes narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 19:34",
            "label": "soccer-ball",
            "description": "Goal! Massimo Maccarone displays great vision and sends a pass to Riccardo Saponara (Empoli), who shows brilliant composure inside the box to bury the ball into the back of the net. The score is 1:1."
        },
        {
            "gameTime": "1 - 15:21",
            "label": "soccer-ball",
            "description": "Carlos Bacca (AC Milan) finishes his beautiful individual effort with a superb strike from inside the box. Lukasz Skorupski is just a bystander as the ball flies low into the middle of the goal. The score is 1:0."
        },
        {
            "gameTime": "1 - 13:52",
            "label": "corner",
            "description": "The resulting corner comes to nothing as sends it out of play."
        },
        {
            "gameTime": "1 - 12:52",
            "label": "",
            "description": "What a goal scoring opportunity! Massimo Maccarone (Empoli) finds some space inside the box and gets in a strike, but the shot is brilliantly blocked by one of the defending players sliding in. The ball is out of play. Empoli will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 10:43",
            "label": "",
            "description": "Luca Antonelli (AC Milan) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 08:07",
            "label": "",
            "description": "Suso (AC Milan) takes a mid range shot, but the ball sails high over the bar."
        },
        {
            "gameTime": "1 - 07:24",
            "label": "corner",
            "description": "quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 06:51",
            "label": "",
            "description": "Lorenzo Tonelli (Empoli) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender. Empoli get a corner."
        },
        {
            "gameTime": "1 - 04:58",
            "label": "",
            "description": "Andrea Bertolacci (AC Milan) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 01:36",
            "label": "",
            "description": "jumps into a tackle and Piero Giacomelli blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and AC Milan will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Piero Giacomelli will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The game was pretty even. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "Empoli",
    "gameDate": "29/08/2015 - 21:45",
    "gameHomeTeam": "AC Milan",
    "gameScore": "2 - 1"
}