{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-10-23 - 21-45 AS Roma 4 - 1 Palermo/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The home team had more of the game. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        },
        {
            "gameTime": "2 - 48:08",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:31",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) fails to score a rebound with his right foot as he misses the target."
        },
        {
            "gameTime": "2 - 46:36",
            "label": "funfact",
            "description": "7:3 the latest stats for both teams in respect of shots on target."
        },
        {
            "gameTime": "2 - 45:38",
            "label": "",
            "description": "Ilija Nestorovski (Palermo) produces an attempt from the edge of the box which would have most likely endangered the goalkeeper, but one of the defending players blocked it, so we can only speculate about the outcome."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 42:23",
            "label": "",
            "description": "Francesco Totti (AS Roma) horribly skewed a first time shot from the edge of the box and sent the ball way wide of the right post."
        },
        {
            "gameTime": "2 - 40:33",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Bruno Henrique (Palermo), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "",
            "description": "Bruno Henrique (Palermo) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. The linesman points to the corner flag, Palermo are going to take it."
        },
        {
            "gameTime": "2 - 38:42",
            "label": "y-card",
            "description": "Mohamed Salah (AS Roma) gives the referee no choice but to show him a yellow card."
        },
        {
            "gameTime": "2 - 37:00",
            "label": "soccer-ball",
            "description": "Stephan El Shaarawy (AS Roma) receives a brilliant pass inside the box from Mohamed Salah, and he beats the goalkeeper with a low accurate shot into the middle of the goal. He makes it 4:1."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to make a change. Francesco Totti (AS Roma) replaces Edin Dzeko."
        },
        {
            "gameTime": "2 - 34:20",
            "label": "soccer-ball",
            "description": "Goal! Edoardo Goldaniga passes the ball to Robin Quaison (Palermo) and he fires in a shot from the edge of the box which is deflected. Wojciech Szczesny couldn't do anything about it. 3:1."
        },
        {
            "gameTime": "2 - 31:17",
            "label": "",
            "description": "AS Roma move the ball around well as they wait for an opportunity to shoot, but the attack is halted as they lose possession."
        },
        {
            "gameTime": "2 - 28:27",
            "label": "",
            "description": "Alessandro Florenzi (AS Roma) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 27:00",
            "label": "substitution",
            "description": "Here comes a substitution. Alessandro Diamanti is given a rest as he is replaced by Mato Jajalo (Palermo)."
        },
        {
            "gameTime": "2 - 26:53",
            "label": "",
            "description": "The ball is cleared after Stephan El Shaarawy (AS Roma) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Ivaylo Chochev departs the field of play to be replaced by Robin Quaison (Palermo)."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "substitution",
            "description": "Luciano Spalletti prepares a substitution. Radja Nainggolan is replaced by Kevin Strootman (AS Roma)."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "soccer-ball",
            "description": "Alessandro Florenzi passes to Edin Dzeko (AS Roma), who collects the ball and unleashes a terrific shot from the edge of the box. His effort goes into the bottom right corner. Fabulous goal! The score is 3:0."
        },
        {
            "gameTime": "2 - 21:33",
            "label": "",
            "description": "A cross by Haitam Aleesami (Palermo) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "2 - 20:04",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 18:8."
        },
        {
            "gameTime": "2 - 18:37",
            "label": "",
            "description": "Edin Dzeko (AS Roma) latches on to a sweet cross inside the box and misses with a header high above the bar."
        },
        {
            "gameTime": "2 - 17:24",
            "label": "",
            "description": "Josip Posavec doesn't have to worry about this one. Mohamed Salah plays a pass into the feet of Alessandro Florenzi (AS Roma), who is unable to find the target as his effort from inside the box goes high over the bar."
        },
        {
            "gameTime": "2 - 14:00",
            "label": "substitution",
            "description": "Roberto De Zerbi has decided to substitute Michel Morganella and he is replaced by Andrea Rispoli (Palermo)."
        },
        {
            "gameTime": "2 - 11:37",
            "label": "",
            "description": "Sinisa Andelkovic (Palermo) attempts to convert a lofted cross as he jumps high and heads the ball to the bottom right corner. Wojciech Szczesny shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net."
        },
        {
            "gameTime": "2 - 11:16",
            "label": "corner",
            "description": "Alessandro Diamanti (Palermo) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 10:55",
            "label": "",
            "description": "Wojciech Szczesny blocks a long range effort from Alessandro Diamanti (Palermo) towards the bottom left corner. The referee signals a corner kick to Palermo."
        },
        {
            "gameTime": "2 - 08:12",
            "label": "corner",
            "description": "Bruno Henrique (Palermo) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "",
            "description": "Ivaylo Chochev (Palermo) looks to break free, but an opposing player clears the ball away. The referee points to the corner flag. It's a corner to Palermo."
        },
        {
            "gameTime": "2 - 05:59",
            "label": "soccer-ball",
            "description": "Leandro Paredes (AS Roma) takes the free kick from mid range and finds the back of the net with the goalkeeper rooted to the spot."
        },
        {
            "gameTime": "2 - 05:16",
            "label": "",
            "description": "Alessandro Diamanti (Palermo) should know this behaviour is beyond the rules. He was too careless with his challenge and left Gianpaolo Calvarese no option but to blow his whistle. A free kick has been awarded to AS Roma."
        },
        {
            "gameTime": "2 - 04:39",
            "label": "",
            "description": "Palermo are enjoying a spell of pressure at the moment, but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 02:23",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) sends a teasing cross into the area, but Josip Posavec intercepts the ball."
        },
        {
            "gameTime": "2 - 01:02",
            "label": "",
            "description": "Edin Dzeko (AS Roma) is caught offside!"
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Luciano Spalletti makes a half time substitution. Alessandro Florenzi (AS Roma) comes on in place of Juan Jesus."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. The hosts dominated much of the first period. Pass and move. The home side have played some possession football so far, while the visitors have been patient as they wait for the right moment to hit them on the break."
        },
        {
            "gameTime": "1 - 45:14",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 44:23",
            "label": "corner",
            "description": "The resulting corner from Leandro Paredes (AS Roma) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 43:55",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) wastes a good opportunity as his pass into the box is blocked by the defence. The ball goes out of play. AS Roma are awarded a corner kick."
        },
        {
            "gameTime": "1 - 42:25",
            "label": "",
            "description": "Leandro Paredes (AS Roma) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "1 - 40:19",
            "label": "",
            "description": "Thiago Rangel Cionek (Palermo) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation."
        },
        {
            "gameTime": "1 - 38:48",
            "label": "y-card",
            "description": "Gianpaolo Calvarese shows a yellow card to Ivaylo Chochev (Palermo) for his blatant foul."
        },
        {
            "gameTime": "1 - 37:51",
            "label": "",
            "description": "Close! Alessandro Diamanti (Palermo) stands over the resulting free kick from around 19 metres out and his shot goes just over the crossbar."
        },
        {
            "gameTime": "1 - 36:00",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Juan Jesus (AS Roma) was quite harsh and Gianpaolo Calvarese didn't hesitate to show him a yellow card. Palermo are awarded a free kick."
        },
        {
            "gameTime": "1 - 35:22",
            "label": "",
            "description": "Leandro Paredes (AS Roma) crosses the ball from the free kick, but it goes out of play."
        },
        {
            "gameTime": "1 - 34:30",
            "label": "y-card",
            "description": "Edoardo Goldaniga (Palermo) is booked after bringing down an opponent. Gianpaolo Calvarese had an easy decision to make. That's a free kick to AS Roma."
        },
        {
            "gameTime": "1 - 32:26",
            "label": "",
            "description": "A cross from Juan Jesus (AS Roma) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 31:00",
            "label": "soccer-ball",
            "description": "Goal! Edin Dzeko produces a great pass that finds Mohamed Salah (AS Roma) inside the penalty area, who takes advantage of the situation to rifle a shot low shot into the back of the net. 0:0."
        },
        {
            "gameTime": "1 - 30:07",
            "label": "",
            "description": "Mohamed Salah (AS Roma) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 28:41",
            "label": "",
            "description": "Alessandro Diamanti (Palermo) sends in a lofted cross from a long range free kick in order to find one of his teammates. His poor effort, however, sails way out of play."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "y-card",
            "description": "Konstantinos Manolas (AS Roma) is shown a yellow card after a horrible tackle. Palermo have a free kick."
        },
        {
            "gameTime": "1 - 26:23",
            "label": "",
            "description": "The foul by Mohamed Salah (AS Roma) was seen by Gianpaolo Calvarese who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 25:35",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) sends a chip pass into the box, but Josip Posavec is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 24:29",
            "label": "",
            "description": "A pass by Radja Nainggolan (AS Roma) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 23:28",
            "label": "",
            "description": "The game is interrupted. Michel Morganella (Palermo) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "1 - 21:56",
            "label": "",
            "description": "Ivaylo Chochev (Palermo) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "1 - 21:38",
            "label": "",
            "description": "Gianpaolo Calvarese blows for a foul after Konstantinos Manolas (AS Roma) was too aggressive in the battle for the ball. There is a free kick near the sideline to Palermo."
        },
        {
            "gameTime": "1 - 20:47",
            "label": "corner",
            "description": "Mohamed Salah (AS Roma) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 20:29",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) won himself some space after the corner kick and tries his luck with a shot from the edge of the box. His effort is directed towards the right post, but the goalkeeper is alert and makes the save. AS Roma have a corner."
        },
        {
            "gameTime": "1 - 19:53",
            "label": "corner",
            "description": "The referee awards a corner and Daniele De Rossi (AS Roma) goes over to take it."
        },
        {
            "gameTime": "1 - 19:34",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) tries to send a pass but it's blocked. Good work from AS Roma as they win a corner."
        },
        {
            "gameTime": "1 - 18:06",
            "label": "",
            "description": "Edin Dzeko (AS Roma) gets to a rebound inside the goalmouth, but even from this distance he misses the target and fails to score."
        },
        {
            "gameTime": "1 - 17:16",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) meets a pass on the edge of the penalty area and shoots towards the bottom right corner. He didn't put enough power into the effort, though, and Josip Posavec pulls off an easy save."
        },
        {
            "gameTime": "1 - 16:56",
            "label": "",
            "description": "Ivaylo Chochev (Palermo) tries to find Ilija Nestorovski, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 15:44",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) sees the run of Mohamed Salah and tries to slip the ball to him, but Josip Posavec sees the danger and gathers."
        },
        {
            "gameTime": "1 - 14:43",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Thiago Rangel Cionek (Palermo). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "1 - 13:20",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) threw away a promising scoring opportunity. He received a fine cross inside the 6 yard box, but his shot missed the target close to the right post."
        },
        {
            "gameTime": "1 - 11:30",
            "label": "",
            "description": "AS Roma control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 09:12",
            "label": "",
            "description": "Mohamed Salah (AS Roma) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 08:01",
            "label": "corner",
            "description": "Alessandro Diamanti (Palermo) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 07:20",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Haitam Aleesami (Palermo). Palermo force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 06:49",
            "label": "",
            "description": "Edin Dzeko (AS Roma) meets a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Josip Posavec pulls off an easy save."
        },
        {
            "gameTime": "1 - 05:56",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "1 - 05:06",
            "label": "",
            "description": "The free kick is taken by Leandro Paredes (AS Roma), but ball is cleared. Corner kick. AS Roma will have an opportunity."
        },
        {
            "gameTime": "1 - 04:56",
            "label": "",
            "description": "A player from Palermo brings down an opponent and commits a foul. AS Roma earn a free kick."
        },
        {
            "gameTime": "1 - 04:17",
            "label": "",
            "description": "Haitam Aleesami (Palermo) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play."
        },
        {
            "gameTime": "1 - 02:28",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Gianpaolo Calvarese blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 01:29",
            "label": "",
            "description": "The AS Roma players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Palermo will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Gianpaolo Calvarese."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "11:29 That's the goals for and against record for Palermo. They need some improvement in the defence."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "4 That's the number of points AS Roma have already won from away matches. In total, they have 16 points."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko is the biggest threat to an opponent! He has already scored 17 goals and is top scorer in this AS Roma team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The home team had more of the game. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        }
    ],
    "gameAwayTeam": "Palermo",
    "gameDate": "23/10/2016 - 21:45",
    "gameHomeTeam": "AS Roma",
    "gameScore": "4 - 1"
}