{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-08-20 - 19-30 Leicester 0 - 0 Arsenal/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:30",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The visitors played the better football overall. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        },
        {
            "gameTime": "2 - 48:22",
            "label": "whistle",
            "description": "Mark Clattenburg is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort."
        },
        {
            "gameTime": "2 - 47:57",
            "label": "",
            "description": "Leicester get the opportunity to endanger the opposition's goal with a free kick from the edge of the box."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "y-card",
            "description": "Mark Clattenburg shows a yellow card to Rob Holding (Arsenal), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "Ahmed Musa (Leicester) picks up a pass and unleashes a strong shot from inside the box, but the goalkeeper is equal to it!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:27",
            "label": "",
            "description": "Robert Huth (Leicester) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 43:32",
            "label": "",
            "description": "A lofted cross from Ahmed Musa (Leicester) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The ball has crossed the sideline. Leicester are taking a throw in."
        },
        {
            "gameTime": "2 - 43:13",
            "label": "",
            "description": "Theo Walcott (Arsenal) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Kasper Schmeichel guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 41:44",
            "label": "substitution",
            "description": "Claudio Ranieri decides to make a substitution. Marc Albrighton will be replaced by Ahmed Musa (Leicester)."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) trips an opposition player and Mark Clattenburg signals a foul. Arsenal are awarded the free kick."
        },
        {
            "gameTime": "2 - 40:36",
            "label": "",
            "description": "Theo Walcott (Arsenal) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 38:31",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 38:14",
            "label": "",
            "description": "Mesut Ozil (Arsenal) meets a pass on the edge of the penalty area and shoots towards the bottom right corner. He didn't put enough power into the effort, though, and Kasper Schmeichel pulls off an easy save. Arsenal get a corner."
        },
        {
            "gameTime": "2 - 37:06",
            "label": "",
            "description": "Jamie Vardy (Leicester) goes on a mazy run and tries his luck with a mid range strike, but one of the defending players steps in and makes a block."
        },
        {
            "gameTime": "2 - 35:55",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 35:37",
            "label": "",
            "description": "Olivier Giroud (Arsenal) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. Arsenal have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 34:47",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Nacho Monreal (Arsenal) is thwarted and cleared to safety. The ball goes behind for a corner. Arsenal will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 34:25",
            "label": "",
            "description": "Riyad Mahrez (Leicester) brings his opponent down with a tackle and Mark Clattenburg blows his whistle for a foul. A free kick is awarded to Arsenal."
        },
        {
            "gameTime": "2 - 32:42",
            "label": "substitution",
            "description": "Substitution. Alex Oxlade Chamberlain leaves the pitch and is replaced by Olivier Giroud (Arsenal)."
        },
        {
            "gameTime": "2 - 30:36",
            "label": "",
            "description": "Mesut Ozil (Arsenal) sends a cross into the box, but Kasper Schmeichel comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 29:25",
            "label": "",
            "description": "Theo Walcott (Arsenal) latches on to a precise pass and finds himself one on one with the keeper, but his effort is straight at Kasper Schmeichel, who is alert and makes an easy save to deny him."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "substitution",
            "description": "Arsene Wenger prepares a substitution. Santi Cazorla is replaced by Mesut Ozil (Arsenal)."
        },
        {
            "gameTime": "2 - 27:58",
            "label": "substitution",
            "description": "That will be all from Granit Xhaka who is being replaced by the fresh legs of Jack Wilshere (Arsenal)."
        },
        {
            "gameTime": "2 - 26:35",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "2 - 24:51",
            "label": "",
            "description": "A brilliant individual effort! Jamie Vardy (Leicester) tricks his way past challenges into the box and drags his shot narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 22:55",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Granit Xhaka (Arsenal). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 22:50",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) slides a pass forward, but one of the defenders cuts it out. The ball is out of play. A goal scoring opportunity from a corner for Arsenal."
        },
        {
            "gameTime": "2 - 21:31",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Shinji Okazaki as he is replaced by Leonardo Ulloa (Leicester)."
        },
        {
            "gameTime": "2 - 20:12",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball is out of play. Arsenal will have a throw in."
        },
        {
            "gameTime": "2 - 17:26",
            "label": "",
            "description": "Marc Albrighton (Leicester) sends a long ball in, but Petr Cech comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 15:12",
            "label": "",
            "description": "Andy King (Leicester) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it."
        },
        {
            "gameTime": "2 - 14:15",
            "label": "",
            "description": "Nacho Monreal (Arsenal) sends a long ball in, but Kasper Schmeichel comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 13:19",
            "label": "",
            "description": "Theo Walcott (Arsenal) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "",
            "description": "Kasper Schmeichel receives ovations from the crowd. He manages to block a first time effort from Hector Bellerin (Arsenal), whose strike from the edge of the box was headed towards the middle of the goal."
        },
        {
            "gameTime": "2 - 11:46",
            "label": "corner",
            "description": "The corner from Marc Albrighton (Leicester) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 11:26",
            "label": "",
            "description": "Wes Morgan (Leicester) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention. The referee and one of his assistants signal for a corner kick to Leicester."
        },
        {
            "gameTime": "2 - 10:32",
            "label": "",
            "description": "The free kick from a promising distance is taken by Riyad Mahrez (Leicester), who fires in a direct effort inches over the crossbar. What a chance!"
        },
        {
            "gameTime": "2 - 09:53",
            "label": "",
            "description": "Francis Coquelin (Arsenal) brings an opponent down and Mark Clattenburg interrupts the game. Leicester earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 07:55",
            "label": "substitution",
            "description": "Problems for Claudio Ranieri as Nampalys Mendy is not able to play anymore. His injury is too serious and Andy King (Leicester) replaces him."
        },
        {
            "gameTime": "2 - 07:03",
            "label": "injury",
            "description": "Nampalys Mendy (Leicester) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 04:13",
            "label": "",
            "description": "Hector Bellerin (Arsenal) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 03:28",
            "label": "",
            "description": "Mark Clattenburg blows his whistle after Laurent Koscielny (Arsenal) kicks an opponent's legs instead of the ball. Leicester get a free kick."
        },
        {
            "gameTime": "2 - 01:28",
            "label": "",
            "description": "Marc Albrighton (Leicester) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:20",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. During the first 45 minutes, we have witnessed the ascendency of the visiting team who have been precise and effective. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 46:02",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:54",
            "label": "y-card",
            "description": "Nampalys Mendy (Leicester) sees a yellow card from Mark Clattenburg after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 42:50",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 42:11",
            "label": "",
            "description": "Jamie Vardy (Leicester) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 41:08",
            "label": "corner",
            "description": "The corner kick from Santi Cazorla (Arsenal) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 40:59",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Theo Walcott (Arsenal) is thwarted and cleared to safety. The ball goes out of play. Arsenal are awarded a corner kick."
        },
        {
            "gameTime": "1 - 39:55",
            "label": "",
            "description": "A cross into the box from Jamie Vardy (Leicester) is cleared."
        },
        {
            "gameTime": "1 - 39:14",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Alexis Sanchez (Arsenal). Mark Clattenburg saw the sliding tackle and blows for a foul. There is a free kick near the sideline to Leicester."
        },
        {
            "gameTime": "1 - 38:29",
            "label": "",
            "description": "Granit Xhaka (Arsenal) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies into the stands."
        },
        {
            "gameTime": "1 - 35:41",
            "label": "",
            "description": "A cross from the free kick is whipped in by Marc Albrighton (Leicester), but one of the defenders steps in and averts the threat."
        },
        {
            "gameTime": "1 - 34:28",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) probably spotted the goalkeeper off his line, but he misdirected his long range shot as it went a few yards wide of the right post."
        },
        {
            "gameTime": "1 - 33:46",
            "label": "",
            "description": "Santi Cazorla (Arsenal) gets on the end of a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Kasper Schmeichel pulls off an easy save."
        },
        {
            "gameTime": "1 - 33:10",
            "label": "",
            "description": "Riyad Mahrez (Leicester) swings it in and Jamie Vardy gets on the end of it, but Petr Cech shows good awareness and comes off his line to thwart the move."
        },
        {
            "gameTime": "1 - 32:45",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 31:04",
            "label": "",
            "description": "Granit Xhaka (Arsenal) unleashes a shot goalwards from a mid range free kick. The ball heads towards the right post, but the goalkeeper makes a decent save to thwart him. The referee signals a corner kick to Arsenal."
        },
        {
            "gameTime": "1 - 30:29",
            "label": "",
            "description": "Nampalys Mendy (Leicester) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul. Arsenal win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 29:18",
            "label": "",
            "description": "Mark Clattenburg blows his whistle after Robert Huth (Leicester) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 26:58",
            "label": "",
            "description": "Marc Albrighton (Leicester) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 24:51",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) creates a good chance for himself and goes for goal from mid range, but he misses the right post by a whisker."
        },
        {
            "gameTime": "1 - 23:13",
            "label": "y-card",
            "description": "Francis Coquelin (Arsenal) has tested the patience of referee Mark Clattenburg and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 21:51",
            "label": "corner",
            "description": "The resulting corner, taken by Santi Cazorla (Arsenal), comes to nothing."
        },
        {
            "gameTime": "1 - 21:34",
            "label": "",
            "description": "Theo Walcott (Arsenal) chips a pass over the line of defenders to get the ball to Alexis Sanchez, but his attempt is intercepted and cleared. Arsenal force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 20:28",
            "label": "",
            "description": "Nacho Monreal (Arsenal) has an effort from distance but it's blocked."
        },
        {
            "gameTime": "1 - 18:11",
            "label": "",
            "description": "Jamie Vardy (Leicester) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 16:42",
            "label": "",
            "description": "Hector Bellerin (Arsenal) sprays a pass out to Theo Walcott, but he can't beat his man to get to the ball."
        },
        {
            "gameTime": "1 - 14:39",
            "label": "",
            "description": "Nacho Monreal (Arsenal) is penalised after knocking an opponent down. A free kick has been awarded to Leicester."
        },
        {
            "gameTime": "1 - 14:14",
            "label": "",
            "description": "Wes Morgan (Leicester) brings his opponent down. Mark Clattenburg has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 12:34",
            "label": "",
            "description": "A cross by Riyad Mahrez (Leicester) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "1 - 10:48",
            "label": "",
            "description": "The ball is cleared after Jamie Vardy (Leicester) attempted to dribble past an opposing player. It's a throw in for Leicester."
        },
        {
            "gameTime": "1 - 08:56",
            "label": "",
            "description": "Hector Bellerin (Arsenal) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 07:53",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) serves up a nice cross, but Petr Cech punches the ball away."
        },
        {
            "gameTime": "1 - 05:27",
            "label": "",
            "description": "Nacho Monreal (Arsenal) sends a teasing cross into the area, but Kasper Schmeichel intercepts the ball."
        },
        {
            "gameTime": "1 - 04:20",
            "label": "",
            "description": "Shinji Okazaki (Leicester) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 03:37",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) clips a neat ball into the box in the direction of Alexis Sanchez, but he can't get on the end of the pass."
        },
        {
            "gameTime": "1 - 02:33",
            "label": "corner",
            "description": "Granit Xhaka (Arsenal) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "",
            "description": "Santi Cazorla (Arsenal) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. It will be a corner kick for Arsenal."
        },
        {
            "gameTime": "1 - 00:53",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 00:30",
            "label": "",
            "description": "Jamie Vardy (Leicester) races towards goal but the defender gets back well to make a challenge. The ball is out of play and the linesman points at the corner flag. Corner to Leicester."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Arsenal will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Mark Clattenburg."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last game that Arsenal played was against Stoke City and it ended 4:1."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Arsenal will miss the presence of Alexis Sanchez (Abdominal strain), Gabriel (Knee Injury), Nacho Monreal (Injury), Mesut Ozil (Illness), Mesut Ozil (Illness), Mesut Ozil (Muscle Injury), Per Mertesacker (Knee Injury), Danny Welbeck (Knee Injury), David Ospina (Groin Injury), Shkodran Mustafi (Muscle Injury), Granit Xhaka (Red Card), Granit Xhaka (Red Card), Granit Xhaka (Red Card), Granit Xhaka (Calf Injury), Laurent Koscielny (Red Card), Laurent Koscielny (Red Card), Olivier Giroud (Red Card), Olivier Giroud (Ankle Injury), Francis Coquelin (Yellow Cards), Francis Coquelin (Muscle Injury), Alexandre Lacazette (Calf Injury), Alexandre Lacazette (Injury), Alexandre Lacazette (Hip Injury), Alex Oxlade Chamberlain (Thigh Injury), Alex Oxlade Chamberlain (Knee Injury), Mohamed Elneny (Ankle Injury), Gabriel (Ankle Injury), Calum Chambers (Ankle Injury), Sead Kolasinac (Groin Injury), Sead Kolasinac (Yellow Cards), Hector Bellerin (Ankle Injury)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 1:2 in the last game between Leicester and Sunderland."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The visitors played the better football overall. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        }
    ],
    "gameAwayTeam": "Arsenal",
    "gameDate": "20/08/2016 - 19:30",
    "gameHomeTeam": "Leicester",
    "gameScore": "0 - 0"
}