{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2016-10-22 - 16-30 Ingolstadt 3 - 3 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. The home players attempted to beat the opposition's defence using mostly counter attacks. The away team tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 49:03",
            "label": "whistle",
            "description": "That's it for today, Felix Zwayer has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:07",
            "label": "",
            "description": "Felix Passlack sends a terrific cross into the box. Pierre Emerick Aubameyang (Dortmund) gets on the end of it but his header from the centre of the box goes just over the bar. The ball is off of the pitch and it's a goal kick for Ingolstadt."
        },
        {
            "gameTime": "2 - 45:57",
            "label": "soccer-ball",
            "description": "Goal! Christian Pulisic (Dortmund) fires the rebound into the bottom right corner after the ball breaks to him in the box. The score is 2:1."
        },
        {
            "gameTime": "2 - 45:50",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) rises above the defenders and places a towering header towards the bottom right corner, but Orjan Nyland is prepared and dives to thwart him."
        },
        {
            "gameTime": "2 - 45:22",
            "label": "corner",
            "description": "The corner kick from Mario Gotze (Dortmund) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 45:09",
            "label": "",
            "description": "A long ball forward to Pierre Emerick Aubameyang (Dortmund) is intercepted. Dortmund force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:54",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Alfredo Morales (Ingolstadt) comes onto the pitch so that Lukas Hinterseer can be given a rest."
        },
        {
            "gameTime": "2 - 42:45",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Mario Gotze (Dortmund). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 42:30",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) makes contact with a cross and strikes a shot towards the right post that lacks the powerful to find the back of the net, but the goalkeeper still has to pull off a marvellous diving save to keep his effort out. The ball goes out of play. Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "2 - 41:17",
            "label": "corner",
            "description": "Mario Gotze (Dortmund) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 40:58",
            "label": "",
            "description": "Mario Gotze (Dortmund) receives a precise low pass inside the box, controls the ball and drills it towards the right post. Unfortunately for him, Orjan Nyland makes a great save to stop his effort. The referee points to the corner flag and Dortmund will take a corner."
        },
        {
            "gameTime": "2 - 39:48",
            "label": "",
            "description": "Felix Passlack (Dortmund) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "",
            "description": "He should have done better. Christian Pulisic (Dortmund) is afforded space to connect with a Felix Passlack cross, but his header from the centre of the box flies well wide of the right post."
        },
        {
            "gameTime": "2 - 34:57",
            "label": "attendance",
            "description": "The attendance is 15200."
        },
        {
            "gameTime": "2 - 34:03",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) takes a shot after receiving a good pass, but his effort from the edge of the box goes just over the crossbar. The ball is off of the pitch and it's a goal kick for Ingolstadt."
        },
        {
            "gameTime": "2 - 33:54",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Mario Gotze (Dortmund)."
        },
        {
            "gameTime": "2 - 33:34",
            "label": "",
            "description": "Felix Passlack (Dortmund) tries his luck with a long range effort after receiving a precise pass. It goes to the right side of the goal, but Orjan Nyland has a clear view of it and makes a comfortable save. Dortmund get a corner."
        },
        {
            "gameTime": "2 - 33:20",
            "label": "corner",
            "description": "Mario Gotze (Dortmund) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 32:14",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety. Now Dortmund have a corner."
        },
        {
            "gameTime": "2 - 31:28",
            "label": "",
            "description": "Florent Hadergjonaj (Ingolstadt) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "2 - 27:51",
            "label": "substitution",
            "description": "Here is a change. Shinji Kagawa is going off and Thomas Tuchel gives the last tactical orders to Felix Passlack (Dortmund)."
        },
        {
            "gameTime": "2 - 27:20",
            "label": "",
            "description": "Christian Pulisic (Dortmund) shows too much aggression while trying to break free from his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 26:11",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Dario Lezcano walks off the pitch to be replaced by Mathew Leckie (Ingolstadt)."
        },
        {
            "gameTime": "2 - 25:20",
            "label": "y-card",
            "description": "A yellow card for a tackle by Adrian Ramos (Dortmund). Felix Zwayer doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 23:54",
            "label": "soccer-ball",
            "description": "Goal! Adrian Ramos (Dortmund) finds himself some space inside the box to get on the end of a pass from Christian Pulisic, then sends the ball low into the middle of the net. 2:1."
        },
        {
            "gameTime": "2 - 20:41",
            "label": "",
            "description": "Dario Lezcano (Ingolstadt) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 15:52",
            "label": "",
            "description": "Moritz Hartmann (Ingolstadt) latches on to a cross on the edge of the box. He shows a good first touch and drills a low drive towards the left post, but the goalkeeper manages to punch the ball onto the post."
        },
        {
            "gameTime": "2 - 13:51",
            "label": "soccer-ball",
            "description": "Florent Hadergjonaj provides Dario Lezcano (Ingolstadt) with a nice pass inside the box. It allows him to finish with a low shot into the middle of the goal."
        },
        {
            "gameTime": "2 - 13:20",
            "label": "soccer-ball",
            "description": "Pierre Emerick Aubameyang (Dortmund) scores from quite a difficult position as he leaps high to connect with a cross and powers his header inside the left post. Excellent finish."
        },
        {
            "gameTime": "2 - 13:05",
            "label": "substitution",
            "description": "A substitution has been made. Gonzalo Castro goes off and Mario Gotze (Dortmund) comes on."
        },
        {
            "gameTime": "2 - 12:41",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "2 - 11:56",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Marvin Matip (Ingolstadt). Felix Zwayer saw the sliding tackle and blows for a foul. Dortmund win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 10:20",
            "label": "",
            "description": "Marc Bartra (Dortmund) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 09:49",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The referee signals a corner kick to Dortmund."
        },
        {
            "gameTime": "2 - 08:26",
            "label": "",
            "description": "Christian Pulisic (Dortmund) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 04:53",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post."
        },
        {
            "gameTime": "2 - 01:02",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to make a substitution during the half time break. Christian Pulisic (Dortmund) comes on the pitch for Joo Ho Park."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The fans in the stadium won't regret buying tickets for today's game as they have witnessed a great game so far, and nothing suggests it's going to change in the second half. It has been a tight contest so far. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 46:02",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:49",
            "label": "",
            "description": "Roman Weidenfeller makes a sensational save to thwart a great chance. A rebound falls to Almog Cohen (Ingolstadt) on the edge of the box and he drills goalwards, but the ball ends up in the keeper's gloves instead of the middle of the goal."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:10",
            "label": "corner",
            "description": "Markus Suttner (Ingolstadt) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 43:10",
            "label": "",
            "description": "Roman Weidenfeller was forced into action to thwart Dario Lezcano (Ingolstadt). He found himself some space after latching on to a pass and unleashed a shot to the bottom right corner but couldn't beat the keeper. Good work from Ingolstadt as they win a corner."
        },
        {
            "gameTime": "1 - 40:36",
            "label": "",
            "description": "Wow, what an escape. Ousmane Dembele (Dortmund) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "1 - 39:26",
            "label": "",
            "description": "Moritz Hartmann (Ingolstadt) commits a rough foul. Felix Zwayer stops the game and makes a call."
        },
        {
            "gameTime": "1 - 38:51",
            "label": "",
            "description": "The free kick from long distance is taken by Pierre Emerick Aubameyang (Dortmund), who fires in a direct effort inches over the crossbar. What a chance!"
        },
        {
            "gameTime": "1 - 35:01",
            "label": "",
            "description": "Matthias Ginter (Dortmund) fouls an opponent. At least that's what referee Felix Zwayer signals."
        },
        {
            "gameTime": "1 - 32:56",
            "label": "",
            "description": "This shall not pass! Gonzalo Castro (Dortmund) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 28:25",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar. The ball goes out of play and Ingolstadt will have a goal kick."
        },
        {
            "gameTime": "1 - 28:11",
            "label": "corner",
            "description": "The referee awards a corner and Gonzalo Castro (Dortmund) goes over to take it."
        },
        {
            "gameTime": "1 - 28:04",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) fashions a shot from the edge of the box after receiving an accurate pass. Orjan Nyland makes a stunning save to stop the effort from flying into the right side of the goal. The referee blows his whistle, Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 25:06",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 24:35",
            "label": "",
            "description": "Dario Lezcano (Ingolstadt) was too forceful with his tackle and Felix Zwayer interrupted the game to signal a free kick. Dortmund earn a free kick."
        },
        {
            "gameTime": "1 - 23:50",
            "label": "soccer-ball",
            "description": "The ball from the free kick finds its way to Dario Lezcano (Ingolstadt) who rises and scores with a thunderous header inside the left post. An incredible long range header!"
        },
        {
            "gameTime": "1 - 20:51",
            "label": "",
            "description": "Matthias Ginter (Dortmund) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "1 - 17:29",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) manages to beat his opponent to the ball, but he commits a foul in the process."
        },
        {
            "gameTime": "1 - 16:52",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) clips a neat ball into the box in the direction of Lukasz Piszczek, but he can't get on the end of the pass. The ball goes out of play and Ingolstadt will have a goal kick."
        },
        {
            "gameTime": "1 - 16:02",
            "label": "",
            "description": "Orjan Nyland makes a superb save to deny a header which was nodded by Adrian Ramos (Dortmund) after a cross from the side."
        },
        {
            "gameTime": "1 - 15:14",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) dribbled past his opponents before finding himself in a great position to strike. His attempt from just outside of the box went towards the roof of the net, but it wasn't dangerous and Orjan Nyland gathered easily."
        },
        {
            "gameTime": "1 - 12:43",
            "label": "",
            "description": "Lukas Hinterseer (Ingolstadt) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Roman Weidenfeller."
        },
        {
            "gameTime": "1 - 12:35",
            "label": "corner",
            "description": "Pascal Gross (Ingolstadt) will take a corner kick."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "",
            "description": "Marcel Tisserand (Ingolstadt) finds himself in a promising position after receiving a beautiful cross from the side, but the opposition defence is ready and one of the defenders averts the threat with a quick interception. The ball is out of play. Ingolstadt will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 08:26",
            "label": "",
            "description": "Moritz Hartmann (Ingolstadt) finds himself behind the opposition's defence, but the game is stopped for offside."
        },
        {
            "gameTime": "1 - 07:38",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) stands over the resultant free kick from 21 metres out and his shot goes well over the bar. The ball is off of the pitch and it's a goal kick for Ingolstadt."
        },
        {
            "gameTime": "1 - 07:01",
            "label": "",
            "description": "Almog Cohen (Ingolstadt) commits an ugly challenge. The referee sees it and immediately blows his whistle. Dortmund have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "soccer-ball",
            "description": "Almog Cohen (Ingolstadt) scores! He controls the ball from the free kick inside the 6 yard box and drills a superb strike into the top of the net."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "Roger (Ingolstadt) receives a pass and fires a shot in from long range, but it's blocked."
        },
        {
            "gameTime": "1 - 04:16",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) makes a slide tackle, but referee Felix Zwayer blows for a foul."
        },
        {
            "gameTime": "1 - 02:19",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball goes out of play and Ingolstadt will have a goal kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Dortmund will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Felix Zwayer will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most prolific goal scorer for Dortmund is Pierre Emerick Aubameyang with 16 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Tobias Levels has played more minutes (630) than anyone in this Ingolstadt team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lukas Hinterseer is the leading goal scorer for Ingolstadt with 3 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. The home players attempted to beat the opposition's defence using mostly counter attacks. The away team tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "22/10/2016 - 16:30",
    "gameHomeTeam": "Ingolstadt",
    "gameScore": "3 - 3"
}