{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2016-09-20 - 21-00 Wolfsburg 1 - 5 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. Dortmund were better team throughout the game. The home side attempted to hold onto the ball for as long as possible. The away team was pressing and leaving the opponents little space for combination play."
        },
        {
            "gameTime": "2 - 45:06",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 44:00",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) and Sebastian Rode combine brilliantly in a series of one twos."
        },
        {
            "gameTime": "2 - 42:34",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) sends a cross into the box, but Roman Burki comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 41:44",
            "label": "",
            "description": "The Dortmund players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 40:42",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) makes a driving run into the box but he cannot work any space for a shot."
        },
        {
            "gameTime": "2 - 40:28",
            "label": "",
            "description": "Julian Draxler (Wolfsburg) produces a nice strike from about 25 metres. It would have probably ended up in the middle of the goal, but Roman Burki stopped it with a superb save."
        },
        {
            "gameTime": "2 - 39:39",
            "label": "",
            "description": "The ball is cleared after Jakub Blaszczykowski (Wolfsburg) attempted to dribble past an opposing player. The ball is behind the touchline and Wolfsburg will take a throw in."
        },
        {
            "gameTime": "2 - 38:09",
            "label": "",
            "description": "Dortmund enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 37:02",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) unleashes a promising shot towards the bottom right corner after his wonderful solo run, but Koen Casteels thwarts the effort with a fabulous save. The score remains the same."
        },
        {
            "gameTime": "2 - 36:11",
            "label": "",
            "description": "Wolfsburg quickly take the free kick with a short pass."
        },
        {
            "gameTime": "2 - 36:02",
            "label": "",
            "description": "Sokratis (Dortmund) makes a strong challenge and Daniel Siebert blows for a foul. There is a free kick near the sideline to Wolfsburg."
        },
        {
            "gameTime": "2 - 34:25",
            "label": "",
            "description": "Sebastian Rode (Dortmund) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 33:28",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) is all over the pitch today. He is full of energy and asking for the ball, while his ability to control the game and to be on the ball is simply fantastic. Every manager wants to have a playmaker like him."
        },
        {
            "gameTime": "2 - 32:21",
            "label": "",
            "description": "Philipp Wollscheid (Wolfsburg) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "",
            "description": "Great teamplay by Wolfsburg as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 28:00",
            "label": "soccer-ball",
            "description": "The score has changed – 1:2. Raphael Guerreiro sends a fantastic cross into the box from the corner. Lukasz Piszczek (Dortmund) jumps highest and plants a header inside the right post."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "corner",
            "description": "The referee awards a corner and Raphael Guerreiro (Dortmund) goes over to take it."
        },
        {
            "gameTime": "2 - 26:46",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball is out of play and Dortmund manage to earn a corner."
        },
        {
            "gameTime": "2 - 26:23",
            "label": "funfact",
            "description": "9:9 – this is the current number of shots on target."
        },
        {
            "gameTime": "2 - 25:22",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Mario Gomez (Wolfsburg) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "2 - 23:52",
            "label": "",
            "description": "Daniel Siebert blows his whistle as Mario Gomez (Wolfsburg) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 23:01",
            "label": "substitution",
            "description": "Mario Gotze goes off the pitch and Sebastian Rode (Dortmund) comes on."
        },
        {
            "gameTime": "2 - 19:38",
            "label": "",
            "description": "Daniel Didavi (Wolfsburg) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "2 - 19:22",
            "label": "",
            "description": "Mario Gotze (Dortmund) robs an opponent of the ball and explodes in anger when Daniel Siebert blows for a foul. Wolfsburg are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 18:35",
            "label": "",
            "description": "Julian Draxler (Wolfsburg) looks to break free, but an opposing player clears the ball away. The ball is out of play. Wolfsburg will take a throw in."
        },
        {
            "gameTime": "2 - 17:53",
            "label": "substitution",
            "description": "Daniel Caligiuri (Wolfsburg) joins the action as a substitute, replacing Vieirinha."
        },
        {
            "gameTime": "2 - 16:58",
            "label": "soccer-ball",
            "description": "Goal! Gonzalo Castro puts the ball on a plate for Pierre Emerick Aubameyang (Dortmund), who scores with a simple close range finish. It's 1:4."
        },
        {
            "gameTime": "2 - 15:34",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) receives a precise pass and is given time inside the box to send a promising strike towards the bottom right corner. Koen Casteels guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 13:00",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Gonzalo Castro sprays a pass out to Ousmane Dembele (Dortmund), and he has an easy job to slot the ball into an empty net. The score is 1:3."
        },
        {
            "gameTime": "2 - 11:29",
            "label": "",
            "description": "Philipp Wollscheid (Wolfsburg) jumps for a header from the resulting corner kick inside the box and sends the ball in on goal, but the goalkeeper makes a very good save."
        },
        {
            "gameTime": "2 - 11:28",
            "label": "corner",
            "description": "Corner kick. Ricardo Rodriguez (Wolfsburg) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 10:57",
            "label": "",
            "description": "Roman Burki makes a good save! Julian Draxler (Wolfsburg) easily weaves through the defence and fires in from long range. His shot goes towards the left side of the goal is saved by the keeper! The ball is out of play and the linesman points at the corner flag. Corner to Wolfsburg."
        },
        {
            "gameTime": "2 - 10:42",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 09:52",
            "label": "",
            "description": "The foul by Yannick Gerhardt (Wolfsburg) was seen by Daniel Siebert who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Superb finishing from Daniel Didavi (Wolfsburg). Paul Seguin plays a fantastic through ball and finds Daniel Didavi (Wolfsburg), who reacts quickly to get in front of the goalkeeper and fire a close range shot into the bottom right corner. 1:2."
        },
        {
            "gameTime": "2 - 06:17",
            "label": "",
            "description": "Mario Gomez (Wolfsburg) attempts to turn the rebound in from close range. Nevertheless, the goalkeeper pulls off a stunning save and stops the ball from hitting the net. Great goalkeeping."
        },
        {
            "gameTime": "2 - 06:05",
            "label": "",
            "description": "Julian Draxler (Wolfsburg) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 04:08",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "2 - 03:35",
            "label": "corner",
            "description": "Julian Draxler (Wolfsburg) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 03:15",
            "label": "",
            "description": "Jakub Blaszczykowski (Wolfsburg) fails to find any of his teammates inside the box as his pass is blocked. The referee and his assistant both point at the corner flag. Wolfsburg will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 02:04",
            "label": "",
            "description": "Rough tackle by Mario Gotze (Dortmund). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 00:45",
            "label": "substitution",
            "description": "Thomas Tuchel makes a switch. Gonzalo Castro (Dortmund) is coming on in place of Christian Pulisic at the start of the second period."
        },
        {
            "gameTime": "2 - 00:35",
            "label": "substitution",
            "description": "Half time substitution. Bruno Henrique is replaced by Daniel Didavi (Wolfsburg)."
        },
        {
            "gameTime": "2 - 00:19",
            "label": "substitution",
            "description": "Half time substitution. Dieter Hecking decided to make a change. Maximilian Arnold is replaced by Paul Seguin (Wolfsburg)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The fans in the stadium won't regret buying tickets for today's game as they have witnessed a great game so far, and nothing suggests it's going to change in the second half. The visitors dominated that half and looked more dangerous in attack. The home side attempts to hold onto the ball for as long as possible. The away team is applying strong pressure, leaving the opponent little space for combination play."
        },
        {
            "gameTime": "1 - 45:13",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:06",
            "label": "",
            "description": "Maximilian Arnold (Wolfsburg) fashions a shot from the edge of the box after receiving an accurate pass. Roman Burki makes a comfortable save to stop the effort from flying into the middle of the goal."
        },
        {
            "gameTime": "1 - 42:48",
            "label": "",
            "description": "Bruno Henrique (Wolfsburg) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 42:21",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "",
            "description": "Christian Pulisic (Dortmund) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The referee points to the corner flag and Dortmund will take a corner."
        },
        {
            "gameTime": "1 - 39:43",
            "label": "",
            "description": "Mario Gotze (Dortmund) sprays a pass out to Pierre Emerick Aubameyang, but he can't beat his man to get to the ball."
        },
        {
            "gameTime": "1 - 38:29",
            "label": "",
            "description": "Julian Draxler (Wolfsburg) commits a foul and Daniel Siebert immediately signals a free kick."
        },
        {
            "gameTime": "1 - 37:11",
            "label": "",
            "description": "Ricardo Rodriguez (Wolfsburg) sends a direct shot in from the free kick that's in a promising position. The ball sails towards the underside of the crossbar, but the goalkeeper prevents a goal with a quick save."
        },
        {
            "gameTime": "1 - 36:23",
            "label": "",
            "description": "Handball by Raphael Guerreiro (Dortmund). Wolfsburg are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 35:35",
            "label": "",
            "description": "Mario Gomez (Wolfsburg) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Roman Burki guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 33:08",
            "label": "",
            "description": "Maximilian Arnold (Wolfsburg) got on the ball on the edge of the box and blazed a first time shot well over the bar."
        },
        {
            "gameTime": "1 - 32:06",
            "label": "",
            "description": "Mario Gotze (Dortmund) wasted a huge opportunity! The fans already began to celebrate as he produced a shot from the edge of the box after a brilliant solo effort. The ball went towards the middle of the goal, but Koen Casteels made an astonishing save!"
        },
        {
            "gameTime": "1 - 30:32",
            "label": "",
            "description": "What a chance that is! Yannick Gerhardt (Wolfsburg) finds himself in a promising position after receiving a pass on the edge of the box. His attempt goes just over the bar. The ball is off of the pitch and it's a goal kick for Dortmund."
        },
        {
            "gameTime": "1 - 29:45",
            "label": "",
            "description": "Mario Gotze (Dortmund) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 27:16",
            "label": "",
            "description": "Neat passing move from Wolfsburg in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 25:26",
            "label": "",
            "description": "A cross is whipped into the box by Jakub Blaszczykowski (Wolfsburg) and Mario Gomez controls it well. He lines up the ball, but one of the defenders produces a timely intervention."
        },
        {
            "gameTime": "1 - 24:37",
            "label": "y-card",
            "description": "Jakub Blaszczykowski (Wolfsburg) sees a yellow card. He should be more careful because one more challenge like that could result in a red card."
        },
        {
            "gameTime": "1 - 22:13",
            "label": "",
            "description": "A big opportunity missed by Mario Gomez (Wolfsburg). He got on the ball inside the box and thumped a splendid first time shot on goal, but it went narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 20:54",
            "label": "",
            "description": "Christian Pulisic (Dortmund) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 19:20",
            "label": "corner",
            "description": "The corner from Raphael Guerreiro (Dortmund) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 18:41",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the left post. Koen Casteels is alert and denies him with a nice save. Dortmund force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 17:45",
            "label": "",
            "description": "Mario Gomez (Wolfsburg) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "1 - 16:00",
            "label": "soccer-ball",
            "description": "An amazing individual effort from Pierre Emerick Aubameyang (Dortmund) ends with a strike from inside the penalty area. He sends the ball into the right side of the goal and makes it 0:2. Koen Casteels was helpless."
        },
        {
            "gameTime": "1 - 13:06",
            "label": "",
            "description": "Matthias Ginter (Dortmund) is caught offside, but it was a really close call."
        },
        {
            "gameTime": "1 - 12:23",
            "label": "y-card",
            "description": "Maximilian Arnold (Wolfsburg) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "1 - 11:21",
            "label": "substitution",
            "description": "Thomas Tuchel is forced to make a change. Marc Bartra is unable to continue due to injury, Matthias Ginter (Dortmund) comes on."
        },
        {
            "gameTime": "1 - 10:35",
            "label": "",
            "description": "Flag up against Bruno Henrique (Wolfsburg). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 09:10",
            "label": "",
            "description": "Mario Gotze (Dortmund) takes the free kick and sends the ball into the penalty area, but the opposition's defence is ready."
        },
        {
            "gameTime": "1 - 08:35",
            "label": "",
            "description": "Jakub Blaszczykowski (Wolfsburg) makes a slide tackle, but referee Daniel Siebert blows for a foul. It's a free kick to Dortmund in a dangerous position."
        },
        {
            "gameTime": "1 - 07:32",
            "label": "",
            "description": "Roman Burki pulls off a great save to deny Bruno Henrique (Wolfsburg) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "1 - 07:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) makes his forward run a little too early and is caught in an offside position after his teammate tries to play a pass to him."
        },
        {
            "gameTime": "1 - 06:38",
            "label": "",
            "description": "A lofted cross from Julian Draxler (Wolfsburg) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 05:30",
            "label": "",
            "description": "Daniel Siebert blows the whistle, Jakub Blaszczykowski (Wolfsburg) is penalised for a foul."
        },
        {
            "gameTime": "1 - 04:52",
            "label": "",
            "description": "The linesman signals that Mario Gomez (Wolfsburg) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 03:50",
            "label": "soccer-ball",
            "description": "Goal! Marc Bartra plays it to Raphael Guerreiro (Dortmund), whose deflected shot from inside the box goes past the helpless Koen Casteels. 0:1."
        },
        {
            "gameTime": "1 - 02:39",
            "label": "",
            "description": "The ball is cleared after Bruno Henrique (Wolfsburg) attempted to dribble past an opposing player. The ball goes out of play and Dortmund will have a goal kick."
        },
        {
            "gameTime": "1 - 00:20",
            "label": "",
            "description": "The referee blows his whistle as Mario Gotze (Dortmund) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Wolfsburg will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Daniel Siebert."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last game that Dortmund played was against FC Augsburg and it ended 1:1."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Wolfsburg haven't lost in their last 5 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Yannick Gerhardt has more yellow cards (2) than any other Wolfsburg player."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. Dortmund were better team throughout the game. The home side attempted to hold onto the ball for as long as possible. The away team was pressing and leaving the opponents little space for combination play."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "20/09/2016 - 21:00",
    "gameHomeTeam": "Wolfsburg",
    "gameScore": "1 - 5"
}