{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-09-26 - 17-00 Barcelona 2 - 1 Las Palmas/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The host team were better throughout the game. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 46:49",
            "label": "y-card",
            "description": "Luis Suarez (Barcelona) sees a yellow card from Ricardo de Burgos Bengoetxea after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 45:20",
            "label": "",
            "description": "Luis Suarez (Barcelona) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 45:07",
            "label": "substitution",
            "description": "The referee signals a substitution. Gerard Gumbau (Barcelona) is brought on as a substitute for Adriano."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:30",
            "label": "",
            "description": "Jonathan Viera (UD Las Palmas) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the right post."
        },
        {
            "gameTime": "2 - 43:48",
            "label": "",
            "description": "Chance! Sandro Ramirez (Barcelona) comes within inches of scoring after picking up a pass from Neymar, but his shot from inside the box flashes inches wide of the right post."
        },
        {
            "gameTime": "2 - 42:59",
            "label": "soccer-ball",
            "description": "Goal! Pedro Bigas plays it to Jonathan Viera (UD Las Palmas), whose deflected shot from inside the box goes past the helpless Marc Andre ter Stegen. 2:1."
        },
        {
            "gameTime": "2 - 39:54",
            "label": "",
            "description": "Luis Suarez (Barcelona) takes the free kick from mid range, but he balloons his effort high over the bar. What a miskick!"
        },
        {
            "gameTime": "2 - 39:12",
            "label": "",
            "description": "Emmanuel Culio (UD Las Palmas) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Ricardo de Burgos Bengoetxea with no other option than to blow for a foul. Barcelona earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 37:08",
            "label": "corner",
            "description": "Neymar (Barcelona) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 36:41",
            "label": "",
            "description": "Javier Mascherano (Barcelona) receives the ball and fires a first time shot from long range. His brilliant effort towards the left post is blocked by Javi Varas, who pulls off a stunning save! Barcelona win a corner."
        },
        {
            "gameTime": "2 - 34:29",
            "label": "substitution",
            "description": "It's time for a substitution. Sandro Ramirez (Barcelona) comes on in place of Munir El Haddadi."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "y-card",
            "description": "Javier Mascherano (Barcelona) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 33:20",
            "label": "",
            "description": "The game is interrupted as Neymar (Barcelona) is flagged offside."
        },
        {
            "gameTime": "2 - 32:50",
            "label": "",
            "description": "Close! Jonathan Viera (UD Las Palmas) stands over the resulting free kick from around 19 metres out and his shot goes just over the crossbar."
        },
        {
            "gameTime": "2 - 32:06",
            "label": "",
            "description": "Javier Mascherano (Barcelona) makes an overly aggressive challenge and Ricardo de Burgos Bengoetxea blows his whistle for a foul. Another situation results in a direct free kick for Las Palmas."
        },
        {
            "gameTime": "2 - 31:30",
            "label": "corner",
            "description": "Emmanuel Culio (UD Las Palmas) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 31:12",
            "label": "corner",
            "description": "Emmanuel Culio (UD Las Palmas) whips in the corner, but one of the defending players gets a head on it and intercepts. The ball goes out of play. Las Palmas are awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:44",
            "label": "",
            "description": "Mubarak Wakaso (UD Las Palmas) has an effort from distance and sends the ball towards the right post, but the goalkeeper is equal to it. It will be a corner kick for Las Palmas."
        },
        {
            "gameTime": "2 - 29:58",
            "label": "",
            "description": "Luis Suarez (Barcelona) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Javi Varas to get hold of the ball."
        },
        {
            "gameTime": "2 - 28:30",
            "label": "",
            "description": "Luis Suarez (Barcelona) pulls the jersey of one of the opposition players and Ricardo de Burgos Bengoetxea blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 25:30",
            "label": "",
            "description": "Luis Suarez slides a brilliant pass into Neymar (Barcelona), but his shot from inside the box goes a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 25:10",
            "label": "",
            "description": "Jonathan Viera (UD Las Palmas) takes a wonderful touch after collecting a pass inside the box. He steers his shot goalwards, but the keeper produces a decent save!"
        },
        {
            "gameTime": "2 - 24:42",
            "label": "attendance",
            "description": "The attendance is 74916."
        },
        {
            "gameTime": "2 - 22:50",
            "label": "substitution",
            "description": "The substitution is prepared. Juan Carlos Valeron (UD Las Palmas) joins the action as a substitute, replacing Roque Mesa."
        },
        {
            "gameTime": "2 - 21:40",
            "label": "substitution",
            "description": "Francisco Herrera Lorenzo has decided to make a change. Nabil El Zhar (UD Las Palmas) replaces Sergio Araujo."
        },
        {
            "gameTime": "2 - 20:59",
            "label": "penalty-missed",
            "description": "Neymar (Barcelona) can't convert the spot kick. It goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 20:52",
            "label": "",
            "description": "Neymar (Barcelona) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 20:40",
            "label": "y-card",
            "description": "Antolin Alcaraz (UD Las Palmas) is awarded a yellow card. The referee showed him no mercy."
        },
        {
            "gameTime": "2 - 20:19",
            "label": "penalty",
            "description": "The game is interrupted, a clear handball by Antolin Alcaraz (UD Las Palmas). The referee blows the whistle and gives a penalty to Barcelona!"
        },
        {
            "gameTime": "2 - 18:21",
            "label": "",
            "description": "Flag goes up against Luis Suarez (Barcelona) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 17:17",
            "label": "",
            "description": "Neymar (Barcelona) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Javi Varas."
        },
        {
            "gameTime": "2 - 14:24",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball goes well wide of the right post."
        },
        {
            "gameTime": "2 - 13:54",
            "label": "corner",
            "description": "Neymar (Barcelona) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 13:43",
            "label": "",
            "description": "Sergi Roberto (Barcelona) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. Barcelona force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "y-card",
            "description": "Mubarak Wakaso (UD Las Palmas) attempts to discuss the decision with Ricardo de Burgos Bengoetxea, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "2 - 12:11",
            "label": "",
            "description": "Marc Andre ter Stegen pulls off a great save to deny Sergio Araujo (UD Las Palmas), who makes himself some space inside the box and unleashes a quick shot to the right side of the goal."
        },
        {
            "gameTime": "2 - 11:58",
            "label": "substitution",
            "description": "Francisco Herrera Lorenzo has decided to substitute Hernan and he is replaced by Emmanuel Culio (UD Las Palmas)."
        },
        {
            "gameTime": "2 - 10:58",
            "label": "y-card",
            "description": "David Simon (UD Las Palmas) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Ricardo de Burgos Bengoetxea didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "soccer-ball",
            "description": "Goal! Munir El Haddadi provides Luis Suarez (Barcelona) with a nice pass inside the box. It allows him to finish with a precise effort under the bar. 2:0."
        },
        {
            "gameTime": "2 - 07:53",
            "label": "",
            "description": "Roque Mesa (UD Las Palmas) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 07:30",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) sends a long cross over to Neymar, but Javi Varas comes forward to gather the ball."
        },
        {
            "gameTime": "2 - 05:02",
            "label": "",
            "description": "Munir El Haddadi (Barcelona) is caught offside!"
        },
        {
            "gameTime": "2 - 04:35",
            "label": "",
            "description": "Luis Suarez (Barcelona) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 03:58",
            "label": "",
            "description": "Roque Mesa (UD Las Palmas) sends a teasing cross into the area, but Marc Andre ter Stegen intercepts the ball."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "corner",
            "description": "The corner from Roque Mesa (UD Las Palmas) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 03:10",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Roque Mesa (UD Las Palmas), but the defence gets it clear. Las Palmas will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 02:42",
            "label": "",
            "description": "The linesman signals that Marc Bartra (Barcelona) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) whips in the free kick, but one of the defenders comfortably clears the ball away."
        },
        {
            "gameTime": "2 - 01:38",
            "label": "",
            "description": "Pedro Bigas (UD Las Palmas) was too fierce in his attempt to get the ball from his opponent and Ricardo de Burgos Bengoetxea blows for a foul. Barcelona have a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Ricardo de Burgos Bengoetxea starts the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "We can hope that the managers will be able to motivate the players and stir them to improve their performance for after the half time break. We haven't seen really exciting football in the previous 45 minutes. The home side were more active and dominant in the first half. The opposition found it tough to keep up. The home team makes a lot of passes and attempts to maintain possession, while the visitors look to counter attack."
        },
        {
            "gameTime": "1 - 47:13",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 46:34",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 45:35",
            "label": "",
            "description": "Mubarak Wakaso (UD Las Palmas) escapes without any punishment from the referee after using excessive force to foul his opponent. A free kick is awarded to Barcelona."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 43:13",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) fires a volley from the edge of the box, but his effort goes well wide of the left post."
        },
        {
            "gameTime": "1 - 40:26",
            "label": "",
            "description": "Chance! Jonathan Viera (UD Las Palmas) comes within inches of scoring after picking up a pass from Sergio Araujo, but his shot from inside the box flashes just over the bar."
        },
        {
            "gameTime": "1 - 39:45",
            "label": "",
            "description": "Munir El Haddadi (Barcelona) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 37:33",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 37:12",
            "label": "",
            "description": "Sergio Busquets (Barcelona) strikes a powerful volley towards goal, but one of the defenders blocks his attempt. Barcelona force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 35:59",
            "label": "y-card",
            "description": "Hernan (UD Las Palmas) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Ricardo de Burgos Bengoetxea ignores the protests."
        },
        {
            "gameTime": "1 - 35:55",
            "label": "corner",
            "description": "Jonathan Viera (UD Las Palmas) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 35:33",
            "label": "",
            "description": "Marc Andre ter Stegen blocks a long range effort from Jonathan Viera (UD Las Palmas) towards the roof of the net. The ball is out of play. Las Palmas win a corner kick."
        },
        {
            "gameTime": "1 - 35:21",
            "label": "",
            "description": "Las Palmas quickly take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 35:03",
            "label": "",
            "description": "Sergi Roberto (Barcelona) makes an unfair challenge by holding his opponent to prevent him from getting the ball. Las Palmas are awarded the free kick."
        },
        {
            "gameTime": "1 - 32:51",
            "label": "",
            "description": "Luis Suarez sprays a pass out to Neymar (Barcelona), but he produces a poor effort from inside the box which goes well wide of the left post."
        },
        {
            "gameTime": "1 - 31:33",
            "label": "",
            "description": "Munir El Haddadi (Barcelona) is penalised for a foul. Ricardo de Burgos Bengoetxea had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 28:29",
            "label": "",
            "description": "Ricardo de Burgos Bengoetxea couldn't ignore the rough tackle by Sergio Araujo (UD Las Palmas) and blew his whistle."
        },
        {
            "gameTime": "1 - 27:05",
            "label": "",
            "description": "Flag up against Luis Suarez (Barcelona). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 24:46",
            "label": "soccer-ball",
            "description": "Sergi Roberto sends a superb cross into the box. Luis Suarez (Barcelona) latches on to it and from close range plants a header inside the left post, leaving Javi Varas beaten. He displayed his eye for goal there excellent finish. The score is 0:0."
        },
        {
            "gameTime": "1 - 22:35",
            "label": "",
            "description": "Jonathan Viera (UD Las Palmas) is adjudged offside."
        },
        {
            "gameTime": "1 - 20:53",
            "label": "",
            "description": "This was a piece of cake for Marc Andre ter Stegen. Sergio Araujo (UD Las Palmas) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "1 - 19:35",
            "label": "",
            "description": "Sergi Roberto (Barcelona) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 17:17",
            "label": "",
            "description": "Munir El Haddadi (Barcelona) finds himself in a promising position after receiving a clever chip pass, but one of the defending players comes up with a timely interception."
        },
        {
            "gameTime": "1 - 14:18",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Roque Mesa (UD Las Palmas)."
        },
        {
            "gameTime": "1 - 12:15",
            "label": "",
            "description": "Luis Suarez (Barcelona) tries to find Neymar, but he puts too much power on the pass. The ball is off of the pitch and it's a goal kick for Las Palmas."
        },
        {
            "gameTime": "1 - 10:52",
            "label": "",
            "description": "Sergio Araujo (UD Las Palmas) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 09:16",
            "label": "substitution",
            "description": "Luis Enrique is forced to make a change. Lionel Messi is unable to continue due to injury, Munir El Haddadi (Barcelona) comes on."
        },
        {
            "gameTime": "1 - 06:16",
            "label": "",
            "description": "Neymar (Barcelona) wasted an opportunity to score from the free kick from about 24 metres out. His attempt hit the defensive wall."
        },
        {
            "gameTime": "1 - 05:38",
            "label": "",
            "description": "Lionel Messi (Barcelona) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 05:15",
            "label": "",
            "description": "Ricardo de Burgos Bengoetxea interrupts the game for a tactical foul by Antolin Alcaraz (UD Las Palmas). Barcelona earn a free kick."
        },
        {
            "gameTime": "1 - 04:02",
            "label": "injury",
            "description": "Lionel Messi (Barcelona) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "1 - 03:27",
            "label": "",
            "description": "Lionel Messi (Barcelona) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 01:57",
            "label": "",
            "description": "Adriano (Barcelona) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Barcelona will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ricardo de Burgos Bengoetxea is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "0:1 is Las Palmas's most common score in this competition. 4 of their all matches finished with that score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "19 That's the number of penalties Barcelona were awarded in this competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona's worst defeat of the season is 1:4 against Celta Vigo on 23.9.."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The host team were better throughout the game. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        }
    ],
    "gameAwayTeam": "Las Palmas",
    "gameDate": "26/09/2015 - 17:00",
    "gameHomeTeam": "Barcelona",
    "gameScore": "2 - 1"
}