{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-01-15 - 17-00 Udinese 0 - 1 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. You have to say that the visitors have been the better side. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        },
        {
            "gameTime": "2 - 48:06",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) is caught offside, but it was a really close call."
        },
        {
            "gameTime": "2 - 46:36",
            "label": "",
            "description": "The Udinese players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession. The referee and the linesman both signal a throw in for AS Roma."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:44",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Francesco Totti (AS Roma)."
        },
        {
            "gameTime": "2 - 43:14",
            "label": "",
            "description": "Edin Dzeko (AS Roma) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 42:43",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) brings his opponent down. Antonio Damato has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 41:49",
            "label": "",
            "description": "Cyril Thereau (Udinese) receives a precise low pass inside the box, controls the ball and releases it towards the top left corner. Unfortunately for him, Wojciech Szczesny makes a great save to stop his effort."
        },
        {
            "gameTime": "2 - 39:44",
            "label": "",
            "description": "Edin Dzeko (AS Roma) latches on to a precise pass and one on one with the keeper slams the ball towards the right hand post. Orestis Karnezis is alert, though, and leaps like a salmon to deny him."
        },
        {
            "gameTime": "2 - 38:14",
            "label": "",
            "description": "Edin Dzeko (AS Roma) is caught offside after the linesman raises his flag."
        },
        {
            "gameTime": "2 - 36:18",
            "label": "",
            "description": "Edin Dzeko (AS Roma) climbs high to connect with a cross near the penalty spot but plants a header well wide of the right post."
        },
        {
            "gameTime": "2 - 34:50",
            "label": "",
            "description": "Edin Dzeko (AS Roma) had a good opportunity when he latched on to a cross from the wing, but his header wasn't accurate at all and the ball went well wide of the left post. The ball goes out of play and Udinese will have a goal kick."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "corner",
            "description": "Emerson (AS Roma) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 34:29",
            "label": "",
            "description": "What a great touch by Radja Nainggolan (AS Roma) as he controls a fine pass into the box and takes a shot to the bottom left corner, but an opposing player makes a clearance. Great defending. The ball is out of play. AS Roma will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 33:16",
            "label": "",
            "description": "A pass by Bruno Peres (AS Roma) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 31:28",
            "label": "y-card",
            "description": "Seko Fofana (Udinese) is shown a yellow card for a late challenge."
        },
        {
            "gameTime": "2 - 30:25",
            "label": "",
            "description": "Ewandro (Udinese) trips an opposition player and Antonio Damato signals a foul."
        },
        {
            "gameTime": "2 - 29:36",
            "label": "y-card",
            "description": "Felipe (Udinese) takes his opponent down and receives a yellow card from the referee."
        },
        {
            "gameTime": "2 - 29:15",
            "label": "",
            "description": "The ball is cleared after Rodrigo De Paul (Udinese) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 28:00",
            "label": "substitution",
            "description": "The substitution is prepared. Ewandro (Udinese) joins the action as a substitute, replacing Sven Kums."
        },
        {
            "gameTime": "2 - 27:52",
            "label": "",
            "description": "Francesco Totti (AS Roma) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again."
        },
        {
            "gameTime": "2 - 27:13",
            "label": "",
            "description": "Cyril Thereau (Udinese) gets on the ball and beats an opponent, but his run is stopped by the referee Antonio Damato who sees an offensive foul."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "",
            "description": "Bruno Peres (AS Roma) did his best to latch on to a crossfield pass, but it was too long and it goes out of play. It's a throw in for Udinese."
        },
        {
            "gameTime": "2 - 25:25",
            "label": "",
            "description": "Stipe Perica (Udinese) dribbles into space and finds himself in a shooting position, but his shot from the edge of the box is bravely blocked."
        },
        {
            "gameTime": "2 - 25:15",
            "label": "",
            "description": "Bruno Peres (AS Roma) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 23:47",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Duvan Zapata will be replaced by Emil Hallfredsson (Udinese)."
        },
        {
            "gameTime": "2 - 23:28",
            "label": "",
            "description": "Francesco Totti (AS Roma) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The linesman signals a throw in for AS Roma."
        },
        {
            "gameTime": "2 - 21:51",
            "label": "",
            "description": "Cyril Thereau (Udinese) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "2 - 20:45",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) races towards goal but the defender gets back well to make a challenge. The ball is out of play. AS Roma will take a throw in."
        },
        {
            "gameTime": "2 - 19:27",
            "label": "corner",
            "description": "Rodrigo De Paul (Udinese) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 19:12",
            "label": "",
            "description": "Seko Fofana (Udinese) flights in the cross, but the defender is alert and clears to safety. The linesman makes the right call and Udinese will have a corner."
        },
        {
            "gameTime": "2 - 18:21",
            "label": "",
            "description": "Bruno Peres (AS Roma) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 17:18",
            "label": "substitution",
            "description": "Today's match ends for Stephan El Shaarawy who will be replaced by Francesco Totti (AS Roma)."
        },
        {
            "gameTime": "2 - 16:43",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) tries a shot from distance, but the goalkeeper can stay calm as it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 15:45",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) forces a pass into the box, but Orestis Karnezis is alert and does a great job to rob him of the ball."
        },
        {
            "gameTime": "2 - 14:32",
            "label": "",
            "description": "A lofted cross from Bruno Peres (AS Roma) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 12:51",
            "label": "",
            "description": "A long pass, executed by Kevin Strootman (AS Roma), missed the precision to reach his teammates."
        },
        {
            "gameTime": "2 - 11:22",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "2 - 10:24",
            "label": "",
            "description": "Udinese hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "2 - 08:24",
            "label": "",
            "description": "Edin Dzeko (AS Roma) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the middle of the goal. Orestis Karnezis has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 07:49",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Stephan El Shaarawy (AS Roma) takes it short."
        },
        {
            "gameTime": "2 - 07:39",
            "label": "",
            "description": "The AS Roma players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 06:23",
            "label": "substitution",
            "description": "Luigi Delneri decides to make a substitution. Jakub Jankto will be replaced by Stipe Perica (Udinese)."
        },
        {
            "gameTime": "2 - 06:06",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 04:23",
            "label": "",
            "description": "Leandro Paredes (AS Roma) sends a long cross over to Edin Dzeko, but Orestis Karnezis comes forward to gather the ball."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "corner",
            "description": "Emerson (AS Roma) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 02:33",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from 26 metres out by Emerson (AS Roma) as his effort only hit the wall. The referee points to the corner flag. It's a corner to AS Roma."
        },
        {
            "gameTime": "2 - 01:28",
            "label": "",
            "description": "Sven Kums (Udinese) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 00:54",
            "label": "",
            "description": "Duvan Zapata (Udinese) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Antonio Damato blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. We are witnessing quite a balanced game with both teams struggling to prevail. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 45:06",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 44:29",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) breaks past challenges inside the box, but puts too much pace on his pass to Duvan Zapata."
        },
        {
            "gameTime": "1 - 43:09",
            "label": "",
            "description": "Nice passing game by Udinese. They are increasing their possession with a series of long passes and waiting for the right moment to create an attacking opportunity."
        },
        {
            "gameTime": "1 - 41:49",
            "label": "",
            "description": "Sven Kums (Udinese) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 40:58",
            "label": "corner",
            "description": "Rodrigo De Paul (Udinese) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "y-card",
            "description": "Juan Jesus (AS Roma) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "1 - 39:52",
            "label": "",
            "description": "The ball is cleared after Edin Dzeko (AS Roma) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 38:40",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Rodrigo De Paul (Udinese), but the defence gets it clear. The ball has crossed the sideline. Udinese are taking a throw in."
        },
        {
            "gameTime": "1 - 36:55",
            "label": "",
            "description": "Duvan Zapata (Udinese) commits a foul and Antonio Damato immediately signals a free kick."
        },
        {
            "gameTime": "1 - 35:26",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) tries his luck with a long range shot from a rebound, but it isn't precise at all and the ball flies miles over the crossbar. Very poor shot."
        },
        {
            "gameTime": "1 - 34:44",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) was trying to get to the ball but clattered into the legs of the opponent as well. Antonio Damato blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 34:22",
            "label": "corner",
            "description": "Emerson (AS Roma) launches a cross from the corner, but Orestis Karnezis is alert to thwart the effort."
        },
        {
            "gameTime": "1 - 33:35",
            "label": "",
            "description": "A promising cross into the box is nearly received by the lurking Edin Dzeko (AS Roma), but one of the defending players cuts it out to avert the threat."
        },
        {
            "gameTime": "1 - 32:16",
            "label": "",
            "description": "Kevin Strootman (AS Roma) sends a teasing cross into the area, but Orestis Karnezis intercepts the ball."
        },
        {
            "gameTime": "1 - 31:32",
            "label": "",
            "description": "A pass by Duvan Zapata (Udinese) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 30:19",
            "label": "",
            "description": "Cyril Thereau (Udinese) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "1 - 29:39",
            "label": "",
            "description": "Antonio Damato blows his whistle after Leandro Paredes (AS Roma) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 28:09",
            "label": "",
            "description": "The AS Roma players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession. The referee and the linesman both signal a throw in for Udinese."
        },
        {
            "gameTime": "1 - 26:50",
            "label": "corner",
            "description": "Rodrigo De Paul (Udinese) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 26:28",
            "label": "",
            "description": "What a wonderful moment! Rodrigo De Paul (Udinese) receives a perfect pass in the middle of the pitch, lines up the ball and unloads a powerful strike towards the crossbar. His effort fails to surprise Wojciech Szczesny, who makes a nice save. Udinese earn a corner."
        },
        {
            "gameTime": "1 - 25:57",
            "label": "",
            "description": "An attempted cross from Cyril Thereau (Udinese) is cleared."
        },
        {
            "gameTime": "1 - 24:49",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes a short corner kick."
        },
        {
            "gameTime": "1 - 24:08",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee blows his whistle, AS Roma are awarded a corner kick."
        },
        {
            "gameTime": "1 - 21:50",
            "label": "corner",
            "description": "Rodrigo De Paul (Udinese) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 21:40",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) latches on to a lovely pass inside the box and fires towards the top right corner, but the effort is smothered by the keeper. The ball is out of play. A goal scoring opportunity from a corner for Udinese."
        },
        {
            "gameTime": "1 - 21:30",
            "label": "",
            "description": "Felipe (Udinese) leaps highest in the penalty area to get on the end of a cross from the set piece, and he produces a promising goal bound header towards the right side of the goal, but Wojciech Szczesny pulls off a decent save to deny him."
        },
        {
            "gameTime": "1 - 19:21",
            "label": "",
            "description": "The Udinese players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 17:42",
            "label": "penalty-missed",
            "description": "Edin Dzeko (AS Roma) doesn't keep his cool and fails to convert the penalty. He skies the ball way over the bar and into the stands."
        },
        {
            "gameTime": "1 - 17:31",
            "label": "",
            "description": "Edin Dzeko (AS Roma) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 17:25",
            "label": "penalty",
            "description": "The players claim that Davide Faraoni (Udinese) handled the ball inside the box and it seems they are right. AS Roma are awarded a penalty!"
        },
        {
            "gameTime": "1 - 15:28",
            "label": "",
            "description": "Edin Dzeko (AS Roma) makes a yard for himself and attempts to endanger the goalkeeper with a long range shot. His great effort, however, goes a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 14:10",
            "label": "",
            "description": "Bruno Peres (AS Roma) trips an opponent with a slide tackle. Antonio Damato stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 13:36",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 11:42",
            "label": "soccer-ball",
            "description": "Goal! Radja Nainggolan (AS Roma) unleashes a first time shot from inside the box and beats the goalkeeper into the bottom left corner. 0:1."
        },
        {
            "gameTime": "1 - 10:22",
            "label": "",
            "description": "Cyril Thereau (Udinese) finds himself in a promising position after receiving a beautiful cross from the side, but the opposition defence is ready and one of the defenders averts the threat with a quick interception. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "1 - 09:36",
            "label": "",
            "description": "Emerson (AS Roma) tries to slide the ball through to a teammate but it's well blocked by a defender. The ball is out of play. AS Roma will have a throw in."
        },
        {
            "gameTime": "1 - 07:22",
            "label": "",
            "description": "AS Roma players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 05:51",
            "label": "",
            "description": "Antonio Damato blows his whistle and it's Edin Dzeko (AS Roma) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 05:24",
            "label": "corner",
            "description": "Emerson (AS Roma) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence. The ball goes out of play and Udinese will have a goal kick."
        },
        {
            "gameTime": "1 - 04:43",
            "label": "",
            "description": "Orestis Karnezis pulls off a great save to deny Stephan El Shaarawy (AS Roma), who makes himself some space inside the box and unleashes a quick shot to the right side of the goal. The referee and his assistant both point at the corner flag. AS Roma will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 04:26",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) races towards goal but the defender gets back well to make a challenge. The ball is behind the touchline and AS Roma will take a throw in."
        },
        {
            "gameTime": "1 - 03:48",
            "label": "",
            "description": "Bruno Peres (AS Roma) is clearly in an offside position after the ball is played through to him and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 02:51",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) is penalised for a foul. Antonio Damato had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 01:48",
            "label": "",
            "description": "Close! Edin Dzeko (AS Roma) picks up the ball in space and from inside the penalty area sends a shot narrowly over the bar. The ball is off of the pitch and it's a goal kick for Udinese."
        },
        {
            "gameTime": "1 - 01:09",
            "label": "",
            "description": "Seko Fofana (Udinese) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 00:37",
            "label": "",
            "description": "Edin Dzeko (AS Roma) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Damato is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most prolific goal scorer for AS Roma is Edin Dzeko with 13 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "4 that's the number of matches that Udinese have lost at home so far this season, while they have lost 4x away."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. You have to say that the visitors have been the better side. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "15/01/2017 - 17:00",
    "gameHomeTeam": "Udinese",
    "gameScore": "0 - 1"
}