{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-09-23 - 22-00 Ath Bilbao 1 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:19",
            "label": "",
            "description": "The fans can't complain about what they saw on the pitch as both sides displayed a highly captivating football match. The superiority of the away team was evident on the pitch today. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        },
        {
            "gameTime": "2 - 48:18",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 47:41",
            "label": "",
            "description": "Jese (Real Madrid) clips a neat ball into the box in the direction of Cristiano Ronaldo, but he can't get on the end of the pass."
        },
        {
            "gameTime": "2 - 44:59",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:58",
            "label": "y-card",
            "description": "Raul Garcia (Ath Bilbao) picks up a yellow card."
        },
        {
            "gameTime": "2 - 43:59",
            "label": "substitution",
            "description": "A substitution has been made. Mateo Kovacic is replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 42:56",
            "label": "corner",
            "description": "Aymeric Laporte (Ath Bilbao) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 42:28",
            "label": "",
            "description": "Gomez Perez Ibai (Ath Bilbao) rises above the defenders and places a towering header towards the top left corner, but Keylor Navas is prepared and leaps to thwart him. The ball is out of play. A goal scoring opportunity from a corner for Ath Bilbao."
        },
        {
            "gameTime": "2 - 41:56",
            "label": "",
            "description": "Mikel Balenziaga (Ath Bilbao) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 41:05",
            "label": "attendance",
            "description": "The attendance for today's match is 43387."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "",
            "description": "Antonio Mateu Lahoz couldn't ignore the rough tackle by Raul Garcia (Ath Bilbao) and blew his whistle."
        },
        {
            "gameTime": "2 - 39:21",
            "label": "substitution",
            "description": "Substitution. Benat will be replaced by Sola (Ath Bilbao)."
        },
        {
            "gameTime": "2 - 38:48",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) dances his way past two defending players and gets to the edge of the box from where he unleashes a shot that goes well wide of the right post."
        },
        {
            "gameTime": "2 - 35:40",
            "label": "y-card",
            "description": "Today's referee Antonio Mateu Lahoz rightly decides to book Gomez Perez Ibai (Ath Bilbao) for his harsh tackle."
        },
        {
            "gameTime": "2 - 34:40",
            "label": "substitution",
            "description": "Substitution. Karim Benzema leaves the pitch and is replaced by Casemiro (Real Madrid)."
        },
        {
            "gameTime": "2 - 33:46",
            "label": "",
            "description": "Raul Garcia (Ath Bilbao) wastes a huge opportunity after receiving a fine cross from the free kick, but his close range shot goes well wide of the left post."
        },
        {
            "gameTime": "2 - 33:43",
            "label": "",
            "description": "Benat (Ath Bilbao) will take the free kick."
        },
        {
            "gameTime": "2 - 32:59",
            "label": "substitution",
            "description": "Ernesto Valverde Tejedor has decided to introduce fresh legs, with Gomez Perez Ibai (Ath Bilbao) replacing Markel Susaeta."
        },
        {
            "gameTime": "2 - 32:58",
            "label": "y-card",
            "description": "The game is interrupted because of a yellow card that is shown to Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "2 - 32:39",
            "label": "",
            "description": "The players claim that Toni Kroos (Real Madrid) handled the ball and it seems they are right. Ath Bilbao get a free kick."
        },
        {
            "gameTime": "2 - 31:56",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 31:50",
            "label": "",
            "description": "The ball goes out of play and Real Madrid have been awarded a corner kick. Jese (Real Madrid) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety."
        },
        {
            "gameTime": "2 - 29:34",
            "label": "",
            "description": "It's unbelievable, Aritz Aduriz (Ath Bilbao) blows a huge opportunity! He is totally unmarked and fires a first time shot towards goal from a few yards out, but Keylor Navas reacts superbly to keep the ball out."
        },
        {
            "gameTime": "2 - 29:13",
            "label": "corner",
            "description": "Benat (Ath Bilbao) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 29:00",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Sabin (Ath Bilbao), is intercepted by the opposition's defence. It will be a corner kick for Ath Bilbao."
        },
        {
            "gameTime": "2 - 28:21",
            "label": "",
            "description": "A pass from Marcelo (Real Madrid) is intercepted by Gorka Iraizoz and the move breaks down."
        },
        {
            "gameTime": "2 - 27:07",
            "label": "",
            "description": "Karim Benzema (Real Madrid) latches on to a precise cross on the edge of the box and strikes the ball goalwards. However, it whistles wide of the left post so the goalkeeper can relax."
        },
        {
            "gameTime": "2 - 26:50",
            "label": "substitution",
            "description": "Here is a change. Mikel San Jose is going off and Ernesto Valverde Tejedor gives the last tactical orders to Mikel Rico (Ath Bilbao)."
        },
        {
            "gameTime": "2 - 26:31",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Isco walks off the pitch to be replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "soccer-ball",
            "description": "Goal 1:2! Isco laid the ball off to Karim Benzema (Real Madrid), who slots it into the back of the net from close range, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 23:59",
            "label": "",
            "description": "Some patient build up play from Real Madrid as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 21:59",
            "label": "soccer-ball",
            "description": "The ball hits the back of the net! Markel Susaeta showcases his brilliant technique and produces a beautiful lofted cross into the box, where Sabin (Ath Bilbao) manages to convert it into a sweet goal. He heads it inside the right post and gets on the scoresheet – 0:1."
        },
        {
            "gameTime": "2 - 20:59",
            "label": "y-card",
            "description": "The foul by Oscar de Marcos (Ath Bilbao) is worthy of a card and a yellow is duly shown by Antonio Mateu Lahoz."
        },
        {
            "gameTime": "2 - 20:20",
            "label": "",
            "description": "Raphael Varane (Real Madrid) gets his head on the corner, but he can't find the target as his header flies high over the crossbar."
        },
        {
            "gameTime": "2 - 19:58",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "",
            "description": "The referee and one of his assistants signal for a corner kick to Real Madrid. Cristiano Ronaldo (Real Madrid) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety."
        },
        {
            "gameTime": "2 - 19:00",
            "label": "",
            "description": "Benat (Ath Bilbao) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "2 - 18:25",
            "label": "y-card",
            "description": "Benat (Ath Bilbao) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 17:08",
            "label": "",
            "description": "Aritz Aduriz (Ath Bilbao) meets a cross inside the box, but his header is blocked by an opposing player."
        },
        {
            "gameTime": "2 - 15:31",
            "label": "",
            "description": "Mikel Balenziaga (Ath Bilbao) makes a rough challenge and Antonio Mateu Lahoz blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 14:46",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) comes close to scoring. He meets a lovely lofted pass from Marcelo, but sends his close range header way over the crossbar."
        },
        {
            "gameTime": "2 - 12:35",
            "label": "",
            "description": "A poorly executed mid range free kick by Benat (Ath Bilbao) as he fails to deliver a decent cross."
        },
        {
            "gameTime": "2 - 11:59",
            "label": "y-card",
            "description": "Antonio Mateu Lahoz shows a yellow card to Pepe (Real Madrid) for a tough tackle."
        },
        {
            "gameTime": "2 - 09:45",
            "label": "",
            "description": "Sabin (Ath Bilbao) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "2 - 08:27",
            "label": "",
            "description": "Benat (Ath Bilbao) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "2 - 08:05",
            "label": "",
            "description": "Ath Bilbao take a quick free kick with a short pass and play continues."
        },
        {
            "gameTime": "2 - 06:51",
            "label": "y-card",
            "description": "Cristiano Ronaldo (Real Madrid) says something out of turn to the referee and is shown a yellow card."
        },
        {
            "gameTime": "2 - 06:24",
            "label": "",
            "description": "Luka Modric (Real Madrid) fouls an opponent. At least that's what referee Antonio Mateu Lahoz signals. Ath Bilbao have a free kick."
        },
        {
            "gameTime": "2 - 06:09",
            "label": "corner",
            "description": "Markel Susaeta (Ath Bilbao) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 05:49",
            "label": "",
            "description": "Raul Garcia (Ath Bilbao) tries his luck with a long range effort after receiving a precise pass, but Keylor Navas has a clear view of it and makes a comfortable save. Ath Bilbao force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 05:23",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 05:02",
            "label": "",
            "description": "Marcelo (Real Madrid) tries to slide the ball through to a teammate but it's well blocked by a defender. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 04:04",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 03:40",
            "label": "",
            "description": "Karim Benzema (Real Madrid) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort. Real Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 02:52",
            "label": "",
            "description": "Karim Benzema (Real Madrid) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 02:32",
            "label": "",
            "description": "Mikel Balenziaga (Ath Bilbao) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "2 - 01:10",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a long ball in, but Gorka Iraizoz comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 45:13",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. The visitors were more active and dominated the home side in the first half, who weren't able to keep up. The home side focuses on defending and lets the opposition enjoy possession of the ball."
        },
        {
            "gameTime": "1 - 45:12",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 42:43",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies into the stands."
        },
        {
            "gameTime": "1 - 42:18",
            "label": "corner",
            "description": "Isco (Real Madrid) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 41:54",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) latches on to a precise pass and one on one with the keeper slams the ball towards the middle of the goal. Gorka Iraizoz is alert, though, and makes an easy save to deny him. The referee and his assistant both point at the corner flag. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 40:39",
            "label": "",
            "description": "Keylor Navas makes a superb save to deny a header which was nodded towards the right hand post by Aritz Aduriz (Ath Bilbao) after a cross from the side."
        },
        {
            "gameTime": "1 - 40:30",
            "label": "",
            "description": "Benat (Ath Bilbao) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 39:26",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) was too fierce in his attempt to get the ball from his opponent and Antonio Mateu Lahoz blows for a foul. Ath Bilbao have been awarded a free kick."
        },
        {
            "gameTime": "1 - 37:38",
            "label": "",
            "description": "Karim Benzema (Real Madrid) reacts well and displays good awareness inside the box to get on the end of the resulting corner kick. He fails to direct the ball into the net as it flies narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 37:23",
            "label": "corner",
            "description": "Isco (Real Madrid) will take the corner."
        },
        {
            "gameTime": "1 - 37:02",
            "label": "",
            "description": "Gorka Iraizoz pulls off a great save to deny Mateo Kovacic (Real Madrid), who makes himself some space inside the box and unleashes a quick shot towards the top of the net. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 36:04",
            "label": "",
            "description": "Mikel San Jose (Ath Bilbao) makes a slide tackle, but referee Antonio Mateu Lahoz blows for a foul."
        },
        {
            "gameTime": "1 - 34:01",
            "label": "",
            "description": "Karim Benzema (Real Madrid) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 31:34",
            "label": "",
            "description": "Antonio Mateu Lahoz blows his whistle and it's Oscar de Marcos (Ath Bilbao) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 31:13",
            "label": "corner",
            "description": "A dangerous looking corner kick from Benat (Ath Bilbao) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 30:54",
            "label": "",
            "description": "Raul Garcia (Ath Bilbao) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. Ath Bilbao have a corner."
        },
        {
            "gameTime": "1 - 29:59",
            "label": "",
            "description": "Isco (Real Madrid) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 28:52",
            "label": "",
            "description": "Aritz Aduriz (Ath Bilbao) blows a huge opportunity! He latches on to a perfect cross from the wing into the penalty area, but sends a bullet header just wide of the left post!"
        },
        {
            "gameTime": "1 - 27:57",
            "label": "",
            "description": "Karim Benzema picks out Toni Kroos (Real Madrid), who drives a shot just over the crossbar from the edge of the box."
        },
        {
            "gameTime": "1 - 27:17",
            "label": "corner",
            "description": "Benat (Ath Bilbao) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 26:59",
            "label": "",
            "description": "Markel Susaeta (Ath Bilbao) tries to find the head of a teammate in the box but overhits the cross. The referee points to the corner flag and Ath Bilbao will take a corner."
        },
        {
            "gameTime": "1 - 25:27",
            "label": "",
            "description": "Isco (Real Madrid) attempts to find Marcelo, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 24:50",
            "label": "",
            "description": "Markel Susaeta (Ath Bilbao) makes an overly aggressive challenge and Antonio Mateu Lahoz blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 23:56",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) takes a short corner kick."
        },
        {
            "gameTime": "1 - 23:31",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) unleashes a shot from long range but it's well blocked. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 23:11",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) robs an opponent of the ball and explodes in anger when Antonio Mateu Lahoz blows for a foul."
        },
        {
            "gameTime": "1 - 22:28",
            "label": "",
            "description": "Marcelo (Real Madrid) tries to find Karim Benzema, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 21:35",
            "label": "",
            "description": "Gorka Iraizoz is a nightmare for the offensive players! Cristiano Ronaldo (Real Madrid) meets a cross on the edge of the penalty area, takes a good first touch and fires a rocket of a shot towards the roof of the net, but the goalkeeper produces a wonderful save."
        },
        {
            "gameTime": "1 - 21:23",
            "label": "",
            "description": "Some neat passing and movement from Real Madrid as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 18:59",
            "label": "soccer-ball",
            "description": "Goal! It's a catastrophic error from the opponent which has gifted a chance to Karim Benzema (Real Madrid), who rolls the ball into the back of the net from close range. 0:1."
        },
        {
            "gameTime": "1 - 18:23",
            "label": "",
            "description": "Poorly taken free kick by Cristiano Ronaldo (Real Madrid) from mid range. He unleashes a strong shot, but it goes well wide of the right post. What a miskick!"
        },
        {
            "gameTime": "1 - 17:22",
            "label": "",
            "description": "Antonio Mateu Lahoz blows his whistle and signals a foul after Benat (Ath Bilbao) brought his opponent down. Real Madrid are awarded the free kick."
        },
        {
            "gameTime": "1 - 16:33",
            "label": "",
            "description": "Benat (Ath Bilbao) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 15:40",
            "label": "",
            "description": "A crossfield pass from Xabier Etxeita (Ath Bilbao) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 14:30",
            "label": "",
            "description": "Karim Benzema (Real Madrid) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "1 - 13:29",
            "label": "",
            "description": "Cristiano Ronaldo races towards the box before laying off to Karim Benzema (Real Madrid), who picks it up but blazes a shot well over the bar from the edge of the box."
        },
        {
            "gameTime": "1 - 12:45",
            "label": "",
            "description": "Raul Garcia (Ath Bilbao) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box well wide of the left post."
        },
        {
            "gameTime": "1 - 12:26",
            "label": "",
            "description": "Markel Susaeta (Ath Bilbao) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 11:07",
            "label": "",
            "description": "Karim Benzema (Real Madrid) produces a long range cannon of a shot after a nice pass. The ball heads towards the right post, but is stopped by a great save from Gorka Iraizoz and the score remains the same."
        },
        {
            "gameTime": "1 - 09:45",
            "label": "",
            "description": "Karim Benzema (Real Madrid) handles the ball and everyone in the stadium shouts 'handball'."
        },
        {
            "gameTime": "1 - 07:16",
            "label": "",
            "description": "He should have done better. Raphael Varane (Real Madrid) is afforded space to connect with a Marcelo cross, but his header from the centre of the box flies well over the crossbar."
        },
        {
            "gameTime": "1 - 07:05",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 06:38",
            "label": "",
            "description": "Karim Benzema (Real Madrid) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. The referee points to the corner flag. It's a corner to Real Madrid."
        },
        {
            "gameTime": "1 - 06:08",
            "label": "",
            "description": "Oscar de Marcos (Ath Bilbao) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 05:20",
            "label": "",
            "description": "Karim Benzema (Real Madrid) is penalised for a foul. Antonio Mateu Lahoz had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 03:41",
            "label": "",
            "description": "Cristiano Ronaldo sends a lovely lofted pass forward that flies over the top of the defence and into the path of Isco (Real Madrid), but he can't direct his header on target as it flies well wide of the right post."
        },
        {
            "gameTime": "1 - 03:02",
            "label": "",
            "description": "Raul Garcia (Ath Bilbao) commits a foul and Antonio Mateu Lahoz immediately signals a free kick."
        },
        {
            "gameTime": "1 - 02:31",
            "label": "corner",
            "description": "Benat (Ath Bilbao) will take a corner kick."
        },
        {
            "gameTime": "1 - 02:13",
            "label": "",
            "description": "The ball is cleared after Aritz Aduriz (Ath Bilbao) attempted to dribble past an opposing player. Good work from Ath Bilbao as they win a corner."
        },
        {
            "gameTime": "1 - 01:17",
            "label": "",
            "description": "Pepe (Real Madrid) gives away a foul for a clumsy challenge. Referee Antonio Mateu Lahoz saw the whole situation."
        },
        {
            "gameTime": "1 - 01:01",
            "label": "",
            "description": "Pepe (Real Madrid) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Mateu Lahoz is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid are playing some good attacking football with some solid defence, here is their goals for and against 110:34."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ath Bilbao have completed big transfer and they have signed Raul Garcia (Atl. Madrid)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Aritz Aduriz is Ath Bilbao's leading goal scorer with 20 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans can't complain about what they saw on the pitch as both sides displayed a highly captivating football match. The superiority of the away team was evident on the pitch today. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "23/09/2015 - 22:00",
    "gameHomeTeam": "Ath Bilbao",
    "gameScore": "1 - 2"
}