{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-09-10 - 21-30 Barcelona 1 - 2 Alaves/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. Great display from the home side, you have to say that they were the better side today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        },
        {
            "gameTime": "2 - 48:58",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 48:30",
            "label": "",
            "description": "Lionel Messi (Barcelona) goes close to scoring with a shot from inside the box, but he drags his effort wide of the right post."
        },
        {
            "gameTime": "2 - 47:31",
            "label": "corner",
            "description": "The corner kick from Neymar (Barcelona) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 47:13",
            "label": "",
            "description": "Lucas Digne (Barcelona) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The referee and one of his assistants signal for a corner kick to Barcelona."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:35",
            "label": "",
            "description": "Neymar (Barcelona) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 40:53",
            "label": "",
            "description": "Neymar (Barcelona) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 39:27",
            "label": "",
            "description": "Andres Iniesta (Barcelona) takes a shot from the edge of the area, but it goes harmlessly wide of the right post."
        },
        {
            "gameTime": "2 - 38:23",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 38:08",
            "label": "",
            "description": "Lionel Messi (Barcelona) fires the ball at goal from inside the area, but it's well blocked. Barcelona will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 36:35",
            "label": "",
            "description": "What a wasted opportunity by Jeremy Mathieu (Barcelona)! He creates some space for himself inside the penalty box and unleashes a decent strike towards the bottom right corner, but Fernando Pacheco makes an astonishing save to thwart him."
        },
        {
            "gameTime": "2 - 36:23",
            "label": "corner",
            "description": "Neymar (Barcelona) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 36:06",
            "label": "",
            "description": "Lucas Digne (Barcelona) sends a pass into the box, but his attempt is thwarted and cleared. The ball is out of play. Barcelona win a corner kick."
        },
        {
            "gameTime": "2 - 33:11",
            "label": "substitution",
            "description": "Here's the change. Gomez Perez Ibai leaves the pitch and Victor Camarasa (Alaves) comes on as a substitute."
        },
        {
            "gameTime": "2 - 31:14",
            "label": "corner",
            "description": "Neymar (Barcelona) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "",
            "description": "Neymar (Barcelona) and Lucas Digne attempt to exchange short two yard passes, but the opposition's defence intercepts the ball. Barcelona force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 29:57",
            "label": "",
            "description": "Andres Iniesta (Barcelona) sends a cross into the box, but Fernando Pacheco comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 29:32",
            "label": "",
            "description": "Barcelona are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "2 - 28:05",
            "label": "substitution",
            "description": "We are about to witness a substitution. Carlos Vigaray (Alaves) is replacing Kiko."
        },
        {
            "gameTime": "2 - 27:18",
            "label": "",
            "description": "Lionel Messi (Barcelona) lines up the resulting free kick from the edge of the box, but he produces a poor shot that goes high over the bar. The ball could have snow on it when it returns!"
        },
        {
            "gameTime": "2 - 26:36",
            "label": "",
            "description": "Barcelona win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 26:23",
            "label": "y-card",
            "description": "Mario Melero Lopez shows the yellow card to Raul Garcia (Alaves) for a heavy challenge."
        },
        {
            "gameTime": "2 - 24:29",
            "label": "substitution",
            "description": "Here is a change. Edgar Mendez is going off and Mauricio Pellegrino gives the last tactical orders to Cristian Espinoza (Alaves)."
        },
        {
            "gameTime": "2 - 23:12",
            "label": "",
            "description": "Andres Iniesta (Barcelona) attempts to release Luis Suarez with a through ball, but his effort is thwarted by one of the defending players."
        },
        {
            "gameTime": "2 - 20:47",
            "label": "substitution",
            "description": "Substitution. Alcacer Paco makes his way off the pitch and Luis Suarez (Barcelona) comes on as his replacement."
        },
        {
            "gameTime": "2 - 18:50",
            "label": "soccer-ball",
            "description": "Gomez Perez Ibai (Alaves) makes a great solo run and pulls the trigger from inside the box, beating Jasper Cillessen with a strike into the bottom right corner. He makes it 1:2."
        },
        {
            "gameTime": "2 - 18:17",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Arda Turan trots off the pitch and is replaced by Andres Iniesta (Barcelona)."
        },
        {
            "gameTime": "2 - 17:07",
            "label": "",
            "description": "Lionel Messi (Barcelona) took a mid range free kick and failed to find the target. The goalkeeper didn't need to react at all as his attempt went miles wide of the left post."
        },
        {
            "gameTime": "2 - 16:16",
            "label": "",
            "description": "Mario Melero Lopez blows his whistle. Daniel Torres (Alaves) commits a foul after dangerous play. Barcelona earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 16:07",
            "label": "corner",
            "description": "The resulting set piece from Barcelona is comfortably intercepted by one of the defending players."
        },
        {
            "gameTime": "2 - 15:43",
            "label": "",
            "description": "Lucas Digne (Barcelona) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Good work from Barcelona as they win a corner."
        },
        {
            "gameTime": "2 - 15:18",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Neymar (Barcelona)."
        },
        {
            "gameTime": "2 - 15:04",
            "label": "",
            "description": "Lionel Messi (Barcelona) steps up to take a free kick and sends it in, but the opposition's defence is alert and clears the ball to safety. The referee points to the corner flag and Barcelona will take a corner."
        },
        {
            "gameTime": "2 - 14:38",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Denis Suarez walks off the pitch to be replaced by Lionel Messi (Barcelona)."
        },
        {
            "gameTime": "2 - 14:13",
            "label": "",
            "description": "Kiko (Alaves) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul. Barcelona are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 13:05",
            "label": "",
            "description": "Lucas Digne (Barcelona) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 12:39",
            "label": "corner",
            "description": "Barcelona take the corner, but their hopes of scoring a goal end with nice clearance by the defence."
        },
        {
            "gameTime": "2 - 12:21",
            "label": "",
            "description": "Lucas Digne (Barcelona) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. The referee points to the corner flag. It's a corner to Barcelona."
        },
        {
            "gameTime": "2 - 11:58",
            "label": "",
            "description": "Mario Melero Lopez couldn't ignore the rough tackle by Gomez Perez Ibai (Alaves) and blew his whistle. Barcelona restart play with a quick free kick."
        },
        {
            "gameTime": "2 - 10:55",
            "label": "",
            "description": "A cross by Arda Turan (Barcelona) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor. The ball is off of the pitch and it's a goal kick for Alaves."
        },
        {
            "gameTime": "2 - 10:23",
            "label": "",
            "description": "Flag up against Alcacer Paco (Barcelona). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 09:18",
            "label": "",
            "description": "Arda Turan (Barcelona) and Aleix Vidal try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "2 - 09:05",
            "label": "y-card",
            "description": "Javier Mascherano (Barcelona) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Mario Melero Lopez ignores the protests."
        },
        {
            "gameTime": "2 - 06:31",
            "label": "",
            "description": "Alcacer Paco (Barcelona) receives a precise pass inside the box and takes a shot that flies just wide of the right post."
        },
        {
            "gameTime": "2 - 05:43",
            "label": "",
            "description": "Alaves have a goal ruled out for offside!"
        },
        {
            "gameTime": "2 - 05:31",
            "label": "funfact",
            "description": "The statistic for corner kicks – 13:0."
        },
        {
            "gameTime": "2 - 05:01",
            "label": "",
            "description": "Lucas Digne (Barcelona) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Mario Melero Lopez with no other option than to blow for a foul."
        },
        {
            "gameTime": "2 - 04:30",
            "label": "",
            "description": "Neymar (Barcelona) creates some space for himself and unleashes a strike from long range, but his effort sails just over the crossbar."
        },
        {
            "gameTime": "2 - 03:42",
            "label": "",
            "description": "Jeremy Mathieu (Barcelona) comes close to scoring! He gets the ball inside the box from the resulting corner, but his effort goes narrowly wide of the right post. This should be a big warning for the defence."
        },
        {
            "gameTime": "2 - 03:23",
            "label": "corner",
            "description": "Barcelona force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 03:14",
            "label": "",
            "description": "Arda Turan (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 02:40",
            "label": "",
            "description": "Neymar (Barcelona) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 02:03",
            "label": "",
            "description": "Deyverson (Alaves) shoots from the edge of the penalty area. The ball travels towards the bottom right corner, but Jasper Cillessen easily deals with the threat."
        },
        {
            "gameTime": "2 - 00:55",
            "label": "soccer-ball",
            "description": "Goal 1:1! Neymar sends in a fine cross from the corner kick. The perfect pass finds Jeremy Mathieu (Barcelona) and his header from near the penalty spot goes low into the middle of the net."
        },
        {
            "gameTime": "2 - 00:42",
            "label": "corner",
            "description": "The ball is out of play and Barcelona manage to earn a corner."
        },
        {
            "gameTime": "2 - 00:35",
            "label": "",
            "description": "Arda Turan (Barcelona) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have seen a few chances and nice movements, but the overall impression of the game is rather average and not hugely entertaining. The hosts were superior in their performance in the first half. They were more active and precise. The home team tries to prevail using combination football, while the away teams uses mostly counter attacks."
        },
        {
            "gameTime": "1 - 45:08",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) controls a cross inside the six yard box, but sends his shot slightly wide of the right post."
        },
        {
            "gameTime": "1 - 43:24",
            "label": "",
            "description": "Alaves take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 43:07",
            "label": "",
            "description": "One of the Barcelona players commits a holding foul and the referee reaches for his whistle."
        },
        {
            "gameTime": "1 - 42:36",
            "label": "",
            "description": "Neymar (Barcelona) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 41:54",
            "label": "",
            "description": "Barcelona have a goal ruled out for offside!"
        },
        {
            "gameTime": "1 - 39:47",
            "label": "",
            "description": "Neymar (Barcelona) blows a huge opportunity! He latches on to a perfect cross from the wing into the penalty area, but sends his bullet header just wide of the right post."
        },
        {
            "gameTime": "1 - 38:58",
            "label": "soccer-ball",
            "description": "Goal! Deyverson (Alaves) finds himself some space inside the box to get on the end of a pass from Kiko, then sends the ball low into the middle of the net. 0:1."
        },
        {
            "gameTime": "1 - 36:52",
            "label": "",
            "description": "Neymar (Barcelona) and Alcacer Paco try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 34:06",
            "label": "",
            "description": "Neymar (Barcelona) takes a mid range free kick and fires the ball into the stands. His effort flew well wide of the right post and it's going to be a goal kick."
        },
        {
            "gameTime": "1 - 33:50",
            "label": "",
            "description": "Mario Melero Lopez interrupts the game. One of the players from Alaves won the ball, but his effort is adjudged unfair. Barcelona have a free kick."
        },
        {
            "gameTime": "1 - 33:42",
            "label": "corner",
            "description": "Neymar (Barcelona) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 33:01",
            "label": "",
            "description": "Aleix Vidal (Barcelona) connects with the ball in the six yard box after the resulting free kick and shoots towards the top of the net, but Fernando Pacheco makes a magnificent save! The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 32:07",
            "label": "",
            "description": "The referee blows his whistle after Kiko (Alaves) does a good impression of a basketball player and handles the ball. Barcelona have a free kick."
        },
        {
            "gameTime": "1 - 31:54",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 30:06",
            "label": "",
            "description": "Sergio Busquets (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 29:09",
            "label": "",
            "description": "Alexis (Alaves) jumps into a tackle and Mario Melero Lopez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 28:21",
            "label": "corner",
            "description": "Neymar (Barcelona) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "1 - 27:47",
            "label": "",
            "description": "Lucas Digne (Barcelona) wastes a good opportunity as his pass into the box is blocked by the defence. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 26:31",
            "label": "",
            "description": "Arda Turan (Barcelona) sends a teasing cross into the area, but Fernando Pacheco intercepts the ball."
        },
        {
            "gameTime": "1 - 25:28",
            "label": "",
            "description": "Neymar (Barcelona) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 25:19",
            "label": "corner",
            "description": "Neymar (Barcelona) works the corner short."
        },
        {
            "gameTime": "1 - 24:56",
            "label": "",
            "description": "Aleix Vidal (Barcelona) misses a good chance to score. An inch perfect cross into the box finds Aleix Vidal (Barcelona) who rises for a header, but sends the ball well over the bar. The ball is out of play. A goal scoring opportunity from a corner for Barcelona."
        },
        {
            "gameTime": "1 - 23:34",
            "label": "",
            "description": "Mario Melero Lopez blows his whistle and it's Arda Turan (Barcelona) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 22:27",
            "label": "",
            "description": "A brilliant individual effort! Arda Turan (Barcelona) tricks his way past challenges into the box and blazes his shot just a few inches over the top."
        },
        {
            "gameTime": "1 - 21:44",
            "label": "",
            "description": "Neymar (Barcelona) swings a cross into the box, but it's far too close to Fernando Pacheco, who smothers the ball."
        },
        {
            "gameTime": "1 - 20:11",
            "label": "",
            "description": "Edgar Mendez (Alaves) attempts to surprise the keeper with a nice shot, but it lacks accuracy and goes well wide of the right post."
        },
        {
            "gameTime": "1 - 18:47",
            "label": "",
            "description": "A cross from a mid range free kick, taken by Alaves, is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 18:27",
            "label": "",
            "description": "The referee blows his whistle as Jeremy Mathieu (Barcelona) was too aggressive in his challenge. There is a free kick near the sideline to Alaves."
        },
        {
            "gameTime": "1 - 17:35",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) takes a mid range shot, but it lacks accuracy and it goes way over the bar."
        },
        {
            "gameTime": "1 - 15:48",
            "label": "",
            "description": "Denis Suarez (Barcelona) brings his opponent down. Mario Melero Lopez has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 14:23",
            "label": "corner",
            "description": "Neymar (Barcelona) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 14:12",
            "label": "",
            "description": "The ball is cleared after Denis Suarez (Barcelona) attempted to dribble past an opposing player. Barcelona earn a corner."
        },
        {
            "gameTime": "1 - 13:25",
            "label": "",
            "description": "Gomez Perez Ibai (Alaves) unleashes a shot from the edge of the box, but it goes straight at Jasper Cillessen."
        },
        {
            "gameTime": "1 - 12:31",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 11:20",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Neymar (Barcelona) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 09:20",
            "label": "",
            "description": "Lucas Digne (Barcelona) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 06:52",
            "label": "",
            "description": "Barcelona decide to take a short pass from the free kick and the attacking effort continues."
        },
        {
            "gameTime": "1 - 06:47",
            "label": "",
            "description": "A player from Alaves commits a rough challenge. Mario Melero Lopez blows for a foul and keeps the game under control."
        },
        {
            "gameTime": "1 - 03:30",
            "label": "",
            "description": "Neymar (Barcelona) thinks that he is fouled by his opponent, but the referee deems him to be the one who commits a foul and awards a free kick to the other team."
        },
        {
            "gameTime": "1 - 01:29",
            "label": "",
            "description": "Neymar (Barcelona) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 01:07",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alaves will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Mario Melero Lopez will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alaves have signed: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The latest signings for Barcelona are ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Barcelona is Lionel Messi with 9 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. Great display from the home side, you have to say that they were the better side today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        }
    ],
    "gameAwayTeam": "Alaves",
    "gameDate": "10/09/2016 - 21:30",
    "gameHomeTeam": "Barcelona",
    "gameScore": "1 - 2"
}