{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-01-31 - 22-30 Real Madrid 6 - 0 Espanyol/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The home side were dominant and dictated the tempo of the game. The tactic of the home side was slow build up play and the away side was creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 46:19",
            "label": "",
            "description": "James Rodriguez (Real Madrid) probably handled the ball."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:40",
            "label": "corner",
            "description": "Jese (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 43:27",
            "label": "",
            "description": "Isco (Real Madrid) tries to send a pass but it's blocked. Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "soccer-ball-own",
            "description": "Own goal! Oscar Duarte (Espanyol) suffers a good deal of misfortune as he accidentally puts a pass from one of the attacking players into his own net. The score is 4:0."
        },
        {
            "gameTime": "2 - 39:54",
            "label": "",
            "description": "Joan Jordan (Espanyol) stands over the free kick and opts to take it himself, sending it towards the right post only for Keylor Navas to dive and make a save."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "y-card",
            "description": "Alejandro Hernandez shows a yellow card to Casemiro (Real Madrid), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Jese finds Cristiano Ronaldo (Real Madrid), who jumps highest and steers a close range header into the right side of the goal. His effort was both strong and precise, and Giedrius Arlauskis had no chance of stopping that. 4:0."
        },
        {
            "gameTime": "2 - 35:43",
            "label": "",
            "description": "Abraham (Espanyol) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender."
        },
        {
            "gameTime": "2 - 34:07",
            "label": "attendance",
            "description": "The attendance is 65768."
        },
        {
            "gameTime": "2 - 32:02",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends in a cross from the free kick from the edge of the box. His effort is inaccurate and goes out of play."
        },
        {
            "gameTime": "2 - 31:48",
            "label": "y-card",
            "description": "Alejandro Hernandez shows the yellow card to for a heavy challenge."
        },
        {
            "gameTime": "2 - 30:46",
            "label": "corner",
            "description": "Joan Jordan (Espanyol) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 30:20",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Oscar Duarte (Espanyol). The linesman makes the right call and Espanyol will have a corner."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Karim Benzema as he is replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 28:31",
            "label": "",
            "description": "Isco (Real Madrid) attempts to whip a quick pass into the box, but Karim Benzema was not able to dribble past the opponent's defence and loses the ball."
        },
        {
            "gameTime": "2 - 27:20",
            "label": "",
            "description": "Abraham (Espanyol) gets to the rebound inside the box and shoots goalwards, but his sidefooter is blocked by an alert Keylor Navas. What a save!"
        },
        {
            "gameTime": "2 - 26:19",
            "label": "",
            "description": "Alejandro Hernandez interrupts the game for a tactical foul by Alvaro Gonzalez (Espanyol)."
        },
        {
            "gameTime": "2 - 24:48",
            "label": "substitution",
            "description": "It will be a substitution. Casemiro (Real Madrid) is ready to enter the pitch as Toni Kroos walks off."
        },
        {
            "gameTime": "2 - 24:31",
            "label": "",
            "description": "The free kick from a promising distance is taken by Cristiano Ronaldo (Real Madrid), who fires in a direct effort inches over the crossbar. What a chance!"
        },
        {
            "gameTime": "2 - 23:04",
            "label": "",
            "description": "Referee Alejandro Hernandez sees the trip by and doesn't hesitate to blow his whistle. Another situation results in a direct free kick for Real Madrid."
        },
        {
            "gameTime": "2 - 21:49",
            "label": "",
            "description": "Jese (Real Madrid) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 19:25",
            "label": "",
            "description": "Mamadou Sylla (Espanyol) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 17:49",
            "label": "substitution",
            "description": "Zinedine Zidane prepares a substitution. Luka Modric is replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 16:44",
            "label": "",
            "description": "Karim Benzema (Real Madrid) is strong enough to get to the ball and produces a header from close range. Even though it was aimed precisely towards the middle of the goal, Giedrius Arlauskis didn't have a hard time stopping the attempt as it wasn't powerful enough."
        },
        {
            "gameTime": "2 - 15:53",
            "label": "",
            "description": "Isco (Real Madrid) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "",
            "description": "Luka Modric (Real Madrid) sends a cross in and finds Daniel Carvajal inside the box, but one of the defenders steps in and clears the danger."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "substitution",
            "description": "Abraham (Espanyol) joins the action as a substitute, replacing Victor Sanchez."
        },
        {
            "gameTime": "2 - 10:40",
            "label": "",
            "description": "Close! Isco (Real Madrid) unleashes a rocket of a shot from the edge of the box and his shot flies just a few inches over the crossbar."
        },
        {
            "gameTime": "2 - 09:54",
            "label": "",
            "description": "Juan Rafael Fuentes (Espanyol) has a sight of goal, fires a shot in from distance towards the bottom right corner and forces a good save out of Keylor Navas."
        },
        {
            "gameTime": "2 - 08:06",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) swings a cross into the box, but it's far too close to Giedrius Arlauskis, who smothers the ball."
        },
        {
            "gameTime": "2 - 07:30",
            "label": "",
            "description": "Marcelo (Real Madrid) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "2 - 06:45",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) passes the ball onto Karim Benzema, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "2 - 05:44",
            "label": "",
            "description": "Pape Diop (Espanyol) makes a slide tackle, but referee Alejandro Hernandez blows for a foul."
        },
        {
            "gameTime": "2 - 02:47",
            "label": "",
            "description": "Marcelo (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 00:13",
            "label": "",
            "description": "The players are on the pitch and Real Madrid will have the kick off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Constantin Galca makes a half time substitution. Juan Rafael Fuentes (Espanyol) comes on in place of Ruben Duarte."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The game is over for Salva Sevilla. Oscar Duarte (Espanyol) comes on for the second half."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. The hosts are mostly controlling the match and making it pretty tough for the opposition to keep up. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 45:44",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 44:54",
            "label": "soccer-ball",
            "description": "Goal! Cristiano Ronaldo (Real Madrid) weaves his way past opponents, and he unleashes a magnificent effort from the edge of the box inside the left post. Giedrius Arlauskis had no chance of reaching it. The score is 4:0."
        },
        {
            "gameTime": "1 - 44:25",
            "label": "",
            "description": "Keylor Navas pulls off a great save to deny Salva Sevilla (Espanyol) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "y-card",
            "description": "The foul by Mamadou Sylla (Espanyol) is worthy of a card and a yellow is duly shown by Alejandro Hernandez."
        },
        {
            "gameTime": "1 - 41:40",
            "label": "y-card",
            "description": "Javi Lopez (Espanyol) is punished with the yellow card."
        },
        {
            "gameTime": "1 - 41:00",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Toni Kroos (Real Madrid). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 40:53",
            "label": "",
            "description": "James Rodriguez (Real Madrid) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players. Real Madrid get a corner."
        },
        {
            "gameTime": "1 - 40:28",
            "label": "",
            "description": "Isco (Real Madrid) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 39:44",
            "label": "",
            "description": "Mamadou Sylla (Espanyol) trips an opponent with a slide tackle. Alejandro Hernandez stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 37:40",
            "label": "",
            "description": "Salva Sevilla (Espanyol) attempts to find one of his teammates with a free kick, but the defence is well positioned and clears the ball away from danger."
        },
        {
            "gameTime": "1 - 36:51",
            "label": "y-card",
            "description": "Alejandro Hernandez shows a yellow card to Pape Diop (Espanyol) for a tough tackle."
        },
        {
            "gameTime": "1 - 35:42",
            "label": "",
            "description": "A cross is whipped into the box by Marcelo (Real Madrid) and Karim Benzema controls it well. He lines up the ball, but one of the defenders produces a timely intervention."
        },
        {
            "gameTime": "1 - 33:41",
            "label": "",
            "description": "James Rodriguez (Real Madrid) takes the free kick and curls the ball just over the crossbar. That was close!"
        },
        {
            "gameTime": "1 - 32:33",
            "label": "",
            "description": "Joan Jordan (Espanyol) trips an opposition player and Alejandro Hernandez signals a foul. Real Madrid will take a free kick."
        },
        {
            "gameTime": "1 - 32:06",
            "label": "",
            "description": "Marcelo (Real Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 30:21",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Daniel Carvajal (Real Madrid), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "1 - 29:28",
            "label": "",
            "description": "Salva Sevilla (Espanyol) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 27:17",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) sends a short pass into the box, Daniel Carvajal takes a touch to control the ball, but one of the defenders robs him of it and clears to safety."
        },
        {
            "gameTime": "1 - 26:32",
            "label": "",
            "description": "Raphael Varane (Real Madrid) plays a long ball to Isco, but the defence is well organised and manages to get it clear."
        },
        {
            "gameTime": "1 - 24:59",
            "label": "",
            "description": "Poor challenge! Raphael Varane (Real Madrid) is penalised for tripping and Alejandro Hernandez blows his whistle."
        },
        {
            "gameTime": "1 - 23:07",
            "label": "",
            "description": "Karim Benzema (Real Madrid) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 21:58",
            "label": "",
            "description": "Mamadou Sylla (Espanyol) jumps into a tackle and Alejandro Hernandez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 20:35",
            "label": "",
            "description": "Hernan Perez (Espanyol) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 18:14",
            "label": "",
            "description": "What a big chance! Hernan Perez (Espanyol) picks up an inch perfect pass inside the box and skies the ball well over the bar."
        },
        {
            "gameTime": "1 - 17:28",
            "label": "",
            "description": "CHANCE! Isco finds Karim Benzema (Real Madrid) with a sweet pass, but he can't find the target as his effort from inside the box goes just wide of the left post!"
        },
        {
            "gameTime": "1 - 15:35",
            "label": "soccer-ball",
            "description": "It's in the back of the net! James Rodriguez (Real Madrid) tries his luck from the edge of the box and his shot takes a deflection and goes past the stranded Giedrius Arlauskis. He makes it 3:0."
        },
        {
            "gameTime": "1 - 13:03",
            "label": "",
            "description": "James Rodriguez (Real Madrid) whips the ball into the box and Karim Benzema takes a perfect touch to control it, but one of the defenders does well to intercept."
        },
        {
            "gameTime": "1 - 11:07",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) steps up and confidently powers the spot kick into the bottom left corner."
        },
        {
            "gameTime": "1 - 10:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 10:51",
            "label": "y-card",
            "description": "Hernan Perez (Espanyol) kept talking out of turn to the referee until Alejandro Hernandez lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "1 - 10:25",
            "label": "penalty",
            "description": "Enzo Roco (Espanyol) fouls an opponent. At least that's what referee Alejandro Hernandez signals. PENALTY to Real Madrid! Great chance to score."
        },
        {
            "gameTime": "1 - 09:39",
            "label": "",
            "description": "Real Madrid keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 07:00",
            "label": "soccer-ball",
            "description": "James Rodriguez produces a beautiful lofted cross into the box, where Karim Benzema (Real Madrid) rises high to head the ball into the left side of the goal and beyond the goalkeeper. He makes it 1:0."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "Isco (Real Madrid) finds himself with a great opportunity! He unleashes a shot from the edge of the box, which whizzes just wide of the right post!"
        },
        {
            "gameTime": "1 - 05:12",
            "label": "corner",
            "description": "A dangerous looking corner kick from Toni Kroos (Real Madrid) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 04:59",
            "label": "",
            "description": "A lofted cross from Isco (Real Madrid) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Real Madrid win a corner."
        },
        {
            "gameTime": "1 - 02:49",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) shoots from the edge of the penalty area. The ball travels low towards the middle of the target, but Giedrius Arlauskis easily deals with the threat."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "",
            "description": "Marcelo (Real Madrid) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just over the crossbar."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Alejandro Hernandez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The home side were dominant and dictated the tempo of the game. The tactic of the home side was slow build up play and the away side was creating their opportunities using lightning fast counter attacks."
        }
    ],
    "gameAwayTeam": "Espanyol",
    "gameDate": "31/01/2016 - 22:30",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "6 - 0"
}