{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-10-29 - 14-30 Sunderland 1 - 4 Arsenal/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The fans can't complain about what they saw on the pitch as both sides displayed a highly captivating football match. The Arsenal fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The home team really focused on a well organized defence, while the away team played possession football."
        },
        {
            "gameTime": "2 - 48:16",
            "label": "whistle",
            "description": "That's it for today, Martin Atkinson has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 47:30",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) takes a rebound on the edge of the box and slams the ball well wide of the right post."
        },
        {
            "gameTime": "2 - 47:08",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) pulls the jersey of one of the opposition players and Martin Atkinson blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 45:07",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner, but it's intercepted by the defender. Arsenal have a corner."
        },
        {
            "gameTime": "2 - 44:29",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. Arsenal will take a corner kick."
        },
        {
            "gameTime": "2 - 43:34",
            "label": "substitution",
            "description": "Here's the change. Francis Coquelin leaves the pitch and Ainsley Maitland Niles (Arsenal) comes on as a substitute."
        },
        {
            "gameTime": "2 - 43:12",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Sunderland was in an offside position."
        },
        {
            "gameTime": "2 - 41:26",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) chips a pass over the line of defenders to get the ball to Olivier Giroud, but his attempt is intercepted and cleared."
        },
        {
            "gameTime": "2 - 41:02",
            "label": "funfact",
            "description": "The up to date shots on target statistics – 1:7."
        },
        {
            "gameTime": "2 - 38:37",
            "label": "substitution",
            "description": "The substitution is prepared. Lynden Gooch (Sunderland) joins the action as a substitute, replacing Duncan Watmore."
        },
        {
            "gameTime": "2 - 37:38",
            "label": "",
            "description": "Arsenal control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 34:52",
            "label": "y-card",
            "description": "Kieran Gibbs (Arsenal) shouldn't be surprised it's a yellow from the ref, who cooled the situation down well."
        },
        {
            "gameTime": "2 - 33:58",
            "label": "attendance",
            "description": "The attendance for today's match is 44322."
        },
        {
            "gameTime": "2 - 32:36",
            "label": "soccer-ball",
            "description": "Goal! Alexis Sanchez (Arsenal) was in the right place at the right time to pounce on the rebound inside the box and gleefully rifles the ball home. It's 1:4."
        },
        {
            "gameTime": "2 - 32:30",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) picks up an accurate pass inside the box and unleashes a shot goalwards that smashes against the left post. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "2 - 31:52",
            "label": "substitution",
            "description": "Arsene Wenger has decided to make a change. Aaron Ramsey (Arsenal) replaces Alex Oxlade Chamberlain."
        },
        {
            "gameTime": "2 - 30:44",
            "label": "soccer-ball",
            "description": "Olivier Giroud (Arsenal) connects with the ball from the resulting corner and places a precise header past the stranded goalkeeper and into the top left corner. The opposing players are staring at each other, unable to understand what happened. Who will take the blame for that one? Olivier Giroud (Arsenal) has a reason to celebrate!"
        },
        {
            "gameTime": "2 - 30:30",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) will take a corner kick."
        },
        {
            "gameTime": "2 - 30:09",
            "label": "",
            "description": "Mesut Ozil (Arsenal) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort. The linesman makes the right call and Arsenal will have a corner."
        },
        {
            "gameTime": "2 - 28:59",
            "label": "",
            "description": "Martin Atkinson has a clear sight and sees a foul from Adnan Januzaj (Sunderland). Arsenal have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 28:47",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner."
        },
        {
            "gameTime": "2 - 28:32",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. The ball is out of play and Arsenal manage to earn a corner."
        },
        {
            "gameTime": "2 - 27:39",
            "label": "",
            "description": "One of the players from Sunderland times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 25:58",
            "label": "soccer-ball",
            "description": "Olivier Giroud (Arsenal) meets a perfect cross from Kieran Gibbs deep inside the box and controls it with a nice first touch. He produces an accurate strike inside the right post. The score is 1:2."
        },
        {
            "gameTime": "2 - 24:49",
            "label": "substitution",
            "description": "David William Moyes has decided to introduce fresh legs, with Adnan Januzaj (Sunderland) replacing Steven Pienaar."
        },
        {
            "gameTime": "2 - 24:32",
            "label": "",
            "description": "Laurent Koscielny (Arsenal) is quickest inside the box and leaps to connect with the resulting set piece. He produces a fine header, but it floats just over the crossbar."
        },
        {
            "gameTime": "2 - 24:05",
            "label": "corner",
            "description": "Alex Oxlade Chamberlain (Arsenal) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 23:54",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Olivier Giroud (Arsenal) replaces Alex Iwobi."
        },
        {
            "gameTime": "2 - 23:21",
            "label": "",
            "description": "The Arsenal players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition. Arsenal get a corner."
        },
        {
            "gameTime": "2 - 20:30",
            "label": "y-card",
            "description": "Alexis Sanchez (Arsenal) is cautioned by the referee."
        },
        {
            "gameTime": "2 - 19:57",
            "label": "soccer-ball",
            "description": "Jermain Defoe (Sunderland) leaves the keeper helpless with his precise penalty shot inside the right post."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "",
            "description": "Jermain Defoe (Sunderland) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 18:52",
            "label": "y-card",
            "description": "The whistle blows and Petr Cech (Arsenal) is booked for an infringement."
        },
        {
            "gameTime": "2 - 18:50",
            "label": "penalty",
            "description": "Petr Cech (Arsenal) trips an opposition player and Martin Atkinson signals a foul. The crowd is going crazy! The referee makes a call and gives the penalty to Sunderland."
        },
        {
            "gameTime": "2 - 18:43",
            "label": "",
            "description": "A pass by Mesut Ozil (Arsenal) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 16:17",
            "label": "",
            "description": "What a big chance! Alex Oxlade Chamberlain (Arsenal) picks up an inch perfect pass inside the box and fires the ball well wide of the left post."
        },
        {
            "gameTime": "2 - 15:25",
            "label": "",
            "description": "Wahbi Khazri (Sunderland) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 13:36",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the left post."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) is caught offside, but it was a really close call."
        },
        {
            "gameTime": "2 - 11:44",
            "label": "",
            "description": "Duncan Watmore (Sunderland) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort."
        },
        {
            "gameTime": "2 - 11:29",
            "label": "",
            "description": "What a miskick by Francis Coquelin (Arsenal). He smashes a volley from long distance that goes into the stands."
        },
        {
            "gameTime": "2 - 10:58",
            "label": "",
            "description": "Mesut Ozil (Arsenal) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 07:52",
            "label": "",
            "description": "Jermain Defoe (Sunderland) makes his forward run a little too early and is caught in an offside position after his teammate tries to play a pass to him."
        },
        {
            "gameTime": "2 - 06:23",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Wahbi Khazri (Sunderland), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "2 - 05:38",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement. Sunderland win a free kick."
        },
        {
            "gameTime": "2 - 04:09",
            "label": "",
            "description": "Good defending. Shkodran Mustafi (Arsenal) tries to find Alexis Sanchez inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 02:57",
            "label": "y-card",
            "description": "Papy Djilobodji (Sunderland) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 02:50",
            "label": "",
            "description": "Papy Djilobodji (Sunderland) was too fierce in his attempt to get the ball from his opponent and Martin Atkinson blows for a foul."
        },
        {
            "gameTime": "2 - 02:22",
            "label": "",
            "description": "Duncan Watmore (Sunderland) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The linesman signals a throw in for Arsenal."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. The visiting team dominated in most aspects of the game and the home side struggled to keep up. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 47:20",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:52",
            "label": "",
            "description": "Alex Iwobi (Arsenal) receives a precise pass on the edge of the box and has an effort on goal. Unfortunately for him, his strike flies inches high over the bar."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "1 - 43:43",
            "label": "",
            "description": "Mesut Ozil (Arsenal) plays in a hopeful cross, but it doesn't find its way to any of the attacking players. The ball goes out of play and Sunderland will have a goal kick."
        },
        {
            "gameTime": "1 - 43:07",
            "label": "",
            "description": "Arsenal hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 41:12",
            "label": "substitution",
            "description": "John O'Shea just cannot continue due to injury and has to be substituted. Papy Djilobodji (Sunderland) replaces him."
        },
        {
            "gameTime": "1 - 40:31",
            "label": "y-card",
            "description": "Yellow card. Steven Pienaar (Sunderland) goes into the referee's book after a bad challenge."
        },
        {
            "gameTime": "1 - 40:20",
            "label": "",
            "description": "Martin Atkinson blows his whistle after Steven Pienaar (Sunderland) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 37:52",
            "label": "",
            "description": "Mesut Ozil (Arsenal) wastes a huge opportunity! He receives a precise cross inside the penalty area and releases a quick shot that sails towards the middle of a goal. His effort, however, lacks power and the goalkeeper makes a comfortable save."
        },
        {
            "gameTime": "1 - 36:26",
            "label": "",
            "description": "Martin Atkinson blows his whistle for a foul after Lamine Kone (Sunderland) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 35:41",
            "label": "",
            "description": "Mohamed Elneny (Arsenal) commits a rough foul. Martin Atkinson stops the game and makes a call."
        },
        {
            "gameTime": "1 - 34:50",
            "label": "",
            "description": "What an amazing save by Jordan Pickford! Alex Oxlade Chamberlain (Arsenal) swirls around the defenders and attempts to beat the keeper with a close range shot low towards the middle of the target, but fails."
        },
        {
            "gameTime": "1 - 34:05",
            "label": "",
            "description": "Mohamed Elneny (Arsenal) receives a pass and fires a shot in from long range, but it's blocked."
        },
        {
            "gameTime": "1 - 33:21",
            "label": "",
            "description": "Jack Rodwell (Sunderland) swings a cross into the box, but it's far too close to Petr Cech, who smothers the ball."
        },
        {
            "gameTime": "1 - 32:24",
            "label": "y-card",
            "description": "Didier Ndong (Sunderland) has tested the patience of referee Martin Atkinson and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 32:08",
            "label": "",
            "description": "Didier Ndong (Sunderland) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 30:48",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) produces a shot from a direct free kick on the edge of the box. His effort sails narrowly over the crossbar. The goalkeeper was lucky there."
        },
        {
            "gameTime": "1 - 29:59",
            "label": "y-card",
            "description": "Martin Atkinson shows a yellow card to Wahbi Khazri (Sunderland) for his blatant foul."
        },
        {
            "gameTime": "1 - 29:59",
            "label": "",
            "description": "Martin Atkinson blows the whistle, Wahbi Khazri (Sunderland) is penalised for a foul. Arsenal win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 27:55",
            "label": "",
            "description": "Martin Atkinson blows his whistle and signals a foul after Steven Pienaar (Sunderland) brought his opponent down."
        },
        {
            "gameTime": "1 - 27:37",
            "label": "",
            "description": "Wahbi Khazri (Sunderland) sends in a lofted cross from a mid range free kick. His effort, however, goes out of play."
        },
        {
            "gameTime": "1 - 27:05",
            "label": "",
            "description": "Mesut Ozil (Arsenal) is penalised for holding. Martin Atkinson signals a set piece. A free kick has been awarded to Sunderland."
        },
        {
            "gameTime": "1 - 25:47",
            "label": "",
            "description": "Alex Iwobi (Arsenal) creates some space for himself to pick up a pass on the edge of the box and unleashes a decent strike which goes a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 25:21",
            "label": "",
            "description": "Billy Jones (Sunderland) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 23:45",
            "label": "",
            "description": "Wahbi Khazri (Sunderland) is in a clear offside position and the referee blows his whistle after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 23:19",
            "label": "",
            "description": "Billy Jones (Sunderland) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "1 - 22:16",
            "label": "",
            "description": "Duncan Watmore (Sunderland) races towards goal but the defender gets back well to make a challenge. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "1 - 20:45",
            "label": "",
            "description": "The free kick from the edge of the box is taken by Patrick van Aanholt (Sunderland), who fires in a direct effort just wide of the right post. What a chance!"
        },
        {
            "gameTime": "1 - 19:44",
            "label": "",
            "description": "The referee blows his whistle as Francis Coquelin (Arsenal) was too aggressive in his challenge. Another situation results in a direct free kick for Sunderland."
        },
        {
            "gameTime": "1 - 18:25",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Alex Oxlade Chamberlain finds Alexis Sanchez (Arsenal), who jumps highest and steers a close range header into the left side of the goal. His effort was both strong and precise, and Jordan Pickford had no chance of stopping that. 0:0."
        },
        {
            "gameTime": "1 - 15:34",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Martin Atkinson with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 14:40",
            "label": "",
            "description": "Mesut Ozil (Arsenal) attempted to send a defence splitting pass into space where Mohamed Elneny was lurking. It could have put him one on one with the goalkeeper, but one of the defending players somehow manages to avert the threat."
        },
        {
            "gameTime": "1 - 13:32",
            "label": "",
            "description": "Francis Coquelin (Arsenal) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 12:40",
            "label": "",
            "description": "Mesut Ozil (Arsenal) takes a great touch after receiving a pass inside the box. He immediately unleashes a low shot to the middle of the goal, but the keeper pulls off a decent save!"
        },
        {
            "gameTime": "1 - 11:14",
            "label": "",
            "description": "Hector Bellerin (Arsenal) should know this behaviour is beyond the rules. He was too careless with his challenge and left Martin Atkinson no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 09:45",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) swings in a cross from the corner, but Jordan Pickford reads it well and gathers the ball."
        },
        {
            "gameTime": "1 - 09:14",
            "label": "corner",
            "description": "Mohamed Elneny (Arsenal) takes the corner, but the opposition's defence is ready and clears the ball to safety. It will be a corner kick for Arsenal."
        },
        {
            "gameTime": "1 - 08:42",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) sends a pass into the box, but his attempt is thwarted and cleared. The ball is out of play. Arsenal win a corner kick."
        },
        {
            "gameTime": "1 - 06:44",
            "label": "",
            "description": "Billy Jones (Sunderland) sends a chip pass into the box, but Petr Cech is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 05:05",
            "label": "",
            "description": "One of the Arsenal players tripped an opponent and conceded a foul."
        },
        {
            "gameTime": "1 - 04:44",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Mesut Ozil (Arsenal), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 04:21",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) rises high to head a nice lofted cross towards the top left corner. Unfortunately for him, his close range effort lacks pace and Jordan Pickford makes a comfortable save. The referee and one of his assistants signal for a corner kick to Arsenal."
        },
        {
            "gameTime": "1 - 03:03",
            "label": "",
            "description": "A spell of possession for Arsenal in an attempt to control the game."
        },
        {
            "gameTime": "1 - 02:05",
            "label": "",
            "description": "The linesman raises his flag. Duncan Watmore (Sunderland) is adjudged offside."
        },
        {
            "gameTime": "1 - 00:51",
            "label": "",
            "description": "The game is interrupted, a clear handball by Alexis Sanchez (Arsenal)."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Arsenal will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Martin Atkinson."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Arsenal have not lost for 8 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alexis Sanchez has already scored 12 goals and he is the top goal scorer for Arsenal in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jermain Defoe from Sunderland will look to add to his goal tally, he has netted 4 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans can't complain about what they saw on the pitch as both sides displayed a highly captivating football match. The Arsenal fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The home team really focused on a well organized defence, while the away team played possession football."
        }
    ],
    "gameAwayTeam": "Arsenal",
    "gameDate": "29/10/2016 - 14:30",
    "gameHomeTeam": "Sunderland",
    "gameScore": "1 - 4"
}