{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2014-2015/2015-04-25 - 19-30 Bayern Munich 1 - 0 Hertha Berlin/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. This has been a real cat and mouse game, with the hosts coming out on top. The home team played possession football and the away players really focused on a well organized defence."
        },
        {
            "gameTime": "2 - 47:38",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:38",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) chips a pass over the line of defenders to get the ball to Claudio Pizarro, but his attempt is intercepted and cleared."
        },
        {
            "gameTime": "2 - 45:46",
            "label": "",
            "description": "Marcel N'Djeng (Hertha Berlin) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:41",
            "label": "",
            "description": "Guido Winkmann has a clear sight and sees a foul from Dante (Bayern Munich). Hertha Berlin have been awarded a free kick."
        },
        {
            "gameTime": "2 - 42:57",
            "label": "",
            "description": "Bastian Schweinsteiger (Bayern Munich) produced a promising shot low towards the middle of the goal after his wonderful solo run, but Sascha Burchert thwarted him with a fabulous save and the score remains the same."
        },
        {
            "gameTime": "2 - 41:31",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Sascha Burchert was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 40:33",
            "label": "",
            "description": "Jens Hegeler (Hertha Berlin) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 39:13",
            "label": "attendance",
            "description": "The attendance is 75000."
        },
        {
            "gameTime": "2 - 38:25",
            "label": "",
            "description": "Sebastian Langkamp (Hertha Berlin) brings an opponent down and Guido Winkmann interrupts the game. That's a free kick to Bayern Munich."
        },
        {
            "gameTime": "2 - 37:38",
            "label": "",
            "description": "Genki Haraguchi (Hertha Berlin) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "2 - 37:16",
            "label": "substitution",
            "description": "It will be a substitution. Sandro Wagner (Hertha Berlin) is ready to enter the pitch as Nico Schulz walks off."
        },
        {
            "gameTime": "2 - 34:37",
            "label": "soccer-ball",
            "description": "Goal! Mitchell Weiser provides Bastian Schweinsteiger (Bayern Munich) with a nice pass inside the box. It allows him to finish with a precise effort into the top right corner. 1:0."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "",
            "description": "Bastian Schweinsteiger (Bayern Munich) latches on to a superb cross into the box and hits the right post with his header. A stroke of luck for the goalkeeper!"
        },
        {
            "gameTime": "2 - 32:02",
            "label": "",
            "description": "Bastian Schweinsteiger (Bayern Munich) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but he sent it well over the bar."
        },
        {
            "gameTime": "2 - 31:44",
            "label": "corner",
            "description": "Corner kick. Thiago Alcantara (Bayern Munich) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 31:13",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) outjumps the defence to meet the resulting corner and heads the ball towards the right side of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save. Bayern Munich force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 30:57",
            "label": "corner",
            "description": "Thiago Alcantara (Bayern Munich) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 30:42",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) fails to find any of his teammates inside the box as his pass is blocked. The ball goes out for a corner. Bayern Munich can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 30:14",
            "label": "corner",
            "description": "Sinan Kurt (Bayern Munich) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 29:57",
            "label": "substitution",
            "description": "That will be all from Mario Gotze who is being replaced by the fresh legs of Claudio Pizarro (Bayern Munich)."
        },
        {
            "gameTime": "2 - 29:22",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) attempts a long crossfield pass, but the defence does well to intercept the ball. The ball is out of play and the linesman points at the corner flag. Corner to Bayern Munich."
        },
        {
            "gameTime": "2 - 28:39",
            "label": "",
            "description": "A cross is clipped into the penalty area by Jerome Boateng (Bayern Munich) but poses no threat."
        },
        {
            "gameTime": "2 - 27:29",
            "label": "substitution",
            "description": "Substitution. Valentin Stocker makes way for Jens Hegeler (Hertha Berlin)."
        },
        {
            "gameTime": "2 - 27:05",
            "label": "",
            "description": "The ball is cleared after Mario Gotze (Bayern Munich) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 25:49",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) should know this behaviour is beyond the rules. He was too careless with his challenge and left Guido Winkmann no option but to blow his whistle."
        },
        {
            "gameTime": "2 - 25:30",
            "label": "",
            "description": "A cross is whipped into the box by Jerome Boateng (Bayern Munich) and Robert Lewandowski controls it well. He lines up the ball, but one of the defenders produces a timely intervention."
        },
        {
            "gameTime": "2 - 24:18",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) sends a cross into the box, but Sascha Burchert comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 23:22",
            "label": "",
            "description": "A poorly executed mid range free kick by Marvin Plattenhardt (Hertha Berlin) as he fails to deliver a decent cross."
        },
        {
            "gameTime": "2 - 22:45",
            "label": "",
            "description": "Guido Winkmann blows his whistle and signals a foul after Mitchell Weiser (Bayern Munich) brought his opponent down. It's a free kick to Hertha Berlin, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "2 - 22:14",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) tries his luck with a low long range effort after receiving a precise pass, but Sascha Burchert has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 21:19",
            "label": "substitution",
            "description": "Pep Guardiola prepares a substitution. Thomas Muller is replaced by Thiago Alcantara (Bayern Munich)."
        },
        {
            "gameTime": "2 - 20:44",
            "label": "substitution",
            "description": "We are about to witness a substitution. Marcel N'Djeng (Hertha Berlin) is replacing Salomon Kalou."
        },
        {
            "gameTime": "2 - 19:04",
            "label": "",
            "description": "That's a well taken pass by Robert Lewandowski (Bayern Munich). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 18:34",
            "label": "corner",
            "description": "The resulting corner from Sinan Kurt (Bayern Munich) is cleared by the defence."
        },
        {
            "gameTime": "2 - 18:27",
            "label": "",
            "description": "A pass from Sinan Kurt (Bayern Munich) is intercepted by Sascha Burchert and the move breaks down. Bayern Munich will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 16:54",
            "label": "y-card",
            "description": "Salomon Kalou (Hertha Berlin) got a yellow card."
        },
        {
            "gameTime": "2 - 16:20",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Philipp Lahm (Bayern Munich), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 15:15",
            "label": "",
            "description": "Bayern Munich hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 13:24",
            "label": "",
            "description": "Sinan Kurt (Bayern Munich) sends a low pass from outside the box to Robert Lewandowski. He lines up a shot, but the defence intercepts at the last moment."
        },
        {
            "gameTime": "2 - 10:25",
            "label": "",
            "description": "A player from Bayern Munich brings down an opponent and commits a foul."
        },
        {
            "gameTime": "2 - 09:55",
            "label": "corner",
            "description": "Marvin Plattenhardt (Hertha Berlin) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 09:22",
            "label": "",
            "description": "Nico Schulz (Hertha Berlin) zig zags his way into the box and drills a low shot towards the left post, but the goalkeeper pulls off a superb stop. Now Hertha Berlin have a corner."
        },
        {
            "gameTime": "2 - 08:39",
            "label": "",
            "description": "Valentin Stocker (Hertha Berlin) dribbled past his opponents before finding himself in a great position to strike. His attempt from just outside of the box went towards the bottom left corner, but it wasn't dangerous and Manuel Neuer made a comfortable save."
        },
        {
            "gameTime": "2 - 07:47",
            "label": "",
            "description": "Neat link up play between Sinan Kurt (Bayern Munich) and Thomas Muller, but Sascha Burchert reads the game well and the move breaks down."
        },
        {
            "gameTime": "2 - 07:01",
            "label": "",
            "description": "Mitchell Weiser (Bayern Munich) swings a cross into the box, but it's far too close to Sascha Burchert, who smothers the ball."
        },
        {
            "gameTime": "2 - 06:41",
            "label": "",
            "description": "The ball is behind the sideline. Manuel Neuer (Bayern Munich) takes a throw in."
        },
        {
            "gameTime": "2 - 05:37",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) dribbles into the box, but Sascha Burchert is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 04:39",
            "label": "",
            "description": "Per Skjelbred (Hertha Berlin) is able to continue to play."
        },
        {
            "gameTime": "2 - 04:01",
            "label": "injury",
            "description": "Per Skjelbred (Hertha Berlin) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 03:17",
            "label": "",
            "description": "Nico Schulz (Hertha Berlin) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 02:45",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) makes a run beyond the last defender, but he's offside."
        },
        {
            "gameTime": "2 - 02:17",
            "label": "",
            "description": "One of the Hertha Berlin players unfairly tackled his opponent and conceded a foul."
        },
        {
            "gameTime": "2 - 01:39",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) feels very aggrieved after the referee stops play for a foul that he commits while in possession of the ball."
        },
        {
            "gameTime": "2 - 01:28",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) looks to break free, but an opposing player clears the ball away. The linesman signals a throw in for Bayern Munich."
        },
        {
            "gameTime": "2 - 00:54",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here comes a substitution. Gianluca Gaudino is given a rest as he is replaced by Sinan Kurt (Bayern Munich)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The players are likely to put the fans to sleep with this performance rather than receiving any vociferous support. Let's hope we are about to see an improvement in the second half. The home side is in control of this game. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 45:08",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:32",
            "label": "",
            "description": "Peter Pekarik (Hertha Berlin) is picked out by one of his teammates with a brilliant low pass, but he doesn't control the ball well and the defence eliminates the danger without any problem. That should have been a goalscoring opportunity."
        },
        {
            "gameTime": "1 - 42:52",
            "label": "",
            "description": "Marvin Plattenhardt (Hertha Berlin) takes the free kick from a long way out but the defender manages to get it clear."
        },
        {
            "gameTime": "1 - 42:03",
            "label": "",
            "description": "Mitchell Weiser (Bayern Munich) trips an opponent with a slide tackle. Guido Winkmann stops the game and he could give him a card, but eventually decides on just a warning. Hertha Berlin have a free kick."
        },
        {
            "gameTime": "1 - 41:38",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball is out of play. Bayern Munich will have a throw in."
        },
        {
            "gameTime": "1 - 40:28",
            "label": "",
            "description": "Gianluca Gaudino (Bayern Munich) and Mitchell Weiser matched up again to find some space for an unmarked teammate."
        },
        {
            "gameTime": "1 - 39:15",
            "label": "",
            "description": "Valentin Stocker (Hertha Berlin) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 38:29",
            "label": "",
            "description": "Gianluca Gaudino (Bayern Munich) makes a rough challenge and Guido Winkmann blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 37:59",
            "label": "",
            "description": "A pass by Jerome Boateng (Bayern Munich) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 35:55",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) sends a superb lead pass into the penalty area and finds Thomas Muller, who fails to shoot."
        },
        {
            "gameTime": "1 - 34:51",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Philipp Lahm (Bayern Munich)."
        },
        {
            "gameTime": "1 - 34:04",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "1 - 33:03",
            "label": "",
            "description": "Gianluca Gaudino (Bayern Munich) attempts to feed Thomas Muller with a chip pass, but Sascha Burchert reacts well and comes off his line to intercept."
        },
        {
            "gameTime": "1 - 32:26",
            "label": "",
            "description": "Marvin Plattenhardt (Hertha Berlin) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 31:37",
            "label": "",
            "description": "Guido Winkmann blows his whistle for a foul after Gianluca Gaudino (Bayern Munich) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 31:06",
            "label": "",
            "description": "This shall not pass! Mario Gotze (Bayern Munich) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 30:31",
            "label": "",
            "description": "Peter Pekarik (Hertha Berlin) sends in a lofted cross from a long range free kick, but it goes out of play."
        },
        {
            "gameTime": "1 - 29:53",
            "label": "",
            "description": "Dante (Bayern Munich) didn't hesitate to knock his opponent down with a harsh sliding tackle. Guido Winkmann could probably show him a yellow, but he only goes with blowing the whistle for a foul. Hertha Berlin will take a free kick."
        },
        {
            "gameTime": "1 - 29:23",
            "label": "",
            "description": "Mitchell Weiser (Bayern Munich) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "1 - 28:03",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) smashes the ball upfield and Mitchell Weiser controls it with a great first touch."
        },
        {
            "gameTime": "1 - 26:55",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) is clearly in an offside position and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) takes the ball and sets it for the free kick. Dante (Bayern Munich) is penalised for a foul. Guido Winkmann had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 23:49",
            "label": "",
            "description": "Per Skjelbred (Hertha Berlin) with a slide tackle, but referee Guido Winkmann calls for a foul. A free kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 23:36",
            "label": "",
            "description": "Salomon Kalou (Hertha Berlin) skips perfectly past challenges but misdirects his shot from the edge of the box. The ball flies a few yards over the bar."
        },
        {
            "gameTime": "1 - 22:23",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "1 - 21:09",
            "label": "",
            "description": "Valentin Stocker (Hertha Berlin) whips the ball into the box and Salomon Kalou takes a perfect touch to control it, but one of the defenders does well to intercept."
        },
        {
            "gameTime": "1 - 19:54",
            "label": "",
            "description": "Genki Haraguchi (Hertha Berlin) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 19:00",
            "label": "",
            "description": "Mitchell Weiser (Bayern Munich) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 17:10",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) receives a low pass just outside the box and unleashes a fine strike towards the bottom right corner. Sascha Burchert pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 16:32",
            "label": "",
            "description": "Gianluca Gaudino (Bayern Munich) picks up a pass and hits the ball towards goal, but he can't generate enough power to trouble Sascha Burchert."
        },
        {
            "gameTime": "1 - 16:03",
            "label": "corner",
            "description": "Mitchell Weiser (Bayern Munich) sends over a poor, overhit cross from the corner kick and the ball goes out of play."
        },
        {
            "gameTime": "1 - 15:50",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) races towards goal but the defender gets back well to make a challenge. Bayern Munich force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 13:10",
            "label": "",
            "description": "Philipp Lahm clips a neat ball into the box towards Thomas Muller (Bayern Munich), whose header from the centre of the box goes a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 11:49",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is off of the pitch and it's a goal kick for Hertha Berlin."
        },
        {
            "gameTime": "1 - 10:19",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 10:10",
            "label": "",
            "description": "Bayern Munich hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 09:01",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates. It's a throw in for Hertha Berlin."
        },
        {
            "gameTime": "1 - 08:20",
            "label": "",
            "description": "Valentin Stocker (Hertha Berlin) receives a lofted pass from the flank and shoots from close range, but the ball flies slightly wide, almost brushing the right hand post."
        },
        {
            "gameTime": "1 - 08:09",
            "label": "",
            "description": "The ball is cleared after Mitchell Weiser (Bayern Munich) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 07:01",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) manages to beat his opponent to the ball, but he commits a foul in the process. A free kick has been awarded to Hertha Berlin."
        },
        {
            "gameTime": "1 - 05:42",
            "label": "",
            "description": "Nico Schulz (Hertha Berlin) passes the ball onto Valentin Stocker, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 05:02",
            "label": "",
            "description": "Genki Haraguchi (Hertha Berlin) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 04:28",
            "label": "",
            "description": "Mitchell Weiser (Bayern Munich) makes a reckless foul in order to win the ball from his opponent. Guido Winkmann has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 04:05",
            "label": "",
            "description": "The foul by Salomon Kalou (Hertha Berlin) was seen by Guido Winkmann who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 03:38",
            "label": "corner",
            "description": "The resulting corner from Marvin Plattenhardt (Hertha Berlin) is cleared."
        },
        {
            "gameTime": "1 - 03:03",
            "label": "",
            "description": "Marvin Plattenhardt (Hertha Berlin) sends a pass into the box, but his attempt is thwarted and cleared. The ball is out of play. Hertha Berlin win a corner kick."
        },
        {
            "gameTime": "1 - 02:43",
            "label": "",
            "description": "A pass by Genki Haraguchi (Hertha Berlin) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 02:17",
            "label": "",
            "description": "Valentin Stocker (Hertha Berlin) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 01:40",
            "label": "",
            "description": "Guido Winkmann blows his whistle as Robert Lewandowski (Bayern Munich) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 01:06",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) sends an accurate short pass. Mitchell Weiser controls the ball with a fine first touch and is able to come up with a new attacking effort."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Bayern Munich will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Guido Winkmann got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. This has been a real cat and mouse game, with the hosts coming out on top. The home team played possession football and the away players really focused on a well organized defence."
        }
    ],
    "gameAwayTeam": "Hertha Berlin",
    "gameDate": "25/04/2015 - 19:30",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "1 - 0"
}