{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-12-10 - 22-45 Real Madrid 3 - 2 Dep. La Coruna/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 51:59",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. The host team were superior on the pitch today. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        },
        {
            "gameTime": "2 - 51:26",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 51:20",
            "label": "corner",
            "description": "Faycal Fajr (Dep. La Coruna) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 51:00",
            "label": "",
            "description": "Celso Borges (Dep. La Coruna) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Dep. La Coruna have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 50:20",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) leaps high to meet a lofted pass inside the six yard box, but his header flies yards over the crossbar."
        },
        {
            "gameTime": "2 - 49:42",
            "label": "",
            "description": "Pedro Mosquera Parada (Dep. La Coruna) commits a foul and Santiago Jaime Latre immediately signals a free kick."
        },
        {
            "gameTime": "2 - 49:24",
            "label": "",
            "description": "Real Madrid hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "2 - 46:55",
            "label": "soccer-ball",
            "description": "Sergio Ramos (Real Madrid) connects with the ball from the resulting corner and places a powerful header past the stranded goalkeeper and into the roof of the net. The opposing players are staring at each other, unable to understand what happened. Who will take the blame for that one? Sergio Ramos (Real Madrid) has a reason to celebrate!"
        },
        {
            "gameTime": "2 - 46:30",
            "label": "corner",
            "description": "There's an opportunity for Toni Kroos (Real Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 45:47",
            "label": "",
            "description": "Przemyslaw Tyton pulls off a fantastic save! Alvaro Morata (Real Madrid) attempts to head home after a precise cross into the box. He aims his header to the top left corner of the goal, but his effort is kept out. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:05",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) is cautioned by the referee."
        },
        {
            "gameTime": "2 - 42:42",
            "label": "y-card",
            "description": "Sidnei (Dep. La Coruna) receives a yellow card."
        },
        {
            "gameTime": "2 - 42:36",
            "label": "y-card",
            "description": "Keylor Navas (Real Madrid) is given a yellow card."
        },
        {
            "gameTime": "2 - 41:33",
            "label": "",
            "description": "Joselu (Dep. La Coruna) picks up a long through ball, but Keylor Navas deserves praise for a brilliant reaction and interception."
        },
        {
            "gameTime": "2 - 38:53",
            "label": "soccer-ball",
            "description": "Lucas showcases his great technique and produces a beautiful lofted cross into the box. Mariano Diaz (Real Madrid) gets onto the scoresheet by heading inside the left post. It's 2:2."
        },
        {
            "gameTime": "2 - 36:57",
            "label": "substitution",
            "description": "Gaizka Garitano has decided to introduce fresh legs, with Faycal Fajr (Dep. La Coruna) replacing Ryan Babel."
        },
        {
            "gameTime": "2 - 35:51",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Marcelo (Real Madrid) for Danilo."
        },
        {
            "gameTime": "2 - 34:39",
            "label": "",
            "description": "Ryan Babel (Dep. La Coruna) makes a run into the box in an attempt to get onto a long through ball, but one of the opponents comes up with a vital clearance."
        },
        {
            "gameTime": "2 - 32:08",
            "label": "attendance",
            "description": "The attendance for today's match is 67174."
        },
        {
            "gameTime": "2 - 31:34",
            "label": "",
            "description": "Real Madrid are enjoying a spell of pressure at the moment, but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 29:39",
            "label": "",
            "description": "One of the players from Real Madrid times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 29:10",
            "label": "substitution",
            "description": "The substitution is prepared. Pedro Mosquera Parada (Dep. La Coruna) joins the action as a substitute, replacing Florin Andone."
        },
        {
            "gameTime": "2 - 26:49",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to substitute Isco and he is replaced by Mariano Diaz (Real Madrid)."
        },
        {
            "gameTime": "2 - 24:52",
            "label": "y-card",
            "description": "Alvaro Morata (Real Madrid) gets booked for the first time in this match."
        },
        {
            "gameTime": "2 - 24:45",
            "label": "",
            "description": "Isco (Real Madrid) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "2 - 23:59",
            "label": "",
            "description": "Real Madrid players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "2 - 20:56",
            "label": "substitution",
            "description": "It's time for a substitution. Lucas (Real Madrid) comes on in place of Marco Asensio."
        },
        {
            "gameTime": "2 - 19:53",
            "label": "soccer-ball",
            "description": "Superb finishing from Joselu (Dep. La Coruna). Florin Andone plays a fantastic through ball and finds Joselu (Dep. La Coruna), who reacts quickly to get in front of the goal and fire a low shot from close range past the goalkeeper. It's 1:2."
        },
        {
            "gameTime": "2 - 17:42",
            "label": "soccer-ball",
            "description": "Goal 1:1! Joselu (Dep. La Coruna) gets a shot away from the edge of the box and scores into the top left corner. Carles Gil provided an assist for the goal."
        },
        {
            "gameTime": "2 - 16:38",
            "label": "corner",
            "description": "Real Madrid quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 16:24",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) sends a sweet pass into the penalty area, but one of the defenders averts the danger. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 13:39",
            "label": "y-card",
            "description": "Raul Albentosa (Dep. La Coruna) has tested the patience of referee Santiago Jaime Latre and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 13:06",
            "label": "",
            "description": "Danilo (Real Madrid) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 12:38",
            "label": "substitution",
            "description": "Here's the change. Emre Colak leaves the pitch and Joselu (Dep. La Coruna) comes on as a substitute."
        },
        {
            "gameTime": "2 - 11:55",
            "label": "injury",
            "description": "Danilo (Real Madrid) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 11:42",
            "label": "",
            "description": "Florin Andone (Dep. La Coruna) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 11:10",
            "label": "funfact",
            "description": "64:36 – this is the current ball possession ratio."
        },
        {
            "gameTime": "2 - 10:02",
            "label": "",
            "description": "Toni Kroos (Real Madrid) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 09:22",
            "label": "",
            "description": "Fernando Navarro (Dep. La Coruna) commits an ugly challenge. The referee sees it and immediately blows his whistle. Real Madrid are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 07:41",
            "label": "",
            "description": "Santiago Jaime Latre blows his whistle and it's Casemiro (Real Madrid) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 04:52",
            "label": "soccer-ball",
            "description": "Isco passes to Alvaro Morata (Real Madrid), who collects the ball and unleashes a terrific shot from the edge of the box. His effort goes into the bottom right corner. Fabulous goal! The score is 1:0."
        },
        {
            "gameTime": "2 - 03:59",
            "label": "",
            "description": "A spell of possession for Real Madrid in an attempt to control the game."
        },
        {
            "gameTime": "2 - 02:36",
            "label": "",
            "description": "Danilo (Real Madrid) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Let's hope the players will show us more in the second half as the first one has been rather ordinary, devoid of goalscoring opportunities. The hosts are mostly controlling the match and making it pretty tough for the opposition to keep up. The home team is playing possession football and the away team is basing its game on a well organized defence."
        },
        {
            "gameTime": "1 - 45:10",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "y-card",
            "description": "Santiago Jaime Latre shows the yellow card to Ryan Babel (Dep. La Coruna) for a heavy challenge."
        },
        {
            "gameTime": "1 - 42:41",
            "label": "",
            "description": "Real Madrid seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 39:58",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 39:46",
            "label": "",
            "description": "Isco (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "1 - 39:40",
            "label": "corner",
            "description": "Isco (Real Madrid) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 39:32",
            "label": "",
            "description": "Nacho (Real Madrid) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. The ball goes out for a corner. Real Madrid can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 38:58",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) swings in a cross from the corner, but Przemyslaw Tyton reads it well and gathers the ball."
        },
        {
            "gameTime": "1 - 38:38",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is intercepted by the defence. Real Madrid force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 38:21",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) has a shot blocked from inside the box. Now Real Madrid have a corner."
        },
        {
            "gameTime": "1 - 36:15",
            "label": "",
            "description": "Casemiro (Real Madrid) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "1 - 34:27",
            "label": "",
            "description": "Celso Borges (Dep. La Coruna) finds his way to the ball from the free kick inside the box, but his header only hits the left post."
        },
        {
            "gameTime": "1 - 33:50",
            "label": "",
            "description": "One of the Real Madrid players tripped an opponent and conceded a foul. Free kick. Dep. La Coruna will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 32:43",
            "label": "",
            "description": "The foul by Alvaro Morata (Real Madrid) was seen by Santiago Jaime Latre who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 32:25",
            "label": "",
            "description": "The Real Madrid players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 30:30",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 30:20",
            "label": "",
            "description": "Toni Kroos (Real Madrid) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "corner",
            "description": "A dangerous looking corner kick from Isco (Real Madrid) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 29:20",
            "label": "",
            "description": "Isco (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "1 - 28:51",
            "label": "",
            "description": "What a sweet touch by James Rodriguez (Real Madrid) as he collects a pass deep inside the box and decides to go for goal. It's on target but easy for Przemyslaw Tyton to hold."
        },
        {
            "gameTime": "1 - 27:57",
            "label": "corner",
            "description": "Emre Colak (Dep. La Coruna) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 27:20",
            "label": "corner",
            "description": "The corner from Emre Colak (Dep. La Coruna) is cleared away by the defence. Good work from Dep. La Coruna as they win a corner."
        },
        {
            "gameTime": "1 - 26:47",
            "label": "",
            "description": "Ryan Babel (Dep. La Coruna) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The ball goes out of play. Dep. La Coruna are awarded a corner kick."
        },
        {
            "gameTime": "1 - 25:33",
            "label": "",
            "description": "Close! Sergio Ramos (Real Madrid) takes the resultant free kick from 20 metres out and his shot goes just over the crossbar."
        },
        {
            "gameTime": "1 - 24:51",
            "label": "",
            "description": "Real Madrid are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 24:28",
            "label": "y-card",
            "description": "The foul by Celso Borges (Dep. La Coruna) is worthy of a card and a yellow is duly shown by Santiago Jaime Latre."
        },
        {
            "gameTime": "1 - 20:46",
            "label": "",
            "description": "Ryan Babel (Dep. La Coruna) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee and the linesman both signal a throw in for Dep. La Coruna."
        },
        {
            "gameTime": "1 - 19:00",
            "label": "",
            "description": "Danilo (Real Madrid) picks up a long through ball, but Przemyslaw Tyton deserves praise for a brilliant reaction and interception."
        },
        {
            "gameTime": "1 - 17:59",
            "label": "",
            "description": "The flag is raised and Alvaro Morata (Real Madrid) is offside again, not for the first time today."
        },
        {
            "gameTime": "1 - 16:26",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Marco Asensio (Real Madrid)."
        },
        {
            "gameTime": "1 - 15:26",
            "label": "",
            "description": "Santiago Jaime Latre blows the whistle, Toni Kroos (Real Madrid) is penalised for a foul."
        },
        {
            "gameTime": "1 - 12:59",
            "label": "",
            "description": "Isco (Real Madrid) dances his way past two defending players and gets to the edge of the box from where he unleashes a shot that goes well wide of the right post."
        },
        {
            "gameTime": "1 - 12:38",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 12:04",
            "label": "",
            "description": "Nacho (Real Madrid) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. Real Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 09:30",
            "label": "",
            "description": "Florin Andone (Dep. La Coruna) is penalised for a foul. Santiago Jaime Latre had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 06:42",
            "label": "",
            "description": "Toni Kroos (Real Madrid) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "The game is interrupted as Alvaro Morata (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "1 - 05:10",
            "label": "",
            "description": "Marco Asensio (Real Madrid) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "1 - 03:06",
            "label": "",
            "description": "Real Madrid try to speed play up by taking a quick free kick."
        },
        {
            "gameTime": "1 - 02:56",
            "label": "",
            "description": "One of the Dep. La Coruna players unfairly tackled his opponent and conceded a foul. It's a free kick to Real Madrid in a dangerous position."
        },
        {
            "gameTime": "1 - 01:55",
            "label": "",
            "description": "Flag up against Alvaro Morata (Real Madrid). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 01:53",
            "label": "",
            "description": "The Real Madrid players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Real Madrid will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Santiago Jaime Latre will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 5:1 in the last game between Dep. La Coruna and Real Sociedad."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Real Madrid players have rippled the net at least once in their last 26 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The leading assist man for Real Madrid is Toni Kroos, with 6 assists so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. The host team were superior on the pitch today. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        }
    ],
    "gameAwayTeam": "Dep. La Coruna",
    "gameDate": "10/12/2016 - 22:45",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "3 - 2"
}