{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-11-06 - 17-15 Liverpool 6 - 1 Watford/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. The host team were superior on the pitch today. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        },
        {
            "gameTime": "2 - 48:17",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 45:49",
            "label": "soccer-ball",
            "description": "Goal! Georginio Wijnaldum (Liverpool) was in the right place at the right time to pounce on the rebound inside the box and gleefully rifles the ball home. It's 6:1."
        },
        {
            "gameTime": "2 - 45:33",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) shoots from the edge of the penalty area. The ball travels towards the left side of the target, but Costel Pantilimon easily deals with the threat."
        },
        {
            "gameTime": "2 - 45:01",
            "label": "corner",
            "description": "A quickly taken corner by Liverpool."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 42:37",
            "label": "y-card",
            "description": "Georginio Wijnaldum (Liverpool) is booked by the referee."
        },
        {
            "gameTime": "2 - 42:37",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) gets a shot from the edge of the box, but it crashes against the crossbar!"
        },
        {
            "gameTime": "2 - 41:35",
            "label": "substitution",
            "description": "Jurgen Klopp decides to make a substitution. Philippe Coutinho will be replaced by Oviemuno Ejaria (Liverpool)."
        },
        {
            "gameTime": "2 - 40:10",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Juan Zuniga (Watford) comes onto the pitch for Roberto Pereyra."
        },
        {
            "gameTime": "2 - 39:52",
            "label": "",
            "description": "Nordin Amrabat (Watford) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Watford was in an offside position."
        },
        {
            "gameTime": "2 - 36:06",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) runs with the ball towards the keeper and pulls the trigger from close range, but Costel Pantilimon anticipates his intention and makes an amazing save to stop the shot going low into the middle of the target."
        },
        {
            "gameTime": "2 - 34:26",
            "label": "y-card",
            "description": "The referee gives a yellow card to Miguel Angel Britos Cabrera (Watford)."
        },
        {
            "gameTime": "2 - 32:26",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) fires a shot from close range, but he is somehow only able to hit the crossbar!"
        },
        {
            "gameTime": "2 - 31:24",
            "label": "corner",
            "description": "Liverpool have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "2 - 29:17",
            "label": "soccer-ball",
            "description": "Daryl Janmaat (Watford) receives a well taken defence splitting pass inside the box and scores! He buries the ball into the bottom left corner."
        },
        {
            "gameTime": "2 - 28:07",
            "label": "",
            "description": "Etienne Capoue (Watford) collects a great pass inside the box and misses a golden opportunity. His low drive is headed for the bottom left corner, but the goalkeeper pulls off a marvellous diving save and denies him."
        },
        {
            "gameTime": "2 - 27:19",
            "label": "",
            "description": "Neat passing move from Liverpool in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 25:03",
            "label": "substitution",
            "description": "That will be all from Adam Lallana who is being replaced by the fresh legs of Daniel Sturridge (Liverpool)."
        },
        {
            "gameTime": "2 - 24:10",
            "label": "corner",
            "description": "Watford didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 23:54",
            "label": "",
            "description": "Odion Ighalo (Watford) has a great chance inside the six yard box, shoots to the bottom right corner, but Loris Karius pulls off an exquisite save to deny him. Watford force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 23:40",
            "label": "corner",
            "description": "Jose Holebas (Watford) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 22:48",
            "label": "",
            "description": "Etienne Capoue (Watford) gets to the rebound on the edge of the penalty area and fires a shot towards the right side of the goal, but Loris Karius gets a hand to it and keeps it out."
        },
        {
            "gameTime": "2 - 22:37",
            "label": "corner",
            "description": "Watford take the corner, but their hopes of scoring a goal end with nice clearance by the defence."
        },
        {
            "gameTime": "2 - 17:47",
            "label": "substitution",
            "description": "Jurgen Klopp prepares a substitution. Sadio Mane is replaced by Georginio Wijnaldum (Liverpool)."
        },
        {
            "gameTime": "2 - 15:20",
            "label": "substitution",
            "description": "Valon Behrami comes off the pitch to be replaced by Ben Watson (Watford)."
        },
        {
            "gameTime": "2 - 14:14",
            "label": "soccer-ball",
            "description": "Goal! Sadio Mane (Liverpool) finds himself some space inside the box to get on the end of a pass from Roberto Firmino, then sends the ball into the middle of the net. 5:0."
        },
        {
            "gameTime": "2 - 11:17",
            "label": "soccer-ball",
            "description": "Roberto Firmino (Liverpool) received a delightful pass inside the box before slotting the ball past the goalkeeper. What a brilliant finish!"
        },
        {
            "gameTime": "2 - 10:55",
            "label": "y-card",
            "description": "Jose Holebas (Watford) is awarded a yellow card. The referee showed him no mercy."
        },
        {
            "gameTime": "2 - 10:26",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 09:42",
            "label": "",
            "description": "Miguel Angel Britos Cabrera (Watford) makes a reckless foul in order to win the ball from his opponent. Michael Oliver has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 08:14",
            "label": "",
            "description": "Jordan Henderson (Liverpool) misses a big chance! He fires the ball high over the crossbar from inside the 6 yard box after the ball rebounded to him."
        },
        {
            "gameTime": "2 - 06:54",
            "label": "",
            "description": "Michael Oliver interrupts the game. One of the players from Liverpool won the ball, but his effort is adjudged unfair."
        },
        {
            "gameTime": "2 - 05:47",
            "label": "",
            "description": "Liverpool keep the ball well and push forward with purpose, but here comes an interception from the opposition."
        },
        {
            "gameTime": "2 - 03:11",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) smashes the ball towards goal from the edge of the penalty box, but it goes well wide of the right post."
        },
        {
            "gameTime": "2 - 01:32",
            "label": "",
            "description": "Nordin Amrabat (Watford) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "We are seeing a great game so far, let's hope the players will be able to sustain their level of performance and keep entertaining the fans in such a fabulous way. The visitors played second fiddle to the home team in the first half. The visitors have been very flat and lacked creativity in their attack. Let's see if they change something in the second period."
        },
        {
            "gameTime": "1 - 48:55",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:48",
            "label": "",
            "description": "Emre Can (Liverpool) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 45:37",
            "label": "",
            "description": "James Milner (Liverpool) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "1 - 45:22",
            "label": "corner",
            "description": "James Milner (Liverpool) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "1 - 44:54",
            "label": "",
            "description": "James Milner (Liverpool) was close to scoring from the resulting free kick. He unleashed a decent strike from the edge of the box towards the top left corner, but the goalkeeper made a great save to keep him out. The ball is out of play and the linesman points at the corner flag. Corner to Liverpool."
        },
        {
            "gameTime": "1 - 44:37",
            "label": "",
            "description": "One of the Watford players tripped an opponent and conceded a foul. A free kick has been awarded to Liverpool."
        },
        {
            "gameTime": "1 - 43:56",
            "label": "",
            "description": "Odion Ighalo (Watford) shoots from the edge of the penalty area. The ball travels towards the bottom right corner, but Loris Karius easily deals with the threat."
        },
        {
            "gameTime": "1 - 42:34",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Adam Lallana finds Emre Can (Liverpool), who jumps highest and steers a close range header into the right side of the goal. His effort was both strong and precise, and Costel Pantilimon had no chance of stopping that. 2:0."
        },
        {
            "gameTime": "1 - 41:47",
            "label": "",
            "description": "Watford couldn't find the way to score from a long range free kick as Loris Karius (Liverpool) leaped high and intercepted a cross."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "",
            "description": "Sadio Mane (Liverpool) makes a rough challenge and Michael Oliver blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 38:09",
            "label": "",
            "description": "Jose Holebas (Watford) races towards goal but the defender gets back well to make a challenge. The ball goes out of play and Liverpool will have a goal kick."
        },
        {
            "gameTime": "1 - 37:14",
            "label": "",
            "description": "The linesman raises his flag. Troy Deeney (Watford) is adjudged offside."
        },
        {
            "gameTime": "1 - 36:38",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 28:11."
        },
        {
            "gameTime": "1 - 36:14",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) produces a header from long distance, but his naive attempt ends way wide of the left post."
        },
        {
            "gameTime": "1 - 35:33",
            "label": "",
            "description": "The Liverpool players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 32:57",
            "label": "substitution",
            "description": "Heurelho Gomes is substituted due to injury. Walter Mazzarri gives a chance to Costel Pantilimon (Watford)."
        },
        {
            "gameTime": "1 - 31:40",
            "label": "injury",
            "description": "Heurelho Gomes (Watford) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 29:49",
            "label": "soccer-ball",
            "description": "What a stunner from just outside the box! Philippe Coutinho (Liverpool) produces a perfect low drive into the middle of the goal."
        },
        {
            "gameTime": "1 - 26:37",
            "label": "soccer-ball",
            "description": "The ball hits the back of the net! Philippe Coutinho showcases his brilliant technique and produces a beautiful lofted cross into the box, where Sadio Mane (Liverpool) manages to convert it into a sweet goal. He heads it inside the right post and gets on the scoresheet – 0:0."
        },
        {
            "gameTime": "1 - 25:58",
            "label": "corner",
            "description": "Liverpool take a short corner kick."
        },
        {
            "gameTime": "1 - 25:48",
            "label": "",
            "description": "James Milner (Liverpool) runs with the ball towards the keeper and pulls the trigger from close range, but Costel Pantilimon anticipates his intention and makes an amazing save to stop the shot going into the bottom left corner."
        },
        {
            "gameTime": "1 - 25:09",
            "label": "",
            "description": "Sadio Mane (Liverpool) aims for the middle of the goal, but that's an easy job for the goalkeeper. It will take more than that to test him!"
        },
        {
            "gameTime": "1 - 23:39",
            "label": "",
            "description": "Philippe Coutinho slides a brilliant pass into Roberto Firmino (Liverpool), but his shot from inside the box goes a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 22:44",
            "label": "",
            "description": "A pass by Nordin Amrabat (Watford) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 22:07",
            "label": "",
            "description": "James Milner (Liverpool) fashions a shot from the edge of the box after receiving an accurate pass. Costel Pantilimon makes a stunning save to stop the effort from flying into the bottom left corner."
        },
        {
            "gameTime": "1 - 21:22",
            "label": "",
            "description": "Sadio Mane (Liverpool) has a shot blocked from inside the box."
        },
        {
            "gameTime": "1 - 20:25",
            "label": "",
            "description": "Jordan Henderson (Liverpool) pulls the jersey of one of the opposition players and Michael Oliver blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 19:49",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) spurns a great opportunity from inside the 6 yard box. The ball flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 18:04",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) is caught offside!"
        },
        {
            "gameTime": "1 - 15:57",
            "label": "",
            "description": "A cross following the corner kick finds its way to Lucas Leiva (Liverpool) inside the box and he manages to steer it to the left side of the target. He is about to start celebrating a goal, but Costel Pantilimon makes a save in the nick of time and maintains the current score."
        },
        {
            "gameTime": "1 - 15:29",
            "label": "corner",
            "description": "The ball is out of play and Liverpool manage to earn a corner."
        },
        {
            "gameTime": "1 - 15:24",
            "label": "",
            "description": "Lucas Leiva (Liverpool) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 14:28",
            "label": "",
            "description": "Good defending. Valon Behrami (Watford) tries to find Troy Deeney inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 12:10",
            "label": "",
            "description": "A bullet header by Lucas Leiva (Liverpool) from inside the box has the power, but goes totally in the wrong direction, yards wide of the right post."
        },
        {
            "gameTime": "1 - 11:10",
            "label": "",
            "description": "Michael Oliver blows his whistle. Nordin Amrabat (Watford) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 09:00",
            "label": "corner",
            "description": "The corner by Philippe Coutinho (Liverpool) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 06:49",
            "label": "",
            "description": "Roberto Firmino (Liverpool) picks up a lofted cross inside the box and unleashes a low shot to the middle of the goal. His promising effort is kept out by Costel Pantilimon, who pulls off a decent save!"
        },
        {
            "gameTime": "1 - 03:45",
            "label": "",
            "description": "Sadio Mane (Liverpool) swings a cross into the box, but it's far too close to Costel Pantilimon, who smothers the ball."
        },
        {
            "gameTime": "1 - 03:01",
            "label": "",
            "description": "What a great effort! Miguel Angel Britos Cabrera (Watford) decides to unleash a long range shot. Despite hitting it very well, it scorches inches wide of the right post. We could have witnessed a magnificent goal."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Michael Oliver."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "8 The number of away wins for Liverpool."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Philippe Coutinho will look to add to his tally of 5 assists this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. The host team were superior on the pitch today. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        }
    ],
    "gameAwayTeam": "Watford",
    "gameDate": "06/11/2016 - 17:15",
    "gameHomeTeam": "Liverpool",
    "gameScore": "6 - 1"
}