{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-09-17 - 17-00 Hull City 1 - 4 Arsenal/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. You have to say that the visitors have been the better side. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        },
        {
            "gameTime": "2 - 48:01",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "soccer-ball",
            "description": "Granit Xhaka (Arsenal) latches on to a pass and controls it with a good first touch. He unleashes a deadly strike from around 30 metres out which goes into the roof of the net."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:03",
            "label": "",
            "description": "Francis Coquelin (Arsenal) has an effort on goal, but he misses to the right of the goal."
        },
        {
            "gameTime": "2 - 42:38",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 42:26",
            "label": "substitution",
            "description": "Substitution. Theo Walcott will be replaced by Lucas Perez (Arsenal)."
        },
        {
            "gameTime": "2 - 42:02",
            "label": "",
            "description": "The ball is cleared after Mesut Ozil (Arsenal) attempted to dribble past an opposing player. Now Arsenal have a corner."
        },
        {
            "gameTime": "2 - 39:02",
            "label": "",
            "description": "A pass from Dieumerci Mbokani (Hull City) is intercepted by Petr Cech and the move breaks down."
        },
        {
            "gameTime": "2 - 37:47",
            "label": "soccer-ball",
            "description": "Goal! Alexis Sanchez (Arsenal) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball into the top right corner. It's 1:3."
        },
        {
            "gameTime": "2 - 37:40",
            "label": "",
            "description": "Eldin Jakupovic pulls off a great save to deny Theo Walcott (Arsenal), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "2 - 33:45",
            "label": "soccer-ball",
            "description": "Robert Snodgrass (Hull City) fires the penalty inside the left post."
        },
        {
            "gameTime": "2 - 32:30",
            "label": "",
            "description": "Robert Snodgrass (Hull City) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 32:25",
            "label": "y-card",
            "description": "Petr Cech (Arsenal) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 32:20",
            "label": "penalty",
            "description": "Petr Cech (Arsenal) tackles a bit over zealously and Roger East blows for a foul. The referee blows the whistle and gives a penalty to Hull City!"
        },
        {
            "gameTime": "2 - 31:55",
            "label": "substitution",
            "description": "Arsene Wenger has decided to introduce fresh legs, with Mohamed Elneny (Arsenal) replacing Alex Iwobi."
        },
        {
            "gameTime": "2 - 31:54",
            "label": "substitution",
            "description": "That will be all from Abel Hernandez who is being replaced by the fresh legs of Dieumerci Mbokani (Hull City)."
        },
        {
            "gameTime": "2 - 31:13",
            "label": "",
            "description": "Mesut Ozil sprays a pass out to Theo Walcott (Arsenal), but he produces a poor effort from inside the box which goes well wide of the left post."
        },
        {
            "gameTime": "2 - 29:29",
            "label": "",
            "description": "Mesut Ozil (Arsenal) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 27:44",
            "label": "",
            "description": "Francis Coquelin (Arsenal) and Alexis Sanchez attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 26:33",
            "label": "",
            "description": "Eldin Jakupovic displays his ability to read the game and clears the danger after Alexis Sanchez (Arsenal) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "2 - 25:25",
            "label": "",
            "description": "Francis Coquelin (Arsenal) and Nacho Monreal matched up again to find some space for an unmarked teammate."
        },
        {
            "gameTime": "2 - 21:36",
            "label": "substitution",
            "description": "Here comes a substitution. Granit Xhaka (Arsenal) is brought on as a substitute for Santi Cazorla."
        },
        {
            "gameTime": "2 - 21:07",
            "label": "",
            "description": "Flag up against Abel Hernandez (Hull City). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 19:52",
            "label": "",
            "description": "Robert Snodgrass (Hull City) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 18:46",
            "label": "",
            "description": "Alex Iwobi (Arsenal) finds Santi Cazorla with a nice pass so he can go on towards the goal."
        },
        {
            "gameTime": "2 - 14:31",
            "label": "",
            "description": "Theo Walcott (Arsenal) smashes the ball towards goal from the edge of the penalty box, but it goes well wide of the right post."
        },
        {
            "gameTime": "2 - 12:12",
            "label": "substitution",
            "description": "Substitution. Ryan Mason (Hull City) replaces Tom Huddlestone."
        },
        {
            "gameTime": "2 - 09:07",
            "label": "soccer-ball",
            "description": "Goal! Alex Iwobi gets to the ball, slips Theo Walcott (Arsenal) into the area and he scores with a delightful chipped finish to make it 0:2."
        },
        {
            "gameTime": "2 - 07:57",
            "label": "",
            "description": "The Hull City players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 04:51",
            "label": "",
            "description": "Theo Walcott (Arsenal) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "2 - 03:53",
            "label": "",
            "description": "David Meyler (Hull City) sends a chip pass into the box, but Petr Cech is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 01:56",
            "label": "",
            "description": "Santi Cazorla (Arsenal) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Roger East blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. The away side is controlling this game. The home players attempt to beat the opposition's defence using mostly counter attacks. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 47:57",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:08",
            "label": "corner",
            "description": "Robert Snodgrass (Hull City) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "",
            "description": "Robert Snodgrass (Hull City) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play. Hull City win a corner kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "1 - 41:50",
            "label": "",
            "description": "Laurent Koscielny (Arsenal) wins himself just enough space inside the box to connect with the corner. His header flies towards the middle of the goal, but the goalkeeper blocks the effort."
        },
        {
            "gameTime": "1 - 41:40",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 41:30",
            "label": "substitution",
            "description": "Tactical substitution due to red card. Adama Diomande departs the field of play to be replaced by Harry Maguire (Hull City)."
        },
        {
            "gameTime": "1 - 40:58",
            "label": "penalty-missed",
            "description": "Alexis Sanchez (Arsenal) wastes a huge opportunity to score from the penalty spot. He attempts to slot into the bottom left corner, but Eldin Jakupovic pulls off a superb save."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "r-card",
            "description": "That will be the end of the match for Jake Livermore (Hull City), who is shown a red card!"
        },
        {
            "gameTime": "1 - 39:25",
            "label": "penalty",
            "description": "The players claim that Jake Livermore (Hull City) handled the ball inside the box and it seems they are right. It's a penalty for Arsenal!"
        },
        {
            "gameTime": "1 - 38:12",
            "label": "",
            "description": "Tom Huddlestone (Hull City) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 35:17",
            "label": "",
            "description": "Robert Snodgrass (Hull City) had a golden opportunity. He volleyed from point blank range low towards the middle of the net, but Petr Cech was alert and made an amazing save!"
        },
        {
            "gameTime": "1 - 33:41",
            "label": "y-card",
            "description": "Santi Cazorla (Arsenal) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "1 - 32:54",
            "label": "",
            "description": "Arsenal keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "1 - 30:46",
            "label": "",
            "description": "Adama Diomande (Hull City) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 30:34",
            "label": "",
            "description": "Shkodran Mustafi (Arsenal) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 29:26",
            "label": "injury",
            "description": "The game is interrupted now, Adama Diomande (Hull City) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 29:12",
            "label": "injury",
            "description": "Shkodran Mustafi (Arsenal) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 27:50",
            "label": "",
            "description": "Mesut Ozil (Arsenal) strikes the rebound, but it goes well over the bar."
        },
        {
            "gameTime": "1 - 27:40",
            "label": "",
            "description": "Alex Iwobi (Arsenal) was close to scoring a goal after unleashing a first time effort from inside the six yard box. The ball was aimed towards the bottom left corner, but the goalkeeper read it well and pulled off a brilliant save to thwart the attempt."
        },
        {
            "gameTime": "1 - 26:55",
            "label": "",
            "description": "Ahmed Al Muhammadi (Hull City) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "1 - 24:16",
            "label": "",
            "description": "Half chance! Adama Diomande (Hull City) plays a pass into the box, but Petr Cech reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 23:08",
            "label": "",
            "description": "Theo Walcott (Arsenal) had a golden opportunity. He volleyed from point blank range towards the middle of the goal, but Eldin Jakupovic was alert and made an amazing save!"
        },
        {
            "gameTime": "1 - 22:12",
            "label": "",
            "description": "Robert Snodgrass (Hull City) commits a foul on his opponent and it looks like it should be the other way around at first glance, but the referee makes the right decision in awarding a free kick to the other team. Arsenal have a free kick."
        },
        {
            "gameTime": "1 - 20:58",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 20:52",
            "label": "",
            "description": "Mesut Ozil (Arsenal) plays a one two with Alexis Sanchez, but the move breaks down. The referee blows his whistle, Arsenal are awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:03",
            "label": "",
            "description": "Abel Hernandez (Hull City) creates a good chance for himself and goes for goal from mid range, but the effort is well wide of the left post."
        },
        {
            "gameTime": "1 - 18:40",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 18:14",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) slaloms his way past challenges, but an opposing player does well to get the ball away. The referee signals a corner kick to Arsenal."
        },
        {
            "gameTime": "1 - 16:09",
            "label": "soccer-ball",
            "description": "Goal! Alex Iwobi takes aim and his effort deflects off Alexis Sanchez (Arsenal) to beat the goalkeeper. 0:1."
        },
        {
            "gameTime": "1 - 15:30",
            "label": "",
            "description": "Mesut Ozil (Arsenal) produces a lovely chip pass into the box, but one of the opposition players cuts it out."
        },
        {
            "gameTime": "1 - 13:45",
            "label": "corner",
            "description": "Robert Snodgrass (Hull City) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "1 - 13:27",
            "label": "",
            "description": "Robert Snodgrass (Hull City) races towards goal but the defender gets back well to make a challenge. Hull City have a corner."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) picks up the ball inside the penalty box and immediately fires a first time effort that sails well over the crossbar and ends in the stands."
        },
        {
            "gameTime": "1 - 11:00",
            "label": "",
            "description": "Hector Bellerin (Arsenal) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 10:15",
            "label": "",
            "description": "Adama Diomande (Hull City) picks up a long through ball, but Petr Cech deserves praise for a brilliant reaction and interception."
        },
        {
            "gameTime": "1 - 08:24",
            "label": "",
            "description": "The foul by Theo Walcott (Arsenal) was seen by Roger East who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 05:26",
            "label": "",
            "description": "Andrew Robertson (Hull City) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 02:30",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "1 - 01:37",
            "label": "",
            "description": "David Meyler (Hull City) sends an accurate short pass. Tom Huddlestone controls the ball with a fine first touch and is able to come up with a new attacking effort."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Hull City will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Roger East."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Robert Snodgrass from Hull City will look to add to his goal tally, he has netted 2 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "43 Number of goals that Arsenal have conceded so far this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Arsenal will miss a few players for this clash: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. You have to say that the visitors have been the better side. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        }
    ],
    "gameAwayTeam": "Arsenal",
    "gameDate": "17/09/2016 - 17:00",
    "gameHomeTeam": "Hull City",
    "gameScore": "1 - 4"
}