{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2016-09-28 - 21-45 Ludogorets 1 - 3 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. An impressive display from the visitors, they had the better of it. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        },
        {
            "gameTime": "2 - 48:11",
            "label": "whistle",
            "description": "Pavel Kralovec is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:16",
            "label": "",
            "description": "Jody Lukoki (Ludogorets) takes a long range shot, but his attempt is not a big threat to the goalkeeper."
        },
        {
            "gameTime": "2 - 45:19",
            "label": "substitution",
            "description": "The referee signals a substitution. Jean Kevin Augustin (Paris SG) is brought on as a substitute for Edinson Cavani."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:58",
            "label": "",
            "description": "Vladislav Stoyanov hears the fans clapping his superb goalkeeping. Blaise Matuidi (Paris SG) shoots from the edge of the box towards the left side of the goal, but the goalkeeper makes a magnificent save."
        },
        {
            "gameTime": "2 - 44:38",
            "label": "attendance",
            "description": "The attendance is 17155."
        },
        {
            "gameTime": "2 - 42:52",
            "label": "substitution",
            "description": "It is time for a substitution. Claudiu Keseru (Ludogorets) is on for Wanderson."
        },
        {
            "gameTime": "2 - 42:28",
            "label": "substitution",
            "description": "Unai Emery Etxegoien prepares a substitution. Angel Di Maria is replaced by Nanitamo Ikone (Paris SG)."
        },
        {
            "gameTime": "2 - 40:39",
            "label": "",
            "description": "Jody Lukoki (Ludogorets) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 37:18",
            "label": "",
            "description": "The linesman's flag goes up. Edinson Cavani (Paris SG) is caught in the offside trap."
        },
        {
            "gameTime": "2 - 34:55",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Marco Verratti as he is replaced by Grzegorz Krychowiak (Paris SG)."
        },
        {
            "gameTime": "2 - 33:29",
            "label": "",
            "description": "Angel Di Maria (Paris SG) stands over the free kick and opts to take it himself, sending the ball towards the bottom right corner only for Vladislav Stoyanov to dive and make a save."
        },
        {
            "gameTime": "2 - 32:16",
            "label": "",
            "description": "Anicet (Ludogorets) was too fierce in his attempt to get the ball from his opponent and Pavel Kralovec blows for a foul. It's a free kick to Paris SG, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "2 - 28:38",
            "label": "",
            "description": "Natanael (Ludogorets) gets a shot away from distance, but wasn't really set to take it and fires high and wide."
        },
        {
            "gameTime": "2 - 28:02",
            "label": "substitution",
            "description": "Jody Lukoki (Ludogorets) joins the action as a substitute, replacing Vura."
        },
        {
            "gameTime": "2 - 26:19",
            "label": "",
            "description": "Wanderson (Ludogorets) unleashes a shot from the edge of the box, but it goes straight at Alphonse Areola."
        },
        {
            "gameTime": "2 - 24:30",
            "label": "",
            "description": "Yordan Minev (Ludogorets) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again."
        },
        {
            "gameTime": "2 - 21:29",
            "label": "",
            "description": "Edinson Cavani plays a lovely pass into Blaise Matuidi (Paris SG), but he can't find the target. His strike from inside the box goes narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 19:21",
            "label": "",
            "description": "Serge Aurier (Paris SG) passes the ball onto Edinson Cavani, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "2 - 18:24",
            "label": "",
            "description": "Great teamplay by Ludogorets as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "soccer-ball",
            "description": "Goal! Edinson Cavani (Paris SG) finds himself some space inside the box to get on the end of a pass from Lucas, then sends the ball inside the right post. 1:3."
        },
        {
            "gameTime": "2 - 13:30",
            "label": "penalty-missed",
            "description": "Cosmin Moti (Ludogorets) blows a huge chance to score! He sends the penalty to the bottom left corner, but it's not enough to beat Alphonse Areola who easily stops the effort."
        },
        {
            "gameTime": "2 - 13:23",
            "label": "",
            "description": "Cosmin Moti (Ludogorets) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 12:49",
            "label": "y-card",
            "description": "A yellow card is awarded to Thiago Motta (Paris SG)."
        },
        {
            "gameTime": "2 - 11:53",
            "label": "penalty",
            "description": "Pavel Kralovec blows his whistle after Thiago Motta (Paris SG) kicks an opponent's legs instead of the ball. It's a penalty! Great chance to score for Ludogorets!"
        },
        {
            "gameTime": "2 - 11:45",
            "label": "y-card",
            "description": "The referee gives a yellow card to Blaise Matuidi (Paris SG)."
        },
        {
            "gameTime": "2 - 10:56",
            "label": "y-card",
            "description": "Jonathan Cafu (Ludogorets) earns the yellow card."
        },
        {
            "gameTime": "2 - 10:21",
            "label": "soccer-ball",
            "description": "Superbly taken set piece! Angel Di Maria takes the free kick and sends a cross into the six yard box. Edinson Cavani (Paris SG) flicks the ball lightly with his head towards the middle of the goal. Vladislav Stoyanov can't react quickly enough and the score changes to 1:2."
        },
        {
            "gameTime": "2 - 10:19",
            "label": "",
            "description": "A free kick is awarded from a very dangerous distance. It's situated just a few metres from outside the box. Several players gather around the ball, but it seems like Angel Di Maria (Paris SG) is going to have a crack himself."
        },
        {
            "gameTime": "2 - 09:06",
            "label": "",
            "description": "Natanael (Ludogorets) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement. Paris SG win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 06:47",
            "label": "",
            "description": "Thiago Silva (Paris SG) commits a rough challenge and Pavel Kralovec blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 05:44",
            "label": "",
            "description": "Angel Di Maria (Paris SG) shoots from the edge of the penalty area. The ball travels low towards the middle of the target, but Vladislav Stoyanov easily deals with the threat."
        },
        {
            "gameTime": "2 - 04:47",
            "label": "y-card",
            "description": "Natanael (Ludogorets) shouldn't be surprised it's a yellow from the ref, who cooled the situation down well."
        },
        {
            "gameTime": "2 - 04:03",
            "label": "",
            "description": "It looked like the long range shot by Angel Di Maria (Paris SG) would end up in the net, but the effort went painfully wide of the left post. The goalkeeper was quite lucky this time."
        },
        {
            "gameTime": "2 - 03:07",
            "label": "",
            "description": "Edinson Cavani (Paris SG) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the left post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Pavel Kralovec starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. Even first half from both sides, and they've both had chances. The home team tries to prevail using combination football, while the away teams uses mostly counter attacks."
        },
        {
            "gameTime": "1 - 45:15",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Pavel Kralovec has ended it."
        },
        {
            "gameTime": "1 - 44:51",
            "label": "",
            "description": "Pavel Kralovec blows his whistle. Edinson Cavani (Paris SG) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 43:46",
            "label": "y-card",
            "description": "Svetoslav Dyakov (Ludogorets) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "1 - 40:30",
            "label": "soccer-ball",
            "description": "Goal! Marco Verratti produces a great pass that finds Blaise Matuidi (Paris SG) inside the penalty area, who takes advantage of the situation to rifle a shot into the left side of the goal. 1:1."
        },
        {
            "gameTime": "1 - 37:36",
            "label": "",
            "description": "Maxwell (Paris SG) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "1 - 34:42",
            "label": "",
            "description": "Maxwell (Paris SG) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 30:32",
            "label": "",
            "description": "Thiago Silva (Paris SG) rises above the defence to meet a cross from the corner. His timing is good, but he directs his header just a few inches wide of the left post."
        },
        {
            "gameTime": "1 - 30:18",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 30:05",
            "label": "",
            "description": "Lucas (Paris SG) fails to find any of his teammates inside the box as his pass is blocked. Paris SG have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 28:36",
            "label": "",
            "description": "Lucas (Paris SG) creates a yard of space for himself and tries an effort from the edge of the box, but it goes just wide of the left post."
        },
        {
            "gameTime": "1 - 25:28",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) works the corner short."
        },
        {
            "gameTime": "1 - 25:12",
            "label": "",
            "description": "Angel Di Maria (Paris SG) sends the ball into the box from the side of the pitch, but his cross is blocked. Paris SG have a corner."
        },
        {
            "gameTime": "1 - 21:08",
            "label": "",
            "description": "That didn't go as planned! Angel Di Maria (Paris SG) tried his luck from the edge of the box, but his effort low towards the middle of the goal was too weak to get past Vladislav Stoyanov, who easily kept it out."
        },
        {
            "gameTime": "1 - 19:25",
            "label": "",
            "description": "Good defending. Angel Di Maria (Paris SG) tries to find Edinson Cavani inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 18:01",
            "label": "corner",
            "description": "The corner from Lucas (Paris SG) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 17:46",
            "label": "",
            "description": "A beautiful low pass from the side is received by Angel Di Maria (Paris SG), who was waiting for his chance. However, the defence is alert and spanks the ball away. Paris SG will take a corner kick."
        },
        {
            "gameTime": "1 - 15:27",
            "label": "soccer-ball",
            "description": "Natanael (Ludogorets) can showcase his brilliant free kick ability, particularly from a distance like this. He hits the ball perfectly and it ends up inside the right post."
        },
        {
            "gameTime": "1 - 13:52",
            "label": "",
            "description": "Thiago Motta (Paris SG) brings his opponent down with a tackle and Pavel Kralovec blows his whistle for a foul. Another situation results in a direct free kick for Ludogorets."
        },
        {
            "gameTime": "1 - 13:04",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Angel Di Maria (Paris SG)."
        },
        {
            "gameTime": "1 - 12:53",
            "label": "",
            "description": "A promising cross into the box is nearly received by the lurking Lucas (Paris SG), but one of the defending players cuts it out to avert the threat. Paris SG will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 11:58",
            "label": "",
            "description": "Anicet (Ludogorets) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "1 - 11:11",
            "label": "",
            "description": "Angel Di Maria (Paris SG) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 08:58",
            "label": "",
            "description": "Svetoslav Dyakov (Ludogorets) makes a rough challenge and Pavel Kralovec blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 05:14",
            "label": "",
            "description": "Edinson Cavani (Paris SG) lashes the ball towards goal from outside the penalty area, but it goes narrowly over the crossbar. The ball goes out of play and Ludogorets will have a goal kick."
        },
        {
            "gameTime": "1 - 04:30",
            "label": "",
            "description": "Anicet (Ludogorets) knocks his opponent down with an over the top tackle."
        },
        {
            "gameTime": "1 - 04:03",
            "label": "",
            "description": "A pass from Vura (Ludogorets) is intercepted by Alphonse Areola and the move breaks down."
        },
        {
            "gameTime": "1 - 02:56",
            "label": "",
            "description": "Thiago Silva (Paris SG) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Pavel Kralovec blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 02:28",
            "label": "",
            "description": "Ludogorets enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Paris SG will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pavel Kralovec is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. An impressive display from the visitors, they had the better of it. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "28/09/2016 - 21:45",
    "gameHomeTeam": "Ludogorets",
    "gameScore": "1 - 3"
}