{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-09-20 - 18-00 Southampton 2 - 3 Manchester United/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "It was a very watchable match. Great goals and there was plenty of action at both ends of the pitch. No regrets about following this game. You have to say that the visitors have been the better side. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 50:13",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 49:33",
            "label": "",
            "description": "Memphis Depay (Manchester United) makes a strong challenge and Mark Clattenburg blows for a foul."
        },
        {
            "gameTime": "2 - 49:04",
            "label": "",
            "description": "Victor Wanyama (Southampton) collects a rebound and produces a mid range attempt. The ball goes low to the middle of the target, but David de Gea keeps it out."
        },
        {
            "gameTime": "2 - 48:32",
            "label": "",
            "description": "Steven Davis (Southampton) meets a cross on the edge of the box and produces a header towards the bottom right corner, but one of the defending players blocks the effort."
        },
        {
            "gameTime": "2 - 47:30",
            "label": "corner",
            "description": "Dusan Tadic (Southampton) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "",
            "description": "Victor Wanyama (Southampton) shoots after his astonishing individual effort from about 18 metres out to the top left corner, but David de Gea shows his excellent skills and saves the attempt. Southampton get a corner."
        },
        {
            "gameTime": "2 - 46:06",
            "label": "",
            "description": "Dusan Tadic (Southampton) blows a huge opportunity! He latches on to a perfect cross from the wing into the penalty area, but sends a bullet header just wide of the left post!"
        },
        {
            "gameTime": "2 - 45:37",
            "label": "",
            "description": "Flag goes up against Memphis Depay (Manchester United) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 45:22",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 5 min. of added time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "Morgan Schneiderlin (Manchester United) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play. Manchester United are awarded a corner kick."
        },
        {
            "gameTime": "2 - 44:05",
            "label": "",
            "description": "What a chance that is! Graziano Pelle (Southampton) squanders a huge opportunity as he latches on to a perfect cross from the wing. He produces a bullet header from around the penalty spot which goes well wide of the right post!"
        },
        {
            "gameTime": "2 - 43:48",
            "label": "",
            "description": "A cross, provided by Dusan Tadic (Southampton), caused no threat to the opposition's defence as the ball was cleared out of danger."
        },
        {
            "gameTime": "2 - 43:18",
            "label": "",
            "description": "Antonio Valencia (Manchester United) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "2 - 42:49",
            "label": "",
            "description": "Southampton enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 40:33",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Sadio Mane finds Graziano Pelle (Southampton), who jumps highest and steers a close range header straight into the top right corner. His effort was both strong and precise, and David de Gea had no chance of stopping that. 1:3."
        },
        {
            "gameTime": "2 - 39:42",
            "label": "",
            "description": "Dusan Tadic (Southampton) sends a lofted cross into the box from the free kick, but David de Gea guesses his intention and plucks the ball out of the air."
        },
        {
            "gameTime": "2 - 39:24",
            "label": "",
            "description": "Memphis Depay (Manchester United) was trying to get to the ball but clattered into the legs of the opponent as well. Mark Clattenburg blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 39:09",
            "label": "",
            "description": "Virgil Van Dijk (Southampton) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 36:45",
            "label": "injury",
            "description": "The game is interrupted now, Virgil Van Dijk (Southampton) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 34:02",
            "label": "",
            "description": "Memphis Depay (Manchester United) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 33:19",
            "label": "",
            "description": "Memphis Depay (Manchester United) fails to convert a close range free kick as he sends the ball narrowly over the bar."
        },
        {
            "gameTime": "2 - 32:20",
            "label": "y-card",
            "description": "A yellow card for a tackle by Jose Fonte (Southampton). Mark Clattenburg doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 30:24",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and James Ward Prowse walks off the pitch to be replaced by Shane Long (Southampton)."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "",
            "description": "Sadio Mane (Southampton) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 28:29",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) steps up and sends the free kick straight into the defensive wall."
        },
        {
            "gameTime": "2 - 27:32",
            "label": "y-card",
            "description": "Virgil Van Dijk (Southampton) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Mark Clattenburg didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 26:58",
            "label": "",
            "description": "A cross from Dusan Tadic (Southampton) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 26:27",
            "label": "",
            "description": "Virgil Van Dijk (Southampton) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 23:37",
            "label": "substitution",
            "description": "That will be all from Marcos Rojo who is being replaced by the fresh legs of Paddy McNair (Manchester United)."
        },
        {
            "gameTime": "2 - 22:45",
            "label": "soccer-ball",
            "description": "Goal! Mata (Manchester United) picks up the ball from a rebound and from the edge of the box he unleashes a shot inside the right post. It's 1:3."
        },
        {
            "gameTime": "2 - 22:40",
            "label": "",
            "description": "OFF THE POST! Good play from Memphis Depay (Manchester United) as skips past two defending players and from the edge of the box unleashes a decent strike that smashes the right post!"
        },
        {
            "gameTime": "2 - 21:11",
            "label": "funfact",
            "description": "6:13 – this is the current number of fouls committed by both teams."
        },
        {
            "gameTime": "2 - 18:36",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "2 - 18:16",
            "label": "",
            "description": "Memphis Depay (Manchester United) looks to break free, but an opposing player clears the ball away. Manchester United force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 15:44",
            "label": "",
            "description": "Marcos Rojo (Manchester United) brings his opponent down. Mark Clattenburg has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 14:57",
            "label": "substitution",
            "description": "Substitution. Bastian Schweinsteiger (Manchester United) on for Michael Carrick."
        },
        {
            "gameTime": "2 - 14:03",
            "label": "",
            "description": "Jose Fonte (Southampton) jumps inside the box to meet the corner and aims a header towards the right post, but the goalkeeper pulls off an astonishing save to deny him."
        },
        {
            "gameTime": "2 - 13:14",
            "label": "corner",
            "description": "Dusan Tadic (Southampton) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 12:56",
            "label": "",
            "description": "Maya Yoshida (Southampton) crosses the ball forward but it is intercepted. The referee signals a corner kick to Southampton."
        },
        {
            "gameTime": "2 - 11:19",
            "label": "corner",
            "description": "A dangerous looking corner kick from James Ward Prowse (Southampton) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 10:54",
            "label": "",
            "description": "Virgil Van Dijk (Southampton) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. Southampton win a corner."
        },
        {
            "gameTime": "2 - 10:41",
            "label": "substitution",
            "description": "It will be a substitution. Steven Davis (Southampton) is ready to enter the pitch as Oriol Romeu walks off."
        },
        {
            "gameTime": "2 - 10:27",
            "label": "",
            "description": "Morgan Schneiderlin (Manchester United) pulls the jersey of one of the opposition players and Mark Clattenburg blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 09:04",
            "label": "",
            "description": "James Ward Prowse (Southampton) whips a long ball in from the free kick which is intercepted by David de Gea."
        },
        {
            "gameTime": "2 - 07:42",
            "label": "",
            "description": "Memphis Depay (Manchester United) creates some space for himself and unleashes a strike from long range, but his effort sails just wide of the left post."
        },
        {
            "gameTime": "2 - 06:59",
            "label": "attendance",
            "description": "The attendance for today's match is 31588."
        },
        {
            "gameTime": "2 - 05:51",
            "label": "",
            "description": "James Ward Prowse (Southampton) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "2 - 04:47",
            "label": "soccer-ball",
            "description": "GOAL! A terrible mistake leads to a goal. The defender ends up losing possession, allowing Anthony Martial (Manchester United) to pick up the ball before slotting it into the back of the net to make it 1:2."
        },
        {
            "gameTime": "2 - 04:15",
            "label": "",
            "description": "Wayne Rooney (Manchester United) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "2 - 02:30",
            "label": "",
            "description": "Dusan Tadic (Southampton) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 01:59",
            "label": "",
            "description": "Anthony Martial (Manchester United) makes a reckless foul in order to win the ball from his opponent. Mark Clattenburg has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Ronald Koeman makes a switch. Cuco Martina (Southampton) is coming on in place of Matt Targett at the start of the second period."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Louis van Gaal gives a chance to Antonio Valencia (Manchester United) and Matteo Darmian is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We can hope that the managers will be able to motivate the players and stir them to improve their performance for after the half time break. We haven't seen really exciting football in the previous 45 minutes. Even first half from both sides, and they've both had chances. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 46:15",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:33",
            "label": "",
            "description": "Matt Targett (Southampton) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:18",
            "label": "injury",
            "description": "Matt Targett (Southampton) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 42:09",
            "label": "corner",
            "description": "The resulting corner from Juan Manuel Mata (Manchester United) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "",
            "description": "Mata (Manchester United) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort. The referee and one of his assistants signal for a corner kick to Manchester United."
        },
        {
            "gameTime": "1 - 41:22",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "",
            "description": "Memphis Depay (Manchester United) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. The referee points to the corner flag. It's a corner to Manchester United."
        },
        {
            "gameTime": "1 - 40:53",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 40:36",
            "label": "",
            "description": "Memphis Depay (Manchester United) races towards goal but the defender gets back well to make a challenge. It will be a corner kick for Manchester United."
        },
        {
            "gameTime": "1 - 39:41",
            "label": "",
            "description": "Anthony Martial (Manchester United) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 36:44",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Manchester United."
        },
        {
            "gameTime": "1 - 33:53",
            "label": "soccer-ball",
            "description": "Anthony Martial (Manchester United) receives a killer pass, finds himself one on one with the goalkeeper and sends a low drive past the goalkeeper."
        },
        {
            "gameTime": "1 - 31:55",
            "label": "",
            "description": "Marcos Rojo (Manchester United) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 28:58",
            "label": "",
            "description": "Morgan Schneiderlin (Manchester United) fouls an opponent. At least that's what referee Mark Clattenburg signals."
        },
        {
            "gameTime": "1 - 27:53",
            "label": "",
            "description": "Mata (Manchester United) brings his opponent down with a tackle and Mark Clattenburg blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 26:39",
            "label": "corner",
            "description": "The corner from James Ward Prowse (Southampton) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 26:06",
            "label": "",
            "description": "Graziano Pelle (Southampton) finds his way to a cross and strikes towards the goal, but one of the defending players deflects the ball away. Southampton have a corner."
        },
        {
            "gameTime": "1 - 25:39",
            "label": "",
            "description": "Sadio Mane (Southampton) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 25:17",
            "label": "",
            "description": "Memphis Depay (Manchester United) sends a cross into the box, but Maarten Stekelenburg comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 23:33",
            "label": "",
            "description": "He should have done better. Memphis Depay (Manchester United) is afforded space to connect with a Mata cross, but his header from the centre of the box flies well over the crossbar."
        },
        {
            "gameTime": "1 - 22:30",
            "label": "",
            "description": "Graziano Pelle (Southampton) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball sails well over the bar!"
        },
        {
            "gameTime": "1 - 19:57",
            "label": "",
            "description": "James Ward Prowse (Southampton) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but David de Gea was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 18:57",
            "label": "",
            "description": "Mark Clattenburg blows his whistle after Wayne Rooney (Manchester United) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 16:59",
            "label": "",
            "description": "Memphis Depay passes to Anthony Martial (Manchester United), but he produces a wild shot from the edge of the box which goes high over the bar."
        },
        {
            "gameTime": "1 - 15:33",
            "label": "",
            "description": "OFF THE POST! Graziano Pelle (Southampton) runs towards the goal to give his teammate support. He receives a fantastic pass and shoots from the edge of the box, but it crashes against the right post. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "1 - 12:42",
            "label": "soccer-ball",
            "description": "Goal! Graziano Pelle (Southampton) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball low inside the left post. It's 1:0."
        },
        {
            "gameTime": "1 - 12:38",
            "label": "",
            "description": "Sadio Mane (Southampton) latches on to a precise lofted cross inside the box, controls the ball and unleashes a fine strike towards the middle of the goal. His dangerous effort is blocked by David de Gea, who makes a glorious save!"
        },
        {
            "gameTime": "1 - 11:25",
            "label": "corner",
            "description": "James Ward Prowse (Southampton) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 11:03",
            "label": "",
            "description": "Dusan Tadic (Southampton) flights in the cross, but the defender is alert and clears to safety. The linesman makes the right call and Southampton will have a corner."
        },
        {
            "gameTime": "1 - 09:52",
            "label": "",
            "description": "Dusan Tadic (Southampton) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the left post."
        },
        {
            "gameTime": "1 - 07:43",
            "label": "",
            "description": "Graziano Pelle (Southampton) sends a pass into the box, but his attempt is thwarted and cleared. The ball is out of play. Southampton will have a throw in."
        },
        {
            "gameTime": "1 - 06:51",
            "label": "",
            "description": "Matteo Darmian (Manchester United) makes a rough challenge and Mark Clattenburg blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 06:08",
            "label": "",
            "description": "Sadio Mane (Southampton) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "1 - 04:52",
            "label": "",
            "description": "Dusan Tadic (Southampton) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "1 - 02:41",
            "label": "",
            "description": "The referee blows his whistle as Sadio Mane (Southampton) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "",
            "description": "Manchester United are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Southampton will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Mark Clattenburg will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "22 That's the number of clean sheets Manchester United have already kept in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Southampton have completed big transfer and they have signed Virgil Van Dijk (Celtic)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Southampton have already won 63 points from home and away matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a very watchable match. Great goals and there was plenty of action at both ends of the pitch. No regrets about following this game. You have to say that the visitors have been the better side. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "Manchester United",
    "gameDate": "20/09/2015 - 18:00",
    "gameHomeTeam": "Southampton",
    "gameScore": "2 - 3"
}