{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-05-20 - 19-00 Chievo 3 - 5 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:05",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "",
            "description": "Samuel Bastien (Chievo) was too fierce in his attempt to get the ball from his opponent and Antonio Damato blows for a foul."
        },
        {
            "gameTime": "2 - 47:24",
            "label": "",
            "description": "AS Roma are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 41:44",
            "label": "substitution",
            "description": "Rolando Maran has decided to make a change. Emanuel Vignato (Chievo) replaces Roberto Inglese."
        },
        {
            "gameTime": "2 - 40:50",
            "label": "soccer-ball",
            "description": "Goal! The resulting corner is whipped into the box and Roberto Inglese (Chievo) buries the ball into the back of the net from a Sergio Pellissier knock down. 3:5."
        },
        {
            "gameTime": "2 - 40:40",
            "label": "corner",
            "description": "Valter Birsa (Chievo) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 40:38",
            "label": "substitution",
            "description": "Substitution. Edin Dzeko makes way for Francesco Totti (AS Roma)."
        },
        {
            "gameTime": "2 - 37:41",
            "label": "soccer-ball",
            "description": "Goal! That was a fantastic finish by Edin Dzeko (AS Roma) from just outside the box. He wasted little time in getting away a bullet of a shot that flew past the goalkeeper into the right side of the net."
        },
        {
            "gameTime": "2 - 36:31",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to introduce fresh legs, with Diego Perotti (AS Roma) replacing Mohamed Salah."
        },
        {
            "gameTime": "2 - 36:03",
            "label": "",
            "description": "Bostjan Cesar (Chievo) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but it goes well wide of the left post."
        },
        {
            "gameTime": "2 - 35:38",
            "label": "corner",
            "description": "There's an opportunity for Valter Birsa (Chievo) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 35:28",
            "label": "",
            "description": "Roberto Inglese (Chievo) blasts the ball from just outside the box, but his attempt is blocked by the defender. Chievo have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 34:04",
            "label": "",
            "description": "Mohamed Salah (AS Roma) blows a huge opportunity! He latches on to a perfect cross from the wing into the penalty area, but sends a bullet header just wide of the left post!"
        },
        {
            "gameTime": "2 - 30:58",
            "label": "soccer-ball",
            "description": "Goal! Mohamed Salah (AS Roma) collects a pass and without hesitation fires an unstoppable shot into the bottom left corner."
        },
        {
            "gameTime": "2 - 29:46",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) outjumps the defence to meet the resulting corner and heads the ball towards the bottom left corner. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "2 - 29:34",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 29:08",
            "label": "",
            "description": "Stefano Sorrentino can hear the fans clapping for his superb goalkeeping after he magnificently stopped the close range effort from Edin Dzeko (AS Roma). The ball would have probably ended up in the bottom right corner. The linesman makes the right call and AS Roma will have a corner."
        },
        {
            "gameTime": "2 - 25:18",
            "label": "substitution",
            "description": "Here's the change. Stephan El Shaarawy leaves the pitch and Radja Nainggolan (AS Roma) comes on as a substitute."
        },
        {
            "gameTime": "2 - 23:58",
            "label": "corner",
            "description": "A corner kick by Chievo is thwarted by the well prepared Wojciech Szczesny (AS Roma)."
        },
        {
            "gameTime": "2 - 22:15",
            "label": "",
            "description": "Roberto Inglese (Chievo) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 20:46",
            "label": "",
            "description": "Fabrizio Cacciatore (Chievo) attempts to convert a lofted cross as he jumps high and heads the ball to the right side of the goal. Wojciech Szczesny shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net."
        },
        {
            "gameTime": "2 - 17:56",
            "label": "",
            "description": "Valter Birsa (Chievo) commits a rough challenge and Antonio Damato blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "soccer-ball",
            "description": "Stephan El Shaarawy (AS Roma) converts a killer cross with a precise low shot that goes into the bottom left corner. What a brilliant finish!"
        },
        {
            "gameTime": "2 - 11:44",
            "label": "substitution",
            "description": "Rolando Maran is forced to make a change. Alessandro Gamberini is not able to carry on due to injury. He is replaced by Nicolas Frey (Chievo)."
        },
        {
            "gameTime": "2 - 09:13",
            "label": "injury",
            "description": "Alessandro Gamberini (Chievo) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 07:36",
            "label": "",
            "description": "Mohamed Salah (AS Roma) unleashes a shot, but it's well wide of the left hand post."
        },
        {
            "gameTime": "2 - 05:11",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 04:44",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes the corner but it's cleared. The referee points to the corner flag and AS Roma will take a corner."
        },
        {
            "gameTime": "2 - 02:24",
            "label": "",
            "description": "The linesman raises his flag as one of the players from AS Roma was in an offside position."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "y-card",
            "description": "Antonio Damato shows a yellow card to Ivan Radovanovic (Chievo) for a tough tackle."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Rolando Maran decided to make a change. Lucas Castro is replaced by Sergio Pellissier (Chievo)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:09",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "soccer-ball",
            "description": "Mohamed Salah (AS Roma) breaks through the defence and scores a brilliant goal from outside the penalty area after firing the ball inside the left post!"
        },
        {
            "gameTime": "1 - 40:43",
            "label": "",
            "description": "A header by Mohamed Salah (AS Roma) from very close range goes towards the middle of the target, but doesn't get past Stefano Sorrentino, who makes a nice save."
        },
        {
            "gameTime": "1 - 39:36",
            "label": "",
            "description": "Antonio Damato has a clear sight and sees a foul from Lucas Castro (Chievo)."
        },
        {
            "gameTime": "1 - 38:56",
            "label": "",
            "description": "Flag up against Edin Dzeko (AS Roma). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 36:58",
            "label": "soccer-ball",
            "description": "Goal! Valter Birsa clips a neat ball into the box in the direction of Roberto Inglese (Chievo), who jumps highest and steers a bullet header from the centre of the box into the middle of the net. Wojciech Szczesny had no chance of stopping that. 2:1."
        },
        {
            "gameTime": "1 - 36:18",
            "label": "",
            "description": "Leandro Paredes (AS Roma) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "1 - 35:58",
            "label": "",
            "description": "Dangerous play by Fabio Depaoli (Chievo). Antonio Damato blows his whistle for a foul. AS Roma win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 34:41",
            "label": "",
            "description": "Kevin Strootman (AS Roma) shoots from outside the box, but his effort is blocked. The ball is out of play. A goal scoring opportunity from a corner for AS Roma."
        },
        {
            "gameTime": "1 - 31:47",
            "label": "corner",
            "description": "The resulting corner from Leandro Paredes (AS Roma) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 31:29",
            "label": "",
            "description": "Mohamed Salah (AS Roma) tries to send a pass but it's blocked. AS Roma earn a corner."
        },
        {
            "gameTime": "1 - 30:11",
            "label": "",
            "description": "Kevin Strootman (AS Roma) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 29:33",
            "label": "",
            "description": "Edin Dzeko (AS Roma) commits a rough challenge and Antonio Damato blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 27:58",
            "label": "soccer-ball",
            "description": "Goal! Some very poor defending from the opponent allows Stephan El Shaarawy (AS Roma) the chance to get to the edge of the box and he makes no mistake with a lovely finish. It's 1:1."
        },
        {
            "gameTime": "1 - 25:45",
            "label": "",
            "description": "Antonio Damato couldn't ignore the rough tackle by Fabrizio Cacciatore (Chievo) and blew his whistle."
        },
        {
            "gameTime": "1 - 19:47",
            "label": "",
            "description": "Edin Dzeko (AS Roma) is clearly in an offside position after the ball is played through to him and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 18:07",
            "label": "",
            "description": "Valter Birsa (Chievo) receives a precise pass on the edge of the box and releases a promising effort. Unfortunately for him, his strike flies painfully close to the right post."
        },
        {
            "gameTime": "1 - 14:54",
            "label": "y-card",
            "description": "Lucas Castro (Chievo) is awarded a yellow card."
        },
        {
            "gameTime": "1 - 14:39",
            "label": "soccer-ball",
            "description": "Goal! Lucas Castro (Chievo) pounced on a loose ball inside the box and beats the goalkeeper with a shot inside the left post. He makes it 1:0."
        },
        {
            "gameTime": "1 - 13:41",
            "label": "",
            "description": "Samuel Bastien (Chievo) receives a reproachful look from his teammates after he attempted to surprise the goalkeeper with a shot from long distance. The ball flew far wide of the right post."
        },
        {
            "gameTime": "1 - 10:45",
            "label": "",
            "description": "Antonio Damato blows his whistle. Fabio Depaoli (Chievo) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 08:06",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Leandro Paredes (AS Roma)."
        },
        {
            "gameTime": "1 - 07:40",
            "label": "",
            "description": "Mohamed Salah (AS Roma) unleashes a decent volley towards goal, but is denied by an excellent save from the goalkeeper. The referee signals a corner kick to AS Roma."
        },
        {
            "gameTime": "1 - 04:32",
            "label": "",
            "description": "It looked like the long range shot by Ivan Radovanovic (Chievo) would end up in the net, but the effort went painfully wide of the left post. The goalkeeper was quite lucky this time."
        },
        {
            "gameTime": "1 - 02:59",
            "label": "",
            "description": "Leandro Paredes (AS Roma) stands over the free kick and opts to take it himself, but it is straight at Stefano Sorrentino."
        },
        {
            "gameTime": "1 - 02:20",
            "label": "",
            "description": "Samuel Bastien (Chievo) pulls the jersey of one of the opposition players and Antonio Damato blows his whistle for a foul. AS Roma are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 01:24",
            "label": "",
            "description": "Ivan Radovanovic (Chievo) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and AS Roma will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Damato will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko have rippled the net 27x and is the top scorer for AS Roma this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have seen many goals in the previous 5 matches between these two teams, with an average of 3.2 goals per game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "20/05/2017 - 19:00",
    "gameHomeTeam": "Chievo",
    "gameScore": "3 - 5"
}