{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-01-08 - 17-00 Genoa 0 - 1 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:04",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. AS Roma had more of the game and were superior. Their manager will certainly be the happier of the two managers. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        },
        {
            "gameTime": "2 - 49:03",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 47:31",
            "label": "corner",
            "description": "The corner kick from Edenilson (Genoa) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 47:05",
            "label": "",
            "description": "Lucas Ocampos (Genoa) fashions a shot from the edge of the box after receiving an accurate pass. Wojciech Szczesny makes a stunning save to stop the effort from flying into the top right corner. Genoa earn a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:28",
            "label": "",
            "description": "That's a well taken pass by Daniele De Rossi (AS Roma). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Radja Nainggolan as he is replaced by Leandro Paredes (AS Roma)."
        },
        {
            "gameTime": "2 - 41:38",
            "label": "",
            "description": "Mauricio Pinilla (Genoa) attempts to put the ball in from a rebound with his long range shot, but it isn't accurate enough, and the ball goes high over the crossbar."
        },
        {
            "gameTime": "2 - 41:22",
            "label": "",
            "description": "Lucas Ocampos (Genoa) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 39:58",
            "label": "",
            "description": "Edenilson (Genoa) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "2 - 39:41",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Konstantinos Manolas (AS Roma) replaces Bruno Peres."
        },
        {
            "gameTime": "2 - 38:56",
            "label": "y-card",
            "description": "Federico Fazio (AS Roma) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "2 - 38:33",
            "label": "",
            "description": "The game is interrupted as Edenilson (Genoa) is flagged offside."
        },
        {
            "gameTime": "2 - 37:35",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Diego Laxalt (Genoa), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 35:54",
            "label": "y-card",
            "description": "Lucas Ocampos (Genoa) is given a fully deserved yellow card."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "",
            "description": "Mauricio Pinilla (Genoa) stands over the resultant free kick from mid range, but his shot goes just over the crossbar. It could have been a fantastic goal!"
        },
        {
            "gameTime": "2 - 33:35",
            "label": "",
            "description": "Federico Fazio (AS Roma) commits a rough challenge and Nicola Rizzoli blows his whistle for an infringement. Genoa are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 33:00",
            "label": "substitution",
            "description": "Luciano Spalletti prepares a substitution. Diego Perotti is replaced by Stephan El Shaarawy (AS Roma)."
        },
        {
            "gameTime": "2 - 32:22",
            "label": "substitution",
            "description": "We are about to witness a substitution. Mauricio Pinilla (Genoa) is replacing Darko Lazovic."
        },
        {
            "gameTime": "2 - 30:06",
            "label": "",
            "description": "A precise cross towards the penalty spot was latched onto by Giovanni Simeone (Genoa). He outjumped the defence and produced a decent header which went a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 29:09",
            "label": "",
            "description": "Lucas Ocampos (Genoa) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "2 - 27:13",
            "label": "corner",
            "description": "The corner from Bruno Peres (AS Roma) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 26:33",
            "label": "",
            "description": "Bruno Peres (AS Roma) races towards goal but the defender gets back well to make a challenge. The referee points to the corner flag. It's a corner to AS Roma."
        },
        {
            "gameTime": "2 - 25:43",
            "label": "",
            "description": "Ezequiel Munoz (Genoa) sends a long ball in, but Wojciech Szczesny comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 24:05",
            "label": "",
            "description": "Edin Dzeko (AS Roma) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just over the crossbar."
        },
        {
            "gameTime": "2 - 20:11",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Kevin Strootman (AS Roma) was quite harsh and Nicola Rizzoli didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 19:09",
            "label": "",
            "description": "Giovanni Simeone (Genoa) is flagged for offside."
        },
        {
            "gameTime": "2 - 18:30",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "",
            "description": "Nice individual effort by Edin Dzeko (AS Roma). He gets all the way through to the keeper and hits a low drive to the bottom right corner, but Eugenio Lamanna does a good job to anticipate the direction of the ball and keeps it out. The ball is out of play. A goal scoring opportunity from a corner for AS Roma."
        },
        {
            "gameTime": "2 - 16:58",
            "label": "substitution",
            "description": "It's time for a substitution. Edenilson (Genoa) comes on in place of Nikola Ninkovic."
        },
        {
            "gameTime": "2 - 15:03",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it."
        },
        {
            "gameTime": "2 - 13:45",
            "label": "",
            "description": "A cross from Darko Lazovic (Genoa) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 12:29",
            "label": "",
            "description": "Eugenio Lamanna pulls off a great save to block a header from Radja Nainggolan (AS Roma) after a nice lofted cross."
        },
        {
            "gameTime": "2 - 11:34",
            "label": "",
            "description": "Bruno Peres (AS Roma) plays in a hopeful cross, but it doesn't find its way to any of the attacking players. The ball goes out of play and Genoa will have a goal kick."
        },
        {
            "gameTime": "2 - 09:59",
            "label": "",
            "description": "Darko Lazovic (Genoa) receives a precise pass on the edge of the box and bends his effort inches wide of the left post."
        },
        {
            "gameTime": "2 - 09:02",
            "label": "",
            "description": "Bruno Peres (AS Roma) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "",
            "description": "Diego Laxalt (Genoa) makes a driving run into the box but he cannot work any space for a shot. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "2 - 05:21",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 05:05",
            "label": "",
            "description": "Bruno Peres (AS Roma) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. It will be a corner kick for AS Roma."
        },
        {
            "gameTime": "2 - 04:00",
            "label": "y-card",
            "description": "Daniele De Rossi (AS Roma) goes into the referee's book for dissent."
        },
        {
            "gameTime": "2 - 03:09",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 02:36",
            "label": "corner",
            "description": "Eugenio Lamanna leaps to collect the ball from the corner which was sent over by Bruno Peres (AS Roma). The referee signals a corner kick to AS Roma."
        },
        {
            "gameTime": "2 - 02:13",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) gets on the end of a pass on the edge of the box but his shot is blocked. The linesman makes the right call and AS Roma will have a corner."
        },
        {
            "gameTime": "2 - 01:28",
            "label": "",
            "description": "Darko Lazovic (Genoa) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 47:04",
            "label": "",
            "description": "Today's clash hasn't been that attractive up to now, but it hasn't been a total borefest. There have been a few nice movements for both sides. AS Roma have arguably been the better of the two sides in the first half. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 47:03",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Nicola Rizzoli has ended it."
        },
        {
            "gameTime": "1 - 46:14",
            "label": "",
            "description": "Edin Dzeko (AS Roma) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 43:58",
            "label": "",
            "description": "Great teamplay by AS Roma as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 37:31",
            "label": "y-card",
            "description": "Nicola Rizzoli shows a yellow card to Antonio Rudiger (AS Roma) for his blatant foul."
        },
        {
            "gameTime": "1 - 35:38",
            "label": "soccer-ball-own",
            "description": "An unfortunate own goal is conceded by Armando Izzo (Genoa), who attempted to block the ball after a cross, but instead he sends it inside the bottom left corner of his own goal."
        },
        {
            "gameTime": "1 - 32:30",
            "label": "",
            "description": "Giovanni Simeone receives a sweet pass inside the box from Darko Lazovic (Genoa), but one of the defenders is first to the ball and makes an interception."
        },
        {
            "gameTime": "1 - 31:11",
            "label": "",
            "description": "Genoa keep the ball and are displaying some tiki taka style passing at the moment."
        },
        {
            "gameTime": "1 - 29:10",
            "label": "",
            "description": "Diego Perotti (AS Roma) escapes his marker to connect with a cross and heads towards the right side of the goal, but the keeper pulls off an excellent save to deny him."
        },
        {
            "gameTime": "1 - 27:50",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) sends the corner into the box, but Eugenio Lamanna intercepts it and averts the threat."
        },
        {
            "gameTime": "1 - 27:32",
            "label": "",
            "description": "Diego Perotti (AS Roma) produces a dangerous low pass into the penalty area, but the defence manage to cut it out. The ball is out of play and AS Roma manage to earn a corner."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "y-card",
            "description": "Isaac Cofie (Genoa) is booked after bringing down an opponent. Nicola Rizzoli had an easy decision to make."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity!"
        },
        {
            "gameTime": "1 - 23:43",
            "label": "",
            "description": "A neat pass is well received by Lucas Ocampos (Genoa), who is lurking on the edge of the box and strikes the ball towards the right post, but the goalkeeper makes an incredible diving save to block his shot."
        },
        {
            "gameTime": "1 - 22:27",
            "label": "",
            "description": "Diego Laxalt (Genoa) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 21:44",
            "label": "",
            "description": "Edin Dzeko (AS Roma) receives a low pass just outside the box and unleashes a fine strike towards the roof of the net. Eugenio Lamanna pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 18:51",
            "label": "",
            "description": "Nikola Ninkovic (Genoa) sends over a free kick from long range but the defence is alert."
        },
        {
            "gameTime": "1 - 18:25",
            "label": "",
            "description": "Nicola Rizzoli couldn't ignore the rough tackle by Antonio Rudiger (AS Roma) and blew his whistle. That's a free kick to Genoa."
        },
        {
            "gameTime": "1 - 17:20",
            "label": "",
            "description": "Darko Lazovic (Genoa) sends a teasing cross into the area, but Wojciech Szczesny intercepts the ball."
        },
        {
            "gameTime": "1 - 16:53",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Lucas Ocampos (Genoa)."
        },
        {
            "gameTime": "1 - 15:33",
            "label": "",
            "description": "Emerson (AS Roma) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the left side of the net, but Eugenio Lamanna leaps like a salmon to deny him."
        },
        {
            "gameTime": "1 - 14:16",
            "label": "",
            "description": "Close! Radja Nainggolan (AS Roma) picks up the ball in space and from inside the penalty area sends a shot inches wide of the right post. The ball is off of the pitch and it's a goal kick for Genoa."
        },
        {
            "gameTime": "1 - 13:40",
            "label": "",
            "description": "Giovanni Simeone (Genoa) finds himself beyond the last defender but the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 12:57",
            "label": "corner",
            "description": "The corner from Bruno Peres (AS Roma) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 12:47",
            "label": "",
            "description": "An attempted cross from Diego Perotti (AS Roma) is cleared. AS Roma will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 12:19",
            "label": "",
            "description": "Emerson (AS Roma) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 11:56",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) takes a short corner kick."
        },
        {
            "gameTime": "1 - 11:32",
            "label": "",
            "description": "A lofted cross from Kevin Strootman (AS Roma) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. AS Roma force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 10:10",
            "label": "",
            "description": "Emerson (AS Roma) sends a long ball in, but Eugenio Lamanna comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 08:00",
            "label": "substitution",
            "description": "Problems for Ivan Juric as Mattia Perin is not able to play anymore. His injury is too serious and Eugenio Lamanna (Genoa) replaces him."
        },
        {
            "gameTime": "1 - 07:04",
            "label": "",
            "description": "Darko Lazovic (Genoa) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 06:23",
            "label": "",
            "description": "A cross into the box from Giovanni Simeone (Genoa) is cleared."
        },
        {
            "gameTime": "1 - 05:34",
            "label": "",
            "description": "Diego Laxalt (Genoa) looks to break free, but his touch lets him down and he loses the ball. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "1 - 02:34",
            "label": "",
            "description": "CHANCE! Edin Dzeko (AS Roma) goes very close! He gathers a cross inside the box and fires a low shot towards Eugenio Lamanna, who produces an excellent reflex save."
        },
        {
            "gameTime": "1 - 01:53",
            "label": "corner",
            "description": "Darko Lazovic (Genoa) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 00:51",
            "label": "",
            "description": "Diego Laxalt (Genoa) takes a brilliant touch after he latches on to a pass on the edge of the box and strikes the ball to the bottom right corner. The goalkeeper dives low and saves his attempt. The linesman points to the corner flag, Genoa are going to take it."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Genoa will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Nicola Rizzoli will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "5 The number of away defeats for AS Roma."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most frequent result for Genoa this season has been 0:1, 4 of their matches ended like this."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. AS Roma had more of the game and were superior. Their manager will certainly be the happier of the two managers. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "08/01/2017 - 17:00",
    "gameHomeTeam": "Genoa",
    "gameScore": "0 - 1"
}