{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2014-2015/2015-02-21 - 18-00 Swansea 2 - 1 Manchester United/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. It was an even match on the whole, with both sides enjoying spells in the ascendancy. The home team played long ball football unlike the away side who attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 49:53",
            "label": "whistle",
            "description": "Neil Swarbrick is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 48:02",
            "label": "substitution",
            "description": "Here comes a substitution. Jonjo Shelvey is given a rest as he is replaced by Jordi Amat (Swansea)."
        },
        {
            "gameTime": "2 - 45:38",
            "label": "y-card",
            "description": "Jonjo Shelvey (Swansea) picks up a yellow card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "",
            "description": "Marouane Fellaini (Manchester United) is flagged for offside."
        },
        {
            "gameTime": "2 - 42:33",
            "label": "y-card",
            "description": "Marcos Rojo (Manchester United) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 42:25",
            "label": "y-card",
            "description": "Ashley Williams (Swansea) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Neil Swarbrick ignores the protests."
        },
        {
            "gameTime": "2 - 40:34",
            "label": "",
            "description": "Bafetimbi Gomis (Swansea) receives a precise low pass inside the box, controls the ball and drills it to the middle of the goal, but David de Gea makes a comfortable save to stop his effort."
        },
        {
            "gameTime": "2 - 38:17",
            "label": "y-card",
            "description": "Neil Swarbrick shows a yellow card to Ashley Young (Manchester United), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 37:38",
            "label": "corner",
            "description": "The corner from Wayne Rooney (Manchester United) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 37:26",
            "label": "",
            "description": "David de Gea (Manchester United) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The ball goes out of play. Manchester United are awarded a corner kick."
        },
        {
            "gameTime": "2 - 33:24",
            "label": "substitution",
            "description": "The substitution is prepared. Juan Manuel Mata (Manchester United) joins the action as a substitute, replacing Angel Di Maria."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "corner",
            "description": "The corner from Jonjo Shelvey (Swansea) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 31:30",
            "label": "",
            "description": "Wayne Routledge (Swansea) slaloms his way past challenges, but an opposing player does well to get the ball away. Good work from Swansea as they win a corner."
        },
        {
            "gameTime": "2 - 28:38",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Jefferson Montero (Swansea) comes onto the pitch so that Gylfi Sigurdsson can be given a rest."
        },
        {
            "gameTime": "2 - 27:39",
            "label": "soccer-ball",
            "description": "Bafetimbi Gomis (Swansea) deflects his teammate's shot into the middle of the goal by using his body. The goalkeeper reacted to the earlier shot so the deflection only confused him. A lucky goal that counts anyway."
        },
        {
            "gameTime": "2 - 25:24",
            "label": "corner",
            "description": "Angel Di Maria (Manchester United) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 25:10",
            "label": "",
            "description": "Angel Di Maria (Manchester United) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play and Manchester United manage to earn a corner."
        },
        {
            "gameTime": "2 - 24:19",
            "label": "corner",
            "description": "Wayne Rooney (Manchester United) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 24:01",
            "label": "",
            "description": "Wayne Rooney (Manchester United) swings in a cross, but the ball is cleared to safety by one of the defending players. The referee and his assistant both point at the corner flag. Manchester United will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 22:26",
            "label": "",
            "description": "Robin van Persie (Manchester United) takes a great touch after receiving a pass inside the box. He immediately unleashes a low shot to the middle of the goal, but the keeper pulls off a decent save!"
        },
        {
            "gameTime": "2 - 21:21",
            "label": "corner",
            "description": "Lukasz Fabianski leaps to collect the ball from the corner which was sent over by Angel Di Maria (Manchester United)."
        },
        {
            "gameTime": "2 - 21:04",
            "label": "",
            "description": "Ashley Young (Manchester United) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball goes out for a corner. Manchester United can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 20:43",
            "label": "",
            "description": "Marcos Rojo (Manchester United) connects with the corner but his looping header goes well over."
        },
        {
            "gameTime": "2 - 20:15",
            "label": "corner",
            "description": "Angel Di Maria (Manchester United) will take the corner."
        },
        {
            "gameTime": "2 - 19:41",
            "label": "",
            "description": "Daley Blind (Manchester United) delivers a promising cross into the box, but it's cleared. The ball is out of play and the linesman points at the corner flag. Corner to Manchester United."
        },
        {
            "gameTime": "2 - 18:01",
            "label": "corner",
            "description": "Angel Di Maria (Manchester United) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 17:46",
            "label": "",
            "description": "The ball is cleared after Marouane Fellaini (Manchester United) attempted to dribble past an opposing player. Manchester United have a corner."
        },
        {
            "gameTime": "2 - 17:08",
            "label": "",
            "description": "Ashley Young (Manchester United) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "2 - 14:29",
            "label": "",
            "description": "Close! Robin van Persie (Manchester United) picks up the ball in space and from inside the penalty area sends a shot inches wide of the left post."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "substitution",
            "description": "Here's the change. Luke Shaw leaves the pitch and Ashley Young (Manchester United) comes on as a substitute."
        },
        {
            "gameTime": "2 - 11:14",
            "label": "",
            "description": "Neil Swarbrick blows for a foul after Jack Cork (Swansea) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 09:22",
            "label": "corner",
            "description": "Wayne Rooney (Manchester United) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "corner",
            "description": "Angel Di Maria (Manchester United) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger. The ball is out of play. Manchester United will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 08:44",
            "label": "",
            "description": "Marouane Fellaini (Manchester United) crosses the ball into the box, but one of the defending players averts the threat. Corner kick. Manchester United will have an opportunity."
        },
        {
            "gameTime": "2 - 04:47",
            "label": "corner",
            "description": "Angel Di Maria (Manchester United) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "2 - 04:32",
            "label": "",
            "description": "Marouane Fellaini (Manchester United) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. Manchester United earn a corner."
        },
        {
            "gameTime": "2 - 02:25",
            "label": "y-card",
            "description": "Phil Jones (Manchester United) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Neil Swarbrick didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 01:20",
            "label": "",
            "description": "The game is interrupted as Bafetimbi Gomis (Swansea) is flagged offside."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Louis van Gaal gives a chance to Antonio Valencia (Manchester United) and Paddy McNair is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "There was certainly plenty of action during that opening 45 minutes. Both sides have struggled for dominance over the game. The home team are playing long ball football unlike the away side, who are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:23",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:43",
            "label": "y-card",
            "description": "The foul by Marouane Fellaini (Manchester United) is worthy of a card and a yellow is duly shown by Neil Swarbrick."
        },
        {
            "gameTime": "1 - 43:25",
            "label": "corner",
            "description": "Wayne Rooney (Manchester United) takes the corner kick, but Lukasz Fabianski reads it well and stops the effort."
        },
        {
            "gameTime": "1 - 42:58",
            "label": "",
            "description": "A cross into the box from Daley Blind (Manchester United) is cleared. Manchester United force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 41:17",
            "label": "",
            "description": "The linesman raises his flag for offside before Wayne Routledge (Swansea) heads on."
        },
        {
            "gameTime": "1 - 39:09",
            "label": "",
            "description": "What a chance that is! Robin van Persie (Manchester United) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 37:44",
            "label": "",
            "description": "Luke Shaw (Manchester United) was trying to get to the ball but clattered into the legs of the opponent as well. Neil Swarbrick blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 36:55",
            "label": "",
            "description": "Luke Shaw (Manchester United) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 33:35",
            "label": "",
            "description": "That was close by Robin van Persie (Manchester United)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "1 - 31:52",
            "label": "",
            "description": "Daley Blind (Manchester United) brings his opponent down. Neil Swarbrick has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 30:30",
            "label": "",
            "description": "Bafetimbi Gomis (Swansea) is caught offside!"
        },
        {
            "gameTime": "1 - 29:31",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Jonjo Shelvey plays it into the box, and Sung Yong Ki (Swansea) gets on the end of the cross to put it into the back of the net. 0:1."
        },
        {
            "gameTime": "1 - 28:30",
            "label": "",
            "description": "Swansea are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "1 - 27:23",
            "label": "soccer-ball",
            "description": "Goal 0:1! Ander Herrera (Manchester United) gets a shot away from the edge of the box and scores into the bottom left corner. Angel Di Maria provided an assist for the goal."
        },
        {
            "gameTime": "1 - 26:23",
            "label": "",
            "description": "That's a well taken pass by Robin van Persie (Manchester United). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "",
            "description": "Robin van Persie (Manchester United) sends a cross into the box, but Lukasz Fabianski comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 22:46",
            "label": "",
            "description": "Neil Swarbrick blows his whistle for a foul after Marouane Fellaini (Manchester United) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 21:04",
            "label": "corner",
            "description": "A dangerous looking corner kick from Gylfi Sigurdsson (Swansea) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 20:42",
            "label": "",
            "description": "Jonjo Shelvey (Swansea) races towards goal but the defender gets back well to make a challenge. Swansea get a corner."
        },
        {
            "gameTime": "1 - 19:55",
            "label": "",
            "description": "A nice lofted cross finds Wayne Rooney (Manchester United) unmarked and he displays an excellent touch to control the ball. Wayne Rooney (Manchester United) drills a low shot towards the middle of the net, but doesn't give the goalkeeper anything to worry about. An easy save."
        },
        {
            "gameTime": "1 - 16:29",
            "label": "",
            "description": "Wayne Routledge (Swansea) latches on to a pass on the edge of the box, but he can't get any power into the shot and fails to trouble David de Gea."
        },
        {
            "gameTime": "1 - 15:48",
            "label": "",
            "description": "Marcos Rojo (Manchester United) connects with the free kick and produces a header goalwards which is well blocked. The goalkeeper doesn't have to worry about that one."
        },
        {
            "gameTime": "1 - 14:11",
            "label": "",
            "description": "Neil Taylor (Swansea) makes a slide tackle, but referee Neil Swarbrick blows for a foul. It's a free kick to Manchester United, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 11:20",
            "label": "",
            "description": "Bafetimbi Gomis (Swansea) jumps for a cross and produces a fine header from near the penalty spot, but it goes a whisker over the bar! What a huge opportunity!"
        },
        {
            "gameTime": "1 - 10:44",
            "label": "corner",
            "description": "Gylfi Sigurdsson (Swansea) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 09:49",
            "label": "",
            "description": "Gylfi Sigurdsson (Swansea) sends a cross into the box, but the opposition's defence quickly intercepts the ball. Swansea have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 07:45",
            "label": "",
            "description": "Wayne Rooney (Manchester United) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "1 - 05:37",
            "label": "",
            "description": "Bafetimbi Gomis (Swansea) meets a cross and produces a header towards the left side of the goal, but one of the defending players blocks the effort."
        },
        {
            "gameTime": "1 - 04:10",
            "label": "corner",
            "description": "Gylfi Sigurdsson (Swansea) takes the corner."
        },
        {
            "gameTime": "1 - 03:52",
            "label": "",
            "description": "Gylfi Sigurdsson (Swansea) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. The referee points to the corner flag and Swansea will take a corner."
        },
        {
            "gameTime": "1 - 03:02",
            "label": "",
            "description": "Daley Blind (Manchester United) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 01:15",
            "label": "",
            "description": "Marouane Fellaini (Manchester United) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Neil Swarbrick blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Manchester United will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Neil Swarbrick."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. It was an even match on the whole, with both sides enjoying spells in the ascendancy. The home team played long ball football unlike the away side who attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Manchester United",
    "gameDate": "21/02/2015 - 18:00",
    "gameHomeTeam": "Swansea",
    "gameScore": "2 - 1"
}