{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-04-15 - 16-00 AS Roma 1 - 1 Atalanta/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:55",
            "label": "whistle",
            "description": "That's it for today, Piero Giacomelli has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:40",
            "label": "corner",
            "description": "Stephan El Shaarawy (AS Roma) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 47:29",
            "label": "",
            "description": "Federico Fazio (AS Roma) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 46:41",
            "label": "",
            "description": "Edin Dzeko (AS Roma) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 45:50",
            "label": "corner",
            "description": "Francesco Totti (AS Roma) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 41:52",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Antonio Rudiger (AS Roma) was quite harsh and Piero Giacomelli didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 41:12",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to make a change. Francesco Totti (AS Roma) replaces Diego Perotti."
        },
        {
            "gameTime": "2 - 38:30",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Andrea Petagna will be replaced by Alberto Paloschi (Atalanta)."
        },
        {
            "gameTime": "2 - 37:51",
            "label": "",
            "description": "Piero Giacomelli has a clear sight and sees a foul from Andrea Petagna (Atalanta)."
        },
        {
            "gameTime": "2 - 36:16",
            "label": "",
            "description": "Kevin Strootman (AS Roma) receives a fine cross inside the box and attempts to score a goal, but his shot flies just wide of the right post. The ball goes out of play and Atalanta will have a goal kick."
        },
        {
            "gameTime": "2 - 35:32",
            "label": "corner",
            "description": "Stephan El Shaarawy (AS Roma) will take a corner kick."
        },
        {
            "gameTime": "2 - 35:21",
            "label": "",
            "description": "Edin Dzeko (AS Roma) produces a lovely chip pass into the box, but one of the opposition players cuts it out. Corner kick. AS Roma will have an opportunity."
        },
        {
            "gameTime": "2 - 33:43",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Stephan El Shaarawy (AS Roma), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 32:40",
            "label": "substitution",
            "description": "The manager makes a subsitution with Stephan El Shaarawy (AS Roma) coming on for Daniele De Rossi."
        },
        {
            "gameTime": "2 - 32:18",
            "label": "corner",
            "description": "The resulting corner from Radja Nainggolan (AS Roma) is cleared."
        },
        {
            "gameTime": "2 - 26:50",
            "label": "y-card",
            "description": "It must be a yellow card. It is. Mario Rui (AS Roma) receives the caution after an awful tackle."
        },
        {
            "gameTime": "2 - 24:33",
            "label": "y-card",
            "description": "Pierluigi Gollini (Atalanta) goes in the referee's notebook after being shown a yellow card."
        },
        {
            "gameTime": "2 - 22:52",
            "label": "substitution",
            "description": "It's time for a substitution. Bryan Alfredo Cabezas Segura (Atalanta) comes on in place of Jasmin Kurtic."
        },
        {
            "gameTime": "2 - 21:45",
            "label": "",
            "description": "Andrea Conti (Atalanta) commits a foul and Piero Giacomelli immediately signals a free kick."
        },
        {
            "gameTime": "2 - 21:41",
            "label": "corner",
            "description": "Jasmin Kurtic (Atalanta) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 21:25",
            "label": "",
            "description": "Franck Kessie (Atalanta) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The ball goes out of play. Atalanta are awarded a corner kick."
        },
        {
            "gameTime": "2 - 20:43",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) steps up and sends the free kick straight into the defensive wall."
        },
        {
            "gameTime": "2 - 20:27",
            "label": "",
            "description": "Piero Giacomelli blows his whistle after Andrea Conti (Atalanta) brings one of his opponents down with a strong tackle. AS Roma get a free kick."
        },
        {
            "gameTime": "2 - 19:58",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) gathers the ball inside the box and produces a snap shot. The ball only crashes against the crossbar."
        },
        {
            "gameTime": "2 - 15:33",
            "label": "",
            "description": "Diego Perotti (AS Roma) shoots from the edge of the penalty area. The ball travels towards the target, but Pierluigi Gollini easily deals with the threat."
        },
        {
            "gameTime": "2 - 13:19",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity! The ball is off of the pitch and it's a goal kick for Atalanta."
        },
        {
            "gameTime": "2 - 10:55",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) comes close to scoring! He gets the ball inside the box from the resulting corner, but his effort goes narrowly wide of the right post. This should be a big warning for the defence. The ball is off of the pitch and it's a goal kick for Atalanta."
        },
        {
            "gameTime": "2 - 10:53",
            "label": "corner",
            "description": "Radja Nainggolan (AS Roma) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 10:29",
            "label": "",
            "description": "Mohamed Salah (AS Roma) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. The linesman makes the right call and AS Roma will have a corner."
        },
        {
            "gameTime": "2 - 08:52",
            "label": "",
            "description": "Andrea Conti (Atalanta) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "2 - 08:11",
            "label": "substitution",
            "description": "Gian Piero Gasperini decides to make a substitution. Bryan Cristante will be replaced by Marco D'Alessandro (Atalanta)."
        },
        {
            "gameTime": "2 - 04:39",
            "label": "soccer-ball",
            "description": "Goal! Mohamed Salah gets to the ball and heads it over the defence to Edin Dzeko (AS Roma), who meets it nicely and fires in into the back of the net. 1:1."
        },
        {
            "gameTime": "2 - 00:36",
            "label": "substitution",
            "description": "Half time substitution. Konstantinos Manolas will not participate anymore and Bruno Peres (AS Roma) is coming on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "whistle",
            "description": "Piero Giacomelli has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 44:45",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "1 - 44:37",
            "label": "corner",
            "description": "Radja Nainggolan (AS Roma) takes the corner."
        },
        {
            "gameTime": "1 - 44:35",
            "label": "",
            "description": "Diego Perotti (AS Roma) tries to send a low pass into the box, but it's blocked and cleared. The referee signals a corner kick to AS Roma."
        },
        {
            "gameTime": "1 - 41:42",
            "label": "y-card",
            "description": "Hans Hateboer (Atalanta) makes a bad challenge and receives a yellow card. The referee had no doubt."
        },
        {
            "gameTime": "1 - 41:40",
            "label": "",
            "description": "Rough tackle by Hans Hateboer (Atalanta). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 40:25",
            "label": "",
            "description": "Referee Piero Giacomelli sees the trip by Andrea Conti (Atalanta) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 37:39",
            "label": "corner",
            "description": "Daniele De Rossi (AS Roma) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 37:22",
            "label": "",
            "description": "Mohamed Salah (AS Roma) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. The referee and one of his assistants signal for a corner kick to AS Roma."
        },
        {
            "gameTime": "1 - 35:53",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "1 - 35:44",
            "label": "corner",
            "description": "Radja Nainggolan (AS Roma) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 35:31",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. AS Roma will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 34:52",
            "label": "",
            "description": "Hans Hateboer (Atalanta) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again."
        },
        {
            "gameTime": "1 - 33:04",
            "label": "",
            "description": "Mattia Caldara (Atalanta) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Piero Giacomelli blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 29:39",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) brings down his opponent with a very late tackle."
        },
        {
            "gameTime": "1 - 27:18",
            "label": "",
            "description": "Mario Rui (AS Roma) dribbled past his opponents before finding himself in a great position to strike. His attempt from just outside of the box went towards the right side of the goal, but it wasn't dangerous and Pierluigi Gollini made a comfortable save."
        },
        {
            "gameTime": "1 - 22:50",
            "label": "y-card",
            "description": "Jasmin Kurtic (Atalanta) has tested the patience of referee Piero Giacomelli and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 21:55",
            "label": "soccer-ball",
            "description": "Andrea Conti feeds the ball through to Jasmin Kurtic (Atalanta), who picks up the pass inside the box and quickly sends it into the left side of the goal! The goalkeeper was helpless. 0:1!"
        },
        {
            "gameTime": "1 - 20:56",
            "label": "corner",
            "description": "Bryan Cristante (Atalanta) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "1 - 20:52",
            "label": "",
            "description": "Bryan Cristante (Atalanta) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball is out of play. Atalanta will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 18:47",
            "label": "",
            "description": "Edin Dzeko (AS Roma) meets a cross from the flank and pulls the trigger from the edge of the box, but the ball flies high over the bar. High, wide and not at all pretty. The ball is off of the pitch and it's a goal kick for Atalanta."
        },
        {
            "gameTime": "1 - 18:26",
            "label": "corner",
            "description": "The resulting corner, taken by Radja Nainggolan (AS Roma), comes to nothing."
        },
        {
            "gameTime": "1 - 18:10",
            "label": "",
            "description": "Mohamed Salah (AS Roma) plants a nice towering header goalwards, but one of the defenders is in the right place at the right time and makes a vital clearance. The ball is out of play. AS Roma win a corner kick."
        },
        {
            "gameTime": "1 - 15:32",
            "label": "",
            "description": "Federico Fazio (AS Roma) finds himself some space around the penalty spot to connect with a fine free kick. His header is slightly mistimed and sails inches past the right post. The ball is off of the pitch and it's a goal kick for Atalanta."
        },
        {
            "gameTime": "1 - 14:49",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Jasmin Kurtic (Atalanta). Piero Giacomelli saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "1 - 13:18",
            "label": "",
            "description": "Jasmin Kurtic (Atalanta) creates a good chance for himself and goes for goal from mid range, but the effort is well wide of the left post. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "1 - 12:22",
            "label": "",
            "description": "Piero Giacomelli blows his whistle as Mohamed Salah (AS Roma) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 10:09",
            "label": "",
            "description": "What a huge chance for Franck Kessie (Atalanta). He collects a precise pass inside the box and slices a shot that goes a whisker wide of the left post. The ball is off of the pitch and it's a goal kick for AS Roma."
        },
        {
            "gameTime": "1 - 08:35",
            "label": "",
            "description": "Federico Fazio (AS Roma) leaps highest around the penalty spot to meet a cross from the free kick and produces a promising goal bound header towards the top left corner, but Pierluigi Gollini pulls off a save to deny him."
        },
        {
            "gameTime": "1 - 07:27",
            "label": "",
            "description": "Bryan Cristante (Atalanta) makes an overly aggressive challenge and Piero Giacomelli blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 07:10",
            "label": "",
            "description": "AS Roma are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "1 - 03:24",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Diego Perotti (AS Roma)."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Kevin Strootman (AS Roma). The ball is out of play and AS Roma manage to earn a corner."
        },
        {
            "gameTime": "1 - 02:16",
            "label": "corner",
            "description": "Bryan Cristante (Atalanta) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 01:58",
            "label": "",
            "description": "Hans Hateboer (Atalanta) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort. Atalanta have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 01:46",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Piero Giacomelli with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and AS Roma will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Piero Giacomelli will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "In the last 5 games between these two teams there were 3 matches with over 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma scored at least one goal in each of their last 21 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma will be looking to keep their unbeaten run of 4 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's it for today, Piero Giacomelli has blown his whistle and the game is over."
        }
    ],
    "gameAwayTeam": "Atalanta",
    "gameDate": "15/04/2017 - 16:00",
    "gameHomeTeam": "AS Roma",
    "gameScore": "1 - 1"
}