{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-09-26 - 19-30 Newcastle Utd 2 - 2 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 52:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. A very even game was seen on the pitch today. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 52:26",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 51:52",
            "label": "y-card",
            "description": "Pedro (Chelsea) has tested the patience of referee Martin Atkinson and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 50:55",
            "label": "",
            "description": "Siem De Jong (Newcastle Utd) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 50:27",
            "label": "corner",
            "description": "Newcastle Utd take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 50:15",
            "label": "",
            "description": "Gabriel Obertan (Newcastle Utd) fails to find any of his teammates inside the box as his pass is blocked. Newcastle Utd have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 49:57",
            "label": "corner",
            "description": "Ayoze Perez (Newcastle Utd) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 48:18",
            "label": "injury",
            "description": "Siem De Jong (Newcastle Utd) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 47:24",
            "label": "",
            "description": "Gabriel Obertan (Newcastle Utd) races towards goal but the defender gets back well to make a challenge. Newcastle Utd get a corner."
        },
        {
            "gameTime": "2 - 46:32",
            "label": "substitution",
            "description": "Here comes a substitution. Moussa Sissoko is given a rest as he is replaced by Siem De Jong (Newcastle Utd)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "",
            "description": "The Chelsea players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 43:26",
            "label": "",
            "description": "Ramires (Chelsea) creates himself some space inside the goalmouth and connects with the resulting free kick. His header would have probably ended up in the middle of the goal, but Tim Krul pulls off a superb reflex save to thwart him."
        },
        {
            "gameTime": "2 - 42:37",
            "label": "",
            "description": "Moussa Sissoko (Newcastle Utd) trips an opposition player and Martin Atkinson signals a foul. Chelsea will take a free kick. Willian (Chelsea) will take the free kick."
        },
        {
            "gameTime": "2 - 40:55",
            "label": "soccer-ball",
            "description": "Willian (Chelsea) scores a marvellous goal! He smashed a direct free kick from 25 metres into the middle of the net. The normally comfortable situation became a problem for the goalkeeper as the ball slipped behind his back."
        },
        {
            "gameTime": "2 - 40:30",
            "label": "",
            "description": "Newcastle Utd concede a free kick after one of their players holds onto an opposition player. A free kick has been awarded to Chelsea."
        },
        {
            "gameTime": "2 - 39:01",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Aleksandar Mitrovic departs the field of play to be replaced by Ivan Toney (Newcastle Utd)."
        },
        {
            "gameTime": "2 - 37:57",
            "label": "",
            "description": "Pedro (Chelsea) controls a cross inside the six yard box, but unbelievably sends his shot over the bar. The ball is off of the pitch and it's a goal kick for Newcastle Utd."
        },
        {
            "gameTime": "2 - 37:27",
            "label": "",
            "description": "Chelsea are passing the ball across the pitch and keep possession. However, an opponent intercepts a pass and the situation changes."
        },
        {
            "gameTime": "2 - 36:20",
            "label": "",
            "description": "Eden Hazard (Chelsea) goes on a weaving run through the defence and gets within shooting range but his effort is blocked."
        },
        {
            "gameTime": "2 - 33:47",
            "label": "soccer-ball",
            "description": "Ramires (Chelsea) latches on to a pass and controls it with a good first touch. He unleashes a deadly strike from around 24 metres out which goes into the top left corner."
        },
        {
            "gameTime": "2 - 32:25",
            "label": "attendance",
            "description": "The attendance for today's match is 48682."
        },
        {
            "gameTime": "2 - 30:13",
            "label": "",
            "description": "Falcao (Chelsea) finds himself in a promising position after receiving a clever chip pass, but one of the defending players comes up with a timely interception."
        },
        {
            "gameTime": "2 - 28:40",
            "label": "",
            "description": "Falcao (Chelsea) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "substitution",
            "description": "Substitution. Oscar makes way for Ramires (Chelsea)."
        },
        {
            "gameTime": "2 - 27:26",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) finds himself in a promising position after receiving a beautiful cross from the side, but the opposition defence is ready and one of the defenders averts the threat with a quick interception. Chelsea have a corner."
        },
        {
            "gameTime": "2 - 25:49",
            "label": "",
            "description": "Eden Hazard picks out Oscar (Chelsea), who drives a shot just wide of the right post from the edge of the box. The ball is off of the pitch and it's a goal kick for Newcastle Utd."
        },
        {
            "gameTime": "2 - 23:51",
            "label": "corner",
            "description": "Pedro (Chelsea) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 23:35",
            "label": "",
            "description": "Pedro (Chelsea) crosses the ball into the box, but one of the defending players averts the threat. The referee and his assistant both point at the corner flag. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 22:58",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Branislav Ivanovic (Chelsea) was quite harsh and Martin Atkinson didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 22:07",
            "label": "",
            "description": "Willian (Chelsea) displays his superb passing ability after picking out Pedro with a fine lofted pass to continue their attacking move. Pedro (Chelsea) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "2 - 20:17",
            "label": "",
            "description": "Rough tackle by Moussa Sissoko (Newcastle Utd). The referee blows his whistle for a foul. Chelsea get a free kick. Chelsea try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "2 - 18:29",
            "label": "",
            "description": "Martin Atkinson blows his whistle and it's Aleksandar Mitrovic (Newcastle Utd) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 15:55",
            "label": "substitution",
            "description": "Jose Mourinho has decided to make a change. Willian (Chelsea) replaces Nemanja Matic."
        },
        {
            "gameTime": "2 - 15:50",
            "label": "substitution",
            "description": "The game has come to an end for Loic Remy. He has contributed as much as he could today. He will be replaced by the fresh legs of Falcao (Chelsea)."
        },
        {
            "gameTime": "2 - 14:54",
            "label": "soccer-ball",
            "description": "Goal! The corner is whipped in and Georginio Wijnaldum (Newcastle Utd) is in the right place at the right time, planting his header perfectly into the left side of the goal. He makes it 1:0."
        },
        {
            "gameTime": "2 - 14:30",
            "label": "corner",
            "description": "Ayoze Perez (Newcastle Utd) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 14:06",
            "label": "",
            "description": "Ayoze Perez (Newcastle Utd) looks to break free, but an opposing player clears the ball away. The linesman makes the right call and Newcastle Utd will have a corner."
        },
        {
            "gameTime": "2 - 13:41",
            "label": "corner",
            "description": "The corner from Ayoze Perez (Newcastle Utd) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 13:14",
            "label": "",
            "description": "A cross from Moussa Sissoko (Newcastle Utd) fails to reach the box as the defence clears the ball away to safety. The ball goes out of play. Newcastle Utd are awarded a corner kick."
        },
        {
            "gameTime": "2 - 12:34",
            "label": "",
            "description": "Georginio Wijnaldum (Newcastle Utd) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 10:27",
            "label": "",
            "description": "Oscar (Chelsea) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 09:19",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 09:03",
            "label": "",
            "description": "The ball is cleared after Cesar Azpilicueta (Chelsea) attempted to dribble past an opposing player. The referee and one of his assistants signal for a corner kick to Chelsea."
        },
        {
            "gameTime": "2 - 08:26",
            "label": "substitution",
            "description": "Steve McClaren prepares a substitution. Jack Colback is replaced by Gabriel Obertan (Newcastle Utd)."
        },
        {
            "gameTime": "2 - 07:48",
            "label": "",
            "description": "Oscar swings the cross over. Loic Remy (Chelsea) gets his head to it but it goes just over the crossbar. The ball goes out of play and Newcastle Utd will have a goal kick."
        },
        {
            "gameTime": "2 - 07:09",
            "label": "",
            "description": "Eden Hazard (Chelsea) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 06:41",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "2 - 05:34",
            "label": "",
            "description": "Nemanja Matic (Chelsea) was too fierce in his attempt to get the ball from his opponent and Martin Atkinson blows for a foul."
        },
        {
            "gameTime": "2 - 04:53",
            "label": "",
            "description": "The linesman signals that Loic Remy (Chelsea) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 03:15",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "2 - 02:26",
            "label": "",
            "description": "Neat passing move from Chelsea in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 01:41",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Cesar Azpilicueta (Chelsea). The ball is out of play. Chelsea will have a throw in."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "There was certainly plenty of action during that opening 45 minutes. The home fans will be really pleased with what they've seen from their players so far. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 47:05",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:28",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:20",
            "label": "",
            "description": "Chelsea are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 41:55",
            "label": "soccer-ball",
            "description": "Vurnon Anita sends an inch perfect lofted cross into the box. Ayoze Perez (Newcastle Utd) latches on to it and finishes with a quick shot which hits the left post and bounces in off it. The goalkeeper had no chance. The score changes to 1:0."
        },
        {
            "gameTime": "1 - 41:24",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 39:55",
            "label": "",
            "description": "The linesman raises his flag. Pedro (Chelsea) is adjudged offside."
        },
        {
            "gameTime": "1 - 39:29",
            "label": "corner",
            "description": "Oscar (Chelsea) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 39:04",
            "label": "",
            "description": "Oscar (Chelsea) whips a promising cross into the box, but the opposition's defence intercepts the ball. The referee points to the corner flag and Chelsea will take a corner."
        },
        {
            "gameTime": "1 - 38:20",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) gets his head on the corner, but he can't find the target as his header flies high over the crossbar. The ball goes out of play and Newcastle Utd will have a goal kick."
        },
        {
            "gameTime": "1 - 37:52",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 37:15",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) takes the ball on and fires in a shot from 25 metres out. Tim Krul stops the effort which is headed for the top right corner. The ball is out of play and Chelsea manage to earn a corner."
        },
        {
            "gameTime": "1 - 36:32",
            "label": "",
            "description": "Nemanja Matic (Chelsea) makes a reckless foul in order to win the ball from his opponent. Martin Atkinson has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 35:16",
            "label": "",
            "description": "Daryl Janmaat (Newcastle Utd) tries his luck from the edge of the box after a brilliant solo effort, but it is well blocked by the defender."
        },
        {
            "gameTime": "1 - 34:46",
            "label": "",
            "description": "Moussa Sissoko (Newcastle Utd) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "",
            "description": "Pedro (Chelsea) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 32:53",
            "label": "y-card",
            "description": "Martin Atkinson shows a yellow card to Jack Colback (Newcastle Utd) for his blatant foul."
        },
        {
            "gameTime": "1 - 32:03",
            "label": "",
            "description": "Jack Colback (Newcastle Utd) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 31:07",
            "label": "injury",
            "description": "Jack Colback (Newcastle Utd) picks up an injury."
        },
        {
            "gameTime": "1 - 30:41",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 30:15",
            "label": "",
            "description": "Loic Remy (Chelsea) fails to send a pass into the box as his effort is cut out. The referee blows his whistle, Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 29:31",
            "label": "",
            "description": "Moussa Sissoko (Newcastle Utd) tries to create a chance, but puts too much weight on his pass. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "1 - 27:50",
            "label": "",
            "description": "Asmir Begovic was forced into action to thwart Daryl Janmaat (Newcastle Utd). He found himself some space after latching on to a pass and unleashed a shot to the bottom right corner but couldn't beat the keeper."
        },
        {
            "gameTime": "1 - 27:37",
            "label": "",
            "description": "Ayoze Perez (Newcastle Utd) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Asmir Begovic was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 26:27",
            "label": "",
            "description": "What a poor attempt! Ayoze Perez (Newcastle Utd) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes yards wide of the left post. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "1 - 23:58",
            "label": "",
            "description": "Pedro (Chelsea) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 23:11",
            "label": "",
            "description": "Kevin Mbabu (Newcastle Utd) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 22:13",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) fizzes over a cross which doesn't cause any problems. The ball goes out of play and Newcastle Utd will have a goal kick."
        },
        {
            "gameTime": "1 - 21:30",
            "label": "",
            "description": "Martin Atkinson couldn't ignore the rough tackle by Kevin Mbabu (Newcastle Utd) and blew his whistle."
        },
        {
            "gameTime": "1 - 21:12",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Oscar (Chelsea) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 20:42",
            "label": "",
            "description": "Newcastle Utd are playing excellent possession football at the moment by exchanging some long passes."
        },
        {
            "gameTime": "1 - 18:52",
            "label": "",
            "description": "Oscar (Chelsea) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 18:14",
            "label": "",
            "description": "The Chelsea players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 17:13",
            "label": "",
            "description": "Martin Atkinson blows the whistle, Branislav Ivanovic (Chelsea) is penalised for a foul."
        },
        {
            "gameTime": "1 - 16:28",
            "label": "",
            "description": "Moussa Sissoko (Newcastle Utd) collects a pass and has an effort from 24 metres out, but it flies just wide of the left post. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 15:40",
            "label": "",
            "description": "Georginio Wijnaldum sends a lovely lofted pass forward that flies over the top of the defence and into the path of Aleksandar Mitrovic (Newcastle Utd), but he can't direct his header on target as it flies well wide of the right post. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 13:54",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) plays a through ball but overhits it. The referee and the linesman both signal a throw in for Newcastle Utd."
        },
        {
            "gameTime": "1 - 12:34",
            "label": "",
            "description": "Kevin Mbabu (Newcastle Utd) picks up a pass, lines up a shot and strikes from 25 metres out, but Asmir Begovic thwarts the effort which is headed low to the middle of the goal."
        },
        {
            "gameTime": "1 - 12:17",
            "label": "",
            "description": "Daryl Janmaat (Newcastle Utd) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 11:16",
            "label": "",
            "description": "Loic Remy (Chelsea) receives a precise pass inside the box and takes a shot that flies just wide of the right post. The ball is off of the pitch and it's a goal kick for Newcastle Utd."
        },
        {
            "gameTime": "1 - 10:25",
            "label": "",
            "description": "A pass into the penalty area from Georginio Wijnaldum (Newcastle Utd) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 08:02",
            "label": "",
            "description": "Georginio Wijnaldum (Newcastle Utd) and Ayoze Perez attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "The foul by Oscar (Chelsea) was seen by Martin Atkinson who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 06:44",
            "label": "",
            "description": "Vurnon Anita (Newcastle Utd) sends a long ball across the pitch, but it misses its target. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "1 - 06:33",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Newcastle Utd."
        },
        {
            "gameTime": "1 - 05:35",
            "label": "",
            "description": "Oscar (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 04:45",
            "label": "",
            "description": "Vurnon Anita (Newcastle Utd) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 04:17",
            "label": "",
            "description": "Eden Hazard (Chelsea) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "1 - 03:38",
            "label": "",
            "description": "Close! Kurt Zouma (Chelsea) takes the resultant free kick from 25 metres out and his shot goes just wide of the left post. The ball goes out of play and Newcastle Utd will have a goal kick."
        },
        {
            "gameTime": "1 - 02:55",
            "label": "",
            "description": "Jack Colback (Newcastle Utd) brings his opponent down with a tackle and Martin Atkinson blows his whistle for a foul. Chelsea are awarded a free kick."
        },
        {
            "gameTime": "1 - 01:12",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "1 - 00:34",
            "label": "",
            "description": "Loic Remy (Chelsea) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Newcastle Utd will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Martin Atkinson will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "5x that's the number of matches that Chelsea have lost at home so far this season, while they have lost 7x away."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Newcastle Utd have lost 5x at home this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Newcastle Utd players are not so productive as they have scored only 44 goals this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. A very even game was seen on the pitch today. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "26/09/2015 - 19:30",
    "gameHomeTeam": "Newcastle Utd",
    "gameScore": "2 - 2"
}