{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-25 - 22-45 Shakhtar Donetsk 3 - 4 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. There wasn't any significant dominance by either side in this game. The home side attempted to create scoring opportunities mostly with long balls, while the away team tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "whistle",
            "description": "Bas Nijhuis is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 42:59",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Alex Teixeira (Shakhtar) was set free in the area by Taison and made no mistake with a lovely finish into the right side of the net. 3:4."
        },
        {
            "gameTime": "2 - 42:28",
            "label": "",
            "description": "Bernard (Shakhtar) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 41:34",
            "label": "y-card",
            "description": "Danilo (Real Madrid) is booked by the referee. Shakhtar Donetsk are awarded the free kick."
        },
        {
            "gameTime": "2 - 37:57",
            "label": "soccer-ball",
            "description": "GOAL 2:4! The corner comes over and Taras Stepanenko flicks on with his head to Dentinho (Shakhtar), who makes no mistake and fires the ball into the back of the net."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "attendance",
            "description": "The attendance for today's match is 33990."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "corner",
            "description": "Bernard (Shakhtar) will take the corner."
        },
        {
            "gameTime": "2 - 37:21",
            "label": "",
            "description": "Bernard (Shakhtar) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net. The ball is out of play and Shakhtar Donetsk manage to earn a corner."
        },
        {
            "gameTime": "2 - 34:11",
            "label": "funfact",
            "description": "The total number of attempts is 10:20."
        },
        {
            "gameTime": "2 - 31:59",
            "label": "soccer-ball",
            "description": "Alex Teixeira (Shakhtar) takes the penalty and perfectly sends the ball inside the left post."
        },
        {
            "gameTime": "2 - 31:53",
            "label": "",
            "description": "Alex Teixeira (Shakhtar) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 31:10",
            "label": "penalty",
            "description": "Casemiro (Real Madrid) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again. Shakhtar Donetsk are awarded a penalty kick!"
        },
        {
            "gameTime": "2 - 30:27",
            "label": "",
            "description": "Bas Nijhuis couldn't ignore the rough tackle by Yaroslav Rakitsky (Shakhtar) and blew his whistle."
        },
        {
            "gameTime": "2 - 29:02",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "2 - 28:23",
            "label": "substitution",
            "description": "Oleksandr Gladky just cannot continue due to injury and has to be substituted. Facundo Ferreyra (Shakhtar) replaces him."
        },
        {
            "gameTime": "2 - 27:55",
            "label": "injury",
            "description": "Looks like Oleksandr Gladky (Shakhtar) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 25:55",
            "label": "substitution",
            "description": "That will be all from Gareth Bale who is being replaced by the fresh legs of Karim Benzema (Real Madrid)."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "soccer-ball",
            "description": "Goal 0:4! Cristiano Ronaldo (Real Madrid) taps home from close range after the rebound fell kindly into his path."
        },
        {
            "gameTime": "2 - 24:58",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 21:45",
            "label": "",
            "description": "Some patient build up play from Shakhtar Donetsk as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 18:57",
            "label": "substitution",
            "description": "The referee signals a substitution. Dentinho (Shakhtar) is brought on as a substitute for Marcio Azevedo."
        },
        {
            "gameTime": "2 - 18:26",
            "label": "",
            "description": "Casemiro (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 16:47",
            "label": "substitution",
            "description": "Here is a change. Luka Modric is going off and Rafael Benitez gives the last tactical orders to Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "2 - 16:20",
            "label": "substitution",
            "description": "It will be a substitution. Taison (Shakhtar) is ready to enter the pitch as Marlos walks off."
        },
        {
            "gameTime": "2 - 15:49",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) latches on to an accurate pass inside the box and immediately unleashes a shot towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 12:09",
            "label": "",
            "description": "Oleksandr Gladky (Shakhtar) is adjudged offside."
        },
        {
            "gameTime": "2 - 11:57",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Andrij Pyatov is alert and denies him."
        },
        {
            "gameTime": "2 - 09:37",
            "label": "",
            "description": "Marcio Azevedo swings the cross over. Oleksandr Gladky (Shakhtar) gets his head to it but it goes just wide of the right post."
        },
        {
            "gameTime": "2 - 08:06",
            "label": "",
            "description": "Flag goes up against Oleksandr Gladky (Shakhtar) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 06:18",
            "label": "soccer-ball",
            "description": "Goal Daniel Carvajal (Real Madrid)! Daniel Carvajal (Real Madrid) was put through by Cristiano Ronaldo and he showed brilliant composure inside the box to fire into the left side of the net. 0:3."
        },
        {
            "gameTime": "2 - 05:01",
            "label": "",
            "description": "Real Madrid are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "soccer-ball",
            "description": "Goal 0:2! Cristiano Ronaldo laid the ball off to Luka Modric (Real Madrid), who slots it into the back of the net from close range, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 03:54",
            "label": "",
            "description": "Flag up against Oleksandr Gladky (Shakhtar). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 02:32",
            "label": "y-card",
            "description": "Bas Nijhuis shows a yellow card to Daniel Carvajal (Real Madrid) for a tough tackle."
        },
        {
            "gameTime": "2 - 01:46",
            "label": "",
            "description": "What a chance that is! Gareth Bale (Real Madrid) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. The first half was definitely edged by the visiting team. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 46:57",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Bas Nijhuis has ended it."
        },
        {
            "gameTime": "1 - 46:45",
            "label": "",
            "description": "Gareth Bale (Real Madrid) misses a good chance to score. A perfect cross into the box finds Gareth Bale (Real Madrid) who rises for a header, but he sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 46:44",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) works the corner short."
        },
        {
            "gameTime": "1 - 46:16",
            "label": "",
            "description": "Casemiro (Real Madrid) unleashed a powerful long range strike, but the ball was blocked by a defender on its way. Now Real Madrid have a corner."
        },
        {
            "gameTime": "1 - 45:43",
            "label": "corner",
            "description": "Isco (Real Madrid) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 45:19",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a cross into the box, but the opposition's defence clears the ball to safety. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 42:12",
            "label": "",
            "description": "What a wasted chance that was! An inch perfect cross into the box finds Oleksandr Gladky (Shakhtar) who sends his header well wide of the right post."
        },
        {
            "gameTime": "1 - 41:39",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Bernard (Shakhtar)."
        },
        {
            "gameTime": "1 - 41:20",
            "label": "",
            "description": "Alex Teixeira (Shakhtar) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger. The ball is out of play and the linesman points at the corner flag. Corner to Shakhtar Donetsk."
        },
        {
            "gameTime": "1 - 39:31",
            "label": "",
            "description": "Gareth Bale (Real Madrid) tries his luck with a long range effort after receiving a precise pass, but Andrij Pyatov has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 36:19",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Marlos (Shakhtar) takes it short."
        },
        {
            "gameTime": "1 - 36:01",
            "label": "",
            "description": "Vasyl Kobin (Shakhtar) serves up a nice cross, but the defence clears the danger. The referee points to the corner flag. It's a corner to Shakhtar Donetsk."
        },
        {
            "gameTime": "1 - 34:39",
            "label": "y-card",
            "description": "Taras Stepanenko (Shakhtar) gets a yellow card. The referee Bas Nijhuis made the right call."
        },
        {
            "gameTime": "1 - 31:07",
            "label": "substitution",
            "description": "Raphael Varane is being substituted because of an injury. Rafael Benitez sends Danilo (Real Madrid) on the pitch."
        },
        {
            "gameTime": "1 - 30:54",
            "label": "injury",
            "description": "Raphael Varane (Real Madrid) picks up an injury."
        },
        {
            "gameTime": "1 - 30:04",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) rises above the opponent's defence and heads a precise cross towards the middle of the goal. His effort, however, is blocked by Andrij Pyatov, who pulls off a comfortable save!"
        },
        {
            "gameTime": "1 - 28:12",
            "label": "",
            "description": "Taras Stepanenko (Shakhtar) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "1 - 25:53",
            "label": "",
            "description": "Ivan Ordets (Shakhtar) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "1 - 25:12",
            "label": "",
            "description": "Fred (Shakhtar) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 24:29",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play. Shakhtar Donetsk have a free kick."
        },
        {
            "gameTime": "1 - 24:03",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) makes a rough challenge and Bas Nijhuis blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 22:14",
            "label": "corner",
            "description": "Andrij Pyatov leaps to intercept the corner kick from Isco (Real Madrid)."
        },
        {
            "gameTime": "1 - 21:46",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Gareth Bale (Real Madrid), is intercepted by the opposition's defence. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 21:08",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) stands over the resultant free kick from 20 metres out and his shot goes well over the bar."
        },
        {
            "gameTime": "1 - 20:19",
            "label": "",
            "description": "Ivan Ordets (Shakhtar) was too forceful with his tackle and Bas Nijhuis interrupted the game to signal a free kick. Real Madrid are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 17:48",
            "label": "soccer-ball",
            "description": "Goal! Gareth Bale finds Cristiano Ronaldo (Real Madrid) and he shows great determination to get to the ball and plant a header into the back of the net. 0:1."
        },
        {
            "gameTime": "1 - 16:41",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 16:13",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 15:50",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 13:41",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 10:49",
            "label": "",
            "description": "Bernard receives a sweet pass inside the box from Marcio Azevedo (Shakhtar), but one of the defenders is first to the ball and makes an interception."
        },
        {
            "gameTime": "1 - 08:59",
            "label": "",
            "description": "A crossfield pass from Yaroslav Rakitsky (Shakhtar) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 05:42",
            "label": "",
            "description": "The cross into the penalty area from Daniel Carvajal (Real Madrid) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "1 - 04:33",
            "label": "",
            "description": "Gareth Bale (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 02:35",
            "label": "",
            "description": "Luka Modric slides a brilliant pass into Cristiano Ronaldo (Real Madrid), but his shot from inside the box goes a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 00:22",
            "label": "",
            "description": "Bernard (Shakhtar) is flagged for offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Shakhtar Donetsk will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bas Nijhuis is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. There wasn't any significant dominance by either side in this game. The home side attempted to create scoring opportunities mostly with long balls, while the away team tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "25/11/2015 - 22:45",
    "gameHomeTeam": "Shakhtar Donetsk",
    "gameScore": "3 - 4"
}