{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-12-31 - 20-30 Liverpool 1 - 0 Manchester City/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "Let's hope the players will show us more in future games as today's one was rather average, without many exciting moments. The game was more or less balanced. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 50:25",
            "label": "whistle",
            "description": "Craig Pawson is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 49:55",
            "label": "",
            "description": "Sergio Aguero (Manchester City) is penalised for a foul. Craig Pawson had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 49:04",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Georginio Wijnaldum (Liverpool)."
        },
        {
            "gameTime": "2 - 48:27",
            "label": "",
            "description": "The ball is cleared after Divock Origi (Liverpool) attempted to dribble past an opposing player. Liverpool will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 47:46",
            "label": "y-card",
            "description": "Nicolas Otamendi (Manchester City) takes his opponent down and receives a yellow card from the referee."
        },
        {
            "gameTime": "2 - 46:34",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:52",
            "label": "funfact",
            "description": "The shots on goal statistics – 1:2."
        },
        {
            "gameTime": "2 - 44:00",
            "label": "substitution",
            "description": "Substitution. Lucas Leiva (Liverpool) on for Sadio Mane."
        },
        {
            "gameTime": "2 - 43:33",
            "label": "substitution",
            "description": "Pep Guardiola has decided to substitute Yaya Toure and he is replaced by Kelechi Iheanacho (Manchester City)."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "",
            "description": "Raheem Sterling (Manchester City) attempts to find David Silva with a delicate little through ball from inside the box, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "2 - 40:51",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Pablo Zabaleta trots off the pitch and is replaced by Jesus Navas (Manchester City)."
        },
        {
            "gameTime": "2 - 40:20",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) plays a one two with Adam Lallana, but the move breaks down."
        },
        {
            "gameTime": "2 - 37:34",
            "label": "corner",
            "description": "James Milner (Liverpool) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 37:09",
            "label": "",
            "description": "An attempted cross from Divock Origi (Liverpool) is cleared. Liverpool have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 35:21",
            "label": "attendance",
            "description": "The attendance is 53120."
        },
        {
            "gameTime": "2 - 34:33",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 34:08",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The ball goes out of play. Manchester City are awarded a corner kick."
        },
        {
            "gameTime": "2 - 33:15",
            "label": "",
            "description": "The foul by Aleksandar Kolarov (Manchester City) was seen by Craig Pawson who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 31:46",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Kevin De Bruyne (Manchester City) takes it short."
        },
        {
            "gameTime": "2 - 31:32",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Raheem Sterling (Manchester City). The referee and one of his assistants signal for a corner kick to Manchester City."
        },
        {
            "gameTime": "2 - 30:40",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 30:19",
            "label": "",
            "description": "A lofted cross from Fernandinho (Manchester City) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Manchester City will take a corner kick."
        },
        {
            "gameTime": "2 - 29:36",
            "label": "y-card",
            "description": "Yellow card. Emre Can (Liverpool) goes into the book for a bad tackle on his opponent."
        },
        {
            "gameTime": "2 - 26:55",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Divock Origi (Liverpool) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 26:15",
            "label": "corner",
            "description": "The corner kick from Kevin De Bruyne (Manchester City) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 25:58",
            "label": "",
            "description": "Sergio Aguero (Manchester City) slaloms his way past challenges, but an opposing player does well to get the ball away. The linesman points to the corner flag, Manchester City are going to take it."
        },
        {
            "gameTime": "2 - 25:01",
            "label": "corner",
            "description": "James Milner (Liverpool) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 24:33",
            "label": "",
            "description": "Divock Origi (Liverpool) fails to find any of his teammates inside the box as his pass is blocked. The ball goes out of play and Liverpool have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 22:33",
            "label": "",
            "description": "Raheem Sterling (Manchester City) makes a driving run into the box but he cannot work any space for a shot. The ball goes out of play and Liverpool will have a goal kick."
        },
        {
            "gameTime": "2 - 21:16",
            "label": "",
            "description": "The ball is cleared after Roberto Firmino (Liverpool) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 20:05",
            "label": "",
            "description": "David Silva (Manchester City) quickly takes the free kick with a short pass. Kevin De Bruyne (Manchester City) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "2 - 19:16",
            "label": "",
            "description": "Adam Lallana (Liverpool) makes a reckless foul in order to win the ball from his opponent. Craig Pawson has a clear sight of it and blows his whistle. Manchester City are awarded a free kick from mid range. The position is unsuitable for a direct shot, so expect a cross into the box."
        },
        {
            "gameTime": "2 - 18:33",
            "label": "substitution",
            "description": "Jurgen Klopp is forced to make a change. Jordan Henderson is not able to carry on due to injury. He is replaced by Divock Origi (Liverpool)."
        },
        {
            "gameTime": "2 - 17:09",
            "label": "injury",
            "description": "The game is interrupted now, Jordan Henderson (Liverpool) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 16:02",
            "label": "",
            "description": "Raheem Sterling (Manchester City) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 15:42",
            "label": "",
            "description": "Raheem Sterling (Manchester City) and David Silva combine well with a quick one two to trick their opponent."
        },
        {
            "gameTime": "2 - 14:21",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) got on the end of the corner and rifles a low shot from the edge of the box towards the right post, but the goalkeeper makes a stunning diving save."
        },
        {
            "gameTime": "2 - 14:18",
            "label": "corner",
            "description": "There's an opportunity for Kevin De Bruyne (Manchester City) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 13:09",
            "label": "",
            "description": "Raheem Sterling (Manchester City) passes the ball onto Sergio Aguero, but one of the defenders dispossesses him. Manchester City win a corner."
        },
        {
            "gameTime": "2 - 12:46",
            "label": "",
            "description": "Raheem Sterling (Manchester City) comes close to scoring. He peels away from his marker and gets on the end of a cross from Yaya Toure, but he hits a shot just wide of the right post."
        },
        {
            "gameTime": "2 - 11:35",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) attempts to release Kevin De Bruyne with a through ball, but his effort is thwarted by one of the defending players."
        },
        {
            "gameTime": "2 - 10:24",
            "label": "",
            "description": "CLOSE! David Silva (Manchester City) shows off his amazing skills with a solo run to the edge of the box before fashioning a shot that goes inches wide of the left post!"
        },
        {
            "gameTime": "2 - 09:53",
            "label": "",
            "description": "Raheem Sterling (Manchester City) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 08:54",
            "label": "",
            "description": "Sergio Aguero (Manchester City) latches on to an accurate pass into the box and immediately unleashes a low shot goalwards. His effort is well saved by the keeper."
        },
        {
            "gameTime": "2 - 06:38",
            "label": "",
            "description": "Good defending. Nathaniel Clyne (Liverpool) tries to find Adam Lallana inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 06:03",
            "label": "",
            "description": "The ball is cleared after Roberto Firmino (Liverpool) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 03:59",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) and Sadio Mane attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 01:57",
            "label": "",
            "description": "What a big chance! Nathaniel Clyne (Liverpool) picks up an inch perfect pass inside the box and fires the ball well wide of the left post."
        },
        {
            "gameTime": "2 - 00:46",
            "label": "",
            "description": "Raheem Sterling (Manchester City) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Craig Pawson starts the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "It wasn't the most inspiring 45 minutes that you'll see this week. Let's hope that the second period will be more exciting. It has been a tight contest so far. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 46:24",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:36",
            "label": "",
            "description": "Craig Pawson blows his whistle. Yaya Toure (Manchester City) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:16",
            "label": "",
            "description": "Raheem Sterling (Manchester City) looks to break free, but his touch lets him down and he loses the ball. The ball goes out of play and Liverpool will have a goal kick."
        },
        {
            "gameTime": "1 - 43:34",
            "label": "",
            "description": "Adam Lallana (Liverpool) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 42:14",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 41:52",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) goes on a mazy run and tries his luck with a mid range strike, but one of the defending players steps in and makes a block. Manchester City force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 38:10",
            "label": "",
            "description": "David Silva (Manchester City) tries to play a long through ball into Raheem Sterling, but the defence breaks the move down."
        },
        {
            "gameTime": "1 - 36:53",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "1 - 36:09",
            "label": "",
            "description": "Raheem Sterling (Manchester City) sends a cross into the box, but Simon Mignolet comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 32:32",
            "label": "",
            "description": "Emre Can (Liverpool) makes a rough challenge and Craig Pawson blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 31:16",
            "label": "",
            "description": "David Silva (Manchester City) threads a pass through to Sergio Aguero, but Simon Mignolet breaks up the move."
        },
        {
            "gameTime": "1 - 30:07",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Sergio Aguero (Manchester City) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "1 - 29:24",
            "label": "",
            "description": "Emre Can (Liverpool) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball into the stands. Nice run, but poor finish!"
        },
        {
            "gameTime": "1 - 28:35",
            "label": "",
            "description": "James Milner (Liverpool) threads a pass through the eye of a needle into the box for Roberto Firmino, but Claudio Bravo displays great awareness to stop him."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "",
            "description": "A precise low pass is received by Georginio Wijnaldum (Liverpool), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the left post. The ball goes out of play and Manchester City will have a goal kick."
        },
        {
            "gameTime": "1 - 24:41",
            "label": "",
            "description": "James Milner (Liverpool) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "1 - 23:32",
            "label": "",
            "description": "Fernandinho (Manchester City) robs an opponent of the ball and explodes in anger when Craig Pawson blows for a foul. It's a free kick to Liverpool, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 22:29",
            "label": "",
            "description": "Roberto Firmino (Liverpool) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 21:35",
            "label": "",
            "description": "Sergio Aguero (Manchester City) is forced to stop his forward run after being caught in an offside position by the linesman."
        },
        {
            "gameTime": "1 - 21:07",
            "label": "",
            "description": "The linesman signals that Adam Lallana (Liverpool) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 19:52",
            "label": "",
            "description": "A crossfield pass from Raheem Sterling (Manchester City) fails to find any of his teammates. The ball is off of the pitch and it's a goal kick for Liverpool."
        },
        {
            "gameTime": "1 - 18:11",
            "label": "",
            "description": "James Milner (Liverpool) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 16:46",
            "label": "corner",
            "description": "James Milner (Liverpool) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 16:04",
            "label": "",
            "description": "Sadio Mane (Liverpool) looks to break free, but an opposing player clears the ball away. The ball is out of play. A goal scoring opportunity from a corner for Liverpool."
        },
        {
            "gameTime": "1 - 15:00",
            "label": "",
            "description": "Yaya Toure (Manchester City) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 12:43",
            "label": "",
            "description": "The Manchester City players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 10:09",
            "label": "",
            "description": "Liverpool quickly take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 09:57",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Craig Pawson with no other option than to blow for a foul. Liverpool earn a free kick."
        },
        {
            "gameTime": "1 - 08:50",
            "label": "",
            "description": "Sergio Aguero (Manchester City) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies into the stands."
        },
        {
            "gameTime": "1 - 08:00",
            "label": "soccer-ball",
            "description": "The ball hits the back of the net! Adam Lallana showcases his brilliant technique and produces a beautiful lofted cross into the box. Georginio Wijnaldum (Liverpool) gets onto the scoresheet by sweetly heading it low inside the left post – 1:0."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "Yaya Toure (Manchester City) takes a short free kick."
        },
        {
            "gameTime": "1 - 06:25",
            "label": "y-card",
            "description": "Ragnar Klavan (Liverpool) receives a yellow card from the referee for a foul that he committed a little earlier. Manchester City are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 05:15",
            "label": "",
            "description": "Manchester City control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 03:06",
            "label": "",
            "description": "Raheem Sterling (Manchester City) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 01:48",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from 18 metres out by Aleksandar Kolarov (Manchester City) as his effort only hit the wall."
        },
        {
            "gameTime": "1 - 00:58",
            "label": "",
            "description": "Craig Pawson couldn't ignore the rough tackle by James Milner (Liverpool) and blew his whistle. Manchester City win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Manchester City will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Craig Pawson will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Craig Pawson is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "2:1 is the most common score for Manchester City in this competition. 5 of their all matches finished with that score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Kevin De Bruyne will look to add to his tally of 9 assists this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Liverpool players have managed to score 45 goals this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let's hope the players will show us more in future games as today's one was rather average, without many exciting moments. The game was more or less balanced. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Manchester City",
    "gameDate": "31/12/2016 - 20:30",
    "gameHomeTeam": "Liverpool",
    "gameScore": "1 - 0"
}