{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2015-2016/2015-09-27 - 21-45 Inter 1 - 4 Fiorentina/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. The visiting team was controlling the game most of the time. The home team really focused on a well organized defence, while the away team played possession football."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "y-card",
            "description": "The foul by Marcos Alonso (Fiorentina) is worthy of a card and a yellow is duly shown by Antonio Damato."
        },
        {
            "gameTime": "2 - 44:35",
            "label": "",
            "description": "Gilberto (Fiorentina) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 42:48",
            "label": "corner",
            "description": "Matias Fernandez (Fiorentina) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 42:32",
            "label": "",
            "description": "Marcos Alonso (Fiorentina) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball goes out of play. Fiorentina are awarded a corner kick."
        },
        {
            "gameTime": "2 - 41:45",
            "label": "",
            "description": "The Fiorentina players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 39:45",
            "label": "",
            "description": "Gilberto (Fiorentina) was holding his opponent and can be glad he didn't receive a yellow card."
        },
        {
            "gameTime": "2 - 38:59",
            "label": "corner",
            "description": "Fiorentina take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 38:27",
            "label": "",
            "description": "Nikola Kalinic (Fiorentina) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the left side of the net, but Samir Handanovic leaps like a salmon to deny him. The ball is out of play and Fiorentina manage to earn a corner."
        },
        {
            "gameTime": "2 - 38:16",
            "label": "",
            "description": "Some neat passing and movement from Fiorentina as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "2 - 36:00",
            "label": "substitution",
            "description": "Milan Badelj goes off the pitch and Matias Fernandez (Fiorentina) comes on."
        },
        {
            "gameTime": "2 - 35:38",
            "label": "y-card",
            "description": "Antonio Damato shows a yellow card to Gary Medel (Inter) for a tough tackle."
        },
        {
            "gameTime": "2 - 33:34",
            "label": "",
            "description": "Antonio Damato blows his whistle and it's Nikola Kalinic (Fiorentina) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "substitution",
            "description": "Roberto Mancini prepares a substitution. Fredy Guarin is replaced by Marcelo Brozovic (Inter)."
        },
        {
            "gameTime": "2 - 31:38",
            "label": "",
            "description": "Fiorentina players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "soccer-ball",
            "description": "Goal! Nikola Kalinic (Fiorentina) scores after an assist by Josip Ilicic that allowed him to tap in the ball into an empty net. The score is 1:4."
        },
        {
            "gameTime": "2 - 29:38",
            "label": "substitution",
            "description": "Problems for Paulo Sousa as Facundo Roncaglia is not able to play anymore. His injury is too serious and Gilberto (Fiorentina) replaces him."
        },
        {
            "gameTime": "2 - 28:22",
            "label": "injury",
            "description": "Facundo Roncaglia (Fiorentina) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 26:39",
            "label": "",
            "description": "Nenad Tomovic (Fiorentina) controls a nice lofted pass and shoots from the edge of the box, but his attempt is neither hard nor precise, so Samir Handanovic stops it easily."
        },
        {
            "gameTime": "2 - 26:00",
            "label": "",
            "description": "Fiorentina are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "substitution",
            "description": "Here is a change. Jakub Blaszczykowski is going off and Paulo Sousa gives the last tactical orders to Nenad Tomovic (Fiorentina)."
        },
        {
            "gameTime": "2 - 23:27",
            "label": "y-card",
            "description": "That will be a yellow card for one of the players. The one who gets booked is Nikola Kalinic (Fiorentina). Nikola Kalinic (Fiorentina) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him."
        },
        {
            "gameTime": "2 - 21:59",
            "label": "",
            "description": "Marcos Alonso (Fiorentina) makes a driving run into the box but he cannot work any space for a shot."
        },
        {
            "gameTime": "2 - 20:27",
            "label": "",
            "description": "Jakub Blaszczykowski (Fiorentina) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "2 - 19:43",
            "label": "",
            "description": "Some great controlled play and passing from Fiorentina. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 17:38",
            "label": "",
            "description": "Inter are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "2 - 15:29",
            "label": "substitution",
            "description": "Roberto Mancini has decided to introduce fresh legs, with Jonathan Biabiany (Inter) replacing Ivan Perisic."
        },
        {
            "gameTime": "2 - 14:30",
            "label": "soccer-ball",
            "description": "Goal! Mauro Icardi (Inter) is quickest to react to the rebound and stabs the ball into the back of the net. It's 1:3."
        },
        {
            "gameTime": "2 - 14:10",
            "label": "",
            "description": "Mauro Icardi (Inter) shows good awareness inside the box as he latches on to a cross from the set piece. He jumps high but his towering header lacks a little bit of accuracy and glances off the left hand post."
        },
        {
            "gameTime": "2 - 13:42",
            "label": "",
            "description": "Facundo Roncaglia (Fiorentina) is penalised after knocking an opponent down. Inter win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 12:33",
            "label": "",
            "description": "Fiorentina keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "2 - 10:32",
            "label": "",
            "description": "Inter keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "2 - 08:45",
            "label": "",
            "description": "The Inter players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball."
        },
        {
            "gameTime": "2 - 06:56",
            "label": "",
            "description": "One of the Fiorentina players was holding his opponent and the referee doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "2 - 05:49",
            "label": "",
            "description": "Marcos Alonso (Fiorentina) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 04:14",
            "label": "",
            "description": "Milan Badelj (Fiorentina) takes the ball on and fires in a shot from 20 metres out. Samir Handanovic stops the effort which is headed for the bottom right corner."
        },
        {
            "gameTime": "2 - 02:20",
            "label": "",
            "description": "Fiorentina are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 01:30",
            "label": "",
            "description": "Matias Vecino (Fiorentina) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 00:02",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Roberto Mancini gives a chance to Andrea Ranocchia (Inter) and Geoffrey Kondogbia is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have been witnesses to an ordinary game without many breathtaking situations, but there is still time for improvement in the second half. Both teams are unsuccessfully trying to control the game and it's pretty even so far. The home team are playing possession football, while the away team look to find a weakness in the opposition's defence mainly with their rapid counter attacks."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:35",
            "label": "",
            "description": "Fiorentina are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:00",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) makes a strong challenge and Antonio Damato blows for a foul."
        },
        {
            "gameTime": "1 - 42:52",
            "label": "y-card",
            "description": "Antonio Damato shows the yellow card to Fredy Guarin (Inter) for a heavy challenge."
        },
        {
            "gameTime": "1 - 41:15",
            "label": "",
            "description": "Borja Valero (Fiorentina) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "1 - 40:00",
            "label": "y-card",
            "description": "Antonio Damato shows a yellow card to Geoffrey Kondogbia (Inter), who isn't surprised as the tackle was really hard and late. Free kick. Fiorentina will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 39:22",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Alex Nicolao Telles (Inter), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "1 - 39:00",
            "label": "",
            "description": "Facundo Roncaglia (Fiorentina) pulls the jersey of one of the opposition players and Antonio Damato blows his whistle for a foul. Inter will take a free kick."
        },
        {
            "gameTime": "1 - 37:18",
            "label": "",
            "description": "A pass from Ivan Perisic (Inter) is intercepted by Ciprian Tatarusanu and the move breaks down."
        },
        {
            "gameTime": "1 - 36:00",
            "label": "corner",
            "description": "The corner by Alex Nicolao Telles (Inter) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 35:34",
            "label": "",
            "description": "Ciprian Tatarusanu (Fiorentina) skips past his man but can't keep the ball in play. The referee points to the corner flag. It's a corner to Fiorentina."
        },
        {
            "gameTime": "1 - 34:44",
            "label": "",
            "description": "Fiorentina hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 32:26",
            "label": "",
            "description": "Marcos Alonso (Fiorentina) takes a mid range free kick and the effort crashes into the defensive wall."
        },
        {
            "gameTime": "1 - 31:17",
            "label": "",
            "description": "A free kick has been awarded to Fiorentina."
        },
        {
            "gameTime": "1 - 30:23",
            "label": "r-card",
            "description": "Miranda (Inter) knows that the game is over for him after receiving a red card from the referee for fouling his opponent!"
        },
        {
            "gameTime": "1 - 29:46",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 28:38",
            "label": "",
            "description": "Antonio Damato has a clear sight and sees a foul from Fredy Guarin (Inter)."
        },
        {
            "gameTime": "1 - 27:28",
            "label": "",
            "description": "Rodrigo Palacio (Inter) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 26:34",
            "label": "",
            "description": "Iglesias Borja Valero (Fiorentina) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 25:12",
            "label": "",
            "description": "Rodrigo Palacio (Inter) sends in a lofted cross from a mid range free kick. His effort, however, goes out of play."
        },
        {
            "gameTime": "1 - 24:34",
            "label": "",
            "description": "Marcos Alonso (Fiorentina) was too fierce in his attempt to get the ball from his opponent and Antonio Damato blows for a foul. Inter have been awarded a free kick."
        },
        {
            "gameTime": "1 - 22:51",
            "label": "soccer-ball",
            "description": "Goal! Marcos Alonso feeds Nikola Kalinic (Fiorentina), who taps the ball into an empty net. He makes it 0:3."
        },
        {
            "gameTime": "1 - 22:04",
            "label": "",
            "description": "Ciprian Tatarusanu displays his ability to read the game and clears the danger after Rodrigo Palacio (Inter) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "1 - 20:42",
            "label": "corner",
            "description": "Josip Ilicic (Fiorentina) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 20:12",
            "label": "",
            "description": "Borja Valero (Fiorentina) fails to send a pass into the box as his effort is cut out. Fiorentina have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 19:58",
            "label": "",
            "description": "Fiorentina are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "1 - 18:01",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Nikola Kalinic (Fiorentina) and he fired home from close range. The score is 0:2."
        },
        {
            "gameTime": "1 - 17:49",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) gets a shot away from about 25 metres after his amazing solo run. It goes to the top left corner, but Samir Handanovic refuses to be beaten easily and he pulls off an exquisite save to keep the ball out."
        },
        {
            "gameTime": "1 - 16:48",
            "label": "",
            "description": "Flag goes up against Geoffrey Kondogbia (Inter) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 16:22",
            "label": "corner",
            "description": "Alex Nicolao Telles (Inter) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "1 - 15:53",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Mauro Icardi (Inter), but the defence gets it clear. The referee signals a corner kick to Inter."
        },
        {
            "gameTime": "1 - 14:25",
            "label": "",
            "description": "Felipe Melo (Inter) was too forceful with his tackle and Antonio Damato interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 13:48",
            "label": "",
            "description": "Borja Valero (Fiorentina) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "1 - 12:50",
            "label": "",
            "description": "Milan Badelj (Fiorentina) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 12:09",
            "label": "injury",
            "description": "Looks like Milan Badelj (Fiorentina) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 10:13",
            "label": "",
            "description": "The linesman raises his flag. Rodrigo Palacio (Inter) is adjudged offside."
        },
        {
            "gameTime": "1 - 09:56",
            "label": "",
            "description": "Nikola Kalinic (Fiorentina) is picked out by one of his teammates with a brilliant long range cross, but he doesn't control the ball well and the defence eliminates the danger without any problem."
        },
        {
            "gameTime": "1 - 07:33",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) sends a cross in and finds Nikola Kalinic inside the box, but one of the defenders steps in and clears the danger."
        },
        {
            "gameTime": "1 - 05:29",
            "label": "",
            "description": "Some patient build up play from Inter as they look to unlock the defence."
        },
        {
            "gameTime": "1 - 03:59",
            "label": "soccer-ball",
            "description": "Josip Ilicic (Fiorentina) leaves the keeper helpless with his precise penalty shot into the top right corner."
        },
        {
            "gameTime": "1 - 03:28",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 02:52",
            "label": "y-card",
            "description": "Samir Handanovic (Inter) gets a yellow card. The referee Antonio Damato made the right call."
        },
        {
            "gameTime": "1 - 02:51",
            "label": "penalty",
            "description": "Samir Handanovic (Inter) commits an ugly challenge. The referee sees it and immediately blows his whistle. PENALTY to Fiorentina! Great chance to score."
        },
        {
            "gameTime": "1 - 01:14",
            "label": "",
            "description": "Davide Santon (Inter) should know this behaviour is beyond the rules. He was too careless with his challenge and left Antonio Damato no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "",
            "description": "A cross by Alex Nicolao Telles (Inter) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Inter will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Damato will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "H2H matches: 1.3.2015 0:1, 5.10.2014 0:3, 15.2.2014 2:1, 26.9.2013 2:1, 17.2.2013 1:4."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "10 That's how many Inter's matches finished with the result 1:0."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Inter have earned 67 points so far in the competition, of which 41 points earned at home."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. The visiting team was controlling the game most of the time. The home team really focused on a well organized defence, while the away team played possession football."
        }
    ],
    "gameAwayTeam": "Fiorentina",
    "gameDate": "27/09/2015 - 21:45",
    "gameHomeTeam": "Inter",
    "gameScore": "1 - 4"
}