{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-09-26 - 17-00 Manchester United 3 - 0 Sunderland/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Manchester United were better today and displayed masterful control and movement. The home team tried to prevail using combination football, while the away side adopted a defensive style of play."
        },
        {
            "gameTime": "2 - 49:05",
            "label": "whistle",
            "description": "Mike Jones is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "",
            "description": "One of the defending players blocks a long range shot which was unleashed by Patrick van Aanholt (Sunderland)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "soccer-ball",
            "description": "It's a goal! Mata (Manchester United) scores with a brilliant shot into the right side of the goal after being released inside the box by a superb lofted pass from Ashley Young. The score is 2:0."
        },
        {
            "gameTime": "2 - 43:54",
            "label": "",
            "description": "Good touch by Yann M'Vila (Sunderland) as he receives a great pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, the effort misses the net and flies well wide to the right."
        },
        {
            "gameTime": "2 - 42:21",
            "label": "",
            "description": "The ball is cleared after Wayne Rooney (Manchester United) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 41:49",
            "label": "",
            "description": "Mike Jones blows his whistle for a foul after Patrick van Aanholt (Sunderland) hacks down one of his opponents. It's a free kick to Manchester United in a dangerous position."
        },
        {
            "gameTime": "2 - 41:03",
            "label": "",
            "description": "Bastian Schweinsteiger (Manchester United) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "2 - 40:49",
            "label": "",
            "description": "Jeremain Lens (Sunderland) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 39:43",
            "label": "y-card",
            "description": "Lee Cattermole (Sunderland) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Mike Jones ignores the protests."
        },
        {
            "gameTime": "2 - 39:05",
            "label": "",
            "description": "Good defending. Ashley Young (Manchester United) tries to find Wayne Rooney inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 37:31",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Matteo Darmian (Manchester United)."
        },
        {
            "gameTime": "2 - 35:58",
            "label": "corner",
            "description": "Juan Manuel Mata (Manchester United) sends the corner into the box, but Costel Pantilimon intercepts it and averts the threat."
        },
        {
            "gameTime": "2 - 35:44",
            "label": "",
            "description": "Manchester United keep possession of the ball by producing one two passes, but an opponent steps in and wins the ball. Manchester United win a corner."
        },
        {
            "gameTime": "2 - 33:24",
            "label": "corner",
            "description": "Ashley Young (Manchester United) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 32:47",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) fashions a shot from the edge of the box after receiving an accurate pass. Costel Pantilimon makes a stunning save to stop the effort from flying into the bottom left corner. Manchester United force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 31:47",
            "label": "substitution",
            "description": "Louis van Gaal has decided to make a change. Ashley Young (Manchester United) replaces Memphis Depay."
        },
        {
            "gameTime": "2 - 29:15",
            "label": "",
            "description": "A cross is clipped into the penalty area by Memphis Depay (Manchester United) but poses no threat."
        },
        {
            "gameTime": "2 - 28:23",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Daley Blind leaves the pitch and Phil Jones (Manchester United) comes on."
        },
        {
            "gameTime": "2 - 26:33",
            "label": "",
            "description": "Daley Blind (Manchester United) is able to continue to play."
        },
        {
            "gameTime": "2 - 25:51",
            "label": "injury",
            "description": "Daley Blind (Manchester United) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "2 - 24:56",
            "label": "substitution",
            "description": "Here is a change. Ola Toivonen is going off and Dick Advocaat gives the last tactical orders to Sebastian Larsson (Sunderland)."
        },
        {
            "gameTime": "2 - 24:27",
            "label": "",
            "description": "What an opportunity! Anthony Martial (Manchester United) latches on to a perfect cross from the wing and produces a bullet header from around the penalty spot which goes narrowly over the crossbar! The ball is off of the pitch and it's a goal kick for Sunderland."
        },
        {
            "gameTime": "2 - 22:54",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Michael Carrick trots off the pitch and is replaced by Bastian Schweinsteiger (Manchester United)."
        },
        {
            "gameTime": "2 - 22:06",
            "label": "",
            "description": "Memphis Depay (Manchester United) fashions a shot from the edge of the box after receiving an accurate pass. Costel Pantilimon makes a comfortable save to stop the effort from flying into the middle of the goal."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "",
            "description": "Manchester United hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "2 - 17:20",
            "label": "",
            "description": "Matteo Darmian (Manchester United) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 16:57",
            "label": "",
            "description": "Patrick van Aanholt (Sunderland) receives a pass inside the box, controls the ball and drills it towards the left post. Unfortunately for him, David de Gea makes a great save to stop his effort."
        },
        {
            "gameTime": "2 - 15:53",
            "label": "",
            "description": "Michael Carrick (Manchester United) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "2 - 15:31",
            "label": "",
            "description": "Steven Fletcher (Sunderland) makes an overly aggressive challenge and Mike Jones blows his whistle for a foul. There is a free kick near the sideline to Manchester United."
        },
        {
            "gameTime": "2 - 13:01",
            "label": "",
            "description": "Nice passing game by Manchester United. They are increasing their possession with a series of long passes and waiting for the right moment to create an attacking opportunity."
        },
        {
            "gameTime": "2 - 10:49",
            "label": "corner",
            "description": "The resulting corner from Yann M'Vila (Sunderland) comes to nothing."
        },
        {
            "gameTime": "2 - 10:35",
            "label": "",
            "description": "Sunderland are happy to keep the ball as they wait for gaps in defence to open up. However, an opposing player steps in and clears. Sunderland earn a corner."
        },
        {
            "gameTime": "2 - 10:19",
            "label": "corner",
            "description": "Yann M'Vila (Sunderland) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 09:58",
            "label": "",
            "description": "Steven Fletcher (Sunderland) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort. The ball goes out for a corner. Sunderland can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 08:42",
            "label": "",
            "description": "Yann M'Vila (Sunderland) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "2 - 08:01",
            "label": "",
            "description": "Ola Toivonen (Sunderland) gets to a rebound in front of goal and sends the ball towards the bottom left corner. However, but he couldn't beat David de Gea, who shows off his superb goalkeeping ability by pulling off a great save."
        },
        {
            "gameTime": "2 - 07:52",
            "label": "",
            "description": "Morgan Schneiderlin (Manchester United) fouls an opponent. At least that's what referee Mike Jones signals."
        },
        {
            "gameTime": "2 - 06:38",
            "label": "",
            "description": "Neat passing move from Manchester United in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 04:17",
            "label": "y-card",
            "description": "The referee demonstrates he won't tolerate this behaviour. Billy Jones (Sunderland) is given a yellow card."
        },
        {
            "gameTime": "2 - 00:31",
            "label": "soccer-ball",
            "description": "Wayne Rooney (Manchester United) was in the right place to put the ball into the back of the net with his body. It's 0:0."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Dick Advocaat has decided to make a substitution during the half time break. Steven Fletcher (Sunderland) comes on the pitch for Adam Johnson."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 49:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. Manchester United dominated the opening period and easily created the most chances. The home side attempts to hold onto the ball for as long as possible, while the away side focuses on defending and lets the opposition keep possession."
        },
        {
            "gameTime": "1 - 49:19",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 48:15",
            "label": "soccer-ball",
            "description": "Goal! Mata feeds Memphis Depay (Manchester United), who taps the ball into an empty net. He makes it 1:0."
        },
        {
            "gameTime": "1 - 46:13",
            "label": "",
            "description": "Morgan Schneiderlin (Manchester United) makes an unfair challenge by holding his opponent to prevent him from getting the ball."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "",
            "description": "Adam Johnson (Sunderland) is penalised for a foul. Mike Jones had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 43:39",
            "label": "",
            "description": "Wayne Rooney (Manchester United) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 41:21",
            "label": "",
            "description": "Adam Johnson (Sunderland) is penalised for holding. Mike Jones signals a set piece."
        },
        {
            "gameTime": "1 - 39:38",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 39:21",
            "label": "",
            "description": "Manchester United move the ball around well as they wait for an opportunity to shoot, but the attack is halted as they lose possession. The ball goes behind for a corner. Manchester United will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 37:50",
            "label": "",
            "description": "Memphis Depay (Manchester United) stands over the free kick and opts to take it himself, but it is straight at Costel Pantilimon."
        },
        {
            "gameTime": "1 - 37:47",
            "label": "",
            "description": "Memphis Depay (Manchester United) will take a free kick. Is he going to strike the ball directly at the goal? Let's find out!"
        },
        {
            "gameTime": "1 - 37:46",
            "label": "y-card",
            "description": "Adam Johnson (Sunderland) is awarded a yellow card for his behaviour."
        },
        {
            "gameTime": "1 - 36:17",
            "label": "",
            "description": "Anthony Martial (Manchester United) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 35:05",
            "label": "injury",
            "description": "Anthony Martial (Manchester United) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "1 - 34:15",
            "label": "",
            "description": "Adam Johnson (Sunderland) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "1 - 33:44",
            "label": "",
            "description": "Mike Jones interrupts the game. It was a tactical foul from Chris Smalling (Manchester United). A free kick to Sunderland."
        },
        {
            "gameTime": "1 - 32:59",
            "label": "",
            "description": "Fabio Borini (Sunderland) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 32:09",
            "label": "injury",
            "description": "Fabio Borini (Sunderland) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "1 - 30:43",
            "label": "",
            "description": "Wayne Rooney (Manchester United) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "1 - 28:53",
            "label": "",
            "description": "Daley Blind (Manchester United) takes a short free kick."
        },
        {
            "gameTime": "1 - 28:15",
            "label": "",
            "description": "Fabio Borini (Sunderland) pulls the jersey of one of the opposition players and Mike Jones blows his whistle for a foul. A free kick to Manchester United."
        },
        {
            "gameTime": "1 - 27:45",
            "label": "",
            "description": "Mata (Manchester United) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "1 - 27:25",
            "label": "",
            "description": "Antonio Valencia (Manchester United) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "1 - 26:44",
            "label": "",
            "description": "Wayne Rooney (Manchester United) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 26:26",
            "label": "",
            "description": "Fabio Borini (Sunderland) is penalised for holding. Mike Jones signals a set piece."
        },
        {
            "gameTime": "1 - 25:45",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "1 - 24:29",
            "label": "",
            "description": "Anthony Martial (Manchester United) finds himself some space just outside the box, collects a rebound and sends an effort in on goal. Costel Pantilimon pulls off a fantastic reflex save to stop the ball going in off the crossbar. Manchester United force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 22:53",
            "label": "",
            "description": "Adam Johnson (Sunderland) produces a ferocious strike from the edge of the box. His dangerous effort towards the bottom right corner is blocked by David de Gea, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 21:55",
            "label": "",
            "description": "Matteo Darmian (Manchester United) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box into the stands. The ball goes out of play and Sunderland will have a goal kick."
        },
        {
            "gameTime": "1 - 19:41",
            "label": "",
            "description": "Lee Cattermole (Sunderland) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 18:50",
            "label": "injury",
            "description": "Lee Cattermole (Sunderland) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "1 - 18:04",
            "label": "",
            "description": "Mike Jones blows the whistle, Antonio Valencia (Manchester United) is penalised for a foul. A free kick is awarded to Sunderland."
        },
        {
            "gameTime": "1 - 16:22",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) smashes the ball towards goal from the edge of the penalty box, but it fails to bother the goalkeeper as it hits the defensive wall."
        },
        {
            "gameTime": "1 - 14:57",
            "label": "",
            "description": "Dangerous play by Costel Pantilimon (Sunderland). Mike Jones blows his whistle for a foul. Another situation results in a direct free kick for Manchester United."
        },
        {
            "gameTime": "1 - 14:35",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 13:20",
            "label": "",
            "description": "Mata (Manchester United) weaves his way through opponents and strikes the ball from the edge of the area, but it's blocked by a defender. Manchester United will take a corner kick."
        },
        {
            "gameTime": "1 - 12:00",
            "label": "",
            "description": "Matteo Darmian (Manchester United) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "1 - 11:39",
            "label": "",
            "description": "John O'Shea (Sunderland) should know this behaviour is beyond the rules. He was too careless with his challenge and left Mike Jones no option but to blow his whistle. Manchester United are awarded the free kick."
        },
        {
            "gameTime": "1 - 10:49",
            "label": "",
            "description": "John O'Shea (Sunderland) attempts to score as he rises near the penalty spot and heads the ball to the middle of the goal. David de Gea pulls off a comfortable save to stop the ball from hitting the net."
        },
        {
            "gameTime": "1 - 09:10",
            "label": "",
            "description": "Michael Carrick (Manchester United) plays a through ball inside the box, but it's too strong and Costel Pantilimon comes off his line to intercept."
        },
        {
            "gameTime": "1 - 07:37",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Juan Manuel Mata (Manchester United), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "1 - 06:46",
            "label": "",
            "description": "Lee Cattermole (Sunderland) brings down his opponent with a very late tackle. Manchester United win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 05:33",
            "label": "",
            "description": "Mata (Manchester United) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 03:11",
            "label": "",
            "description": "A pass by Juan Manuel Mata (Manchester United) ends up in no man's land, and the attacking effort comes to an end. The ball is off of the pitch and it's a goal kick for Sunderland."
        },
        {
            "gameTime": "1 - 00:59",
            "label": "",
            "description": "The Manchester United players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Mike Jones will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sunderland's latest transfer: Dame N'Doye (Trabzonspor), Jan Kirchhoff (Bayern Munich)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Manchester United have earned 66 points so far in the competition, of which 41 points earned at home."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Head to head clashes between these two clubs: 13.2.2016 1:2, 28.2.2015 2:0, 24.8.2014 1:1, 3.5.2014 0:1, 22.1.2014 2:2."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Manchester United were better today and displayed masterful control and movement. The home team tried to prevail using combination football, while the away side adopted a defensive style of play."
        }
    ],
    "gameAwayTeam": "Sunderland",
    "gameDate": "26/09/2015 - 17:00",
    "gameHomeTeam": "Manchester United",
    "gameScore": "3 - 0"
}