{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-02-12 - 14-30 Crotone 0 - 2 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 48:57",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 48:47",
            "label": "",
            "description": "Mario Rui (AS Roma) tries to slide the ball through to a teammate but it's well blocked by a defender. AS Roma have a corner."
        },
        {
            "gameTime": "2 - 47:24",
            "label": "",
            "description": "A neat pass is well received by Marcello Trotta (Crotone), who is lurking on the edge of the box and strikes the ball towards the roof of the net, but the goalkeeper makes an incredible save to block his shot."
        },
        {
            "gameTime": "2 - 47:08",
            "label": "",
            "description": "A cross into the box from Andrea Nalini (Crotone) is cleared."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to make a change. Diego Perotti (AS Roma) replaces Radja Nainggolan."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "substitution",
            "description": "A substitution has been made. Bruno Peres goes off and Mario Rui (AS Roma) comes on."
        },
        {
            "gameTime": "2 - 41:34",
            "label": "",
            "description": "Boadu Maxwell Acosty (Crotone) creates a good chance for himself and goes for goal from mid range, but the effort is well wide of the left post."
        },
        {
            "gameTime": "2 - 39:49",
            "label": "",
            "description": "Edin Dzeko (AS Roma) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 38:49",
            "label": "",
            "description": "Boadu Maxwell Acosty (Crotone) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "",
            "description": "Leonardo Capezzi (Crotone) has an effort from the edge of the area, but he skies the ball over the top."
        },
        {
            "gameTime": "2 - 36:35",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Marcello Trotta (Crotone). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "2 - 35:23",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Andrea Nalini (Crotone) comes onto the pitch for Aleksandar Tonev."
        },
        {
            "gameTime": "2 - 34:43",
            "label": "substitution",
            "description": "Here is a change. Mohamed Salah is going off and Luciano Spalletti gives the last tactical orders to Daniele De Rossi (AS Roma)."
        },
        {
            "gameTime": "2 - 33:10",
            "label": "",
            "description": "Aleksandar Tonev (Crotone) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the right post."
        },
        {
            "gameTime": "2 - 31:45",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Mohamed Salah is the provider as he slips the ball to Edin Dzeko (AS Roma) who simply steers it home from close range. It's 0:2."
        },
        {
            "gameTime": "2 - 30:24",
            "label": "substitution",
            "description": "Marcello Trotta (Crotone) joins the action as a substitute, replacing Noe Dussenne."
        },
        {
            "gameTime": "2 - 28:54",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 26:09",
            "label": "",
            "description": "Leonardo Capezzi (Crotone) is flagged for offside."
        },
        {
            "gameTime": "2 - 25:36",
            "label": "",
            "description": "Emerson (AS Roma) was too forceful with his tackle and Carmine Russo interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 24:42",
            "label": "",
            "description": "Bruno Peres (AS Roma) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "2 - 23:28",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "injury",
            "description": "The game is interrupted now, Konstantinos Manolas (AS Roma) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 21:34",
            "label": "",
            "description": "Lorenzo Crisetig (Crotone) fires the ball from distance, but it's blocked by a defender."
        },
        {
            "gameTime": "2 - 20:40",
            "label": "",
            "description": "Bruno Peres (AS Roma) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Carmine Russo with no other option than to blow for a foul."
        },
        {
            "gameTime": "2 - 18:32",
            "label": "",
            "description": "Emerson (AS Roma) meets a cross just outside the area and gets in a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "2 - 16:28",
            "label": "corner",
            "description": "The resulting corner from Leandro Paredes (AS Roma) is cleared by the defence."
        },
        {
            "gameTime": "2 - 15:40",
            "label": "",
            "description": "Edin Dzeko (AS Roma) misses a good chance to score. An inch perfect cross into the box finds Edin Dzeko (AS Roma) who rises for a header, but sends the ball well over the bar. The linesman points to the corner flag, AS Roma are going to take it."
        },
        {
            "gameTime": "2 - 14:25",
            "label": "",
            "description": "Boadu Maxwell Acosty (Crotone) fashions a shot from the edge of the box after receiving an accurate pass. Wojciech Szczesny makes a stunning save to stop the effort from flying into the right side of the goal."
        },
        {
            "gameTime": "2 - 12:52",
            "label": "",
            "description": "A goal, which was scored by Aleksandar Tonev (Crotone), was disallowed due to offside."
        },
        {
            "gameTime": "2 - 11:50",
            "label": "",
            "description": "Federico Fazio (AS Roma) connects with an inch perfect cross and from around the penalty spot he steers a header towards the right side of the goal, but Alex Cordaz pulls off a brilliant save and diverts the ball onto the post."
        },
        {
            "gameTime": "2 - 10:53",
            "label": "",
            "description": "The linesman raises his flag for offside before Edin Dzeko (AS Roma) heads on."
        },
        {
            "gameTime": "2 - 09:32",
            "label": "substitution",
            "description": "Here comes a substitution. Mario Sampirisi (Crotone) is brought on as a substitute for Djamel Mesbah."
        },
        {
            "gameTime": "2 - 08:50",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 08:03",
            "label": "",
            "description": "Edin Dzeko (AS Roma) receives a pass and fires in a shot from the edge of the box. It deflects off one of the defending players and hits the underside of the crossbar! Good work from AS Roma as they win a corner."
        },
        {
            "gameTime": "2 - 07:39",
            "label": "",
            "description": "Mohamed Salah (AS Roma) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 05:55",
            "label": "",
            "description": "That's a well taken pass by Edin Dzeko (AS Roma). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 02:31",
            "label": "",
            "description": "Edin Dzeko (AS Roma) commits a rough foul. Carmine Russo stops the game and makes a call."
        },
        {
            "gameTime": "2 - 01:11",
            "label": "",
            "description": "Leandro Paredes (AS Roma) produces a poor cross from the free kick which is easily turned away."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:06",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Carmine Russo has ended it."
        },
        {
            "gameTime": "1 - 43:51",
            "label": "",
            "description": "Gianmarco Ferrari (Crotone) peeled away from his marker and got on the end of the resulting corner, but his fine header towards the underside of the crossbar is perfectly saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 43:42",
            "label": "corner",
            "description": "Lorenzo Crisetig (Crotone) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 43:10",
            "label": "",
            "description": "Aleksandar Tonev (Crotone) shoots from outside the box, but his effort is blocked. It will be a corner kick for Crotone."
        },
        {
            "gameTime": "1 - 42:32",
            "label": "corner",
            "description": "Lorenzo Crisetig (Crotone) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 42:22",
            "label": "",
            "description": "Djamel Mesbah (Crotone) wastes a good opportunity as his pass into the box is blocked by the defence. The linesman makes the right call and Crotone will have a corner."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "soccer-ball",
            "description": "Radja Nainggolan (AS Roma) takes a great first touch to control a killer pass on the edge of the box and drills a shot into the bottom left corner in trademark fashion."
        },
        {
            "gameTime": "1 - 36:59",
            "label": "",
            "description": "Leandro Paredes (AS Roma) commits a rough challenge and Carmine Russo blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 35:50",
            "label": "",
            "description": "Federico Ceccherini (Crotone) robs an opponent of the ball and explodes in anger when Carmine Russo blows for a foul."
        },
        {
            "gameTime": "1 - 34:50",
            "label": "",
            "description": "Boadu Maxwell Acosty (Crotone) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 32:49",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes a short corner kick."
        },
        {
            "gameTime": "1 - 32:21",
            "label": "",
            "description": "Kevin Strootman (AS Roma) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender. The referee points to the corner flag and AS Roma will take a corner."
        },
        {
            "gameTime": "1 - 31:23",
            "label": "",
            "description": "Bruno Peres (AS Roma) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 29:52",
            "label": "",
            "description": "Carmine Russo has a clear sight and sees a foul from Noe Dussenne (Crotone)."
        },
        {
            "gameTime": "1 - 29:02",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 28:36",
            "label": "",
            "description": "Edin Dzeko (AS Roma) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety. The ball is out of play. AS Roma win a corner kick."
        },
        {
            "gameTime": "1 - 27:19",
            "label": "",
            "description": "Kevin Strootman (AS Roma) was too fierce in his attempt to get the ball from his opponent and Carmine Russo blows for a foul."
        },
        {
            "gameTime": "1 - 26:52",
            "label": "",
            "description": "Leandro Paredes (AS Roma) whips in the free kick, but one of the defenders comfortably clears the ball away."
        },
        {
            "gameTime": "1 - 25:51",
            "label": "",
            "description": "The game is interrupted as Aleandro Rosi (Crotone) is flagged offside."
        },
        {
            "gameTime": "1 - 24:54",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) attempted to pick out a free teammate inside the box, but Alex Cordaz comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 23:12",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) hammered the ball from a long range free kick only into the defensive wall."
        },
        {
            "gameTime": "1 - 21:56",
            "label": "",
            "description": "A pass from Aleksandar Tonev (Crotone) is intercepted by Wojciech Szczesny and the move breaks down."
        },
        {
            "gameTime": "1 - 19:40",
            "label": "",
            "description": "What an opportunity! Mohamed Salah (AS Roma) latches on to a perfect cross from the wing and produces a bullet header from around the penalty spot which goes narrowly over the crossbar!"
        },
        {
            "gameTime": "1 - 19:05",
            "label": "",
            "description": "Lorenzo Crisetig (Crotone) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 16:57",
            "label": "penalty-missed",
            "description": "Edin Dzeko (AS Roma) can't convert the spot kick. It goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 16:37",
            "label": "",
            "description": "Edin Dzeko (AS Roma) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 16:12",
            "label": "penalty",
            "description": "Gianmarco Ferrari (Crotone) pulls the jersey of one of the opposition players and Carmine Russo blows his whistle for a foul. It's a penalty! Great chance to score for AS Roma!"
        },
        {
            "gameTime": "1 - 14:50",
            "label": "",
            "description": "Diego Falcinelli (Crotone) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 14:44",
            "label": "",
            "description": "AS Roma are enjoying a spell of pressure at the moment, but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 13:09",
            "label": "",
            "description": "The ball is cleared after Boadu Maxwell Acosty (Crotone) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 10:44",
            "label": "",
            "description": "Aleksandar Tonev (Crotone) receives a low pass just outside the box and unleashes a fine strike towards the right post. Wojciech Szczesny pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 10:14",
            "label": "",
            "description": "It looks like Leonardo Capezzi (Crotone) saw red with that tackle. Carmine Russo won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 09:28",
            "label": "",
            "description": "Mohamed Salah (AS Roma) feels very aggrieved after the referee stops play for a foul that he commits while in possession of the ball."
        },
        {
            "gameTime": "1 - 07:44",
            "label": "",
            "description": "Edin Dzeko (AS Roma) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 05:12",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Gianmarco Ferrari (Crotone) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 02:54",
            "label": "",
            "description": "Mohamed Salah (AS Roma) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 01:06",
            "label": "",
            "description": "Leandro Paredes (AS Roma) makes a reckless foul in order to win the ball from his opponent. Carmine Russo has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 00:25",
            "label": "",
            "description": "Flag goes up against Diego Falcinelli (Crotone) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Crotone will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carmine Russo will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko is the leading goal scorer for AS Roma with 17 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The best result this season for Crotone was a 4:1 victory."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "12/02/2017 - 14:30",
    "gameHomeTeam": "Crotone",
    "gameScore": "0 - 2"
}