{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-25 - 22-45 B. Monchengladbach 4 - 2 Sevilla/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was a very watchable match. Great goals and there was plenty of action at both ends of the pitch. No regrets about following this game. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 47:11",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 46:30",
            "label": "",
            "description": "Great teamplay by B. Monchengladbach as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "soccer-ball",
            "description": "Ever Banega (Sevilla) scores from the penalty spot with a shot that goes inside the right post. How easy is that!"
        },
        {
            "gameTime": "2 - 45:45",
            "label": "",
            "description": "Ever Banega (Sevilla) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 45:20",
            "label": "penalty",
            "description": "Granit Xhaka (B. Monchengladbach) fouls an opponent. At least that's what referee Damir Skomina signals. The referee points to the penalty spot. PENALTY to Sevilla!"
        },
        {
            "gameTime": "2 - 44:34",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Ever Banega (Sevilla), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "2 - 44:18",
            "label": "",
            "description": "Damir Skomina blows the whistle, Julian Korb (B. Monchengladbach) is penalised for a foul. A free kick is awarded to Sevilla."
        },
        {
            "gameTime": "2 - 42:31",
            "label": "",
            "description": "Ever Banega (Sevilla) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "2 - 41:47",
            "label": "corner",
            "description": "The resulting corner from Ever Banega (Sevilla) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 41:46",
            "label": "substitution",
            "description": "Substitution. Fabian Johnson will be replaced by Nico Elvedi (B. Monchengladbach)."
        },
        {
            "gameTime": "2 - 40:39",
            "label": "",
            "description": "Victor Vitolo (Sevilla) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The referee blows his whistle, Sevilla are awarded a corner kick."
        },
        {
            "gameTime": "2 - 39:15",
            "label": "attendance",
            "description": "The attendance is 45177."
        },
        {
            "gameTime": "2 - 38:26",
            "label": "y-card",
            "description": "Josip Drmic (B. Monchengladbach) brings his opponent down with a tackle and Damir Skomina blows his whistle for a foul. The referee shows the yellow card to Josip Drmic (B. Monchengladbach)."
        },
        {
            "gameTime": "2 - 37:47",
            "label": "soccer-ball",
            "description": "Lars Stindl (B. Monchengladbach) latches on to a superb pass and breaks through the defence before firing a shot from mid range that goes past the goalkeeper inside the left post."
        },
        {
            "gameTime": "2 - 36:54",
            "label": "substitution",
            "description": "The substitution is prepared. Mariano (Sevilla) joins the action as a substitute, replacing Coke."
        },
        {
            "gameTime": "2 - 36:53",
            "label": "soccer-ball",
            "description": "Goal! Fernando Llorente gets to the ball, slips Victor Vitolo (Sevilla) into the area and he scores with a delightful chipped finish to make it 3:1."
        },
        {
            "gameTime": "2 - 34:31",
            "label": "",
            "description": "The game is interrupted as Benoit Tremoulinas (Sevilla) is flagged offside."
        },
        {
            "gameTime": "2 - 33:39",
            "label": "substitution",
            "description": "We are about to witness a substitution. Marvin Schulz (B. Monchengladbach) is replacing Mahmoud Dahoud."
        },
        {
            "gameTime": "2 - 32:38",
            "label": "soccer-ball",
            "description": "Lars Stindl produces a sweet pass and picks out Raffael (B. Monchengladbach) inside the box. He quickly takes a shot which goes into the middle of the net and leaves the goalkeeper helpless. He makes it 1:0!"
        },
        {
            "gameTime": "2 - 31:40",
            "label": "",
            "description": "Yann Sommer pulls off a great save to block a header from Fernando Llorente (Sevilla) after a nice lofted cross."
        },
        {
            "gameTime": "2 - 30:26",
            "label": "substitution",
            "description": "Unai Emery Etxegoien prepares a substitution. Kevin Gameiro is replaced by Fernando Llorente (Sevilla)."
        },
        {
            "gameTime": "2 - 29:49",
            "label": "",
            "description": "Damir Skomina blows his whistle for a foul after Raffael (B. Monchengladbach) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 29:16",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 28:30",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) zig zags his way into the box and drills a low shot towards the middle of the goal, but the goalkeeper makes a great reaction save to stop the effort."
        },
        {
            "gameTime": "2 - 26:45",
            "label": "",
            "description": "Raffael (B. Monchengladbach) weaves through the defence with ease and gets one on one with the keeper, but fails to score with his strike towards the bottom right corner as Sergio Rico produces a good save."
        },
        {
            "gameTime": "2 - 25:34",
            "label": "",
            "description": "A crossfield pass from Grzegorz Krychowiak (Sevilla) fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 24:45",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Ever Banega (Sevilla). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 24:25",
            "label": "",
            "description": "A cross from Coke (Sevilla) fails to reach the box as the defence clears the ball away to safety. Sevilla force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 22:52",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Fabian Johnson (B. Monchengladbach) was set free in the area by Julian Korb and made no mistake with a lovely finish into the right side of the net. 2:0."
        },
        {
            "gameTime": "2 - 20:56",
            "label": "",
            "description": "Golden chance! Kevin Gameiro (Sevilla) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the right post."
        },
        {
            "gameTime": "2 - 19:57",
            "label": "",
            "description": "Ever Banega (Sevilla) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 18:35",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Steven N'Zonzi (Sevilla) will replace Michael Krohn Dehli."
        },
        {
            "gameTime": "2 - 17:56",
            "label": "",
            "description": "Ever Banega slides a brilliant pass into Evgen Konoplyanka (Sevilla), but his shot from inside the box goes a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "",
            "description": "The Sevilla players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 16:06",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) breaks past challenges inside the box, but puts too much pace on his pass to Kevin Gameiro."
        },
        {
            "gameTime": "2 - 15:37",
            "label": "",
            "description": "Raffael (B. Monchengladbach) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 13:37",
            "label": "",
            "description": "Mahmoud Dahoud (B. Monchengladbach) takes a shot after receiving a good pass, but his effort from the edge of the box goes just over the crossbar."
        },
        {
            "gameTime": "2 - 12:29",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 10:03",
            "label": "",
            "description": "Raffael (B. Monchengladbach) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 09:12",
            "label": "corner",
            "description": "Raffael (B. Monchengladbach) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 08:38",
            "label": "",
            "description": "Granit Xhaka (B. Monchengladbach) gets to the rebound outside the penalty box and unleashes a long range shot towards the top right corner, but Sergio Rico makes a decent save to stop the effort. B. Monchengladbach earn a corner."
        },
        {
            "gameTime": "2 - 07:44",
            "label": "",
            "description": "Michael Krohn Dehli (Sevilla) sends a cross into the box, but Yann Sommer comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 07:25",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Evgen Konoplyanka (Sevilla)."
        },
        {
            "gameTime": "2 - 07:10",
            "label": "",
            "description": "Coke (Sevilla) receives a low pass just outside the box and unleashes a fine strike towards the top left corner. Yann Sommer pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed. Now Sevilla have a corner."
        },
        {
            "gameTime": "2 - 05:58",
            "label": "",
            "description": "The resulting free kick from Grzegorz Krychowiak (Sevilla) ends up in the gloves of the keeper."
        },
        {
            "gameTime": "2 - 04:52",
            "label": "y-card",
            "description": "Mahmoud Dahoud (B. Monchengladbach) knocks his opponent down with an over the top tackle. Mahmoud Dahoud (B. Monchengladbach) is yellow carded for breaking the rules of the game."
        },
        {
            "gameTime": "2 - 03:48",
            "label": "",
            "description": "Damir Skomina has a clear sight and sees a foul from Granit Xhaka (B. Monchengladbach)."
        },
        {
            "gameTime": "2 - 02:25",
            "label": "",
            "description": "Ever Banega (Sevilla) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the top left corner, but Yann Sommer was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 01:31",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "2 - 00:56",
            "label": "",
            "description": "It looked like the long range shot by Oscar Wendt (B. Monchengladbach) would end up in the net, but the effort went painfully wide of the right post. The goalkeeper was quite lucky this time."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. Neither team has really been able to control the flow of the game. The home team makes a lot of passes and attempts to maintain possession. The same goes for the away side."
        },
        {
            "gameTime": "1 - 45:14",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 44:33",
            "label": "",
            "description": "Julian Korb (B. Monchengladbach) covers his face with his hands after wasting a promising chance. He takes the rebound on the edge of the box but blazes the ball high over the crossbar."
        },
        {
            "gameTime": "1 - 43:56",
            "label": "",
            "description": "Victor Vitolo (Sevilla) attempted to pick out a free teammate inside the box, but Yann Sommer comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 42:01",
            "label": "corner",
            "description": "Evgen Konoplyanka (Sevilla) works the corner short."
        },
        {
            "gameTime": "1 - 41:38",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. Sevilla force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 41:15",
            "label": "corner",
            "description": "Ever Banega (Sevilla) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "",
            "description": "Victor Vitolo (Sevilla) connects with an accurate pass inside the box and fires the ball to the bottom right corner, but one of the defending players steps in to block the effort. Sevilla have a corner."
        },
        {
            "gameTime": "1 - 40:06",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) sends a chip pass into the box, but Yann Sommer is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 39:03",
            "label": "",
            "description": "What a goal scoring opportunity! Victor Vitolo (Sevilla) finds some space inside the box and gets in a strike, but the shot is brilliantly blocked by one of the defending players sliding in."
        },
        {
            "gameTime": "1 - 38:26",
            "label": "",
            "description": "Oscar Wendt (B. Monchengladbach) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 37:49",
            "label": "",
            "description": "Yann Sommer is alert and has a clear sight of a long through ball from Grzegorz Krychowiak (Sevilla). Easy save!"
        },
        {
            "gameTime": "1 - 36:33",
            "label": "",
            "description": "Mahmoud Dahoud (B. Monchengladbach) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 33:40",
            "label": "y-card",
            "description": "Ever Banega (Sevilla) was trying to get to the ball but clattered into the legs of the opponent as well. Damir Skomina blows his whistle for an infringement. A yellow coloured card is received by Ever Banega (Sevilla)."
        },
        {
            "gameTime": "1 - 33:38",
            "label": "",
            "description": "Michael Krohn Dehli (Sevilla) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 32:20",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Mahmoud Dahoud (B. Monchengladbach) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "corner",
            "description": "Evgen Konoplyanka (Sevilla) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 31:27",
            "label": "",
            "description": "Ever Banega (Sevilla) produces a dangerous low pass into the penalty area, but the defence manage to cut it out. Corner kick. Sevilla will have an opportunity."
        },
        {
            "gameTime": "1 - 31:11",
            "label": "corner",
            "description": "Evgen Konoplyanka (Sevilla) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 30:48",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) tries to send a low pass into the box, but it's blocked and cleared. The ball is out of play and Sevilla manage to earn a corner."
        },
        {
            "gameTime": "1 - 28:49",
            "label": "soccer-ball",
            "description": "Goal! Granit Xhaka feeds Lars Stindl (B. Monchengladbach), who taps the ball into an empty net. He makes it 1:0."
        },
        {
            "gameTime": "1 - 28:05",
            "label": "",
            "description": "Julian Korb (B. Monchengladbach) serves up a nice cross, but Sergio Rico punches the ball away."
        },
        {
            "gameTime": "1 - 27:55",
            "label": "corner",
            "description": "Raffael (B. Monchengladbach) takes a short corner kick."
        },
        {
            "gameTime": "1 - 27:34",
            "label": "",
            "description": "Lars Stindl (B. Monchengladbach) takes a wonderful touch after collecting a pass inside the box. He steers his low drive towards the right post, but the keeper dives low to keep the ball out. B. Monchengladbach have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 26:43",
            "label": "",
            "description": "Raffael (B. Monchengladbach) meets a pass on the edge of the penalty area and shoots towards the bottom right corner. He didn't put enough power into the effort, though, and Sergio Rico pulls off an easy save."
        },
        {
            "gameTime": "1 - 25:25",
            "label": "",
            "description": "A through ball from Kevin Gameiro (Sevilla) fails to reach Evgen Konoplyanka as one of the defending players reacts brilliantly to intercept the effort. If the pass had been produced a little bit earlier, Evgen Konoplyanka could have got into a promising position."
        },
        {
            "gameTime": "1 - 23:59",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) pulls the jersey of one of the opposition players and Damir Skomina blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 23:35",
            "label": "",
            "description": "Victor Vitolo (Sevilla) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 23:09",
            "label": "",
            "description": "Lars Stindl (B. Monchengladbach) does well to meet a cross from Raffael, but he directs his shot just over the crossbar."
        },
        {
            "gameTime": "1 - 23:01",
            "label": "",
            "description": "Raffael (B. Monchengladbach) is flagged for offside."
        },
        {
            "gameTime": "1 - 21:07",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Raffael (B. Monchengladbach) takes it short."
        },
        {
            "gameTime": "1 - 20:52",
            "label": "",
            "description": "Raffael (B. Monchengladbach) sends the ball into the box from the side of the pitch, but his cross is blocked. It will be a corner kick for B. Monchengladbach."
        },
        {
            "gameTime": "1 - 20:37",
            "label": "corner",
            "description": "Raffael (B. Monchengladbach) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 20:18",
            "label": "",
            "description": "Oscar Wendt (B. Monchengladbach) collects a pass and has an effort from distance which is blocked. B. Monchengladbach have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 18:45",
            "label": "",
            "description": "Yann Sommer pulls off a great save to deny Evgen Konoplyanka (Sevilla), who makes himself some space inside the box and unleashes a quick low drive to the bottom right corner."
        },
        {
            "gameTime": "1 - 17:01",
            "label": "",
            "description": "Mahmoud Dahoud (B. Monchengladbach) gives away a foul for a clumsy challenge. Referee Damir Skomina saw the whole situation."
        },
        {
            "gameTime": "1 - 15:18",
            "label": "",
            "description": "The ball is cleared after Victor Vitolo (Sevilla) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 12:50",
            "label": "substitution",
            "description": "Problems for Andre Schubert as Ibrahima Traore is not able to play anymore. His injury is too serious and Josip Drmic (B. Monchengladbach) replaces him."
        },
        {
            "gameTime": "1 - 11:41",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "1 - 11:08",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) sends a teasing cross into the area, but Yann Sommer intercepts the ball."
        },
        {
            "gameTime": "1 - 08:58",
            "label": "",
            "description": "Michael Krohn Dehli (Sevilla) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort."
        },
        {
            "gameTime": "1 - 08:55",
            "label": "corner",
            "description": "Ever Banega (Sevilla) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 08:38",
            "label": "",
            "description": "Kevin Gameiro (Sevilla) goes on a mazy run, skips past two defenders and pulls the trigger in front of the keeper. Yann Sommer makes a great save to stop the effort going into the bottom right corner. The ball is out of play. A goal scoring opportunity from a corner for Sevilla."
        },
        {
            "gameTime": "1 - 07:47",
            "label": "",
            "description": "Raffael (B. Monchengladbach) produces a ferocious strike from the edge of the box. His dangerous effort towards the bottom right corner is blocked by Sergio Rico, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 06:29",
            "label": "",
            "description": "Sergio Rico hears the fans clapping his superb goalkeeping. Raffael (B. Monchengladbach) shoots from the edge of the box towards the right side of the goal, but the goalkeeper makes a magnificent save."
        },
        {
            "gameTime": "1 - 06:00",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 05:01",
            "label": "injury",
            "description": "Ibrahima Traore (B. Monchengladbach) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 04:32",
            "label": "corner",
            "description": "Lars Stindl (B. Monchengladbach) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 04:19",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) flights in the cross, but the defender is alert and clears to safety. The ball is out of play and the linesman points at the corner flag. Corner to B. Monchengladbach."
        },
        {
            "gameTime": "1 - 03:51",
            "label": "corner",
            "description": "Ibrahima Traore (B. Monchengladbach) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 03:30",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. B. Monchengladbach get a corner."
        },
        {
            "gameTime": "1 - 02:37",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Ibrahima Traore (B. Monchengladbach) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 01:21",
            "label": "",
            "description": "Raffael (B. Monchengladbach) wastes an opportunity. He finds himself in acres of space and fires in a terrific shot from long range straight towards the bottom left corner, but the goalkeeper makes a brilliant save and stops this one!"
        },
        {
            "gameTime": "1 - 01:03",
            "label": "",
            "description": "Victor Vitolo (Sevilla) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sevilla will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Damir Skomina will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a very watchable match. Great goals and there was plenty of action at both ends of the pitch. No regrets about following this game. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Sevilla",
    "gameDate": "25/11/2015 - 22:45",
    "gameHomeTeam": "B. Monchengladbach",
    "gameScore": "4 - 2"
}