{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-03-12 - 22-45 Real Madrid 2 - 1 Betis/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:10",
            "label": "whistle",
            "description": "Antonio Mateu Lahoz is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "",
            "description": "Antonio Sanabria (Betis) misses a great chance after producing a powerful header towards the right side of the goal, but the goalkeeper denies him with a world class save."
        },
        {
            "gameTime": "2 - 45:53",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 45:27",
            "label": "corner",
            "description": "Betis take the corner, but their hopes of scoring a goal end with nice clearance by the defence."
        },
        {
            "gameTime": "2 - 44:53",
            "label": "",
            "description": "German Pezzella (Betis) slams the ball from a long range free kick. He should have curled it higher to avoid hitting the wall."
        },
        {
            "gameTime": "2 - 44:16",
            "label": "",
            "description": "Antonio Mateu Lahoz blows the whistle, Marcelo (Real Madrid) is penalised for a foul. Betis earn a free kick."
        },
        {
            "gameTime": "2 - 41:39",
            "label": "y-card",
            "description": "The referee has issued a yellow card to Marcelo (Real Madrid)."
        },
        {
            "gameTime": "2 - 40:55",
            "label": "substitution",
            "description": "That's the end of the game for Darko Brasanac, who is replaced by Alex Alegria (Betis)."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "substitution",
            "description": "Victor Sanchez has decided to make a change. Rafael Navarro (Betis) replaces Aissa Mandi."
        },
        {
            "gameTime": "2 - 35:45",
            "label": "soccer-ball",
            "description": "Toni Kroos takes over corner duties and expertly finds Sergio Ramos (Real Madrid), who jumps highest and coolly plants a bullet header into the left side of the goal. The score is now 2:1."
        },
        {
            "gameTime": "2 - 35:44",
            "label": "corner",
            "description": "Corner kick. Toni Kroos (Real Madrid) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 33:48",
            "label": "substitution",
            "description": "Isco will be replaced by Marco Asensio (Real Madrid)."
        },
        {
            "gameTime": "2 - 33:00",
            "label": "yr-card",
            "description": "Cristiano Piccini (Betis) picks up his second yellow card from referee Antonio Mateu Lahoz and is given his marching orders."
        },
        {
            "gameTime": "2 - 32:24",
            "label": "corner",
            "description": "The corner from Ruben Pardo (Betis) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 30:38",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) collects a pass on the edge of the box but he slips the ball just wide of the right post. The ball goes out of play and Betis will have a goal kick."
        },
        {
            "gameTime": "2 - 29:15",
            "label": "corner",
            "description": "A dangerous looking corner kick from Toni Kroos (Real Madrid) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 27:19",
            "label": "",
            "description": "Real Madrid have a goal ruled out for offside!"
        },
        {
            "gameTime": "2 - 26:00",
            "label": "substitution",
            "description": "Substitution. Karim Benzema (Real Madrid) has come on for Alvaro Morata."
        },
        {
            "gameTime": "2 - 24:31",
            "label": "attendance",
            "description": "The attendance is 73103."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "substitution",
            "description": "Here is a change. James Rodriguez is going off and Zinedine Zidane gives the last tactical orders to Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 21:55",
            "label": "corner",
            "description": "Betis work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "2 - 19:42",
            "label": "substitution",
            "description": "Here comes a substitution. Petros (Betis) is brought on as a substitute for Ruben Castro."
        },
        {
            "gameTime": "2 - 18:14",
            "label": "",
            "description": "What a chance that is! Toni Kroos (Real Madrid) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 13:05",
            "label": "",
            "description": "It wasn't the best example of how to strike the ball. Ruben Castro (Betis) unleashed a first time shot from the edge of the box that went high over the crossbar."
        },
        {
            "gameTime": "2 - 11:28",
            "label": "",
            "description": "Marcelo (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 07:26",
            "label": "corner",
            "description": "Real Madrid quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 04:38",
            "label": "",
            "description": "Ruben Castro (Betis) takes a mid range shot, but the ball sails high over the bar."
        },
        {
            "gameTime": "2 - 03:15",
            "label": "corner",
            "description": "The corner from Riza Durmisi (Betis) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 02:58",
            "label": "",
            "description": "Cristiano Piccini (Betis) fails to send a pass into the box as his effort is cut out. The referee signals a corner kick to Betis."
        },
        {
            "gameTime": "2 - 01:37",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:09",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 40:24",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Marcelo finds Cristiano Ronaldo (Real Madrid), who jumps highest and steers a close range header into the right side of the goal. His effort was both strong and precise, and Antonio Adan had no chance of stopping that. 1:1."
        },
        {
            "gameTime": "1 - 35:06",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) thinks that he is fouled by his opponent, but the referee deems him to be the one who commits a foul and awards a free kick to the other team."
        },
        {
            "gameTime": "1 - 31:18",
            "label": "",
            "description": "James Rodriguez (Real Madrid) takes the free kick and sends the ball into the penalty area, but the opposition's defence is ready."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "y-card",
            "description": "The foul by Cristiano Piccini (Betis) is worthy of a card and a yellow is duly shown by Antonio Mateu Lahoz."
        },
        {
            "gameTime": "1 - 28:28",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 24:31",
            "label": "soccer-ball",
            "description": "Goal! Riza Durmisi slips it to Antonio Sanabria (Betis) on the edge of the box and he finds the bottom right corner with a great effort. The score is 0:1."
        },
        {
            "gameTime": "1 - 23:35",
            "label": "",
            "description": "One of the players from Real Madrid times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 18:54",
            "label": "",
            "description": "Cristiano Piccini (Betis) unleashes a shot, but his effort is poor and floats high over the bar."
        },
        {
            "gameTime": "1 - 14:11",
            "label": "",
            "description": "James Rodriguez (Real Madrid) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 12:32",
            "label": "",
            "description": "Ruben Castro (Betis) shoots from the edge of the penalty area. The ball travels towards the bottom right corner, but Keylor Navas easily deals with the threat."
        },
        {
            "gameTime": "1 - 12:00",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) strikes a shot towards goal from the edge of the penalty box, but it flies just wide of the left post."
        },
        {
            "gameTime": "1 - 09:43",
            "label": "",
            "description": "The goalkeeper denies the long range shot from James Rodriguez (Real Madrid). It wasn't such a big threat for him."
        },
        {
            "gameTime": "1 - 07:47",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 07:25",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 07:20",
            "label": "",
            "description": "Antonio Adan hears the fans clapping his superb goalkeeping. Cristiano Ronaldo (Real Madrid) shoots from the edge of the box towards the left side of the goal, but the goalkeeper makes a magnificent save. Now Real Madrid have a corner."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "corner",
            "description": "The corner kick from Toni Kroos (Real Madrid) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Real Madrid will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Mateu Lahoz will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "In the 37 games that Betis have played so far this season, 20 matches have had under 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Cristiano Ronaldo have rippled the net 18x and is the top scorer for Real Madrid this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Antonio Mateu Lahoz is looking at his watch and immediately ends this match."
        }
    ],
    "gameAwayTeam": "Betis",
    "gameDate": "12/03/2017 - 22:45",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "2 - 1"
}