{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-11-08 - 19-00 Arsenal 1 - 1 Tottenham/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. A very even game was seen on the pitch today. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 48:43",
            "label": "whistle",
            "description": "That's it for today, Martin Atkinson has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:30",
            "label": "",
            "description": "Harry Kane (Tottenham) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "2 - 46:05",
            "label": "",
            "description": "The game is interrupted, a clear handball by Joshua Onomah (Tottenham)."
        },
        {
            "gameTime": "2 - 45:33",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Christian Eriksen walks off the pitch to be replaced by Joshua Onomah (Tottenham)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:48",
            "label": "",
            "description": "Harry Kane (Tottenham) makes a good run with the ball into the box, but mishits his shot as it goes well wide of the right post."
        },
        {
            "gameTime": "2 - 44:10",
            "label": "",
            "description": "Mesut Ozil (Arsenal) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "2 - 43:25",
            "label": "",
            "description": "Eric Dier (Tottenham) makes an overly aggressive challenge and Martin Atkinson blows his whistle for a foul. Arsenal are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 42:36",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) is penalised for a foul. Martin Atkinson had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "attendance",
            "description": "The attendance is 60060."
        },
        {
            "gameTime": "2 - 38:56",
            "label": "corner",
            "description": "Alexis Sanchez (Arsenal) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 38:26",
            "label": "",
            "description": "Hugo Lloris pulls off a fantastic save! Olivier Giroud (Arsenal) attempts to head home after a precise cross into the box. He aims his header towards the left post, but the effort is kept out. The referee blows his whistle, Arsenal are awarded a corner kick."
        },
        {
            "gameTime": "2 - 38:00",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) swings in the corner, but the goalkeeper does a brilliant job to intercept the effort."
        },
        {
            "gameTime": "2 - 37:40",
            "label": "",
            "description": "Olivier Giroud (Arsenal) slaloms his way past challenges, but an opposing player does well to get the ball away. The referee and one of his assistants signal for a corner kick to Arsenal."
        },
        {
            "gameTime": "2 - 36:15",
            "label": "substitution",
            "description": "Substitution. Dele Alli walks off the pitch and Ryan Mason (Tottenham) comes on as a substitute."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "",
            "description": "Dele Alli (Tottenham) is adjudged offside."
        },
        {
            "gameTime": "2 - 33:48",
            "label": "",
            "description": "Olivier Giroud (Arsenal) receives a fine cross inside the box and attempts to score a goal, but his strike flies just a few inches over the bar."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 33:21",
            "label": "",
            "description": "Per Mertesacker (Arsenal) unleashes a close range volley towards the left side of the goal, but his effort is thwarted by the keeper, and the score remains unchanged. Arsenal force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "substitution",
            "description": "It's time for a substitution. Mikel Arteta (Arsenal) comes on in place of Mathieu Debuchy."
        },
        {
            "gameTime": "2 - 31:34",
            "label": "soccer-ball",
            "description": "Goal! Mesut Ozil puts a cross into the box and finds Kieran Gibbs (Arsenal), who latches on to it and strikes the ball inside the left post. He makes it 1:1."
        },
        {
            "gameTime": "2 - 30:54",
            "label": "",
            "description": "Nacho Monreal (Arsenal) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 29:56",
            "label": "",
            "description": "The linesman signals that Kieran Gibbs (Arsenal) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 29:19",
            "label": "substitution",
            "description": "Mauricio Pochettino prepares a substitution. Erik Lamela is replaced by Heung Min Son (Tottenham)."
        },
        {
            "gameTime": "2 - 28:11",
            "label": "substitution",
            "description": "Substitution. Kieran Gibbs (Arsenal) has come on for Joel Campbell."
        },
        {
            "gameTime": "2 - 26:18",
            "label": "",
            "description": "Harry Kane (Tottenham) was close to scoring after he unleashed a powerful shot which went a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "",
            "description": "Toby Alderweireld (Tottenham) rises highest from the corner to head at goal, but his effort towards the middle of the goal is comfortably saved by the goalkeeper."
        },
        {
            "gameTime": "2 - 24:30",
            "label": "corner",
            "description": "Erik Lamela (Tottenham) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 24:10",
            "label": "",
            "description": "Harry Kane (Tottenham) connects with a cross from the side and steers a header from around the penalty spot towards the goal. The ball goes in the right direction, but it's stopped by one of the defenders. The ball is out of play. Tottenham will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 23:21",
            "label": "",
            "description": "Christian Eriksen (Tottenham) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 21:58",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Christian Eriksen (Tottenham)."
        },
        {
            "gameTime": "2 - 21:35",
            "label": "",
            "description": "Dele Alli (Tottenham) looks to break free, but an opposing player clears the ball away. Tottenham get a corner."
        },
        {
            "gameTime": "2 - 19:54",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 19:25",
            "label": "",
            "description": "Erik Lamela (Tottenham) looks to break free, but an opposing player clears the ball away. Corner kick. Tottenham will have an opportunity."
        },
        {
            "gameTime": "2 - 19:00",
            "label": "",
            "description": "Close! Harry Kane (Tottenham) picks up the ball in space and from inside the penalty area sends a shot inches wide of the left post."
        },
        {
            "gameTime": "2 - 18:14",
            "label": "",
            "description": "Dele Alli (Tottenham) finds some space inside the box and produces a first time shot that goes high over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "",
            "description": "Petr Cech pulls off a great save to deny Christian Eriksen (Tottenham), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "2 - 15:27",
            "label": "",
            "description": "Olivier Giroud (Arsenal) rises above the defence to meet a cross from the corner. His timing is good, but he directs his header just a few inches wide of the left post."
        },
        {
            "gameTime": "2 - 15:16",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 15:08",
            "label": "",
            "description": "Mesut Ozil (Arsenal) serves up a nice cross, but the defence clears the danger. The referee points to the corner flag and Arsenal will take a corner."
        },
        {
            "gameTime": "2 - 14:38",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) whips in a cross from the corner, but Hugo Lloris is well positioned and punches the ball away."
        },
        {
            "gameTime": "2 - 14:11",
            "label": "",
            "description": "The ball is cleared after Mesut Ozil (Arsenal) attempted to dribble past an opposing player. Arsenal have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 13:58",
            "label": "",
            "description": "Erik Lamela (Tottenham) is flagged for offside."
        },
        {
            "gameTime": "2 - 12:56",
            "label": "",
            "description": "What an opportunity! Laurent Koscielny (Arsenal) leaps high to meet a beautiful cross into the box from the free kick, and he plants a header from near the penalty spot which goes a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "",
            "description": "Eric Dier (Tottenham) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul. Arsenal earn a free kick."
        },
        {
            "gameTime": "2 - 09:54",
            "label": "y-card",
            "description": "Erik Lamela (Tottenham) is booked after bringing down an opponent. Martin Atkinson had an easy decision to make."
        },
        {
            "gameTime": "2 - 08:41",
            "label": "",
            "description": "Olivier Giroud (Arsenal) creates himself some space in front of goal and connects with the resulting free kick. His almost perfect header hits the bar and ricochets away off it."
        },
        {
            "gameTime": "2 - 08:12",
            "label": "",
            "description": "Martin Atkinson couldn't ignore the rough tackle by Moussa Dembele (Tottenham) and blew his whistle. It's a free kick to Arsenal, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 07:48",
            "label": "",
            "description": "A cross by Danny Rose (Tottenham) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "2 - 07:41",
            "label": "corner",
            "description": "Erik Lamela (Tottenham) takes a short corner kick."
        },
        {
            "gameTime": "2 - 07:01",
            "label": "",
            "description": "Dele Alli (Tottenham) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play and Tottenham manage to earn a corner."
        },
        {
            "gameTime": "2 - 06:42",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 05:57",
            "label": "",
            "description": "Christian Eriksen (Tottenham) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. Tottenham will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 05:16",
            "label": "",
            "description": "Martin Atkinson blows his whistle and it's Dele Alli (Tottenham) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 03:48",
            "label": "",
            "description": "Christian Eriksen (Tottenham) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 02:44",
            "label": "",
            "description": "Hugo Lloris hears the fans clapping his superb goalkeeping. Joel Campbell (Arsenal) shoots from the edge of the box towards the bottom left corner, but the goalkeeper makes a magnificent save."
        },
        {
            "gameTime": "2 - 02:28",
            "label": "",
            "description": "Harry Kane (Tottenham) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 01:58",
            "label": "",
            "description": "Martin Atkinson has a clear sight and sees a foul from Mathieu Debuchy (Arsenal)."
        },
        {
            "gameTime": "2 - 00:02",
            "label": "substitution",
            "description": "Arsene Wenger makes a switch. Mathieu Flamini (Arsenal) is coming on in place of Santi Cazorla at the start of the second period."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The game produced by the players until now hasn't been particularly attractive, but there is still 45 minutes left so let's hope they will come out with renewed vigour and provide better entertainment this half. No side has really dominated in this first half. The home players have grown in confidence and started to string some passes together. The visiting side have relied on their defence and counter attacks."
        },
        {
            "gameTime": "1 - 46:08",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "",
            "description": "Joel Campbell (Arsenal) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:41",
            "label": "",
            "description": "Harry Kane (Tottenham) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 44:00",
            "label": "",
            "description": "Harry Kane (Tottenham) latches on to an accurate pass on the edge of the box and unleashes a strong shot towards goal, but his effort is denied by the well positioned keeper."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Tottenham."
        },
        {
            "gameTime": "1 - 38:52",
            "label": "",
            "description": "Harry Kane (Tottenham) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 38:14",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Hugo Lloris is alert and denies him."
        },
        {
            "gameTime": "1 - 37:46",
            "label": "",
            "description": "Mathieu Debuchy (Arsenal) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 35:53",
            "label": "",
            "description": "Dele Alli (Tottenham) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 34:00",
            "label": "",
            "description": "Moussa Dembele (Tottenham) was too forceful with his tackle and Martin Atkinson interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 32:00",
            "label": "soccer-ball",
            "description": "Goal! Danny Rose plays a pass to the feet of Harry Kane (Tottenham) and he shoots low into the back of the net from inside the box. It's 0:1."
        },
        {
            "gameTime": "1 - 29:31",
            "label": "",
            "description": "Danny Rose (Tottenham) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 28:47",
            "label": "",
            "description": "Mesut Ozil (Arsenal) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "",
            "description": "Danny Rose (Tottenham) hits a first time volley towards goal from the edge of the penalty box, but his effort is way off target and the ball goes well wide of the right post."
        },
        {
            "gameTime": "1 - 24:35",
            "label": "",
            "description": "Eric Dier (Tottenham) creates himself some space in front of goal and connects with the resulting free kick. His header is slightly mistimed and sails inches wide of the right post."
        },
        {
            "gameTime": "1 - 24:00",
            "label": "",
            "description": "Martin Atkinson interrupts the game. One of the players from Arsenal won the ball, but his effort is adjudged unfair. Tottenham are awarded the free kick."
        },
        {
            "gameTime": "1 - 23:41",
            "label": "",
            "description": "Christian Eriksen (Tottenham) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 22:18",
            "label": "",
            "description": "Danny Rose (Tottenham) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 21:37",
            "label": "injury",
            "description": "Looks like Danny Rose (Tottenham) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 20:00",
            "label": "",
            "description": "Christian Eriksen (Tottenham) receives a pass and unleashes a shot which goes well wide of the right post."
        },
        {
            "gameTime": "1 - 19:13",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 18:47",
            "label": "",
            "description": "Mousa Dembele (Tottenham) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender. The referee signals a corner kick to Tottenham."
        },
        {
            "gameTime": "1 - 17:38",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 16:40",
            "label": "",
            "description": "Per Mertesacker (Arsenal) commits a foul and Martin Atkinson immediately signals a free kick."
        },
        {
            "gameTime": "1 - 16:27",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) will take a corner kick."
        },
        {
            "gameTime": "1 - 15:39",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. The linesman points to the corner flag, Arsenal are going to take it."
        },
        {
            "gameTime": "1 - 15:00",
            "label": "",
            "description": "Christian Eriksen (Tottenham) makes a run into the box in an attempt to get onto a long through ball, but one of the opponents comes up with a vital clearance."
        },
        {
            "gameTime": "1 - 11:11",
            "label": "",
            "description": "The free kick is taken by Santi Cazorla (Arsenal), but ball is cleared."
        },
        {
            "gameTime": "1 - 10:25",
            "label": "",
            "description": "Erik Lamela (Tottenham) pulls the jersey of one of the opposition players and Martin Atkinson blows his whistle for a foul. A free kick has been awarded to Arsenal."
        },
        {
            "gameTime": "1 - 09:42",
            "label": "",
            "description": "A pass from Danny Rose (Tottenham) is intercepted by Petr Cech and the move breaks down."
        },
        {
            "gameTime": "1 - 08:29",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 07:53",
            "label": "",
            "description": "A lofted cross from Joel Campbell (Arsenal) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The linesman makes the right call and Arsenal will have a corner."
        },
        {
            "gameTime": "1 - 05:56",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) clips a neat ball into the box in the direction of Joel Campbell, but he can't get on the end of the pass."
        },
        {
            "gameTime": "1 - 03:50",
            "label": "",
            "description": "A pass into the penalty area from Erik Lamela (Tottenham) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 01:55",
            "label": "",
            "description": "Hugo Lloris is alert and has a clear sight of a long through ball from Alexis Sanchez (Arsenal). Easy save!"
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Tottenham will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Martin Atkinson will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. A very even game was seen on the pitch today. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Tottenham",
    "gameDate": "08/11/2015 - 19:00",
    "gameHomeTeam": "Arsenal",
    "gameScore": "1 - 1"
}