{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-11-19 - 18-15 Barcelona 0 - 0 Malaga/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 52:40",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The host team were superior on the pitch today. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        },
        {
            "gameTime": "2 - 52:36",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 52:11",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 51:55",
            "label": "r-card",
            "description": "Juan Carlos (Malaga) leaves his team at a huge disadvantage as he is sent off."
        },
        {
            "gameTime": "2 - 50:43",
            "label": "",
            "description": "Andre Gomes (Barcelona) rises above the defenders and places a towering header towards the middle of the goal, but Idriss Carlos Kameni is prepared to thwart his effort."
        },
        {
            "gameTime": "2 - 50:18",
            "label": "substitution",
            "description": "It's time for a substitution. Duda (Malaga) comes on in place of Pablo Fornals."
        },
        {
            "gameTime": "2 - 49:05",
            "label": "corner",
            "description": "Neymar (Barcelona) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 48:29",
            "label": "",
            "description": "Neymar (Barcelona) picks up a lofted cross inside the box and fires a quick shot to the left post. His promising effort is kept out by Idriss Carlos Kameni, who pulls off a stunning save! Barcelona will take a corner kick."
        },
        {
            "gameTime": "2 - 47:16",
            "label": "",
            "description": "Arda Turan (Barcelona) unleashes a powerful shot towards goal, but the ball is blocked by one of his teammates."
        },
        {
            "gameTime": "2 - 46:11",
            "label": "",
            "description": "Idriss Carlos Kameni (Malaga) is able to continue to play."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:39",
            "label": "injury",
            "description": "Idriss Carlos Kameni (Malaga) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "attendance",
            "description": "The attendance is 83439."
        },
        {
            "gameTime": "2 - 42:34",
            "label": "",
            "description": "Arda Turan (Barcelona) commits a foul and Ricardo de Burgos Bengoetxea immediately signals a free kick."
        },
        {
            "gameTime": "2 - 42:27",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 41:48",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 38:32",
            "label": "",
            "description": "Andre Gomes (Barcelona) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "2 - 37:33",
            "label": "corner",
            "description": "The resulting corner, taken by Neymar (Barcelona), comes to nothing."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "",
            "description": "Andre Gomes (Barcelona) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders. The ball is out of play. Barcelona will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 36:39",
            "label": "",
            "description": "A dangerous towering header by Ivan Rakitic (Barcelona) from around the penalty spot goes just wide of the right post. This corner kick didn't change the score."
        },
        {
            "gameTime": "2 - 36:16",
            "label": "corner",
            "description": "The ball is out of play and the linesman points at the corner flag. Corner to Barcelona."
        },
        {
            "gameTime": "2 - 36:14",
            "label": "",
            "description": "Jordi Alba (Barcelona) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 35:42",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Youssef En Nesiry (Malaga) for Sandro Ramirez."
        },
        {
            "gameTime": "2 - 34:47",
            "label": "",
            "description": "He should have done better. Gerard Pique (Barcelona) is afforded space to connect with a Javier Mascherano cross, but his header from the centre of the box flies well over the crossbar."
        },
        {
            "gameTime": "2 - 34:03",
            "label": "",
            "description": "Gerard Pique (Barcelona) launches into a thunderous tackle on his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "",
            "description": "Roberto Rosales (Malaga) brings his opponent down. Ricardo de Burgos Bengoetxea has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 32:49",
            "label": "",
            "description": "Neymar (Barcelona) unleashes a shot from a mid range free kick that goes high over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "2 - 32:04",
            "label": "",
            "description": "Pablo Fornals (Malaga) makes a slide tackle, but referee Ricardo de Burgos Bengoetxea blows for a foul. Barcelona get a free kick."
        },
        {
            "gameTime": "2 - 31:32",
            "label": "",
            "description": "Neymar (Barcelona) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 31:24",
            "label": "substitution",
            "description": "Substitution. Ivan Rakitic (Barcelona) replaces Rafinha."
        },
        {
            "gameTime": "2 - 31:01",
            "label": "",
            "description": "Roberto Rosales (Malaga) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "",
            "description": "Jordi Alba (Barcelona) sends a cross into the box, but Idriss Carlos Kameni comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "",
            "description": "Neymar (Barcelona) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 28:51",
            "label": "",
            "description": "Neymar (Barcelona) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "2 - 27:48",
            "label": "",
            "description": "Neymar (Barcelona) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 27:12",
            "label": "",
            "description": "Andre Gomes (Barcelona) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 25:39",
            "label": "",
            "description": "Rafinha (Barcelona) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 25:32",
            "label": "corner",
            "description": "The referee and one of his assistants signal for a corner kick to Barcelona."
        },
        {
            "gameTime": "2 - 25:16",
            "label": "",
            "description": "Andre Gomes (Barcelona) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "2 - 23:33",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Javier Ontiveros Parra trots off the pitch and is replaced by Luis Munoz (Malaga)."
        },
        {
            "gameTime": "2 - 22:28",
            "label": "r-card",
            "description": "Diego Llorente (Malaga) receives a red card after his horrific challenge and is sent off!"
        },
        {
            "gameTime": "2 - 22:26",
            "label": "substitution",
            "description": "Luis Enrique prepares a substitution. Denis Suarez is replaced by Andre Gomes (Barcelona)."
        },
        {
            "gameTime": "2 - 21:27",
            "label": "",
            "description": "Barcelona enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 17:21",
            "label": "",
            "description": "Ricardo de Burgos Bengoetxea blows his whistle and it's Gerard Pique (Barcelona) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 16:52",
            "label": "substitution",
            "description": "Today's match ends for Lucas Digne who will be replaced by Jordi Alba (Barcelona)."
        },
        {
            "gameTime": "2 - 16:21",
            "label": "y-card",
            "description": "Ricardo de Burgos Bengoetxea shows a yellow card to Javier Ontiveros Parra (Malaga) for his blatant foul."
        },
        {
            "gameTime": "2 - 15:12",
            "label": "",
            "description": "Gerard Pique (Barcelona) dived to the ground without any contact with the opponent."
        },
        {
            "gameTime": "2 - 14:28",
            "label": "corner",
            "description": "Neymar (Barcelona) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 12:58",
            "label": "",
            "description": "Roberto Rosales (Malaga) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "2 - 11:34",
            "label": "",
            "description": "Juanpi plays a pass to Juan Carlos (Malaga), but he fails to get a decent shot away from inside the box and the ball flies well wide of the right post."
        },
        {
            "gameTime": "2 - 10:59",
            "label": "",
            "description": "Lucas Digne (Barcelona) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 09:13",
            "label": "",
            "description": "Ricardo de Burgos Bengoetxea blows his whistle as Arda Turan (Barcelona) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 07:32",
            "label": "",
            "description": "The linesman signals that Neymar (Barcelona) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 06:40",
            "label": "corner",
            "description": "Juanpi (Malaga) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 04:05",
            "label": "",
            "description": "Javier Mascherano (Barcelona) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the right post."
        },
        {
            "gameTime": "2 - 03:04",
            "label": "corner",
            "description": "The ball goes out of play. Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "2 - 02:57",
            "label": "",
            "description": "A cross from Arda Turan (Barcelona) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 01:17",
            "label": "",
            "description": "Neymar (Barcelona) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Ricardo de Burgos Bengoetxea blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 46:23",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. The home side is dominant and dictating the tempo of the game, mainly because of their work rate and accurate passing. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 46:03",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:42",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 45:17",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Rafinha (Barcelona) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 44:26",
            "label": "",
            "description": "Lucas Digne (Barcelona) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 43:31",
            "label": "",
            "description": "Lucas Digne passes to Sergio Busquets (Barcelona), but he produces a wild shot from the edge of the box which goes high over the bar."
        },
        {
            "gameTime": "1 - 43:08",
            "label": "",
            "description": "Gerard Pique (Barcelona) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 41:38",
            "label": "corner",
            "description": "Neymar (Barcelona) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 41:02",
            "label": "",
            "description": "Neymar (Barcelona) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 40:09",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Javier Ontiveros Parra (Malaga), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "1 - 37:54",
            "label": "corner",
            "description": "Idriss Carlos Kameni leaps to collect the ball from the corner which was sent over by Neymar (Barcelona)."
        },
        {
            "gameTime": "1 - 37:39",
            "label": "",
            "description": "Denis Suarez (Barcelona) sends a lofted cross into the box which is headed clear. Barcelona have a corner."
        },
        {
            "gameTime": "1 - 36:42",
            "label": "",
            "description": "Javier Mascherano (Barcelona) swings a cross into the box, but it's far too close to Idriss Carlos Kameni, who smothers the ball."
        },
        {
            "gameTime": "1 - 33:41",
            "label": "",
            "description": "Arda Turan (Barcelona) is penalised for a foul. Ricardo de Burgos Bengoetxea had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 33:25",
            "label": "",
            "description": "Denis Suarez (Barcelona) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 31:13",
            "label": "",
            "description": "Idriss Carlos Kameni pulls off a great save to deny Rafinha (Barcelona) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "1 - 29:20",
            "label": "",
            "description": "Flag up against Arda Turan (Barcelona). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 28:39",
            "label": "",
            "description": "Gerard Pique (Barcelona) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "1 - 28:28",
            "label": "corner",
            "description": "Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 28:09",
            "label": "",
            "description": "The ball is cleared after Sergi Roberto (Barcelona) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 26:52",
            "label": "",
            "description": "A player from Barcelona brings down an opponent and commits a foul."
        },
        {
            "gameTime": "1 - 23:47",
            "label": "",
            "description": "Sandro Ramirez (Malaga) had a good opportunity from long range. His shot was directed towards the middle of the goal, but Marc Andre ter Stegen was alert and made a comfortable save."
        },
        {
            "gameTime": "1 - 22:13",
            "label": "y-card",
            "description": "Federico Ricca (Malaga) is booked after bringing down an opponent. Ricardo de Burgos Bengoetxea had an easy decision to make."
        },
        {
            "gameTime": "1 - 20:32",
            "label": "",
            "description": "That was close by Rafinha (Barcelona)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "1 - 19:49",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 17:22",
            "label": "",
            "description": "Arda Turan (Barcelona) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "1 - 17:06",
            "label": "",
            "description": "The foul by Sandro Ramirez (Malaga) was seen by Ricardo de Burgos Bengoetxea who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 16:53",
            "label": "",
            "description": "Denis Suarez (Barcelona) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards wide of the left post."
        },
        {
            "gameTime": "1 - 16:10",
            "label": "",
            "description": "Arda Turan (Barcelona) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "1 - 15:35",
            "label": "",
            "description": "The resulting free kick from Sandro Ramirez (Malaga) ends up in the gloves of the keeper."
        },
        {
            "gameTime": "1 - 12:06",
            "label": "",
            "description": "Javier Mascherano (Barcelona) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 11:40",
            "label": "corner",
            "description": "Neymar (Barcelona) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 11:30",
            "label": "corner",
            "description": "The corner from Neymar (Barcelona) is cleared away by the defence. The referee blows his whistle, Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "1 - 11:21",
            "label": "",
            "description": "What a wasted opportunity by Gerard Pique (Barcelona)! He creates himself some space inside the penalty box and unleashes a decent strike towards the top of the net, but Idriss Carlos Kameni makes an astonishing save to thwart him. The referee signals a corner kick to Barcelona."
        },
        {
            "gameTime": "1 - 10:50",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 10:43",
            "label": "",
            "description": "Denis Suarez (Barcelona) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger. The ball goes out of play and Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 08:05",
            "label": "",
            "description": "Neymar (Barcelona) latches on to a lofted pass and strikes the ball! His attempt flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 07:30",
            "label": "",
            "description": "Neymar (Barcelona) attempts to find Sergi Roberto, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 06:24",
            "label": "",
            "description": "A poor finish by Sandro Ramirez (Malaga) as he misdirects his shot well wide of the right post."
        },
        {
            "gameTime": "1 - 04:38",
            "label": "",
            "description": "Barcelona control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 02:20",
            "label": "",
            "description": "Alcacer Paco (Barcelona) is adjudged offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ricardo de Burgos Bengoetxea will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Malaga players have rippled the net at least once in their last 5 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last 6 Barcelona matches finished without a draw."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The host team were superior on the pitch today. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        }
    ],
    "gameAwayTeam": "Malaga",
    "gameDate": "19/11/2016 - 18:15",
    "gameHomeTeam": "Barcelona",
    "gameScore": "0 - 0"
}