{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-03 - 22-45 Sevilla 1 - 3 Manchester City/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. The visitors controlled the game. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        },
        {
            "gameTime": "2 - 49:09",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 48:41",
            "label": "",
            "description": "Adil Rami (Sevilla) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but his attempt went well wide of the right post."
        },
        {
            "gameTime": "2 - 48:19",
            "label": "corner",
            "description": "Ever Banega (Sevilla) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 48:10",
            "label": "",
            "description": "Ciro Immobile (Sevilla) races towards goal but the defender gets back well to make a challenge. Sevilla will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 47:42",
            "label": "",
            "description": "The Sevilla players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball. The ball has crossed the sideline. Sevilla are taking a throw in."
        },
        {
            "gameTime": "2 - 46:49",
            "label": "",
            "description": "Svein Moen blows his whistle and it's Ciro Immobile (Sevilla) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 45:46",
            "label": "",
            "description": "Ciro Immobile (Sevilla) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:48",
            "label": "substitution",
            "description": "Fernandinho is substituted due to injury. Manuel Pellegrini gives a chance to Martin Demichelis (Manchester City)."
        },
        {
            "gameTime": "2 - 42:41",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) receives a low pass just outside the box and unleashes a fine strike towards the middle of the goal. Sergio Rico pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "2 - 41:30",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) trips an opposition player and Svein Moen signals a foul. Manchester City earn a free kick."
        },
        {
            "gameTime": "2 - 40:20",
            "label": "substitution",
            "description": "Manuel Pellegrini has decided to substitute Wilfried Bony and he is replaced by Fabian Delph (Manchester City)."
        },
        {
            "gameTime": "2 - 39:39",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) hasn't beaten the offside trap again."
        },
        {
            "gameTime": "2 - 39:14",
            "label": "",
            "description": "Victor Vitolo (Sevilla) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "2 - 38:46",
            "label": "",
            "description": "Ciro Immobile (Sevilla) produces a lovely chip pass into the box, but one of the opposition players cuts it out. It's a throw in for Sevilla."
        },
        {
            "gameTime": "2 - 38:00",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 11:22."
        },
        {
            "gameTime": "2 - 36:52",
            "label": "",
            "description": "Wilfried Bony (Manchester City) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 33:44",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) brings an opponent down and Svein Moen interrupts the game."
        },
        {
            "gameTime": "2 - 32:30",
            "label": "",
            "description": "Ever Banega (Sevilla) decides to have a shot at goal from the free kick, but it hits the defensive wall."
        },
        {
            "gameTime": "2 - 31:41",
            "label": "",
            "description": "Svein Moen has a clear sight and sees a foul from Kevin De Bruyne (Manchester City). It's a free kick to Sevilla in a dangerous position."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "",
            "description": "Handball by Aleksandar Kolarov (Manchester City). Sevilla have a free kick."
        },
        {
            "gameTime": "2 - 28:25",
            "label": "",
            "description": "The linesman raises his flag for offside before Benoit Tremoulinas (Sevilla) heads on."
        },
        {
            "gameTime": "2 - 27:44",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Raheem Sterling walks off the pitch to be replaced by Kevin De Bruyne (Manchester City)."
        },
        {
            "gameTime": "2 - 27:02",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball into the stands. Nice run, but poor finish!"
        },
        {
            "gameTime": "2 - 25:39",
            "label": "",
            "description": "CHANCE! Yaya Toure (Manchester City) fires just wide of the right post from inside the box after running onto a splendid pass from Wilfried Bony."
        },
        {
            "gameTime": "2 - 25:04",
            "label": "corner",
            "description": "Michael Krohn Dehli (Sevilla) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 24:47",
            "label": "",
            "description": "Michael Krohn Dehli (Sevilla) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders. The linesman points to the corner flag, Sevilla are going to take it."
        },
        {
            "gameTime": "2 - 24:09",
            "label": "",
            "description": "Raheem Sterling (Manchester City) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 23:07",
            "label": "",
            "description": "The cross into the penalty area from Mariano (Sevilla) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "2 - 21:43",
            "label": "",
            "description": "The foul by Wilfried Bony (Manchester City) was seen by Svein Moen who didn't hesitate to blow the whistle. Sevilla have a free kick."
        },
        {
            "gameTime": "2 - 19:06",
            "label": "substitution",
            "description": "Here's the change. Fernando Llorente leaves the pitch and Ciro Immobile (Sevilla) comes on as a substitute."
        },
        {
            "gameTime": "2 - 18:34",
            "label": "",
            "description": "Fernando Llorente (Sevilla) climbs high to connect with a cross heading towards the edge of the box and produces a poor header which goes well wide of the right post."
        },
        {
            "gameTime": "2 - 17:07",
            "label": "",
            "description": "Raheem Sterling (Manchester City) breaks into the penalty area but his shot is blocked."
        },
        {
            "gameTime": "2 - 17:00",
            "label": "",
            "description": "Raheem Sterling (Manchester City) is having a lively performance. He is causing problems and wanting the ball at every opportunity."
        },
        {
            "gameTime": "2 - 15:45",
            "label": "corner",
            "description": "Ever Banega (Sevilla) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 15:30",
            "label": "",
            "description": "Michael Krohn Dehli (Sevilla) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Sevilla force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 15:16",
            "label": "corner",
            "description": "Evgen Konoplyanka (Sevilla) works the corner short."
        },
        {
            "gameTime": "2 - 15:02",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) passes the ball into the box but an opposing player clears. The ball is out of play. Sevilla win a corner kick."
        },
        {
            "gameTime": "2 - 14:05",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Wilfried Bony (Manchester City), but the defence gets it clear."
        },
        {
            "gameTime": "2 - 13:08",
            "label": "",
            "description": "Raheem Sterling (Manchester City) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Svein Moen blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "2 - 12:01",
            "label": "",
            "description": "A pass from Mariano (Sevilla) is intercepted by Joe Hart and the move breaks down."
        },
        {
            "gameTime": "2 - 11:24",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) is adjudged offside."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "substitution",
            "description": "Substitution. Mariano (Sevilla) on for Coke."
        },
        {
            "gameTime": "2 - 09:33",
            "label": "",
            "description": "Raheem Sterling plays a pass to Wilfried Bony (Manchester City), but he fails to get a decent shot away from inside the box and the ball flies well wide of the left post."
        },
        {
            "gameTime": "2 - 08:04",
            "label": "",
            "description": "It's unbelievable, Fernandinho (Manchester City) blows a huge opportunity! He is totally unmarked and fires a first time shot towards goal from a few yards out, but Sergio Rico reacts superbly to keep the ball out."
        },
        {
            "gameTime": "2 - 06:03",
            "label": "corner",
            "description": "A dangerous looking corner kick from Evgen Konoplyanka (Sevilla) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 05:45",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee and one of his assistants signal for a corner kick to Sevilla."
        },
        {
            "gameTime": "2 - 04:43",
            "label": "",
            "description": "Coke (Sevilla) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 03:41",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) pulls the jersey of one of the opposition players and Svein Moen blows his whistle for a foul. Manchester City win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 03:05",
            "label": "",
            "description": "The linesman raises his flag. Fernando Llorente (Sevilla) is adjudged offside."
        },
        {
            "gameTime": "2 - 02:44",
            "label": "",
            "description": "Sevilla hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "",
            "description": "Coke (Sevilla) fails to beat a perfect example of the offside trap."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here is a change after the half time break. Iborra is replaced by Michael Krohn Dehli (Sevilla)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Svein Moen blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The fans can't complain about what they have been seeing so far on the pitch as both sides are playing highly attractive football. The visitors dominated that half and looked more dangerous in attack. The home team tries to prevail using combination football, while the away teams uses mostly counter attacks."
        },
        {
            "gameTime": "1 - 47:04",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Svein Moen has ended it."
        },
        {
            "gameTime": "1 - 46:11",
            "label": "corner",
            "description": "Evgen Konoplyanka (Sevilla) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 45:51",
            "label": "",
            "description": "Coke (Sevilla) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Sevilla have a corner."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:11",
            "label": "",
            "description": "Flag up against Benoit Tremoulinas (Sevilla). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 43:48",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Aleksandar Kolarov (Manchester City)."
        },
        {
            "gameTime": "1 - 42:52",
            "label": "y-card",
            "description": "A yellow card for a tackle by Grzegorz Krychowiak (Sevilla). Svein Moen doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "funfact",
            "description": "The current number of shots on goal is 2:11."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but it goes well wide of the left post."
        },
        {
            "gameTime": "1 - 39:57",
            "label": "corner",
            "description": "Aleksandar Kolarov (Manchester City) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 39:37",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. The ball goes out of play and Manchester City have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 37:06",
            "label": "",
            "description": "Raheem Sterling (Manchester City) makes a slide tackle, but referee Svein Moen blows for a foul. A free kick to Sevilla."
        },
        {
            "gameTime": "1 - 36:45",
            "label": "",
            "description": "Decent spell from Sevilla here and they keep the pressure on until one of the defending players steps in. The referee and the linesman both signal a throw in for Sevilla."
        },
        {
            "gameTime": "1 - 35:31",
            "label": "soccer-ball",
            "description": "Goal Wilfried Bony (Manchester City)! Wilfried Bony (Manchester City) was put through by Jesus Navas and he showed brilliant composure inside the box to fire into the bottom right corner. 1:3."
        },
        {
            "gameTime": "1 - 34:23",
            "label": "corner",
            "description": "Evgen Konoplyanka (Sevilla) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "1 - 34:13",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. Good work from Sevilla as they win a corner."
        },
        {
            "gameTime": "1 - 33:31",
            "label": "",
            "description": "Fernandinho (Manchester City) unleashes a shot from 22 metres out but is unable to find the target and it goes well wide of the left post."
        },
        {
            "gameTime": "1 - 32:34",
            "label": "",
            "description": "Nicolas Otamendi (Manchester City) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "1 - 32:24",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) takes the corner."
        },
        {
            "gameTime": "1 - 32:00",
            "label": "",
            "description": "Wilfried Bony (Manchester City) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender. Now Manchester City have a corner."
        },
        {
            "gameTime": "1 - 31:13",
            "label": "",
            "description": "Svein Moen blows his whistle for a foul after Benoit Tremoulinas (Sevilla) hacks down one of his opponents. There is a free kick near the sideline to Manchester City."
        },
        {
            "gameTime": "1 - 29:09",
            "label": "",
            "description": "Fernando Llorente (Sevilla) is furious with himself as he misses a clear opportunity. He sends a rebound a few inches wide of the right post."
        },
        {
            "gameTime": "1 - 28:48",
            "label": "",
            "description": "Timothee Kolodziejczak (Sevilla) rises highest from the corner and heads at goal, but his effort towards the bottom right corner is saved by Joe Hart."
        },
        {
            "gameTime": "1 - 27:46",
            "label": "corner",
            "description": "Evgen Konoplyanka (Sevilla) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 27:23",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) attempts a long crossfield pass, but the defence does well to intercept the ball. The ball goes out for a corner. Sevilla can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 26:25",
            "label": "",
            "description": "Raheem Sterling (Manchester City) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 25:35",
            "label": "injury",
            "description": "The game is interrupted now, Raheem Sterling (Manchester City) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 24:46",
            "label": "soccer-ball",
            "description": "Goal! A great cross from Coke finds Benoit Tremoulinas (Sevilla), who scores with a simple header into an empty net. 1:2."
        },
        {
            "gameTime": "1 - 23:40",
            "label": "",
            "description": "The ball is cleared after Raheem Sterling (Manchester City) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 23:07",
            "label": "",
            "description": "Yaya Toure (Manchester City) brings down his opponent with a very late tackle. That's a free kick to Sevilla."
        },
        {
            "gameTime": "1 - 22:24",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 20:16",
            "label": "",
            "description": "A great solo effort from Jesus Navas (Manchester City) and he attempts to surprise the goalkeeper with a long range shot low towards the middle of the goal. Sergio Rico has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 19:49",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 19:06",
            "label": "corner",
            "description": "Evgen Konoplyanka (Sevilla) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 18:46",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. Sevilla have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 18:28",
            "label": "",
            "description": "Coke (Sevilla) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "1 - 16:42",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Wilfried Bony (Manchester City). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "1 - 16:19",
            "label": "",
            "description": "What a goal scoring opportunity! Yaya Toure (Manchester City) finds some space inside the box and fires a volley at goal, but the shot is amazingly blocked by a defender."
        },
        {
            "gameTime": "1 - 14:54",
            "label": "",
            "description": "Fernando Llorente (Sevilla) does well to meet a cross from Iborra, but he directs his shot just over the crossbar."
        },
        {
            "gameTime": "1 - 13:48",
            "label": "",
            "description": "Victor Vitolo (Sevilla) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 12:14",
            "label": "",
            "description": "Jesus Navas (Manchester City) shows off his amazing technique to get in front of goal by himself. He pulls the trigger but sends the ball onto the left post. Nice run, but unlucky finish!"
        },
        {
            "gameTime": "1 - 10:55",
            "label": "soccer-ball",
            "description": "Fernandinho (Manchester City) glances a header goalwards from a rebound inside the penalty area. His effort ends in the back of the net and the assistance goes to Wilfried Bony. The score has changed to 0:2."
        },
        {
            "gameTime": "1 - 10:40",
            "label": "",
            "description": "Sergio Rico gets a well deserved ovation! Wilfried Bony (Manchester City) produces a decent first time strike towards the left post, but the goalkeeper is positioned well to block it. Nice goalkeeping skills."
        },
        {
            "gameTime": "1 - 09:16",
            "label": "",
            "description": "Sergio Rico pulls off a great save to deny Aleksandar Kolarov (Manchester City) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "1 - 08:00",
            "label": "soccer-ball",
            "description": "Goal! Fernandinho plays a pass to the feet of Raheem Sterling (Manchester City) and he shoots low into the back of the net from inside the box. It's 0:1."
        },
        {
            "gameTime": "1 - 06:48",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again. Manchester City have been awarded a free kick."
        },
        {
            "gameTime": "1 - 06:21",
            "label": "",
            "description": "Fernando Llorente (Sevilla) superbly chips the ball over a defender inside the box to feed Victor Vitolo in stride, but one of the defenders manages to clear the ball."
        },
        {
            "gameTime": "1 - 05:14",
            "label": "",
            "description": "Svein Moen interrupts the game for a tactical foul by Adil Rami (Sevilla). Manchester City will take a free kick."
        },
        {
            "gameTime": "1 - 04:41",
            "label": "",
            "description": "The ball spins up and hits the hand of Yaya Toure (Manchester City) after he fails to control it and the referee blows his whistle for a foul. A free kick has been awarded to Sevilla."
        },
        {
            "gameTime": "1 - 03:13",
            "label": "",
            "description": "Fernandinho (Manchester City) receives a pass and tries his luck with a low shot from 20 metres out. Sergio Rico pulls off a comfortable save to stop the effort going into the middle of the net."
        },
        {
            "gameTime": "1 - 02:49",
            "label": "",
            "description": "Iborra (Sevilla) is penalised for holding. Svein Moen signals a set piece. Manchester City are awarded the free kick."
        },
        {
            "gameTime": "1 - 02:18",
            "label": "",
            "description": "Victor Vitolo (Sevilla) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 01:38",
            "label": "",
            "description": "Wilfried Bony (Manchester City) picks up a pass and fires a powerful long range shot which goes painfully close to the left post."
        },
        {
            "gameTime": "1 - 00:52",
            "label": "",
            "description": "Fernandinho (Manchester City) takes a rebound on the edge of the box and slams the ball well wide of the right post."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Manchester City will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Svein Moen was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. The visitors controlled the game. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        }
    ],
    "gameAwayTeam": "Manchester City",
    "gameDate": "03/11/2015 - 22:45",
    "gameHomeTeam": "Sevilla",
    "gameScore": "1 - 3"
}