{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2014-2015/2015-05-23 - 21-30 Real Madrid 7 - 3 Getafe/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The host team were better throughout the game. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 46:07",
            "label": "whistle",
            "description": "Jose Teixeira is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 44:53",
            "label": "soccer-ball",
            "description": "Goal! Jese passes the ball to the feet of Marcelo (Real Madrid), who has an empty net in front of him and has no problems in tapping the ball in. 7:3."
        },
        {
            "gameTime": "2 - 44:21",
            "label": "corner",
            "description": "Pablo Sarabia (Getafe) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 43:55",
            "label": "",
            "description": "Iker Casillas blocks a long range effort from Pablo Sarabia (Getafe) towards the top right corner. Now Getafe have a corner."
        },
        {
            "gameTime": "2 - 42:27",
            "label": "",
            "description": "Sergio Escudero (Getafe) attempts to surprise the keeper with a nice shot, but the ball goes narrowly over the bar."
        },
        {
            "gameTime": "2 - 41:39",
            "label": "",
            "description": "James Rodriguez (Real Madrid) commits a foul during an attacking move."
        },
        {
            "gameTime": "2 - 40:37",
            "label": "",
            "description": "Chicharito (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Jordi Codina is alert and denies him."
        },
        {
            "gameTime": "2 - 39:58",
            "label": "",
            "description": "The ball is out of play. Real Madrid will take a throw in."
        },
        {
            "gameTime": "2 - 38:51",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Pedro Leon trots off the pitch and is replaced by Ivi (Getafe)."
        },
        {
            "gameTime": "2 - 36:52",
            "label": "y-card",
            "description": "Jose Teixeira shows a yellow card to Marcelo (Real Madrid), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 35:47",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "2 - 35:30",
            "label": "",
            "description": "James Rodriguez (Real Madrid) floats the free kick into the box, but it's easily cleared by the first man. The ball is out of play. A goal scoring opportunity from a corner for Real Madrid."
        },
        {
            "gameTime": "2 - 34:43",
            "label": "y-card",
            "description": "Mehdi Lacen (Getafe) goes in the referee's notebook after being shown a yellow card."
        },
        {
            "gameTime": "2 - 34:26",
            "label": "y-card",
            "description": "Alexis (Getafe) was probably a bit loose with his words to Jose Teixeira, who decides to show him a yellow."
        },
        {
            "gameTime": "2 - 34:20",
            "label": "",
            "description": "A clumsy foul by Naldo (Getafe) and Jose Teixeira blows his whistle. Real Madrid are awarded the free kick."
        },
        {
            "gameTime": "2 - 33:43",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Baba (Getafe) will replace Diego Castro."
        },
        {
            "gameTime": "2 - 32:58",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 32:50",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) looks to break free, but an opposing player clears the ball away. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "2 - 32:48",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 32:21",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes a short corner kick."
        },
        {
            "gameTime": "2 - 31:50",
            "label": "",
            "description": "Jordi Codina was forced into action to thwart Jese (Real Madrid). He found himself some space after picking up a pass and unleashed a shot towards the roof of the net but couldn't beat the keeper. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:39",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 30:26",
            "label": "",
            "description": "James Rodriguez (Real Madrid) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety. Real Madrid win a corner."
        },
        {
            "gameTime": "2 - 30:20",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by James Rodriguez (Real Madrid)."
        },
        {
            "gameTime": "2 - 29:37",
            "label": "",
            "description": "Asier Illarramendi (Real Madrid) attempts to send a pass but the effort is blocked. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 28:22",
            "label": "",
            "description": "Marcelo (Real Madrid) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 27:42",
            "label": "",
            "description": "Flag goes up against Chicharito (Real Madrid) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 26:07",
            "label": "substitution",
            "description": "Here comes a substitution. Alex Felip (Getafe) is brought on as a substitute for Juan Rodriguez."
        },
        {
            "gameTime": "2 - 25:58",
            "label": "soccer-ball",
            "description": "Goal! James Rodriguez plays a pass to the feet of Jese (Real Madrid), and he shoots into the bottom right corner from inside the box. It's 6:3."
        },
        {
            "gameTime": "2 - 23:34",
            "label": "",
            "description": "Pablo Sarabia (Getafe) has a good chance to get on the scoresheet and fires the ball towards goal from the edge of the penalty box, but it goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 23:16",
            "label": "",
            "description": "Marcelo (Real Madrid) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "",
            "description": "James Rodriguez (Real Madrid) was close to scoring from the resulting free kick. He unleashed a decent strike from the edge of the box towards the middle of the net, but the goalkeeper made a comfortable save to keep him out."
        },
        {
            "gameTime": "2 - 21:20",
            "label": "",
            "description": "Jose Teixeira blows his whistle after Carlos Vigaray (Getafe) brings one of his opponents down with a strong tackle. Real Madrid win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 20:37",
            "label": "",
            "description": "Chicharito (Real Madrid) produces a long range cannon of a shot after a nice pass. The ball heads towards the middle of the goal, but is easily stopped by a save from Jordi Codina and the score remains the same."
        },
        {
            "gameTime": "2 - 18:25",
            "label": "",
            "description": "CHANCE! Alexis (Getafe) fires just wide of the left post from inside the box after running onto a splendid pass from Pablo Sarabia."
        },
        {
            "gameTime": "2 - 18:07",
            "label": "corner",
            "description": "Pedro Leon (Getafe) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 18:05",
            "label": "",
            "description": "Diego Castro (Getafe) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "",
            "description": "The game is interrupted as Chicharito (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "",
            "description": "Carlos Vigaray (Getafe) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "2 - 15:43",
            "label": "",
            "description": "The linesman signals that Pablo Sarabia (Getafe) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 14:15",
            "label": "",
            "description": "Marcelo (Real Madrid) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 13:40",
            "label": "",
            "description": "The ball ends up behind the goal line. A goal kick will follow."
        },
        {
            "gameTime": "2 - 12:35",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Martin Odegaard (Real Madrid) is coming onto the pitch as Cristiano Ronaldo cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 11:57",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "2 - 11:06",
            "label": "attendance",
            "description": "The attendance is 63769."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) wastes a big chance! He unleashes a shot from the edge of the box and it goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 09:11",
            "label": "",
            "description": "Marcelo (Real Madrid) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "2 - 07:57",
            "label": "",
            "description": "A nice cross arrived in the box from the corner kick and found the head of Mehdi Lacen (Getafe). He steered the ball towards the right post, but one of the defenders is there to cover the goalkeeper and keep it out."
        },
        {
            "gameTime": "2 - 07:44",
            "label": "corner",
            "description": "Pedro Leon (Getafe) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 07:23",
            "label": "",
            "description": "Carlos Vigaray (Getafe) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The referee points to the corner flag and Getafe will take a corner."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "soccer-ball",
            "description": "James Rodriguez (Real Madrid) struck with a perfectly taken free kick from the edge of the box. He curled the ball straight inside the right post. There are not enough superlatives that can be used to describe that goal."
        },
        {
            "gameTime": "2 - 05:37",
            "label": "",
            "description": "Dangerous play by Naldo (Getafe). Jose Teixeira blows his whistle for a foul. Real Madrid are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 04:34",
            "label": "",
            "description": "The ball is out of play. Getafe will have a throw in."
        },
        {
            "gameTime": "2 - 03:37",
            "label": "",
            "description": "Flag up against Chicharito (Real Madrid). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 01:23",
            "label": "soccer-ball",
            "description": "Goal 4:3! Chicharito (Real Madrid) taps home from close range after the rebound fell kindly into his path."
        },
        {
            "gameTime": "2 - 01:20",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) latches on to a superb cross into the box and hits the right post with his header. A stroke of luck for the goalkeeper!"
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Carlo Ancelotti has decided to make a substitution during the half time break. Daniel Carvajal (Real Madrid) comes on the pitch for Alvaro Arbeloa."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Jose Teixeira blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Up to now it has been an action packed game full of wonderful movements and opportunities. Neither side is enjoying any significant control of the game. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 46:02",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:52",
            "label": "",
            "description": "Pedro Leon (Getafe) misses a great opportunity to convert the free kick from the edge of the penalty box after firing the ball high over the crossbar of the goal."
        },
        {
            "gameTime": "1 - 44:58",
            "label": "y-card",
            "description": "Jese (Real Madrid) receives a yellow card from the referee for a foul that he committed a little earlier. Another situation results in a direct free kick for Getafe."
        },
        {
            "gameTime": "1 - 44:00",
            "label": "",
            "description": "Pedro Leon (Getafe) gets the ball from a rebound and thumps a terrific long range shot towards the net. Unfortunately for him, it sails narrowly wide of the right post. Unlucky finish."
        },
        {
            "gameTime": "1 - 43:48",
            "label": "corner",
            "description": "The resulting corner from Pablo Sarabia (Getafe) is cleared by the defence."
        },
        {
            "gameTime": "1 - 42:50",
            "label": "",
            "description": "Diego Castro (Getafe) slides a pass forward, but one of the defenders cuts it out. The linesman points to the corner flag, Getafe are going to take it."
        },
        {
            "gameTime": "1 - 41:24",
            "label": "soccer-ball",
            "description": "Mehdi Lacen (Getafe) receives a cross from the corner kick and sends a shot towards the goal. His effort finds its way behind the helpless goalkeeper and into the middle of the goal."
        },
        {
            "gameTime": "1 - 41:12",
            "label": "corner",
            "description": "Pablo Sarabia (Getafe) will take the corner."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "",
            "description": "Pedro Leon (Getafe) stands over the free kick and opts to take it himself, sending it towards the top left corner only for Iker Casillas to dive and make a save. Getafe earn a corner."
        },
        {
            "gameTime": "1 - 39:35",
            "label": "substitution",
            "description": "Carlo Ancelotti is forced to make a change. Pepe is unable to continue due to injury, Raphael Varane (Real Madrid) comes on."
        },
        {
            "gameTime": "1 - 38:31",
            "label": "injury",
            "description": "Pepe (Real Madrid) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 38:22",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 37:50",
            "label": "",
            "description": "Chicharito (Real Madrid) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 37:19",
            "label": "",
            "description": "Marcelo (Real Madrid) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 35:55",
            "label": "",
            "description": "Sergio Escudero (Getafe) trips an opposition player and Jose Teixeira signals a foul."
        },
        {
            "gameTime": "1 - 33:56",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) sends Jordi Codina the wrong way and fires the penalty into the middle of the goal!"
        },
        {
            "gameTime": "1 - 33:40",
            "label": "y-card",
            "description": "Carlos Vigaray (Getafe) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "1 - 33:38",
            "label": "penalty",
            "description": "Poor challenge! Carlos Vigaray (Getafe) is penalised for tripping and Jose Teixeira blows his whistle. PENALTY to Real Madrid! Great chance to score."
        },
        {
            "gameTime": "1 - 31:59",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) can showcase his brilliant free kick ability, particularly from a distance like this. He hits the ball perfectly and it ends up inside the left post."
        },
        {
            "gameTime": "1 - 30:54",
            "label": "",
            "description": "Juan Rodriguez (Getafe) tackles a bit over zealously and Jose Teixeira blows for a foul. Real Madrid have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 30:19",
            "label": "",
            "description": "Pedro Leon (Getafe) tries his luck with a shot from long distance after receiving a good pass. He hits the ball poorly and sends it into orbit."
        },
        {
            "gameTime": "1 - 28:52",
            "label": "",
            "description": "James Rodriguez (Real Madrid) crosses the ball from the free kick, but it goes out of play."
        },
        {
            "gameTime": "1 - 28:37",
            "label": "",
            "description": "Pablo Sarabia (Getafe) commits a foul after bringing down his opponent with a slide tackle. Real Madrid earn a free kick."
        },
        {
            "gameTime": "1 - 27:33",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) should know this behaviour is beyond the rules. He was too careless with his challenge and left Jose Teixeira no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 25:44",
            "label": "soccer-ball",
            "description": "Extraordinary strike! Diego Castro (Getafe) scores a great goal from approximately 18 metres out. His effort goes straight into the right side of the goal and he makes it 1:2."
        },
        {
            "gameTime": "1 - 24:41",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Real Madrid."
        },
        {
            "gameTime": "1 - 23:28",
            "label": "",
            "description": "Rough tackle by Toni Kroos (Real Madrid). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 21:53",
            "label": "soccer-ball",
            "description": "What a beautiful moment! Sergio Escudero (Getafe) got to the ball and unleashed a strong shot from distance. It turned out to be a good decision as his effort found its way into the bottom right corner. Iker Casillas just shakes his head in disbelief. The score changes to 1:1."
        },
        {
            "gameTime": "1 - 21:47",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but he sent it well over the bar."
        },
        {
            "gameTime": "1 - 21:30",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 20:53",
            "label": "",
            "description": "Asier Illarramendi (Real Madrid) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:50",
            "label": "",
            "description": "James Rodriguez (Real Madrid) serves up a nice cross, but Jordi Codina punches the ball away."
        },
        {
            "gameTime": "1 - 19:58",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Pedro Leon (Getafe). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 19:42",
            "label": "",
            "description": "Sergio Escudero (Getafe) delivers a promising cross into the box, but it's cleared. Good work from Getafe as they win a corner."
        },
        {
            "gameTime": "1 - 18:19",
            "label": "corner",
            "description": "The corner from Pablo Sarabia (Getafe) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 18:06",
            "label": "",
            "description": "Pablo Sarabia (Getafe) swings in a cross, but the ball is cleared to safety by one of the defending players. Getafe force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 16:30",
            "label": "",
            "description": "Pablo Sarabia (Getafe) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 14:43",
            "label": "",
            "description": "CHANCE! Chicharito (Real Madrid) connects with a cross but he cannot direct his shot on target."
        },
        {
            "gameTime": "1 - 12:56",
            "label": "soccer-ball",
            "description": "The ball hits the back of the net! Marcelo showcases his brilliant technique and produces a beautiful lofted cross into the box. Cristiano Ronaldo (Real Madrid) gets onto the scoresheets by sweetly heading it inside the left post – 1:0."
        },
        {
            "gameTime": "1 - 11:52",
            "label": "",
            "description": "Carlos Vigaray (Getafe) swings a cross into the box, but it's far too close to Iker Casillas, who smothers the ball."
        },
        {
            "gameTime": "1 - 10:39",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 10:16",
            "label": "",
            "description": "Jese (Real Madrid) passes the ball onto Chicharito, but one of the defenders dispossesses him. The ball is out of play. Real Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 09:05",
            "label": "",
            "description": "A pass by Cristiano Ronaldo (Real Madrid) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 08:26",
            "label": "",
            "description": "James Rodriguez (Real Madrid) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 07:43",
            "label": "",
            "description": "Pedro Leon (Getafe) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 07:17",
            "label": "",
            "description": "An attempted cross from Alvaro Arbeloa (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 06:35",
            "label": "",
            "description": "Diego Castro (Getafe) is penalised for a foul. Jose Teixeira had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 05:24",
            "label": "",
            "description": "Pedro Leon (Getafe) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 04:37",
            "label": "",
            "description": "It looks like Pablo Sarabia (Getafe) saw red with that tackle. Jose Teixeira won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 03:45",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "1 - 03:31",
            "label": "",
            "description": "Chicharito (Real Madrid) sends a pass into the penalty area, but the opponent manages to cut it out. The referee blows his whistle, Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 02:38",
            "label": "",
            "description": "Carlos Vigaray (Getafe) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 02:07",
            "label": "",
            "description": "Getafe control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 00:02",
            "label": "",
            "description": "The players are on the pitch and Real Madrid will have the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jose Teixeira got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The host team were better throughout the game. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Getafe",
    "gameDate": "23/05/2015 - 21:30",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "7 - 3"
}