{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-15 - 21-45 Manchester City 1 - 2 Juventus/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The performance of both teams was pretty much even. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        },
        {
            "gameTime": "2 - 48:03",
            "label": "whistle",
            "description": "Damir Skomina is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:05",
            "label": "",
            "description": "The foul by Wilfried Bony (Manchester City) was seen by Damir Skomina who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "",
            "description": "Manchester City seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "David Silva (Manchester City) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "",
            "description": "Bacary Sagna (Manchester City) swings a cross into the box, but it's far too close to Gianluigi Buffon, who smothers the ball."
        },
        {
            "gameTime": "2 - 44:03",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Aleksandar Kolarov (Manchester City). The referee and the linesman both signal a throw in for Manchester City."
        },
        {
            "gameTime": "2 - 42:52",
            "label": "corner",
            "description": "The resulting corner, taken by David Silva (Manchester City), comes to nothing."
        },
        {
            "gameTime": "2 - 42:39",
            "label": "",
            "description": "Yaya Toure (Manchester City) receives a pass and tries his luck with a shot from 25 metres out. Gianluigi Buffon pulls off a decent save to stop the effort going into the top right corner. Manchester City will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 42:08",
            "label": "",
            "description": "Neat passing move from Manchester City in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 41:28",
            "label": "",
            "description": "Juventus quickly take the free kick with a short pass."
        },
        {
            "gameTime": "2 - 40:58",
            "label": "",
            "description": "Yaya Toure (Manchester City) makes a slide tackle, but referee Damir Skomina blows for a foul. Juventus earn a free kick."
        },
        {
            "gameTime": "2 - 40:49",
            "label": "attendance",
            "description": "The attendance for today's match is 50363."
        },
        {
            "gameTime": "2 - 39:31",
            "label": "",
            "description": "Juventus produce a short pass from the free kick."
        },
        {
            "gameTime": "2 - 39:14",
            "label": "substitution",
            "description": "Substitution. Alvaro Morata leaves the pitch and is replaced by Andrea Barzagli (Juventus)."
        },
        {
            "gameTime": "2 - 38:39",
            "label": "",
            "description": "Damir Skomina blows for a foul after Eliaquim Mangala (Manchester City) was too aggressive in the battle for the ball. Juventus have a free kick."
        },
        {
            "gameTime": "2 - 38:16",
            "label": "substitution",
            "description": "Manuel Pellegrini prepares a substitution. Samir Nasri is replaced by Sergio Aguero (Manchester City)."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 37:34",
            "label": "",
            "description": "David Silva (Manchester City) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "2 - 35:53",
            "label": "soccer-ball",
            "description": "Alvaro Morata (Juventus) makes himself some space on the edge of the penalty area and pulls the trigger. His accurate effort goes in off the left post and the score changes to 1:0."
        },
        {
            "gameTime": "2 - 35:20",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) tackles a bit over zealously and Damir Skomina blows for a foul."
        },
        {
            "gameTime": "2 - 34:13",
            "label": "",
            "description": "Manchester City control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 32:52",
            "label": "substitution",
            "description": "Massimiliano Allegri is forced to make a change. Mario Mandzukic is not able to carry on due to injury. He is replaced by Paulo Dybala (Juventus)."
        },
        {
            "gameTime": "2 - 31:56",
            "label": "",
            "description": "Fernandinho (Manchester City) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "2 - 31:37",
            "label": "",
            "description": "A beautiful low pass from the side is received by David Silva (Manchester City), who was waiting for his chance. However, the defence is alert and spanks the ball away."
        },
        {
            "gameTime": "2 - 30:36",
            "label": "",
            "description": "Mario Mandzukic (Juventus) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 29:15",
            "label": "substitution",
            "description": "Here is a change. Vincent Kompany is going off and Manuel Pellegrini gives the last tactical orders to Nicolas Otamendi (Manchester City)."
        },
        {
            "gameTime": "2 - 28:24",
            "label": "",
            "description": "Manchester City spell of possession comes to an end after a mistake."
        },
        {
            "gameTime": "2 - 25:58",
            "label": "substitution",
            "description": "It's time for a substitution. Kevin De Bruyne (Manchester City) comes on in place of Raheem Sterling."
        },
        {
            "gameTime": "2 - 24:58",
            "label": "soccer-ball",
            "description": "Mario Mandzukic (Juventus) meets a perfect cross from Paul Pogba deep inside the box and controls it with a nice first touch. He produces an accurate strike into the back of the net via the right post. The score is 1:1."
        },
        {
            "gameTime": "2 - 22:29",
            "label": "",
            "description": "Bacary Sagna (Manchester City) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "2 - 21:30",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Manchester City."
        },
        {
            "gameTime": "2 - 19:09",
            "label": "",
            "description": "Nightmare of a shot. Paul Pogba (Juventus) is first to a rebound inside the 6 yard box but his shot goes high and wide of the goal. The ball goes out of play and Manchester City will have a goal kick."
        },
        {
            "gameTime": "2 - 19:01",
            "label": "corner",
            "description": "Hernanes (Juventus) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 18:19",
            "label": "",
            "description": "Patrice Evra (Juventus) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. The referee signals a corner kick to Juventus."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "",
            "description": "Joe Hart pulls off a great save to deny Stefano Sturaro (Juventus) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "corner",
            "description": "David Silva (Manchester City) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 14:48",
            "label": "",
            "description": "Gianluigi Buffon pulls off a superb save! He leapt to block the shot David Silva (Manchester City) fired on target from the rebound. His effort from inside the box was directed low to the middle of the goal. Now Manchester City have a corner."
        },
        {
            "gameTime": "2 - 14:03",
            "label": "",
            "description": "Gianluigi Buffon pulls off a great save to deny Raheem Sterling (Manchester City), who makes himself some space inside the box and unleashes a quick low drive to the bottom right corner."
        },
        {
            "gameTime": "2 - 11:50",
            "label": "soccer-ball-own",
            "description": "What an unlucky own goal by Giorgio Chiellini (Juventus)!"
        },
        {
            "gameTime": "2 - 11:50",
            "label": "corner",
            "description": "David Silva (Manchester City) takes the corner."
        },
        {
            "gameTime": "2 - 11:30",
            "label": "",
            "description": "David Silva (Manchester City) plays a one two with Raheem Sterling, but the move breaks down. The referee points to the corner flag and Manchester City will take a corner."
        },
        {
            "gameTime": "2 - 09:57",
            "label": "",
            "description": "Samir Nasri (Manchester City) jumps into a tackle and Damir Skomina blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 09:35",
            "label": "",
            "description": "Samir Nasri (Manchester City) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 08:08",
            "label": "",
            "description": "Mario Mandzukic (Juventus) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger. It's a throw in for Juventus."
        },
        {
            "gameTime": "2 - 07:24",
            "label": "",
            "description": "A pass by Aleksandar Kolarov (Manchester City) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 06:33",
            "label": "",
            "description": "Juan Cuadrado (Juventus) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 04:55",
            "label": "",
            "description": "Mario Mandzukic (Juventus) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 04:41",
            "label": "",
            "description": "Paul Pogba (Juventus) attempts a long crossfield pass, but the defence does well to intercept the ball."
        },
        {
            "gameTime": "2 - 03:22",
            "label": "",
            "description": "Mario Mandzukic (Juventus) commits a foul and Damir Skomina immediately signals a free kick."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "",
            "description": "Juan Cuadrado (Juventus) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "2 - 02:21",
            "label": "",
            "description": "Fernandinho (Manchester City) was trying to get to the ball but clattered into the legs of the opponent as well. Damir Skomina blows his whistle for an infringement. Juventus are awarded the free kick."
        },
        {
            "gameTime": "2 - 01:33",
            "label": "",
            "description": "The Juventus players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, that wasn't the best of halves. Both sides struggled to produce anything of merit. Neither side is enjoying any significant control of the game. The home side have dominated the possession and midfield so far. The visitors have spent most of their time defending and waiting for the right moment to launch counter attacks."
        },
        {
            "gameTime": "1 - 45:03",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 43:24",
            "label": "",
            "description": "Manchester City are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 42:51",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 41:42",
            "label": "",
            "description": "David Silva (Manchester City) fouls an opponent. At least that's what referee Damir Skomina signals."
        },
        {
            "gameTime": "1 - 39:38",
            "label": "",
            "description": "A rebound falls at the feet of Fernandinho (Manchester City), whose promising strike from long range flies a few inches wide of the right post! What a great effort! The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "1 - 39:19",
            "label": "",
            "description": "A pass into the penalty area from Samir Nasri (Manchester City) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 37:41",
            "label": "",
            "description": "Bacary Sagna (Manchester City) collects a pass and strikes from about 24 metres out. It's a poor attempt which flies well wide of the right post. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "1 - 37:10",
            "label": "",
            "description": "Manchester City enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 35:52",
            "label": "",
            "description": "Juan Cuadrado (Juventus) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. The ball has crossed the sideline. Juventus are taking a throw in."
        },
        {
            "gameTime": "1 - 34:46",
            "label": "",
            "description": "The referee blows his whistle for a foul after David Silva (Manchester City) overruns the ball during an attack and makes an aggressive challenge on his opponent."
        },
        {
            "gameTime": "1 - 34:18",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 33:44",
            "label": "",
            "description": "Good defending. Patrice Evra (Juventus) tries to find Alvaro Morata inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 31:43",
            "label": "",
            "description": "Wilfried Bony (Manchester City) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the left post. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "1 - 30:51",
            "label": "",
            "description": "The effort by Juan Cuadrado (Juventus) failed to trouble the goalkeeper. He smashed the ball in from 24 metres but it went well wide of the left post. The ball is off of the pitch and it's a goal kick for Manchester City."
        },
        {
            "gameTime": "1 - 29:57",
            "label": "",
            "description": "A crossfield pass from Alvaro Morata (Juventus) fails to find any of his teammates. The ball is out of play. Manchester City will have a throw in."
        },
        {
            "gameTime": "1 - 28:44",
            "label": "",
            "description": "Manchester City are seeing far more of the ball now."
        },
        {
            "gameTime": "1 - 27:36",
            "label": "",
            "description": "Yaya Toure (Manchester City) jumps for a header from the resulting set piece, but it goes way wide of the right post. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "1 - 27:26",
            "label": "corner",
            "description": "David Silva (Manchester City) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "1 - 27:01",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) slaloms his way past challenges, but an opposing player does well to get the ball away. Corner kick. Manchester City will have an opportunity."
        },
        {
            "gameTime": "1 - 26:12",
            "label": "",
            "description": "Mario Mandzukic (Juventus) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 25:17",
            "label": "",
            "description": "Alvaro Morata (Juventus) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the left post. The ball is off of the pitch and it's a goal kick for Manchester City."
        },
        {
            "gameTime": "1 - 24:45",
            "label": "",
            "description": "Juventus hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "1 - 23:34",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) stands over the resultant free kick from 32 metres out and his shot goes well wide of the right post. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "1 - 22:44",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) trips an opposition player and Damir Skomina signals a foul. Another situation results in a direct free kick for Manchester City."
        },
        {
            "gameTime": "1 - 22:14",
            "label": "",
            "description": "Fernandinho (Manchester City) gets a shot away from around 23 metres out after his fine solo run. The ball went just over the top! The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "1 - 21:44",
            "label": "",
            "description": "Paul Pogba (Juventus) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 20:39",
            "label": "",
            "description": "The Manchester City players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 17:50",
            "label": "",
            "description": "The ball is cleared after Raheem Sterling (Manchester City) attempted to dribble past an opposing player. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "1 - 17:14",
            "label": "",
            "description": "Manchester City are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 16:00",
            "label": "corner",
            "description": "Samir Nasri (Manchester City) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 15:35",
            "label": "",
            "description": "Wilfried Bony (Manchester City) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender. Manchester City have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 14:51",
            "label": "",
            "description": "Manchester City players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 13:38",
            "label": "",
            "description": "Hernanes (Juventus) shoots at goal from the free kick from some 30 metres out. His attempt was quite precise and another few inches and it would have ended up inside the left post. The ball is off of the pitch and it's a goal kick for Manchester City."
        },
        {
            "gameTime": "1 - 12:23",
            "label": "",
            "description": "Vincent Kompany (Manchester City) makes a reckless foul in order to win the ball from his opponent. Damir Skomina has a clear sight of it and blows his whistle. Juventus get a free kick."
        },
        {
            "gameTime": "1 - 11:27",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Paul Pogba (Juventus) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "1 - 10:39",
            "label": "",
            "description": "Alvaro Morata (Juventus) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 09:23",
            "label": "",
            "description": "The free kick is taken short by Manchester City."
        },
        {
            "gameTime": "1 - 08:58",
            "label": "",
            "description": "Stefano Sturaro (Juventus) makes a rough challenge and Damir Skomina blows his whistle for a foul. Manchester City win a free kick."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "The Manchester City players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 05:46",
            "label": "",
            "description": "Rough tackle by David Silva (Manchester City). The referee blows his whistle for a foul. Juventus are awarded a free kick. Juventus try to speed play up by taking a quick free kick."
        },
        {
            "gameTime": "1 - 04:57",
            "label": "",
            "description": "Paul Pogba (Juventus) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 03:38",
            "label": "",
            "description": "Alvaro Morata (Juventus) is flagged for offside."
        },
        {
            "gameTime": "1 - 02:44",
            "label": "",
            "description": "Vincent Kompany (Manchester City) gets on the ball and beats an opponent, but his run is stopped by the referee Damir Skomina who sees an offensive foul."
        },
        {
            "gameTime": "1 - 02:32",
            "label": "corner",
            "description": "David Silva (Manchester City) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 01:48",
            "label": "",
            "description": "Raheem Sterling (Manchester City) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Gianluigi Buffon is alert and denies him. The linesman points to the corner flag, Manchester City are going to take it."
        },
        {
            "gameTime": "1 - 00:58",
            "label": "",
            "description": "Damir Skomina blows his whistle and it's Paul Pogba (Juventus) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Manchester City will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Damir Skomina."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The performance of both teams was pretty much even. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        }
    ],
    "gameAwayTeam": "Juventus",
    "gameDate": "15/09/2015 - 21:45",
    "gameHomeTeam": "Manchester City",
    "gameScore": "1 - 2"
}