{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-08-28 - 21-15 Ath Bilbao 0 - 1 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The game wasn't exhilarating, but it wasn't totally boring either. There were a few nice moments from both sides. The visiting team was controlling the game most of the time. The home players pressed a lot which put the away team in difficult situations, but they still played their possession football."
        },
        {
            "gameTime": "2 - 48:03",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 47:55",
            "label": "",
            "description": "Wow, what an escape. Luis Suarez (Barcelona) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "2 - 47:20",
            "label": "",
            "description": "Luis Suarez (Barcelona) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:55",
            "label": "y-card",
            "description": "Mikel Balenziaga (Ath Bilbao) sees a yellow! His tackle wasn't that harsh, but he probably talked himself into Antonio Mateu Lahoz's book."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "corner",
            "description": "A dangerous looking corner kick from Benat (Ath Bilbao) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 41:41",
            "label": "",
            "description": "Mikel Balenziaga (Ath Bilbao) sends a sweet pass into the penalty area, but one of the defenders averts the danger. The ball is out of play and Ath Bilbao manage to earn a corner."
        },
        {
            "gameTime": "2 - 40:15",
            "label": "",
            "description": "Benat (Ath Bilbao) shoots at goal from the free kick from some 24 metres out. His attempt was quite precise and another few inches and it would have ended up inside the right post."
        },
        {
            "gameTime": "2 - 39:25",
            "label": "",
            "description": "Antonio Mateu Lahoz has a clear sight and sees a foul from Javier Mascherano (Barcelona). Ath Bilbao are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 38:48",
            "label": "substitution",
            "description": "Luis Enrique prepares a substitution. Arda Turan is replaced by Rafinha (Barcelona)."
        },
        {
            "gameTime": "2 - 37:51",
            "label": "y-card",
            "description": "Benat (Ath Bilbao) gets a yellow card."
        },
        {
            "gameTime": "2 - 37:18",
            "label": "",
            "description": "Benat (Ath Bilbao) attempts to find one of his teammates with a ball from a free kick outside the box. The goalkeeper climbs high above all the players in the box to intercept the cross and snuff out the opportunity."
        },
        {
            "gameTime": "2 - 36:38",
            "label": "",
            "description": "Andre Gomes (Barcelona) gives away a foul for a clumsy challenge. Referee Antonio Mateu Lahoz saw the whole situation. It's a free kick to Ath Bilbao, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "2 - 35:49",
            "label": "",
            "description": "Luis Suarez (Barcelona) makes a good run with the ball into the box, but mishits his shot as it goes way wide of the left post."
        },
        {
            "gameTime": "2 - 34:21",
            "label": "",
            "description": "The linesman signals that Luis Suarez (Barcelona) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 33:08",
            "label": "",
            "description": "Good movement by Aritz Aduriz (Ath Bilbao), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "2 - 31:56",
            "label": "",
            "description": "A crossfield pass from Mikel Vesga (Ath Bilbao) fails to find any of his teammates. The ball is off of the pitch and it's a goal kick for Barcelona."
        },
        {
            "gameTime": "2 - 30:33",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Iker Muniain (Ath Bilbao) will replace Markel Susaeta."
        },
        {
            "gameTime": "2 - 29:52",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 29:11",
            "label": "",
            "description": "The ball is cleared after Lionel Messi (Barcelona) attempted to dribble past an opposing player. Barcelona win a corner."
        },
        {
            "gameTime": "2 - 27:44",
            "label": "",
            "description": "The ball is behind the touchline and Ath Bilbao will take a throw in."
        },
        {
            "gameTime": "2 - 25:59",
            "label": "substitution",
            "description": "Here is a change. Denis Suarez is going off and Luis Enrique gives the last tactical orders to Andre Gomes (Barcelona)."
        },
        {
            "gameTime": "2 - 25:53",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Javier Mascherano (Barcelona) replaces Samuel Umtiti."
        },
        {
            "gameTime": "2 - 24:32",
            "label": "",
            "description": "Lionel Messi (Barcelona) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "2 - 23:40",
            "label": "",
            "description": "Markel Susaeta (Ath Bilbao) gets a shot away from distance, but wasn't really set to take it and fires high and wide."
        },
        {
            "gameTime": "2 - 21:46",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 21:20",
            "label": "",
            "description": "Jordi Alba (Barcelona) tries to send a pass but it's blocked. The referee points to the corner flag. It's a corner to Barcelona."
        },
        {
            "gameTime": "2 - 20:25",
            "label": "",
            "description": "This was a piece of cake for Marc Andre ter Stegen. Inaki Williams (Ath Bilbao) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 19:41",
            "label": "",
            "description": "That was close by Raul Garcia (Ath Bilbao)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "2 - 17:00",
            "label": "substitution",
            "description": "Ernesto Valverde Tejedor has decided to make a change. Mikel Vesga (Ath Bilbao) replaces Ander Iturraspe."
        },
        {
            "gameTime": "2 - 16:50",
            "label": "substitution",
            "description": "Javier Eraso will be replaced by Raul Garcia (Ath Bilbao)."
        },
        {
            "gameTime": "2 - 16:35",
            "label": "y-card",
            "description": "Antonio Mateu Lahoz shows a yellow card to Javier Eraso (Ath Bilbao) for his blatant foul."
        },
        {
            "gameTime": "2 - 15:44",
            "label": "",
            "description": "Luis Suarez (Barcelona) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "attendance",
            "description": "The attendance for today's match is 46365."
        },
        {
            "gameTime": "2 - 13:52",
            "label": "y-card",
            "description": "Sergi Roberto (Barcelona) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 11:55",
            "label": "",
            "description": "Luis Suarez (Barcelona) finds himself some space inside the penalty box and immediately unleashes a first time effort. The shot sails well wide of the right post."
        },
        {
            "gameTime": "2 - 10:47",
            "label": "y-card",
            "description": "A yellow card for a tackle by Ander Iturraspe (Ath Bilbao). Antonio Mateu Lahoz doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 09:45",
            "label": "",
            "description": "The foul by Aritz Aduriz (Ath Bilbao) was seen by Antonio Mateu Lahoz who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 08:49",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a precise pass on the edge of the box and bends his effort inches wide of the left post."
        },
        {
            "gameTime": "2 - 06:51",
            "label": "",
            "description": "Gerard Pique (Barcelona) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the right post."
        },
        {
            "gameTime": "2 - 06:40",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 06:16",
            "label": "",
            "description": "Good clearance! Lionel Messi (Barcelona) receives a brilliant short pass and finds himself in a good position inside the box, but he's robbed of the ball by one of the defending players. The referee signals a corner kick to Barcelona."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "",
            "description": "Some neat passing and movement from Barcelona as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "2 - 02:29",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 01:53",
            "label": "",
            "description": "Luis Suarez (Barcelona) tries to pass the ball into the penalty area but it's blocked. The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 01:35",
            "label": "",
            "description": "Aymeric Laporte (Ath Bilbao) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 01:17",
            "label": "corner",
            "description": "Benat (Ath Bilbao) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 00:50",
            "label": "",
            "description": "Javier Eraso (Ath Bilbao) sends a pass into the box, but his attempt is thwarted and cleared. Ath Bilbao have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Antonio Mateu Lahoz blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. The visitors dominated that half and looked more dangerous in attack. The home side cause the away team problems with their pressing, but they still try to play possession football."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "",
            "description": "Lionel Messi (Barcelona) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 45:15",
            "label": "y-card",
            "description": "Markel Susaeta (Ath Bilbao) commits a foul and is shown a yellow card. Barcelona get a free kick."
        },
        {
            "gameTime": "1 - 44:38",
            "label": "",
            "description": "Arda Turan (Barcelona) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the left post."
        },
        {
            "gameTime": "1 - 42:53",
            "label": "",
            "description": "Ander Iturraspe (Ath Bilbao) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Antonio Mateu Lahoz blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 42:12",
            "label": "",
            "description": "Oscar de Marcos (Ath Bilbao) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "",
            "description": "Luis Suarez (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 41:38",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 40:45",
            "label": "",
            "description": "Benat (Ath Bilbao) hits an explosive shot from outside the penalty area and forces the goalkeeper to make a good save."
        },
        {
            "gameTime": "1 - 39:47",
            "label": "",
            "description": "Inaki Williams (Ath Bilbao) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender."
        },
        {
            "gameTime": "1 - 38:41",
            "label": "",
            "description": "Aritz Aduriz (Ath Bilbao) shoots from the edge of the penalty area. The ball travels towards the bottom left corner, but Marc Andre ter Stegen easily deals with the threat."
        },
        {
            "gameTime": "1 - 37:00",
            "label": "y-card",
            "description": "Luis Suarez (Barcelona) uses the wrong choice of words while trying to explain something to the referee and receives a yellow card for dissent."
        },
        {
            "gameTime": "1 - 36:55",
            "label": "y-card",
            "description": "Sergio Busquets (Barcelona) says more than he should have to the referee and is shown a yellow card."
        },
        {
            "gameTime": "1 - 36:11",
            "label": "",
            "description": "Oscar de Marcos (Ath Bilbao) commits a rough foul. Antonio Mateu Lahoz stops the game and makes a call."
        },
        {
            "gameTime": "1 - 35:30",
            "label": "",
            "description": "Samuel Umtiti (Barcelona) picks up the ball inside the penalty box and immediately fires a first time effort that sails well over the crossbar and ends in the stands."
        },
        {
            "gameTime": "1 - 35:14",
            "label": "",
            "description": "Lionel Messi (Barcelona) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 34:32",
            "label": "",
            "description": "The referee blows his whistle as Eneko Boveda (Ath Bilbao) was too aggressive in his challenge. That's a free kick to Barcelona."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "",
            "description": "Denis Suarez (Barcelona) had a golden opportunity. He volleyed from point blank range low towards the middle of the net, but Gorka Iraizoz was alert and made an amazing save!"
        },
        {
            "gameTime": "1 - 32:51",
            "label": "",
            "description": "Barcelona control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 29:05",
            "label": "",
            "description": "Antonio Mateu Lahoz blows his whistle as Denis Suarez (Barcelona) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 28:41",
            "label": "",
            "description": "The ball spins up and hits the hand of Aymeric Laporte (Ath Bilbao) after he fails to control it and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 27:40",
            "label": "",
            "description": "Lionel Messi (Barcelona) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 25:55",
            "label": "",
            "description": "Inaki Williams (Ath Bilbao) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 23:10",
            "label": "",
            "description": "Eneko Boveda (Ath Bilbao) sends a long ball in, but Marc Andre ter Stegen comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 20:47",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Arda Turan finds Ivan Rakitic (Barcelona), who jumps highest and steers a close range header into the left side of the goal. His effort was both strong and precise, and Gorka Iraizoz had no chance of stopping that. 0:0."
        },
        {
            "gameTime": "1 - 19:09",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Lionel Messi (Barcelona)."
        },
        {
            "gameTime": "1 - 18:45",
            "label": "corner",
            "description": "Benat (Ath Bilbao) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 18:03",
            "label": "",
            "description": "Inaki Williams (Ath Bilbao) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety. Ath Bilbao earn a corner."
        },
        {
            "gameTime": "1 - 17:15",
            "label": "",
            "description": "Aritz Aduriz (Ath Bilbao) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him."
        },
        {
            "gameTime": "1 - 15:42",
            "label": "",
            "description": "The Barcelona players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession."
        },
        {
            "gameTime": "1 - 13:42",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 11:27",
            "label": "",
            "description": "Benat (Ath Bilbao) is unlucky with a goal bound effort from the edge of the box. A fortuitous save from Marc Andre ter Stegen stops the ball from going into the middle of the goal."
        },
        {
            "gameTime": "1 - 09:36",
            "label": "y-card",
            "description": "The foul by Samuel Umtiti (Barcelona) is worthy of a card and a yellow is duly shown by Antonio Mateu Lahoz."
        },
        {
            "gameTime": "1 - 08:42",
            "label": "",
            "description": "Javier Eraso (Ath Bilbao) is adjudged offside."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "Benat (Ath Bilbao) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "1 - 06:16",
            "label": "",
            "description": "Samuel Umtiti (Barcelona) makes a reckless foul in order to win the ball from his opponent. Antonio Mateu Lahoz has a clear sight of it and blows his whistle. Ath Bilbao win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "Barcelona have a goal ruled out for offside!"
        },
        {
            "gameTime": "1 - 03:34",
            "label": "",
            "description": "Denis Suarez (Barcelona) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity!"
        },
        {
            "gameTime": "1 - 02:44",
            "label": "corner",
            "description": "Benat (Ath Bilbao) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 02:13",
            "label": "",
            "description": "Aritz Aduriz (Ath Bilbao) looks to break free, but an opposing player clears the ball away. Ath Bilbao get a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Mateu Lahoz will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 3:1 in the last game between Ath Bilbao and Eibar."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Barcelona players have rippled the net at least once in their last 10 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lionel Messi is the leading goal scorer for Barcelona with 9 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The game wasn't exhilarating, but it wasn't totally boring either. There were a few nice moments from both sides. The visiting team was controlling the game most of the time. The home players pressed a lot which put the away team in difficult situations, but they still played their possession football."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "28/08/2016 - 21:15",
    "gameHomeTeam": "Ath Bilbao",
    "gameScore": "0 - 1"
}