{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2017-01-15 - 19-00 Manchester United 1 - 1 Liverpool/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. There wasn't any significant dominance by either side in this game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 49:16",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 48:42",
            "label": "",
            "description": "Wayne Rooney (Manchester United) tries his luck from the edge of the box after a brilliant solo effort, but it is well blocked by the defender."
        },
        {
            "gameTime": "2 - 47:47",
            "label": "",
            "description": "Ragnar Klavan (Liverpool) is penalised after knocking an opponent down. Manchester United will take a free kick near the side line."
        },
        {
            "gameTime": "2 - 47:18",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but David de Gea is alert and denies him."
        },
        {
            "gameTime": "2 - 45:25",
            "label": "y-card",
            "description": "Roberto Firmino (Liverpool) picks up a yellow card for an infringement."
        },
        {
            "gameTime": "2 - 45:19",
            "label": "y-card",
            "description": "The foul by Ander Herrera (Manchester United) is worthy of a card and a yellow is duly shown by Michael Oliver."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:22",
            "label": "",
            "description": "Flag up against Zlatan Ibrahimovic (Manchester United). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 42:10",
            "label": "",
            "description": "Wayne Rooney (Manchester United) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 41:13",
            "label": "corner",
            "description": "The resulting corner from James Milner (Liverpool) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 40:55",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. Liverpool force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 40:10",
            "label": "",
            "description": "A lofted cross from Antonio Valencia (Manchester United) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. It's a throw in for Manchester United."
        },
        {
            "gameTime": "2 - 38:01",
            "label": "soccer-ball",
            "description": "Antonio Valencia displays his great technique and produces a beautiful lofted cross deep into the box. Zlatan Ibrahimovic (Manchester United) gets onto the scoresheet by superbly heading it in off the crossbar – 1:1."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "",
            "description": "Marouane Fellaini (Manchester United) connects with a cross from out wide in the six yard box, but only plants his header onto the right post."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "",
            "description": "Marouane Fellaini (Manchester United) passes the ball onto Wayne Rooney, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "2 - 36:31",
            "label": "",
            "description": "Wayne Rooney (Manchester United) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 34:31",
            "label": "",
            "description": "A clumsy foul by Ander Herrera (Manchester United) and Michael Oliver blows his whistle."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "",
            "description": "The game is interrupted as Zlatan Ibrahimovic (Manchester United) is flagged offside."
        },
        {
            "gameTime": "2 - 31:33",
            "label": "",
            "description": "Ander Herrera (Manchester United) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it. The ball is off of the pitch and it's a goal kick for Liverpool."
        },
        {
            "gameTime": "2 - 30:12",
            "label": "substitution",
            "description": "Jose Mourinho has decided to introduce fresh legs, with Marouane Fellaini (Manchester United) replacing Matteo Darmian."
        },
        {
            "gameTime": "2 - 29:34",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) climbs high to connect with a cross near the penalty spot but plants a header high over the bar."
        },
        {
            "gameTime": "2 - 28:20",
            "label": "",
            "description": "Roberto Firmino (Liverpool) fails to beat the offside trap. The flag goes up and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 26:55",
            "label": "",
            "description": "James Milner (Liverpool) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "injury",
            "description": "James Milner (Liverpool) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 24:44",
            "label": "",
            "description": "Wayne Rooney (Manchester United) fouls an opponent. At least that's what referee Michael Oliver signals."
        },
        {
            "gameTime": "2 - 23:54",
            "label": "",
            "description": "Mata (Manchester United) sends a teasing cross into the area, but Simon Mignolet intercepts the ball."
        },
        {
            "gameTime": "2 - 22:12",
            "label": "",
            "description": "Henrikh Mkhitaryan (Manchester United) slides a pass forward, but one of the defenders cuts it out. The ball has crossed the sideline. Manchester United are taking a throw in."
        },
        {
            "gameTime": "2 - 21:09",
            "label": "",
            "description": "Adam Lallana (Liverpool) receives a low pass just outside the box and unleashes a fine strike to the bottom left corner. David de Gea pulls off a reflexive save to block his effort. Nice goalkeeping skill."
        },
        {
            "gameTime": "2 - 19:29",
            "label": "substitution",
            "description": "Anthony Martial goes off the pitch and Juan Manuel Mata (Manchester United) comes on."
        },
        {
            "gameTime": "2 - 19:01",
            "label": "",
            "description": "Wayne Rooney (Manchester United) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the left post. The ball goes out of play and Liverpool will have a goal kick."
        },
        {
            "gameTime": "2 - 18:26",
            "label": "",
            "description": "Matteo Darmian (Manchester United) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 17:05",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) wriggles into space and fires the ball from the edge of the area, but one of the defenders is there to block the effort."
        },
        {
            "gameTime": "2 - 16:00",
            "label": "y-card",
            "description": "Yellow card! It's like Georginio Wijnaldum (Liverpool) was asking for a caution with his behaviour. Michael Oliver agrees and books him."
        },
        {
            "gameTime": "2 - 15:40",
            "label": "",
            "description": "Roberto Firmino (Liverpool) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. David de Gea guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 15:10",
            "label": "substitution",
            "description": "Substitution. Philippe Coutinho (Liverpool) on for Divock Origi."
        },
        {
            "gameTime": "2 - 14:56",
            "label": "",
            "description": "Paul Pogba (Manchester United) attempts to put the ball in from a rebound with his long range shot, but it isn't accurate enough and the ball goes wide of the left post."
        },
        {
            "gameTime": "2 - 13:29",
            "label": "",
            "description": "Ander Herrera (Manchester United) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "2 - 11:36",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Ander Herrera (Manchester United) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 10:03",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Manchester United) sends the corner into the box, but Simon Mignolet intercepts it and averts the threat."
        },
        {
            "gameTime": "2 - 09:33",
            "label": "",
            "description": "Henrikh Mkhitaryan (Manchester United) breaks past challenges inside the box, but puts too much pace on his pass to Anthony Martial. Now Manchester United have a corner."
        },
        {
            "gameTime": "2 - 08:11",
            "label": "",
            "description": "Wayne Rooney (Manchester United) commits a foul and Michael Oliver immediately signals a free kick."
        },
        {
            "gameTime": "2 - 05:21",
            "label": "",
            "description": "Divock Origi (Liverpool) pulls the jersey of one of the opposition players and Michael Oliver blows his whistle for a foul. Manchester United are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 04:39",
            "label": "corner",
            "description": "Wayne Rooney (Manchester United) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 04:28",
            "label": "",
            "description": "The ball is cleared after Wayne Rooney (Manchester United) attempted to dribble past an opposing player. The linesman points to the corner flag, Manchester United are going to take it."
        },
        {
            "gameTime": "2 - 03:36",
            "label": "corner",
            "description": "James Milner (Liverpool) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 03:03",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Divock Origi (Liverpool). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate. Liverpool earn a corner."
        },
        {
            "gameTime": "2 - 02:48",
            "label": "",
            "description": "Ander Herrera (Manchester United) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Jose Mourinho gives a chance to Wayne Rooney (Manchester United) and Michael Carrick is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Not a lot happening in the first half, it hasn't been the best game so far in terms of quality. We are witnessing quite a balanced game with both teams struggling to prevail. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 46:10",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Michael Oliver has ended it."
        },
        {
            "gameTime": "1 - 45:43",
            "label": "",
            "description": "It could have been a good chance to score! Anthony Martial (Manchester United) fails to release Paul Pogba with a through ball as the defence is alert and clears."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 43:03",
            "label": "",
            "description": "The foul by Emre Can (Liverpool) was seen by Michael Oliver who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 42:33",
            "label": "corner",
            "description": "James Milner (Liverpool) takes the corner."
        },
        {
            "gameTime": "1 - 42:10",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by James Milner (Liverpool), was easily dealt with by one of the defenders. The referee blows his whistle, Liverpool are awarded a corner kick."
        },
        {
            "gameTime": "1 - 41:43",
            "label": "",
            "description": "Antonio Valencia (Manchester United) was trying to get to the ball but clattered into the legs of the opponent as well. Michael Oliver blows his whistle for an infringement. Liverpool win a free kick."
        },
        {
            "gameTime": "1 - 40:15",
            "label": "",
            "description": "Simon Mignolet pulls off a great save to deny Henrikh Mkhitaryan (Manchester United), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "1 - 38:25",
            "label": "",
            "description": "Adam Lallana (Liverpool) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "1 - 35:52",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Manchester United) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 35:38",
            "label": "",
            "description": "An attempted cross from Antonio Valencia (Manchester United) is cleared. Manchester United have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 34:24",
            "label": "corner",
            "description": "The corner from James Milner (Liverpool) is intercepted by David de Gea."
        },
        {
            "gameTime": "1 - 34:15",
            "label": "",
            "description": "Divock Origi (Liverpool) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball is out of play. Liverpool will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 32:57",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Manchester United) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 32:30",
            "label": "",
            "description": "Simon Mignolet pulls off a stunning save to block the free kick from Zlatan Ibrahimovic (Manchester United). The ball was heading towards the bottom left corner. Manchester United force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 31:34",
            "label": "",
            "description": "Michael Oliver blows the whistle, Divock Origi (Liverpool) is penalised for a foul. Manchester United are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 31:16",
            "label": "corner",
            "description": "Corner kick. Henrikh Mkhitaryan (Manchester United) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 31:04",
            "label": "",
            "description": "The free kick is delivered by Henrikh Mkhitaryan (Manchester United) but it's not one of his best and is easily cleared. The referee signals a corner kick to Manchester United."
        },
        {
            "gameTime": "1 - 30:44",
            "label": "y-card",
            "description": "Michael Oliver shows a yellow card to Dejan Lovren (Liverpool) for a tough tackle."
        },
        {
            "gameTime": "1 - 28:59",
            "label": "",
            "description": "Anthony Martial (Manchester United) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 26:51",
            "label": "soccer-ball",
            "description": "James Milner (Liverpool) smoothly converts the penalty with a stunning effort which ends up inside the right post."
        },
        {
            "gameTime": "1 - 26:20",
            "label": "",
            "description": "James Milner (Liverpool) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 26:01",
            "label": "penalty",
            "description": "Paul Pogba (Manchester United) probably handled the ball inside the penalty area. Liverpool are given a huge opportunity to score it's a penalty kick!"
        },
        {
            "gameTime": "1 - 25:44",
            "label": "corner",
            "description": "James Milner (Liverpool) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 25:23",
            "label": "",
            "description": "Roberto Firmino (Liverpool) races towards goal but the defender gets back well to make a challenge. The ball goes out of play. Liverpool are awarded a corner kick."
        },
        {
            "gameTime": "1 - 24:04",
            "label": "",
            "description": "Trent Alexander Arnold (Liverpool) meets a cross just outside the area and gets in a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 22:58",
            "label": "",
            "description": "Divock Origi (Liverpool) blew a promising chance when he got to a rebound just outside the penalty area. He struck it low towards the middle of the target, but David de Gea pulled off a nice save and to stop the attempt."
        },
        {
            "gameTime": "1 - 22:25",
            "label": "",
            "description": "James Milner (Liverpool) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "1 - 21:51",
            "label": "",
            "description": "Paul Pogba (Manchester United) pulls the shirt of his opponent and the referee stops play for a foul. Free kick. Liverpool will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 20:12",
            "label": "",
            "description": "Henrikh Mkhitaryan (Manchester United) swings a cross into the box, but it's far too close to Simon Mignolet, who smothers the ball."
        },
        {
            "gameTime": "1 - 18:46",
            "label": "",
            "description": "Henrikh Mkhitaryan plays a lovely pass into Paul Pogba (Manchester United), but he can't find the target. His strike from inside the box goes narrowly wide of the right post. The ball goes out of play and Liverpool will have a goal kick."
        },
        {
            "gameTime": "1 - 17:02",
            "label": "",
            "description": "Roberto Firmino (Liverpool) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety."
        },
        {
            "gameTime": "1 - 15:29",
            "label": "",
            "description": "The linesman signals that Zlatan Ibrahimovic (Manchester United) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 13:07",
            "label": "",
            "description": "Zlatan Ibrahimovic (Manchester United) comes close to scoring. He peels away from his marker and gets on the end of a cross from Anthony Martial, but he hits a shot just wide of the right post. The ball is off of the pitch and it's a goal kick for Liverpool."
        },
        {
            "gameTime": "1 - 11:53",
            "label": "",
            "description": "Anthony Martial (Manchester United) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 09:35",
            "label": "",
            "description": "The linesman raises his flag for offside before Roberto Firmino (Liverpool) heads on."
        },
        {
            "gameTime": "1 - 09:14",
            "label": "",
            "description": "Henrikh Mkhitaryan (Manchester United) tackles a bit over zealously and Michael Oliver blows for a foul. Liverpool have a free kick."
        },
        {
            "gameTime": "1 - 08:16",
            "label": "",
            "description": "Ander Herrera (Manchester United) sends a long ball in, but Simon Mignolet comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 06:35",
            "label": "",
            "description": "Divock Origi (Liverpool) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 05:56",
            "label": "",
            "description": "Antonio Valencia (Manchester United) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 04:06",
            "label": "",
            "description": "Michael Oliver interrupts the game for a tactical foul by Zlatan Ibrahimovic (Manchester United). Liverpool have a free kick."
        },
        {
            "gameTime": "1 - 03:16",
            "label": "corner",
            "description": "David de Gea comes off his line to intercept the corner from James Milner (Liverpool)."
        },
        {
            "gameTime": "1 - 02:47",
            "label": "corner",
            "description": "James Milner (Liverpool) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear. The ball is out of play and Liverpool manage to earn a corner."
        },
        {
            "gameTime": "1 - 02:27",
            "label": "",
            "description": "Divock Origi (Liverpool) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play and the linesman points at the corner flag. Corner to Liverpool."
        },
        {
            "gameTime": "1 - 01:00",
            "label": "",
            "description": "Referee Michael Oliver sees the trip by Emre Can (Liverpool) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Liverpool will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Michael Oliver."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool will be looking to keep their unbeaten run of 6 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Manchester United have a winning streak of 6 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. There wasn't any significant dominance by either side in this game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "Liverpool",
    "gameDate": "15/01/2017 - 19:00",
    "gameHomeTeam": "Manchester United",
    "gameScore": "1 - 1"
}