{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-11-29 - 15-00 Tottenham 0 - 0 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The game produced by the players today wasn't one of the most inspiring. They definitely haven't shown us their best. It was a very tight match, with not much between the two teams. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        },
        {
            "gameTime": "2 - 49:21",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 49:16",
            "label": "y-card",
            "description": "The main referee, Michael Oliver, is apparently not going to tolerate any discussions. Cesar Azpilicueta (Chelsea) is given a yellow card for dissent."
        },
        {
            "gameTime": "2 - 47:23",
            "label": "",
            "description": "Harry Kane (Tottenham) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "2 - 46:26",
            "label": "substitution",
            "description": "Pedro goes off the pitch and Ruben Loftus Cheek (Chelsea) comes on."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:51",
            "label": "",
            "description": "Clinton N'Jie (Tottenham) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 43:51",
            "label": "",
            "description": "Erik Lamela (Tottenham) sends a chip pass into the box, but Asmir Begovic is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 43:23",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Willian leaves the pitch and Kenedy (Chelsea) comes on."
        },
        {
            "gameTime": "2 - 42:16",
            "label": "",
            "description": "Clinton N'Jie (Tottenham) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 40:41",
            "label": "",
            "description": "Willian (Chelsea) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "2 - 40:20",
            "label": "",
            "description": "Erik Lamela (Tottenham) makes an unfair challenge by holding his opponent to prevent him from getting the ball. Chelsea have a free kick."
        },
        {
            "gameTime": "2 - 38:34",
            "label": "",
            "description": "Pedro (Chelsea) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 37:58",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "attendance",
            "description": "The attendance for today's match is 35639."
        },
        {
            "gameTime": "2 - 36:42",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 35:23",
            "label": "",
            "description": "Erik Lamela (Tottenham) finds himself in an offside position and the referee stops play after the linesman raises his flag."
        },
        {
            "gameTime": "2 - 33:33",
            "label": "",
            "description": "Eric Dier (Tottenham) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 31:02",
            "label": "",
            "description": "Eden Hazard races towards the box before laying off to Pedro (Chelsea), who picks it up but blazes a shot well over the bar from the edge of the box."
        },
        {
            "gameTime": "2 - 29:14",
            "label": "substitution",
            "description": "It is time for a substitution. Clinton N'Jie (Tottenham) is on for Heung Min Son."
        },
        {
            "gameTime": "2 - 28:32",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) pulls the shirt of his opponent and only escapes without punishment due to the benevolence of the referee."
        },
        {
            "gameTime": "2 - 27:26",
            "label": "",
            "description": "Harry Kane (Tottenham) sprays a pass out to Erik Lamela, but he can't beat his man inside the box."
        },
        {
            "gameTime": "2 - 25:22",
            "label": "",
            "description": "Pedro (Chelsea) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Michael Oliver blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "corner",
            "description": "Hugo Lloris leaps to collect the ball from the corner which was sent over by Willian (Chelsea)."
        },
        {
            "gameTime": "2 - 22:44",
            "label": "corner",
            "description": "Willian (Chelsea) swings in the corner kick, but one of the defenders leaps highest to head the ball away. Chelsea will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 21:59",
            "label": "",
            "description": "Eden Hazard (Chelsea) picks up a lofted cross inside the box and releases a quick shot to the bottom left corner. His promising effort is kept out by Hugo Lloris, who pulls off a stunning save! The ball is out of play and the linesman points at the corner flag. Corner to Chelsea."
        },
        {
            "gameTime": "2 - 20:26",
            "label": "",
            "description": "Nemanja Matic (Chelsea) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 19:12",
            "label": "injury",
            "description": "Nemanja Matic (Chelsea) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 18:11",
            "label": "",
            "description": "Asmir Begovic pulls off a great save to deny Heung Min Son (Tottenham), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "2 - 16:05",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 15:55",
            "label": "",
            "description": "A beautiful low pass from the side is received by Christian Eriksen (Tottenham), who was waiting for his chance. However, the defence is alert and spanks the ball away. Tottenham will take a corner kick."
        },
        {
            "gameTime": "2 - 15:20",
            "label": "",
            "description": "Eden Hazard (Chelsea) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 13:56",
            "label": "y-card",
            "description": "Michael Oliver shows a yellow card to Nemanja Matic (Chelsea), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 12:54",
            "label": "",
            "description": "Heung Min Son (Tottenham) was standing in a clear offside position, making it an easy call for the linesman."
        },
        {
            "gameTime": "2 - 12:37",
            "label": "",
            "description": "Danny Rose (Tottenham) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 10:52",
            "label": "substitution",
            "description": "Ryan Mason is substituted due to injury. Mauricio Pochettino gives a chance to Erik Lamela (Tottenham)."
        },
        {
            "gameTime": "2 - 09:37",
            "label": "injury",
            "description": "Looks like Ryan Mason (Tottenham) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 08:53",
            "label": "",
            "description": "Eden Hazard (Chelsea) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 07:56",
            "label": "injury",
            "description": "The game is interrupted now, Eden Hazard (Chelsea) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 07:35",
            "label": "y-card",
            "description": "Jan Vertonghen (Tottenham) sees a yellow card from Michael Oliver after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 05:43",
            "label": "",
            "description": "Willian (Chelsea) whips a long ball in from the free kick which is intercepted by Hugo Lloris."
        },
        {
            "gameTime": "2 - 05:29",
            "label": "",
            "description": "Heung Min Son (Tottenham) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement. Chelsea have a free kick."
        },
        {
            "gameTime": "2 - 03:48",
            "label": "",
            "description": "Michael Oliver blows his whistle for a foul after Cesc Fabregas (Chelsea) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 03:14",
            "label": "",
            "description": "Ryan Mason (Tottenham) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Let's hope the players will show us more in the second half as the first one has been rather ordinary, devoid of goalscoring opportunities. Tottenham were controlling the game for most of the first half. The home side have dominated the possession and midfield so far. The visitors have spent most of their time defending and waiting for the right moment to launch counter attacks."
        },
        {
            "gameTime": "1 - 47:03",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:29",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "y-card",
            "description": "Kyle Walker (Tottenham) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Michael Oliver ignores the protests."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:04",
            "label": "",
            "description": "Harry Kane (Tottenham) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "1 - 41:51",
            "label": "",
            "description": "Oscar (Chelsea) and his stunning dribble! He zig zags through the defence and gets in front of the keeper. He faints to shoot and then suddenly strikes goalwards, but his effort misses the target by a whisker. Very unlucky for Oscar (Chelsea). This could have been a legendary goal."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "",
            "description": "Willian (Chelsea) sends a teasing cross into the area, but Hugo Lloris intercepts the ball."
        },
        {
            "gameTime": "1 - 39:20",
            "label": "y-card",
            "description": "Michael Oliver shows a yellow card to Harry Kane (Tottenham) for a tough tackle."
        },
        {
            "gameTime": "1 - 36:42",
            "label": "",
            "description": "Heung Min Son (Tottenham) has a go from a long way out but it sails way over."
        },
        {
            "gameTime": "1 - 35:53",
            "label": "",
            "description": "Eden Hazard (Chelsea) finds himself beyond the last defender but the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 34:10",
            "label": "",
            "description": "Toby Alderweireld (Tottenham) sends a long ball in, but Asmir Begovic comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 32:21",
            "label": "",
            "description": "The free kick is taken by Willian (Chelsea), but ball is cleared."
        },
        {
            "gameTime": "1 - 31:47",
            "label": "y-card",
            "description": "The foul by Danny Rose (Tottenham) is worthy of a card and a yellow is duly shown by Michael Oliver."
        },
        {
            "gameTime": "1 - 31:01",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "1 - 30:37",
            "label": "",
            "description": "Mousa Dembele (Tottenham) has an effort from distance and sends the ball towards the right post, but the goalkeeper is equal to it. Tottenham have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 27:48",
            "label": "",
            "description": "Kyle Walker (Tottenham) passes the ball onto Harry Kane, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 27:16",
            "label": "",
            "description": "A cross from Eden Hazard (Chelsea) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 26:30",
            "label": "",
            "description": "Heung Min Son (Tottenham) attempts to convert a lofted cross as he jumps high and heads the ball to the middle of the goal. Asmir Begovic shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net."
        },
        {
            "gameTime": "1 - 24:06",
            "label": "",
            "description": "Willian (Chelsea) sends a cross in and finds Eden Hazard inside the box, but one of the defenders steps in and clears the danger."
        },
        {
            "gameTime": "1 - 22:39",
            "label": "corner",
            "description": "Willian (Chelsea) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 22:07",
            "label": "",
            "description": "Pedro (Chelsea) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. The referee and his assistant both point at the corner flag. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 20:56",
            "label": "",
            "description": "Mousa Dembele (Tottenham) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 19:54",
            "label": "",
            "description": "Oscar clips a neat ball into the box towards Eden Hazard (Chelsea), whose header from the centre of the box goes narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 19:08",
            "label": "corner",
            "description": "The corner from Willian (Chelsea) is intercepted by Hugo Lloris."
        },
        {
            "gameTime": "1 - 18:32",
            "label": "injury",
            "description": "Mousa Dembele (Tottenham) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 18:02",
            "label": "",
            "description": "Pedro (Chelsea) looks to break free, but an opposing player clears the ball away. Chelsea win a corner."
        },
        {
            "gameTime": "1 - 16:49",
            "label": "",
            "description": "Harry Kane (Tottenham) is unlucky with a goal bound effort from the edge of the box. A fortuitous save from Asmir Begovic stops the ball from going into the middle of the goal."
        },
        {
            "gameTime": "1 - 15:20",
            "label": "",
            "description": "Eden Hazard (Chelsea) is in a clear offside position and the referee blows his whistle after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 14:45",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Pedro (Chelsea), but the defence gets it clear."
        },
        {
            "gameTime": "1 - 13:29",
            "label": "",
            "description": "Toby Alderweireld (Tottenham) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 12:12",
            "label": "",
            "description": "Christian Eriksen (Tottenham) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 11:58",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) pulls the jersey of one of the opposition players and Michael Oliver blows his whistle for a foul. A free kick has been awarded to Tottenham."
        },
        {
            "gameTime": "1 - 11:35",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 11:18",
            "label": "",
            "description": "Christian Eriksen (Tottenham) sends the ball into the box from the side of the pitch, but his cross is blocked. The ball is out of play. Tottenham will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 09:51",
            "label": "",
            "description": "Pedro (Chelsea) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "1 - 09:29",
            "label": "",
            "description": "This shall not pass! Harry Kane (Tottenham) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 07:51",
            "label": "",
            "description": "A pass from Willian (Chelsea) is intercepted by Hugo Lloris and the move breaks down."
        },
        {
            "gameTime": "1 - 05:02",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 04:12",
            "label": "",
            "description": "Asmir Begovic (Chelsea) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 03:25",
            "label": "injury",
            "description": "Asmir Begovic (Chelsea) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 02:57",
            "label": "",
            "description": "Danny Rose (Tottenham) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee blows his whistle, Tottenham are awarded a corner kick."
        },
        {
            "gameTime": "1 - 02:24",
            "label": "",
            "description": "Heung Min Son (Tottenham) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "",
            "description": "The players are out and the match is about to start. Tottenham will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Michael Oliver was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The game produced by the players today wasn't one of the most inspiring. They definitely haven't shown us their best. It was a very tight match, with not much between the two teams. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "29/11/2015 - 15:00",
    "gameHomeTeam": "Tottenham",
    "gameScore": "0 - 0"
}