{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2016-09-23 - 21-30 Dortmund 3 - 1 SC Freiburg/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The hosts were superior today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        },
        {
            "gameTime": "2 - 49:11",
            "label": "whistle",
            "description": "That's it for today, Christian Dingert has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:13",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 47:51",
            "label": "",
            "description": "That didn't go as planned! Gonzalo Castro (Dortmund) tried his luck from the edge of the box, but his effort towards the middle of the goal was too weak to get past Alexander Schwolow, who easily kept it out. The ball goes out of play and Dortmund have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 45:58",
            "label": "soccer-ball",
            "description": "Goal 3:1! Gonzalo Castro laid the ball off to Raphael Guerreiro (Dortmund), who shot from close range into the right side of the goal, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 42:57",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 42:28",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety. Dortmund earn a corner."
        },
        {
            "gameTime": "2 - 42:19",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety. Dortmund force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 37:35",
            "label": "attendance",
            "description": "The attendance for today's match is 80800."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "substitution",
            "description": "A substitution has been made. Ousmane Dembele goes off and Sebastian Rode (Dortmund) comes on."
        },
        {
            "gameTime": "2 - 34:16",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 30:20",
            "label": "y-card",
            "description": "Christian Dingert shows a yellow card to Caglar Soyuncu (Freiburg), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 30:10",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) makes a good run with the ball into the box, but mishits his shot as it goes way wide of the left post."
        },
        {
            "gameTime": "2 - 29:41",
            "label": "corner",
            "description": "The resulting corner from Ousmane Dembele (Dortmund) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 29:12",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) swings in a cross from the corner, but Alexander Schwolow reads it well and gathers the ball. Good work from Dortmund as they win a corner."
        },
        {
            "gameTime": "2 - 28:27",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. Dortmund have a corner."
        },
        {
            "gameTime": "2 - 27:34",
            "label": "corner",
            "description": "Vincenzo Grifo (Freiburg) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 27:17",
            "label": "",
            "description": "Onur Bulut (Freiburg) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the left side of the net, but Roman Burki leaps like a salmon to deny him. The ball is out of play and SC Freiburg manage to earn a corner."
        },
        {
            "gameTime": "2 - 25:03",
            "label": "substitution",
            "description": "It is time for a substitution. Raphael Guerreiro (Dortmund) is on for Mario Gotze."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "y-card",
            "description": "Sokratis (Dortmund) gets a yellow card. The referee Christian Dingert made the right call."
        },
        {
            "gameTime": "2 - 22:36",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 22:25",
            "label": "",
            "description": "Dortmund spell of possession comes to an end after a mistake. Dortmund force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 21:59",
            "label": "substitution",
            "description": "Florian Niederlechner (Freiburg) joins the action as a substitute, replacing Maximilian Philipp."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "y-card",
            "description": "Nicolas Hofler (Freiburg) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Christian Dingert didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 18:59",
            "label": "substitution",
            "description": "It's time for a substitution. Christian Pulisic (Dortmund) comes on in place of Emre Mor."
        },
        {
            "gameTime": "2 - 16:55",
            "label": "y-card",
            "description": "The referee Christian Dingert awards Christian Gunter (Freiburg) a yellow card."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "soccer-ball",
            "description": "Goal 2:1! Janik Haberer laid the ball off to Maximilian Philipp (Freiburg), who slots it into the back of the net from close range, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 12:52",
            "label": "",
            "description": "Amir Abrashi (Freiburg) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "2 - 08:40",
            "label": "substitution",
            "description": "Christian Streich has decided to make a change. Georg Niedermeier (Freiburg) replaces Manuel Gulde."
        },
        {
            "gameTime": "2 - 08:19",
            "label": "substitution",
            "description": "The manager makes a subsitution with Janik Haberer (Freiburg) coming on for Nils Petersen."
        },
        {
            "gameTime": "2 - 07:43",
            "label": "soccer-ball",
            "description": "Goal 2:0! Lukasz Piszczek (Dortmund) taps home from close range after the rebound fell kindly into his path."
        },
        {
            "gameTime": "2 - 07:42",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "2 - 06:34",
            "label": "",
            "description": "Mario Gotze (Dortmund) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 05:34",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) takes a mid range shot, but it lacks accuracy and it goes way over the bar."
        },
        {
            "gameTime": "2 - 01:57",
            "label": "corner",
            "description": "Mario Gotze (Dortmund) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 01:25",
            "label": "",
            "description": "Alexander Schwolow pulls off a great save to deny Ousmane Dembele (Dortmund), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal. It will be a corner kick for Dortmund."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Christian Dingert blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. During the first half the home team held the upper hand and were much more precise and effective. The home team tries to prevail using combination football, while the away teams uses mostly counter attacks."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:40",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Ousmane Dembele sprays a pass out to Pierre Emerick Aubameyang (Dortmund), and he has an easy job to slot the ball into an empty net. The score is 1:0."
        },
        {
            "gameTime": "1 - 41:57",
            "label": "corner",
            "description": "Vincenzo Grifo (Freiburg) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 41:37",
            "label": "",
            "description": "Manuel Gulde (Freiburg) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. Corner kick. SC Freiburg will have an opportunity."
        },
        {
            "gameTime": "1 - 37:59",
            "label": "y-card",
            "description": "The foul by Ousmane Dembele (Dortmund) is worthy of a card and a yellow is duly shown by Christian Dingert."
        },
        {
            "gameTime": "1 - 36:15",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 33:22",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) smashes the ball towards goal from the edge of the penalty box, but it fails to bother the goalkeeper as it hits the defensive wall."
        },
        {
            "gameTime": "1 - 28:23",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) sends in a poor cross from the corner and Alexander Schwolow has no trouble gathering it."
        },
        {
            "gameTime": "1 - 28:14",
            "label": "",
            "description": "Matthias Ginter (Dortmund) wins himself enough space to meet the resulting corner and fires the ball at goal, but the keeper does well to stop his effort. The ball goes behind for a corner. Dortmund will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 27:48",
            "label": "corner",
            "description": "Emre Mor (Dortmund) will take the corner."
        },
        {
            "gameTime": "1 - 27:19",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) whips in the corner, but one of the defending players gets a head on it and intercepts. The ball is out of play and the linesman points at the corner flag. Corner to Dortmund."
        },
        {
            "gameTime": "1 - 27:07",
            "label": "",
            "description": "Matthias Ginter (Dortmund) looks to break free, but an opposing player clears the ball away. Now Dortmund have a corner."
        },
        {
            "gameTime": "1 - 26:41",
            "label": "corner",
            "description": "Marcel Schmelzer (Dortmund) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 26:28",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. The referee points to the corner flag and Dortmund will take a corner."
        },
        {
            "gameTime": "1 - 23:25",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) works the corner short."
        },
        {
            "gameTime": "1 - 23:07",
            "label": "",
            "description": "Matthias Ginter (Dortmund) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender. Dortmund will take a corner kick."
        },
        {
            "gameTime": "1 - 22:53",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 22:07",
            "label": "",
            "description": "Emre Mor (Dortmund) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked. Dortmund have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 20:51",
            "label": "",
            "description": "Sokratis (Dortmund) blows a huge opportunity! He latches on to a perfect cross from the wing into the penalty area, but sends his bullet header just wide of the right post."
        },
        {
            "gameTime": "1 - 20:40",
            "label": "corner",
            "description": "Mario Gotze (Dortmund) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 20:22",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) tries to send the ball in front of the goal, but the opposition's defence averts the threat. The ball goes out of play. Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:08",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 19:57",
            "label": "",
            "description": "Emre Mor (Dortmund) shoots from outside the box, but his effort is blocked. Dortmund will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 18:17",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) makes space inside the box for a shot, but his effort goes just wide of the left post."
        },
        {
            "gameTime": "1 - 16:19",
            "label": "",
            "description": "Nils Petersen (Freiburg) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the left post."
        },
        {
            "gameTime": "1 - 15:36",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) collects a pass and strikes from about 22 metres out. It's a poor attempt which flies well over the bar."
        },
        {
            "gameTime": "1 - 13:40",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "1 - 12:35",
            "label": "",
            "description": "Sokratis (Dortmund) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 10:39",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) sends a teasing cross into the area, but Alexander Schwolow intercepts the ball."
        },
        {
            "gameTime": "1 - 07:32",
            "label": "",
            "description": "A pass into the penalty area from Amir Abrashi (Freiburg) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 04:56",
            "label": "",
            "description": "Nice individual effort by Vincenzo Grifo (Freiburg). He gets all the way through to the keeper and hits a shot to the middle of the goal, but Roman Burki does a good job to anticipate the direction of the ball and keeps it out."
        },
        {
            "gameTime": "1 - 02:37",
            "label": "corner",
            "description": "Vincenzo Grifo (Freiburg) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 02:09",
            "label": "",
            "description": "Wow, what an escape. Nils Petersen (Freiburg) has an effort from inside the box but it's brilliantly blocked. The referee points to the corner flag. It's a corner to SC Freiburg."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. SC Freiburg will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Christian Dingert."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "6:0 was the biggest win for Dortmund this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang looks sharp as he's the top goal scorer for Dortmund with 23 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The hosts were superior today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        }
    ],
    "gameAwayTeam": "SC Freiburg",
    "gameDate": "23/09/2016 - 21:30",
    "gameHomeTeam": "Dortmund",
    "gameScore": "3 - 1"
}