{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2014-2015/2015-05-17 - 20-00 Atl. Madrid 0 - 1 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. The superiority of the away team was evident on the pitch today. The hosts defended well and were deadly on the counter attack. The away side displayed some nice build up play using a lot of passes."
        },
        {
            "gameTime": "2 - 48:57",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 48:56",
            "label": "y-card",
            "description": "Guilherme Siqueira (Atl. Madrid) is booked by the referee."
        },
        {
            "gameTime": "2 - 48:33",
            "label": "y-card",
            "description": "Lionel Messi (Barcelona) gets a yellow card."
        },
        {
            "gameTime": "2 - 46:55",
            "label": "y-card",
            "description": "Neymar (Barcelona) got a yellow card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:17",
            "label": "",
            "description": "Lionel Messi (Barcelona) takes the free kick from the edge of the box, but Jan Oblak dives superbly to deny him. His shot went towards the right side of the goal."
        },
        {
            "gameTime": "2 - 43:44",
            "label": "",
            "description": "Barcelona win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 43:43",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco shows the yellow card to Jose Maria Gimenez (Atl. Madrid) for a heavy challenge."
        },
        {
            "gameTime": "2 - 43:16",
            "label": "",
            "description": "Saul Niguez (Atl. Madrid) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "2 - 42:33",
            "label": "corner",
            "description": "There's an opportunity for Koke (Atl. Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 42:06",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender. The referee points to the corner flag and Atl. Madrid will take a corner."
        },
        {
            "gameTime": "2 - 41:01",
            "label": "substitution",
            "description": "Luis Enrique has decided to introduce fresh legs, with Rafinha (Barcelona) replacing Ivan Rakitic."
        },
        {
            "gameTime": "2 - 40:19",
            "label": "",
            "description": "Koke (Atl. Madrid) strikes a volley towards goal, but one of the defenders blocks his effort."
        },
        {
            "gameTime": "2 - 38:52",
            "label": "",
            "description": "Barcelona seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 36:02",
            "label": "substitution",
            "description": "It's time for a substitution. Xavi (Barcelona) comes on in place of Andres Iniesta."
        },
        {
            "gameTime": "2 - 34:38",
            "label": "substitution",
            "description": "Diego Simeone has decided to substitute Fernando Torres and he is replaced by Saul Niguez (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 34:22",
            "label": "substitution",
            "description": "A substitution has been made. Jordi Alba goes off and Jeremy Mathieu (Barcelona) comes on."
        },
        {
            "gameTime": "2 - 32:49",
            "label": "funfact",
            "description": "Here's the current ball possession statistics for both teams – 23:77."
        },
        {
            "gameTime": "2 - 32:02",
            "label": "",
            "description": "Pedro (Barcelona) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the right post."
        },
        {
            "gameTime": "2 - 29:56",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco shows a yellow card to Gabi (Atl. Madrid) for a tough tackle."
        },
        {
            "gameTime": "2 - 27:00",
            "label": "substitution",
            "description": "Substitution. Mario Mandzukic (Atl. Madrid) replaces Arda Turan."
        },
        {
            "gameTime": "2 - 26:35",
            "label": "",
            "description": "Raul Garcia (Atl. Madrid) struck the ball which rebounded to the edge of the box. His attempt went narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 25:29",
            "label": "",
            "description": "Jan Oblak doesn't have to worry about this one. Lionel Messi plays a pass into the feet of Neymar (Barcelona), who is unable to find the target as his effort from inside the box goes high over the bar."
        },
        {
            "gameTime": "2 - 24:07",
            "label": "",
            "description": "Golden chance! Neymar (Barcelona) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the left post."
        },
        {
            "gameTime": "2 - 22:12",
            "label": "substitution",
            "description": "Today's match ends for Mario Suarez who will be replaced by Raul Garcia (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "soccer-ball",
            "description": "Goal 0:0! Lionel Messi (Barcelona) receives a precise pass inside the box from Pedro and he beats the goalkeeper with a neat finish into the bottom right corner."
        },
        {
            "gameTime": "2 - 18:01",
            "label": "",
            "description": "Gabi (Atl. Madrid) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Alberto Undiano Mallenco blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "2 - 16:09",
            "label": "",
            "description": "Gabi (Atl. Madrid) makes an overly aggressive challenge and Alberto Undiano Mallenco blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 13:16",
            "label": "",
            "description": "The linesman signals that Lionel Messi (Barcelona) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 13:14",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 12:58",
            "label": "",
            "description": "Dani Alves (Barcelona) looks to break free, but an opposing player clears the ball away. The referee blows his whistle, Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "attendance",
            "description": "The attendance is 53256."
        },
        {
            "gameTime": "2 - 10:48",
            "label": "",
            "description": "Arda Turan (Atl. Madrid) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 09:21",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) connects with the ball in the six yard box after the resulting free kick and shoots towards the leftside of the goal, but Claudio Bravo makes a magnificent save!"
        },
        {
            "gameTime": "2 - 07:16",
            "label": "y-card",
            "description": "Koke (Atl. Madrid) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Alberto Undiano Mallenco ignores the protests."
        },
        {
            "gameTime": "2 - 06:29",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) gets his head on the corner, but he can't find the target as his header flies high over the crossbar."
        },
        {
            "gameTime": "2 - 06:21",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "2 - 05:59",
            "label": "",
            "description": "Gabi (Atl. Madrid) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. Good work from Atl. Madrid as they win a corner."
        },
        {
            "gameTime": "2 - 04:59",
            "label": "",
            "description": "Andres Iniesta (Barcelona) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 04:18",
            "label": "injury",
            "description": "Andres Iniesta (Barcelona) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 03:44",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the left post."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 01:25",
            "label": "",
            "description": "Gerard Pique (Barcelona) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort. The referee points to the corner flag. It's a corner to Barcelona."
        },
        {
            "gameTime": "2 - 01:13",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 01:03",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Neymar (Barcelona) is thwarted and cleared to safety. Barcelona have a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We are watching a run of the mill game with only a few moments to ignite the crowd. The players surely can surely perform better, they just need to motivate themselves. The visiting side is dictating the tempo in this game. The home players attempt to beat the opposition's defence using mostly counter attacks. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 46:09",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:05",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:35",
            "label": "",
            "description": "Dani Alves (Barcelona) picks up a pass, lines up a shot and strikes from 30 metres out, but Jan Oblak thwarts the effort which is headed for the top right corner. It will be a corner kick for Barcelona."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "",
            "description": "A pass from Lionel Messi (Barcelona) is intercepted by Jan Oblak and the move breaks down."
        },
        {
            "gameTime": "1 - 37:42",
            "label": "",
            "description": "Good touch by Sergio Busquets (Barcelona) as he receives a great pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, the effort misses the net and flies well wide to the right. The ball goes out of play and Atl. Madrid will have a goal kick."
        },
        {
            "gameTime": "1 - 33:40",
            "label": "",
            "description": "Lionel Messi (Barcelona) unleashes a brilliant effort from the free kick, but the ball crashes against the bar. What a chance!"
        },
        {
            "gameTime": "1 - 31:50",
            "label": "y-card",
            "description": "Diego Godin (Atl. Madrid) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Alberto Undiano Mallenco didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "1 - 31:12",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) brings his opponent down. Alberto Undiano Mallenco has a clear sight of it and blows his whistle for a foul. Barcelona are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 28:56",
            "label": "y-card",
            "description": "Pedro (Barcelona) sees a yellow card from Alberto Undiano Mallenco after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 27:58",
            "label": "corner",
            "description": "Koke (Atl. Madrid) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 27:37",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) tries to send a pass but it's blocked. Atl. Madrid win a corner."
        },
        {
            "gameTime": "1 - 25:24",
            "label": "",
            "description": "Gabi (Atl. Madrid) goes for goal, but his effort isn't precise at all and it flies yards wide of the right post."
        },
        {
            "gameTime": "1 - 24:36",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "1 - 22:03",
            "label": "",
            "description": "Barcelona restart play with a quick free kick."
        },
        {
            "gameTime": "1 - 21:50",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) makes a slide tackle, but referee Alberto Undiano Mallenco blows for a foul. It's a free kick to Barcelona in a dangerous position."
        },
        {
            "gameTime": "1 - 17:48",
            "label": "",
            "description": "Neymar picks out Lionel Messi (Barcelona), who drives a shot just over the crossbar from the edge of the box."
        },
        {
            "gameTime": "1 - 13:59",
            "label": "",
            "description": "Pedro (Barcelona) tries his luck from the edge of the box after a brilliant solo effort, but it is well blocked by the defender."
        },
        {
            "gameTime": "1 - 12:50",
            "label": "",
            "description": "Jan Oblak pulls off a decent save! Lionel Messi (Barcelona) attempts to head home after a precise cross into the box. He aims his header towards the middle of the net, but the effort is kept out."
        },
        {
            "gameTime": "1 - 11:17",
            "label": "",
            "description": "Lionel Messi (Barcelona) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Jan Oblak is alert and denies him."
        },
        {
            "gameTime": "1 - 09:32",
            "label": "",
            "description": "The linesman raises his flag for offside before Antoine Griezmann (Atl. Madrid) heads on."
        },
        {
            "gameTime": "1 - 09:08",
            "label": "corner",
            "description": "Arda Turan (Atl. Madrid) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "1 - 08:57",
            "label": "",
            "description": "Arda Turan (Atl. Madrid) sends a cross into the box, but the opposition's defence clears the ball to safety. The ball goes out of play. Atl. Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 08:08",
            "label": "",
            "description": "Jose Maria Gimenez (Atl. Madrid) wins himself just enough space inside the box to connect with the corner. His header flies towards the roof of the net, but the goalkeeper leaps from the ground and makes a stunning save."
        },
        {
            "gameTime": "1 - 07:57",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 07:13",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) sends a pass into the penalty area, but the opponent manages to cut it out. Atl. Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 06:57",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 06:20",
            "label": "",
            "description": "Gabi (Atl. Madrid) crosses the ball into the box, but one of the defending players averts the threat. The referee signals a corner kick to Atl. Madrid."
        },
        {
            "gameTime": "1 - 05:46",
            "label": "",
            "description": "Jordi Alba (Barcelona) fouls an opponent. At least that's what referee Alberto Undiano Mallenco signals."
        },
        {
            "gameTime": "1 - 03:17",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 03:03",
            "label": "",
            "description": "Barcelona play a few nice passes from player to player, but their possession doesn't last long as an opposition player intercepts a pass. The ball is out of play and Barcelona manage to earn a corner."
        },
        {
            "gameTime": "1 - 01:19",
            "label": "",
            "description": "Alberto Undiano Mallenco has a clear sight and sees a foul from Gabi (Atl. Madrid)."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Atl. Madrid will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Alberto Undiano Mallenco."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. The superiority of the away team was evident on the pitch today. The hosts defended well and were deadly on the counter attack. The away side displayed some nice build up play using a lot of passes."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "17/05/2015 - 20:00",
    "gameHomeTeam": "Atl. Madrid",
    "gameScore": "0 - 1"
}