{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-02-07 - 22-30 Granada CF 1 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "Let's hope the players will show us more in future games as today's one was rather average, without many exciting moments. The away side dominated this game. The home players attempted to beat the opposition's defence using mostly counter attacks. The away team tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 47:55",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 47:12",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Toni Kroos (Real Madrid) takes it short."
        },
        {
            "gameTime": "2 - 47:04",
            "label": "",
            "description": "The ball is cleared after Mateo Kovacic (Real Madrid) attempted to dribble past an opposing player. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 45:56",
            "label": "",
            "description": "Ruben Rochina (Granada CF) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:02",
            "label": "attendance",
            "description": "The attendance is 17052."
        },
        {
            "gameTime": "2 - 40:44",
            "label": "substitution",
            "description": "A substitution has been made. Daniel Carvajal is replaced by Nacho (Real Madrid)."
        },
        {
            "gameTime": "2 - 39:27",
            "label": "soccer-ball",
            "description": "Goal! Mateo Kovacic tees up Luka Modric (Real Madrid) on the edge of the box and he fires the ball into the left side of the goal. 1:2."
        },
        {
            "gameTime": "2 - 37:21",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows a yellow card to Daniel Carvajal (Real Madrid) for a tough tackle."
        },
        {
            "gameTime": "2 - 35:03",
            "label": "substitution",
            "description": "Jose Ramon Sandoval has decided to substitute Adalberto Penaranda and he is replaced by Abdoulaye Doucoure (Granada CF)."
        },
        {
            "gameTime": "2 - 32:49",
            "label": "substitution",
            "description": "Here comes a substitution. Mateo Kovacic (Real Madrid) is brought on as a substitute for Isco."
        },
        {
            "gameTime": "2 - 32:28",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 32:08",
            "label": "",
            "description": "Jese (Real Madrid) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender. Real Madrid earn a corner."
        },
        {
            "gameTime": "2 - 31:40",
            "label": "",
            "description": "Karim Benzema (Real Madrid) produces a poor pass. He attempts to get the ball into the box but it's hacked away."
        },
        {
            "gameTime": "2 - 31:15",
            "label": "substitution",
            "description": "Substitution. Fran Rico makes his way off the pitch and Rene Krhin (Granada CF) comes on as his replacement."
        },
        {
            "gameTime": "2 - 27:08",
            "label": "",
            "description": "Isaac Success (Granada CF) dribbles into the box, but Keylor Navas is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 26:14",
            "label": "",
            "description": "A goal, which was scored by Youseff El Arabi (Granada CF), was disallowed due to offside."
        },
        {
            "gameTime": "2 - 25:30",
            "label": "corner",
            "description": "Ruben Rochina (Granada CF) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 25:17",
            "label": "",
            "description": "Isaac Success (Granada CF) races towards goal but the defender gets back well to make a challenge. The ball is out of play. Granada CF will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 23:17",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) finds enough space to climb high and plants a header way over the bar. What a poor effort."
        },
        {
            "gameTime": "2 - 22:47",
            "label": "corner",
            "description": "There's an opportunity for Luka Modric (Real Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 22:35",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) serves up a nice cross, but the defence clears the danger. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 19:54",
            "label": "",
            "description": "Isco (Real Madrid) was too forceful with his tackle and Jesus Gil Manzano interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 16:23",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) has received a yellow card for his foul."
        },
        {
            "gameTime": "2 - 15:56",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to make a change. Jese (Real Madrid) replaces James Rodriguez."
        },
        {
            "gameTime": "2 - 15:39",
            "label": "y-card",
            "description": "The expression of the referee Jesus Gil Manzano is crystal clear. This behaviour won't be tolerated. Youseff El Arabi (Granada CF) is shown a yellow card."
        },
        {
            "gameTime": "2 - 14:49",
            "label": "soccer-ball",
            "description": "Goal! Youseff El Arabi (Granada CF) finishes from close range with an easy finish and he makes it 1:1. He was ably assisted there by Ruben Rochina."
        },
        {
            "gameTime": "2 - 12:48",
            "label": "substitution",
            "description": "Substitution. Youseff El Arabi (Granada CF) receives a signal from the referee and is now allowed to enter the pitch as David Barral walks off."
        },
        {
            "gameTime": "2 - 11:57",
            "label": "",
            "description": "Karim Benzema (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Andres Fernandez is alert and denies him."
        },
        {
            "gameTime": "2 - 10:37",
            "label": "",
            "description": "Karim Benzema (Real Madrid) blows a clear opportunity! He needed only to tap the ball in, but narrowly misses the goal."
        },
        {
            "gameTime": "2 - 09:25",
            "label": "",
            "description": "Luka Modric (Real Madrid) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender."
        },
        {
            "gameTime": "2 - 08:25",
            "label": "",
            "description": "Isaac Success (Granada CF) gets on the ball and beats an opponent, but his run is stopped by the referee Jesus Gil Manzano who sees an offensive foul."
        },
        {
            "gameTime": "2 - 07:44",
            "label": "",
            "description": "Ruben Rochina (Granada CF) gets a shot away from around 20 metres out after his fine solo run. The ball went just over the top!"
        },
        {
            "gameTime": "2 - 05:35",
            "label": "",
            "description": "James Rodriguez (Real Madrid) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "2 - 03:49",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 03:10",
            "label": "",
            "description": "Luka Modric (Real Madrid) strikes a bullet of a shot towards goal from distance and forces the goalkeeper to make a good save. Real Madrid will take a corner kick."
        },
        {
            "gameTime": "2 - 02:56",
            "label": "",
            "description": "James Rodriguez (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 01:24",
            "label": "",
            "description": "David Barral (Granada CF) rises highest from the corner to head at goal, but his effort towards the left side of the goal is brilliantly kept out by the goalkeeper."
        },
        {
            "gameTime": "2 - 01:23",
            "label": "corner",
            "description": "Ruben Rochina (Granada CF) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 00:47",
            "label": "",
            "description": "Isaac Success (Granada CF) wriggles into space inside the box with excellent ball control, but his effort on goal is well blocked. Granada CF have a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. The away side are dominant and dictating the tempo of the game, mainly because of their higher activity and more accurate passing. The home team's main weapon is fast counter attacks, while the away side attempts to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 44:58",
            "label": "whistle",
            "description": "Jesus Gil Manzano has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 43:50",
            "label": "",
            "description": "The effort by Isco (Real Madrid) failed to trouble the goalkeeper. He smashed the ball in from 18 metres but it went into the stands."
        },
        {
            "gameTime": "1 - 42:44",
            "label": "",
            "description": "CHANCE! Miguel Lopes (Granada CF) picks up a pass inside the box and has a sight of goal, but he sends his shot well wide of the left post."
        },
        {
            "gameTime": "1 - 40:19",
            "label": "corner",
            "description": "Ruben Rochina (Granada CF) launches a cross from the corner, but Keylor Navas is alert to thwart the effort."
        },
        {
            "gameTime": "1 - 39:37",
            "label": "",
            "description": "David Barral (Granada CF) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. The ball goes out of play and Granada CF have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 37:34",
            "label": "",
            "description": "The linesman raises his flag for offside before Cristiano Ronaldo (Real Madrid) heads on."
        },
        {
            "gameTime": "1 - 36:21",
            "label": "",
            "description": "The game is interrupted as Marcelo (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "1 - 34:35",
            "label": "",
            "description": "Isco (Real Madrid) attempted to pick out a free teammate inside the box, but Andres Fernandez comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 31:59",
            "label": "y-card",
            "description": "The foul by Ruben Perez (Granada CF) is worthy of a card and a yellow is duly shown by Jesus Gil Manzano."
        },
        {
            "gameTime": "1 - 29:31",
            "label": "soccer-ball",
            "description": "It's a goal! Daniel Carvajal plays a lovely pass into the box and finds Karim Benzema (Real Madrid). He tries his luck from close range and coolly strikes the ball into the back of the net. 0:1."
        },
        {
            "gameTime": "1 - 28:21",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) works the corner short."
        },
        {
            "gameTime": "1 - 28:05",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 26:15",
            "label": "",
            "description": "Ruben Rochina (Granada CF) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 23:49",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 23:32",
            "label": "",
            "description": "Luka Modric (Real Madrid) tries to pass the ball into the penalty area but it's blocked. Real Madrid win a corner."
        },
        {
            "gameTime": "1 - 21:35",
            "label": "",
            "description": "Marcelo (Real Madrid) attempts to find James Rodriguez, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 18:25",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows the yellow card to Miguel Lopes (Granada CF) for a heavy challenge."
        },
        {
            "gameTime": "1 - 16:21",
            "label": "",
            "description": "Isaac Success (Granada CF) goes close to scoring with a shot from inside the box, but he drags his effort wide of the left post."
        },
        {
            "gameTime": "1 - 13:30",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) misses a great chance! He latches on to a fine cross into the box, but his effort misses the right post by a whisker."
        },
        {
            "gameTime": "1 - 11:06",
            "label": "",
            "description": "Half chance! James Rodriguez (Real Madrid) plays a pass into the box, but Andres Fernandez reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 10:27",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Adalberto Penaranda (Granada CF) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "1 - 08:30",
            "label": "",
            "description": "Isaac Success (Granada CF) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "1 - 07:50",
            "label": "",
            "description": "Karim Benzema (Real Madrid) unleashes a powerful first time volley towards goal, but the ball goes well wide of the left post."
        },
        {
            "gameTime": "1 - 06:11",
            "label": "",
            "description": "Fran Rico (Granada CF) is adjudged offside."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "Ruben Rochina (Granada CF) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 03:23",
            "label": "",
            "description": "Keylor Navas is alert and has a clear sight of a long through ball from Miguel Lopes (Granada CF). Easy save!"
        },
        {
            "gameTime": "1 - 01:48",
            "label": "",
            "description": "James Rodriguez (Real Madrid) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Granada CF will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jesus Gil Manzano is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let's hope the players will show us more in future games as today's one was rather average, without many exciting moments. The away side dominated this game. The home players attempted to beat the opposition's defence using mostly counter attacks. The away team tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "07/02/2016 - 22:30",
    "gameHomeTeam": "Granada CF",
    "gameScore": "1 - 2"
}