{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-05-12 - 21-45 Bayern Munich 3 - 2 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. The home side were superior in this game. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        },
        {
            "gameTime": "2 - 48:06",
            "label": "whistle",
            "description": "Mark Clattenburg is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 46:40",
            "label": "",
            "description": "Neymar (Barcelona) breaks past challenges inside the box, but puts too much pace on his pass to Lionel Messi."
        },
        {
            "gameTime": "2 - 46:11",
            "label": "corner",
            "description": "Thiago Alcantara (Bayern Munich) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 45:53",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) looks to break free, but an opposing player clears the ball away. The referee blows his whistle, Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:01",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 42:52",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Sebastian Rode (Bayern Munich)."
        },
        {
            "gameTime": "2 - 41:52",
            "label": "substitution",
            "description": "Pep Guardiola has decided to make a change. Mario Gotze (Bayern Munich) replaces Thomas Muller."
        },
        {
            "gameTime": "2 - 41:44",
            "label": "substitution",
            "description": "The manager makes a subsitution with Javi Martinez (Bayern Munich) coming on for Bastian Schweinsteiger."
        },
        {
            "gameTime": "2 - 39:52",
            "label": "y-card",
            "description": "Yellow card. Pedro (Barcelona) goes into the referee's book after a bad challenge."
        },
        {
            "gameTime": "2 - 39:09",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) connects with a cross and has an effort on goal from the edge of the box, but his attempt goes well wide of the left post."
        },
        {
            "gameTime": "2 - 38:28",
            "label": "y-card",
            "description": "A yellow card is awarded to Sebastian Rode (Bayern Munich). Mark Clattenburg interrupts the game for a tactical foul by Sebastian Rode (Bayern Munich)."
        },
        {
            "gameTime": "2 - 36:57",
            "label": "",
            "description": "Bayern Munich are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break. Thomas Muller (Bayern Munich) plays a through ball but overhits it."
        },
        {
            "gameTime": "2 - 35:55",
            "label": "y-card",
            "description": "Mark Clattenburg shows a yellow card to Xabi Alonso (Bayern Munich) for his blatant foul."
        },
        {
            "gameTime": "2 - 33:19",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but he sent it well over the bar."
        },
        {
            "gameTime": "2 - 33:11",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 32:45",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) connects with a pass but sees his shot from the edge of the box blocked. Bayern Munich get a corner."
        },
        {
            "gameTime": "2 - 30:51",
            "label": "y-card",
            "description": "Robert Lewandowski (Bayern Munich) was probably a bit loose with his words to Mark Clattenburg, who decides to show him a yellow."
        },
        {
            "gameTime": "2 - 30:35",
            "label": "",
            "description": "The ball is cleared after Robert Lewandowski (Bayern Munich) attempted to dribble past an opposing player. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "2 - 29:37",
            "label": "substitution",
            "description": "Luis Enrique has decided to introduce fresh legs, with Xavi (Barcelona) replacing Andres Iniesta."
        },
        {
            "gameTime": "2 - 28:40",
            "label": "soccer-ball",
            "description": "Thomas Muller (Bayern Munich) gets to the ball on the edge of the box and fires in a first time shot without any hesitation. The strike is excellent and goes inside the right post. He couldn't have done it any better. 3:2."
        },
        {
            "gameTime": "2 - 26:15",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Ivan Rakitic leaves the pitch and Jeremy Mathieu (Barcelona) comes on."
        },
        {
            "gameTime": "2 - 24:24",
            "label": "",
            "description": "It looks like Dani Alves (Barcelona) saw red with that tackle. Mark Clattenburg won't tolerate such behaviour on the pitch and blows for a foul. Bastian Schweinsteiger (Bayern Munich) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "2 - 22:39",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 22:26",
            "label": "substitution",
            "description": "Pep Guardiola has decided to substitute Philipp Lahm and he is replaced by Sebastian Rode (Bayern Munich)."
        },
        {
            "gameTime": "2 - 20:32",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) whips the ball into the box and Philipp Lahm takes a perfect touch to control it, but one of the defenders does well to intercept."
        },
        {
            "gameTime": "2 - 18:34",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Ivan Rakitic (Barcelona) was quite harsh and Mark Clattenburg didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 18:03",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 20:5."
        },
        {
            "gameTime": "2 - 17:12",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) spurned a good chance! He gets a shot away from inside the penalty box, but it goes inches wide of the right post."
        },
        {
            "gameTime": "2 - 16:51",
            "label": "",
            "description": "Pedro (Barcelona) brings an opponent down and Mark Clattenburg interrupts the game. Bayern Munich have a free kick."
        },
        {
            "gameTime": "2 - 13:56",
            "label": "soccer-ball",
            "description": "Bastian Schweinsteiger looks around to decide who he is going to pass to. He picks out Robert Lewandowski (Bayern Munich), who collects the ball and unleashes a terrific shot from just outside of the box towards the bottom right corner and it ricochets in off the post. The score is 2:2."
        },
        {
            "gameTime": "2 - 12:20",
            "label": "",
            "description": "Neymar (Barcelona) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 12:05",
            "label": "",
            "description": "Mark Clattenburg couldn't ignore the rough tackle by Mehdi Benatia (Bayern Munich) and blew his whistle."
        },
        {
            "gameTime": "2 - 11:28",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post."
        },
        {
            "gameTime": "2 - 10:53",
            "label": "injury",
            "description": "Neymar (Barcelona) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 09:21",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) gets a shot away from distance, but wasn't really set to take it and fires high and wide."
        },
        {
            "gameTime": "2 - 08:37",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 07:56",
            "label": "",
            "description": "Neymar (Barcelona) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 06:58",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) makes an overly aggressive challenge and Mark Clattenburg blows his whistle for a foul. A free kick has been awarded to Barcelona."
        },
        {
            "gameTime": "2 - 06:19",
            "label": "",
            "description": "Lionel Messi (Barcelona) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety."
        },
        {
            "gameTime": "2 - 05:07",
            "label": "",
            "description": "Referee Mark Clattenburg sees tripping by Rafinha (Bayern Munich) and doesn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 04:46",
            "label": "",
            "description": "Bastian Schweinsteiger (Bayern Munich) meets a cross inside the box, but Marc Andre ter Stegen wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "2 - 03:08",
            "label": "",
            "description": "Bayern Munich seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "2 - 01:25",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) launches into a thunderous tackle on his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Luis Enrique has decided to make a substitution during the half time break. Pedro (Barcelona) comes on the pitch for Luis Suarez."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. It has been a tight contest so far. The home team makes a lot of passes and attempts to maintain possession. The same goes for the away side."
        },
        {
            "gameTime": "1 - 47:16",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 46:30",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) tackles a bit over zealously and Mark Clattenburg blows for a foul."
        },
        {
            "gameTime": "1 - 46:25",
            "label": "y-card",
            "description": "Thiago Alcantara (Bayern Munich) is booked after bringing down an opponent. Mark Clattenburg had an easy decision to make."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:35",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) reacts well and displays good awareness near the penalty spot to get on the end of a cross from the free kick. He jumps high and produces a header which goes well wide of the left post."
        },
        {
            "gameTime": "1 - 44:05",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) will take the free kick."
        },
        {
            "gameTime": "1 - 43:40",
            "label": "",
            "description": "Javier Mascherano (Barcelona) is penalised. He knocks an opponent down. A free kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 42:05",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 39:55",
            "label": "y-card",
            "description": "This foul is worthy of a card! And it is a yellow shown by referee Mark Clattenburg to the guilty Rafinha (Bayern Munich)."
        },
        {
            "gameTime": "1 - 39:05",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) fails to turn the rebound in as the goalkeeper pulls off a great save to keep him out."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) tries his luck from the edge of the box after a brilliant solo effort, but it is well blocked by the defender."
        },
        {
            "gameTime": "1 - 37:56",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "1 - 37:55",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 37:48",
            "label": "",
            "description": "Marc Andre ter Stegen pulls off a fantastic save! Bastian Schweinsteiger (Bayern Munich) attempts to head home after a precise cross into the box. He aims his header towards the top of the net, but the effort is kept out. The referee points to the corner flag and Bayern Munich will take a corner."
        },
        {
            "gameTime": "1 - 34:54",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 32:20",
            "label": "",
            "description": "Mark Clattenburg blows his whistle as Robert Lewandowski (Bayern Munich) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 30:25",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) was too forceful with his tackle and Mark Clattenburg interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 28:56",
            "label": "soccer-ball",
            "description": "Goal 1:2! Luis Suarez tees up Neymar (Barcelona) inside the box and he rolls the ball into the bottom left corner and past Manuel Neuer."
        },
        {
            "gameTime": "1 - 28:15",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the right post. Marc Andre ter Stegen is alert and denies him with a nice save."
        },
        {
            "gameTime": "1 - 27:35",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a precise low pass inside the box, controls the ball and drills it to the middle of the goal, but Manuel Neuer makes a comfortable save to stop his effort."
        },
        {
            "gameTime": "1 - 26:15",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Marc Andre ter Stegen."
        },
        {
            "gameTime": "1 - 25:12",
            "label": "",
            "description": "Flag up against Luis Suarez (Barcelona). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 21:05",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) sends a long ball in, but Marc Andre ter Stegen comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 19:35",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "1 - 18:45",
            "label": "corner",
            "description": "Marc Andre ter Stegen comes off his line to intercept the corner from Xabi Alonso (Bayern Munich)."
        },
        {
            "gameTime": "1 - 18:21",
            "label": "",
            "description": "Marc Andre ter Stegen pulls off a fantastic save! Thomas Muller (Bayern Munich) attempts to head home after a precise cross into the box. He aims his header to the top left corner of the goal, but his effort is kept out. The ball goes behind for a corner. Bayern Munich will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 17:45",
            "label": "",
            "description": "The linesman raises his flag for offside before Lionel Messi (Barcelona) heads on."
        },
        {
            "gameTime": "1 - 14:41",
            "label": "soccer-ball",
            "description": "Goal! Luis Suarez feeds Neymar (Barcelona), who taps the ball into an empty net. He makes it 1:1."
        },
        {
            "gameTime": "1 - 13:05",
            "label": "",
            "description": "Bastian Schweinsteiger (Bayern Munich) knew what to do with the ball, but was just a bit unlucky. After receiving a pass, he sent the ball goalwards from some 28 metres out, but it flew just over the bar."
        },
        {
            "gameTime": "1 - 12:15",
            "label": "",
            "description": "Dangerous play by Robert Lewandowski (Bayern Munich). Mark Clattenburg blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 12:10",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) commits a foul and Mark Clattenburg immediately signals a free kick."
        },
        {
            "gameTime": "1 - 10:59",
            "label": "",
            "description": "A spell of possession for Bayern Munich in an attempt to control the game."
        },
        {
            "gameTime": "1 - 09:59",
            "label": "",
            "description": "Bastian Schweinsteiger (Bayern Munich) should know this behaviour is beyond the rules. He was too careless with his challenge and left Mark Clattenburg no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 06:57",
            "label": "soccer-ball",
            "description": "Goal! Xabi Alonso sent a fine cross from the corner kick. The perfect pass found Mehdi Benatia (Bayern Munich) and his bullet header from around the penalty spot went straight into the left side of the goal. The score is 1:0."
        },
        {
            "gameTime": "1 - 06:20",
            "label": "corner",
            "description": "The referee and one of his assistants signal for a corner kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 06:20",
            "label": "",
            "description": "What a goal scoring opportunity! Robert Lewandowski (Bayern Munich) makes a good run into the box to meet a cross and fires the ball in on goal, but the shot is amazingly blocked by a defender."
        },
        {
            "gameTime": "1 - 05:15",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "corner",
            "description": "The resulting corner from Lionel Messi (Barcelona) is cleared."
        },
        {
            "gameTime": "1 - 04:29",
            "label": "",
            "description": "Neymar (Barcelona) sends a teasing cross into the area, but Manuel Neuer intercepts the ball. Corner kick. Barcelona will have an opportunity."
        },
        {
            "gameTime": "1 - 04:18",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) latches on to a precise lofted cross inside the box, controls the ball and drills a fine strike towards the middle of the goal. His dangerous effort is blocked by Manuel Neuer, who makes a glorious save!"
        },
        {
            "gameTime": "1 - 02:14",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) breaks past challenges inside the box, but puts too much pace on his pass to Philipp Lahm."
        },
        {
            "gameTime": "1 - 01:29",
            "label": "",
            "description": "Rafinha (Bayern Munich) was trying to get to the ball but hit the legs of the opponent as well. Mark Clattenburg blows the whistle for infingement."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Barcelona will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Mark Clattenburg."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. The home side were superior in this game. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "12/05/2015 - 21:45",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "3 - 2"
}