{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2014-2015/2015-05-16 - 16-30 Wolfsburg 2 - 1 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. The game was pretty even. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:08",
            "label": "",
            "description": "Aaron Hunt (Wolfsburg) is flagged for offside."
        },
        {
            "gameTime": "2 - 46:32",
            "label": "y-card",
            "description": "The game is interrupted because of a yellow card that is shown to Kevin De Bruyne (Wolfsburg)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:54",
            "label": "",
            "description": "Andre Schurrle (Wolfsburg) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 44:34",
            "label": "substitution",
            "description": "Dieter Hecking has decided to introduce fresh legs, with Andre Schurrle (Wolfsburg) replacing Daniel Caligiuri."
        },
        {
            "gameTime": "2 - 41:24",
            "label": "",
            "description": "Ciro Immobile (Dortmund) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 40:51",
            "label": "substitution",
            "description": "Substitution. Ivan Perisic makes his way off the pitch and Aaron Hunt (Wolfsburg) comes on as his replacement."
        },
        {
            "gameTime": "2 - 38:53",
            "label": "",
            "description": "Half chance! Marco Reus (Dortmund) plays a pass into the box, but Diego Benaglio reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 38:39",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) is caught offside!"
        },
        {
            "gameTime": "2 - 38:07",
            "label": "",
            "description": "Marco Reus (Dortmund) steps up and sends the free kick straight into the defensive wall."
        },
        {
            "gameTime": "2 - 37:25",
            "label": "y-card",
            "description": "Marco Fritz shows the yellow card to Maximilian Arnold (Wolfsburg) for a heavy challenge. Dortmund earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 35:26",
            "label": "",
            "description": "Ivan Perisic (Wolfsburg) shoots from the edge of the penalty area. The ball travels towards the bottom left corner, but Mitchell Langerak easily deals with the threat."
        },
        {
            "gameTime": "2 - 34:38",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) robs an opponent of the ball and explodes in anger when Marco Fritz blows for a foul."
        },
        {
            "gameTime": "2 - 33:34",
            "label": "",
            "description": "Sokratis (Dortmund) receives a fine cross inside the box and attempts to score a goal, but his shot flies just wide of the right post."
        },
        {
            "gameTime": "2 - 33:29",
            "label": "corner",
            "description": "Marco Reus (Dortmund) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 32:48",
            "label": "",
            "description": "Sebastian Kehl (Dortmund) serves up a nice cross, but the defence clears the danger. Dortmund win a corner."
        },
        {
            "gameTime": "2 - 31:36",
            "label": "substitution",
            "description": "Dieter Hecking prepares a substitution. Ricardo Rodriguez is replaced by Vieirinha (Wolfsburg)."
        },
        {
            "gameTime": "2 - 30:21",
            "label": "substitution",
            "description": "The game has come to an end for Marcel Schmelzer. He has contributed as much as he could today. He will be replaced by the fresh legs of Lukasz Piszczek (Dortmund)."
        },
        {
            "gameTime": "2 - 28:25",
            "label": "corner",
            "description": "The resulting corner from Marcel Schmelzer (Dortmund) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 28:14",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The linesman makes the right call and Dortmund will have a corner."
        },
        {
            "gameTime": "2 - 27:00",
            "label": "y-card",
            "description": "Ilkay Gundogan (Dortmund) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 25:50",
            "label": "y-card",
            "description": "The foul by Ivan Perisic (Wolfsburg) is worthy of a card and a yellow is duly shown by Marco Fritz."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Marco Reus (Dortmund) comes onto the pitch so that Shinji Kagawa can be given a rest."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Kevin Kampl walks off the pitch to be replaced by Ciro Immobile (Dortmund)."
        },
        {
            "gameTime": "2 - 23:23",
            "label": "",
            "description": "Great solo effort by Daniel Caligiuri (Wolfsburg) as he tricks his way through two defenders before firing a drive from just outside of the box towards the left side of the goal. The goalkeeper is ready and produces a stunning save."
        },
        {
            "gameTime": "2 - 19:36",
            "label": "corner",
            "description": "Kevin De Bruyne (Wolfsburg) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 19:27",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) has a great chance inside the six yard box, shoots low to the middle of the goal, but Mitchell Langerak pulls off an exquisite save to deny him. Wolfsburg force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 18:35",
            "label": "corner",
            "description": "Kevin De Bruyne (Wolfsburg) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 18:25",
            "label": "",
            "description": "Sebastian Jung (Wolfsburg) swings in a cross, but the ball is cleared to safety by one of the defending players. Wolfsburg force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "",
            "description": "The linesman raises his flag for offside before Josuha Guilavogui (Wolfsburg) heads on."
        },
        {
            "gameTime": "2 - 16:51",
            "label": "y-card",
            "description": "It's like he was asking for a caution. Neven Subotic (Dortmund) receives a yellow card."
        },
        {
            "gameTime": "2 - 16:25",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 13:56",
            "label": "",
            "description": "Kevin De Bruyne (Wolfsburg) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger."
        },
        {
            "gameTime": "2 - 12:06",
            "label": "",
            "description": "Marco Fritz blows his whistle. Josuha Guilavogui (Wolfsburg) commits a foul after dangerous play."
        },
        {
            "gameTime": "2 - 09:48",
            "label": "corner",
            "description": "The corner from Henrikh Mkhitaryan (Dortmund) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 09:36",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball. The referee points to the corner flag. It's a corner to Dortmund."
        },
        {
            "gameTime": "2 - 07:56",
            "label": "",
            "description": "Flag goes up against Ivan Perisic (Wolfsburg) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 06:40",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) receives a fine low pass and attempts to send the ball past the goalkeeper, but his shot goes wide of the goal."
        },
        {
            "gameTime": "2 - 03:31",
            "label": "soccer-ball",
            "description": "Goal! Naldo (Wolfsburg) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball into the left side of the goal. It's 2:1."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "",
            "description": "Ivan Perisic (Wolfsburg) gets himself onto the end of the corner, but his header is blocked."
        },
        {
            "gameTime": "2 - 03:29",
            "label": "corner",
            "description": "Kevin De Bruyne (Wolfsburg) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 03:09",
            "label": "",
            "description": "Josuha Guilavogui (Wolfsburg) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger. The referee and one of his assistants signal for a corner kick to Wolfsburg."
        },
        {
            "gameTime": "2 - 01:47",
            "label": "corner",
            "description": "The corner from Henrikh Mkhitaryan (Dortmund) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 01:32",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. It will be a corner kick for Dortmund."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "The fans can't complain about what they have been seeing so far on the pitch as both sides are playing highly attractive football. Even first half from both sides, and they've both had chances. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 41:22",
            "label": "",
            "description": "Kevin Kampl (Dortmund) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "1 - 39:36",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 38:46",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) smashes the ball towards goal from the edge of the penalty box, but it fails to bother the goalkeeper as it hits the defensive wall."
        },
        {
            "gameTime": "1 - 37:54",
            "label": "",
            "description": "Marco Fritz blows the whistle, Naldo (Wolfsburg) is penalised for a foul. Dortmund win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 35:52",
            "label": "",
            "description": "Henrikh Mkhitaryan swings the cross over. Pierre Emerick Aubameyang (Dortmund) gets his head to it but it goes just wide of the left post."
        },
        {
            "gameTime": "1 - 34:54",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "1 - 33:59",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) dances his way past two defending players and gets to the edge of the box from where he unleashes a shot that goes well wide of the left post."
        },
        {
            "gameTime": "1 - 33:16",
            "label": "",
            "description": "Flag up against Kevin De Bruyne (Wolfsburg). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 31:33",
            "label": "",
            "description": "Naldo (Wolfsburg) rises highest from the corner to head at goal, but his effort towards the middle of the goal is comfortably saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 31:21",
            "label": "corner",
            "description": "Ricardo Rodriguez (Wolfsburg) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 30:50",
            "label": "",
            "description": "Kevin De Bruyne (Wolfsburg) crosses the ball into the box, but one of the defending players averts the threat. Wolfsburg get a corner."
        },
        {
            "gameTime": "1 - 30:04",
            "label": "corner",
            "description": "Kevin De Bruyne (Wolfsburg) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "1 - 29:33",
            "label": "",
            "description": "Mitchell Langerak was forced into action to thwart Bas Dost (Wolfsburg). He found himself some space after latching on to a pass and unleashed a shot to the right post but couldn't beat the keeper. The ball goes out of play. Wolfsburg are awarded a corner kick."
        },
        {
            "gameTime": "1 - 29:20",
            "label": "",
            "description": "A cross into the box from Henrikh Mkhitaryan (Dortmund) is cleared."
        },
        {
            "gameTime": "1 - 28:20",
            "label": "",
            "description": "Ivan Perisic (Wolfsburg) was trying to get to the ball but clattered into the legs of the opponent as well. Marco Fritz blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 27:29",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 26:50",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Dortmund have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 26:32",
            "label": "",
            "description": "Ivan Perisic (Wolfsburg) sends a teasing cross into the area, but Mitchell Langerak intercepts the ball."
        },
        {
            "gameTime": "1 - 24:03",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) commits a rough challenge and Marco Fritz blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 21:38",
            "label": "",
            "description": "Ivan Perisic (Wolfsburg) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 20:35",
            "label": "",
            "description": "The goalkeeper dives to deny Henrikh Mkhitaryan (Dortmund), whose promising shot was aimed towards the left post."
        },
        {
            "gameTime": "1 - 17:55",
            "label": "",
            "description": "Kevin De Bruyne sprays a pass out to Bas Dost (Wolfsburg), but he produces a poor effort from inside the box which goes well wide of the left post."
        },
        {
            "gameTime": "1 - 16:32",
            "label": "",
            "description": "Bas Dost (Wolfsburg) rises high to head a nice lofted cross towards the middle of the goal. Unfortunately for him, his close range effort lacks pace and Mitchell Langerak makes a comfortable save."
        },
        {
            "gameTime": "1 - 16:11",
            "label": "corner",
            "description": "Kevin De Bruyne (Wolfsburg) works the corner short."
        },
        {
            "gameTime": "1 - 15:52",
            "label": "",
            "description": "Kevin De Bruyne (Wolfsburg) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety. Wolfsburg have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 15:11",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) wastes an opportunity. He finds himself in acres of space and fires in a terrific shot from long range straight towards the left side of the target, but the goalkeeper makes a brilliant save and stops this one!"
        },
        {
            "gameTime": "1 - 14:01",
            "label": "",
            "description": "Erik Durm (Dortmund) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 11:56",
            "label": "",
            "description": "A cross is clipped into the penalty area by Ivan Perisic (Wolfsburg) but poses no threat."
        },
        {
            "gameTime": "1 - 10:42",
            "label": "soccer-ball",
            "description": "Pierre Emerick Aubameyang (Dortmund) sends Diego Benaglio the wrong way and fires the penalty into the middle of the goal!"
        },
        {
            "gameTime": "1 - 10:34",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 10:18",
            "label": "y-card",
            "description": "Diego Benaglio (Wolfsburg) is awarded a yellow card. The referee showed him no mercy."
        },
        {
            "gameTime": "1 - 09:56",
            "label": "penalty",
            "description": "Diego Benaglio (Wolfsburg) jumps into a tackle and Marco Fritz blows his whistle for a foul. The referee gives a penalty to Dortmund!"
        },
        {
            "gameTime": "1 - 09:03",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 05:58",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Marco Fritz with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 03:14",
            "label": "",
            "description": "The game is interrupted as Bas Dost (Wolfsburg) is flagged offside."
        },
        {
            "gameTime": "1 - 02:23",
            "label": "",
            "description": "Neven Subotic (Dortmund) crosses the ball forward but it is intercepted."
        },
        {
            "gameTime": "1 - 01:04",
            "label": "",
            "description": "Neven Subotic (Dortmund) finds Sebastian Kehl with a nice pass so he can go on towards the goal."
        },
        {
            "gameTime": "1 - 00:20",
            "label": "soccer-ball",
            "description": "Goal! Kevin De Bruyne displays great vision and sends a pass to Daniel Caligiuri (Wolfsburg), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 1:0."
        },
        {
            "gameTime": "1 - 00:12",
            "label": "",
            "description": "The players are on the pitch and Dortmund will have the kick off."
        },
        {
            "gameTime": "1 - 00:10",
            "label": "",
            "description": "Wolfsburg hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Marco Fritz will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. The game was pretty even. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "16/05/2015 - 16:30",
    "gameHomeTeam": "Wolfsburg",
    "gameScore": "2 - 1"
}