{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-04-09 - 17-00 Swansea 1 - 0 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:15",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. Neither of the teams could take the initiative and dominate today's game. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 50:10",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 48:21",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "",
            "description": "Pedro (Chelsea) swings a cross into the box, but it's far too close to Lukasz Fabianski, who smothers the ball."
        },
        {
            "gameTime": "2 - 46:24",
            "label": "",
            "description": "Kyle Naughton (Swansea) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:11",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 42:49",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The linesman points to the corner flag, Chelsea are going to take it."
        },
        {
            "gameTime": "2 - 40:48",
            "label": "",
            "description": "Falcao (Chelsea) takes a wonderful touch after collecting a pass inside the box. He steers his shot goalwards, but the keeper produces a decent save!"
        },
        {
            "gameTime": "2 - 39:37",
            "label": "substitution",
            "description": "Substitution. Kyle Naughton (Swansea) receives a signal from the referee and is now allowed to enter the pitch as Jefferson Montero walks off."
        },
        {
            "gameTime": "2 - 37:17",
            "label": "",
            "description": "Oscar (Chelsea) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "2 - 36:04",
            "label": "corner",
            "description": "Lukasz Fabianski leaps to intercept the corner kick from Cesc Fabregas (Chelsea)."
        },
        {
            "gameTime": "2 - 35:39",
            "label": "",
            "description": "Kenedy (Chelsea) tries to send a pass but it's blocked. The ball is out of play. A goal scoring opportunity from a corner for Chelsea."
        },
        {
            "gameTime": "2 - 33:33",
            "label": "y-card",
            "description": "The foul by Leroy Fer (Swansea) is worthy of a card and a yellow is duly shown by Andre Marriner."
        },
        {
            "gameTime": "2 - 30:55",
            "label": "y-card",
            "description": "Cesc Fabregas (Chelsea) is cautioned and receives a yellow card."
        },
        {
            "gameTime": "2 - 30:52",
            "label": "y-card",
            "description": "Ashley Williams (Swansea) is yellow carded for breaking the rules of the game."
        },
        {
            "gameTime": "2 - 30:50",
            "label": "substitution",
            "description": "Guus Hiddink decides to make a substitution. Ruben Loftus Cheek will be replaced by Falcao (Chelsea)."
        },
        {
            "gameTime": "2 - 30:45",
            "label": "",
            "description": "Jefferson Montero (Swansea) has a big opportunity to score! He climbs highest deep inside the penalty box and strikes a powerful header towards the goal. Next time he should aim better as his effort flies narrowly over the bar."
        },
        {
            "gameTime": "2 - 29:26",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Alberto Paloschi departs the field of play to be replaced by Bafetimbi Gomis (Swansea)."
        },
        {
            "gameTime": "2 - 27:26",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) sends the corner into the box, but Lukasz Fabianski intercepts it and averts the threat."
        },
        {
            "gameTime": "2 - 27:19",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Ruben Loftus Cheek (Chelsea). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate. Chelsea get a corner."
        },
        {
            "gameTime": "2 - 25:47",
            "label": "y-card",
            "description": "Pedro (Chelsea) sees a yellow! His tackle wasn't that harsh, but he probably talked himself into Andre Marriner's book."
        },
        {
            "gameTime": "2 - 25:27",
            "label": "",
            "description": "The free kick is delivered by Cesc Fabregas (Chelsea) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "y-card",
            "description": "Andre Marriner shows a yellow card to Alberto Paloschi (Swansea), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 24:05",
            "label": "",
            "description": "Kenedy (Chelsea) sends a teasing cross into the area, but Lukasz Fabianski intercepts the ball."
        },
        {
            "gameTime": "2 - 23:20",
            "label": "attendance",
            "description": "The attendance is 20966."
        },
        {
            "gameTime": "2 - 21:02",
            "label": "substitution",
            "description": "Andre Ayew will be replaced by Wayne Routledge (Swansea)."
        },
        {
            "gameTime": "2 - 20:42",
            "label": "corner",
            "description": "The resulting corner from Cesc Fabregas (Chelsea) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 20:26",
            "label": "",
            "description": "Pedro (Chelsea) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 18:03",
            "label": "substitution",
            "description": "Guus Hiddink has decided to introduce fresh legs, with Bertrand Traore (Chelsea) replacing Pato."
        },
        {
            "gameTime": "2 - 17:07",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "2 - 16:12",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 14:41",
            "label": "",
            "description": "Andre Ayew (Swansea) smashes the ball towards goal from the edge of the penalty box, but his effort flies just a few inches wide of the right post."
        },
        {
            "gameTime": "2 - 14:22",
            "label": "",
            "description": "Gylfi Sigurdsson (Swansea) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 13:48",
            "label": "",
            "description": "The ball is cleared after Alberto Paloschi (Swansea) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 12:36",
            "label": "",
            "description": "Jack Cork (Swansea) was waiting for the ball on the edge of the box and produced a powerful volley directed to the left side of the target, but the goalkeeper made an amazing save to deny him."
        },
        {
            "gameTime": "2 - 09:17",
            "label": "",
            "description": "CHANCE! Pato (Chelsea) fires just wide of the right post from inside the box after running onto a splendid pass from Pedro."
        },
        {
            "gameTime": "2 - 07:55",
            "label": "",
            "description": "This was a piece of cake for Asmir Begovic. Alberto Paloschi (Swansea) found himself some space after latching on to a pass, but his strike only went low to the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 07:02",
            "label": "",
            "description": "Handball by Pato (Chelsea)."
        },
        {
            "gameTime": "2 - 06:00",
            "label": "",
            "description": "Jefferson Montero (Swansea) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "2 - 04:21",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "2 - 02:03",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner kick, but Lukasz Fabianski reads it well and stops the effort."
        },
        {
            "gameTime": "2 - 01:33",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:10",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) dribbles into space and finds himself in a shooting position, but his shot from the edge of the box is bravely blocked. The referee signals a corner kick to Chelsea."
        },
        {
            "gameTime": "2 - 00:12",
            "label": "substitution",
            "description": "There will be a change on the pitch for the second half. Guus Hiddink probably wasn't satisfied with the performance of Matthew Miazga. He is replaced by Kenedy (Chelsea)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 47:15",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. Neither team was able to take the initiative and dominate the first half. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 47:11",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Andre Marriner has ended it."
        },
        {
            "gameTime": "1 - 46:55",
            "label": "",
            "description": "Pato (Chelsea) has a huge chance to score from close range, but his effort goes just a few inches wide of the right hand post."
        },
        {
            "gameTime": "1 - 46:50",
            "label": "",
            "description": "Oscar (Chelsea) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety."
        },
        {
            "gameTime": "1 - 46:33",
            "label": "",
            "description": "Jefferson Montero (Swansea) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "1 - 42:25",
            "label": "y-card",
            "description": "Neil Taylor (Swansea) sees a yellow card from Andre Marriner after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 40:29",
            "label": "",
            "description": "The free kick into the box finds Leroy Fer (Swansea), who directs his header into the middle of the goal, but the keeper pulls off a fantastic reflex save. Great goalkeeping."
        },
        {
            "gameTime": "1 - 39:41",
            "label": "",
            "description": "A free kick has been awarded to Swansea."
        },
        {
            "gameTime": "1 - 39:40",
            "label": "y-card",
            "description": "A yellow card for a tackle by Matthew Miazga (Chelsea). Andre Marriner doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 36:23",
            "label": "",
            "description": "Andre Ayew (Swansea) shoots from the edge of the penalty area. The ball travels towards the bottom right corner, but Asmir Begovic easily deals with the threat."
        },
        {
            "gameTime": "1 - 35:45",
            "label": "y-card",
            "description": "Cesar Azpilicueta (Chelsea) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Andre Marriner ignores the protests."
        },
        {
            "gameTime": "1 - 34:46",
            "label": "corner",
            "description": "The resulting corner from Gylfi Sigurdsson (Swansea) is cleared by the defence."
        },
        {
            "gameTime": "1 - 34:00",
            "label": "",
            "description": "A cross from Jefferson Montero (Swansea) fails to reach the box as the defence clears the ball away to safety. The ball goes out of play. Swansea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 32:16",
            "label": "",
            "description": "Andre Marriner blows his whistle as Andre Ayew (Swansea) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 31:24",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 31:13",
            "label": "",
            "description": "Oscar (Chelsea) races towards goal but the defender gets back well to make a challenge. The ball is out of play and the linesman points at the corner flag. Corner to Chelsea."
        },
        {
            "gameTime": "1 - 30:51",
            "label": "",
            "description": "Pedro (Chelsea) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 29:58",
            "label": "y-card",
            "description": "Andre Marriner shows the yellow card to Angel Rangel (Swansea) for a heavy challenge."
        },
        {
            "gameTime": "1 - 28:11",
            "label": "",
            "description": "Gylfi Sigurdsson (Swansea) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 27:37",
            "label": "",
            "description": "Dangerous play by John Obi Mikel (Chelsea). Andre Marriner blows his whistle for a foul. Free kick. Swansea will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 24:19",
            "label": "soccer-ball",
            "description": "What a hit! Gylfi Sigurdsson (Swansea) shows good composure inside the box to fire a first time shot into the bottom left corner. 1:0."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "Jefferson Montero (Swansea) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 23:50",
            "label": "",
            "description": "Jefferson Montero (Swansea) sends a cross into the box, but Asmir Begovic comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 22:55",
            "label": "",
            "description": "Pato (Chelsea) finds some space inside the box and latches on to a brilliant cross, but he wastes his chance as his shot goes way wide of the left post."
        },
        {
            "gameTime": "1 - 22:31",
            "label": "",
            "description": "Jefferson Montero (Swansea) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 22:10",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Cesc Fabregas (Chelsea) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 21:00",
            "label": "",
            "description": "A pass by Abdul Baba Rahman (Chelsea) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 19:44",
            "label": "",
            "description": "Oscar (Chelsea) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 19:31",
            "label": "",
            "description": "Chelsea seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 16:57",
            "label": "",
            "description": "Gylfi Sigurdsson (Swansea) produces a ferocious strike from the edge of the box. His dangerous effort towards the middle of the goal is blocked by Asmir Begovic, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 16:06",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "1 - 16:02",
            "label": "",
            "description": "Oscar (Chelsea) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Chelsea have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 14:17",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) makes a rough challenge and Andre Marriner blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 13:07",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 12:47",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance. Chelsea force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 12:21",
            "label": "",
            "description": "Pedro almost found himself in a promising position after Oscar (Chelsea) tried to send a defence splitting pass, but one of the defenders reacts well and makes a timely interception."
        },
        {
            "gameTime": "1 - 11:11",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 09:22",
            "label": "",
            "description": "Jefferson Montero (Swansea) zig zags his way into the box and drills a low shot towards the left post, but the goalkeeper pulls off a superb stop."
        },
        {
            "gameTime": "1 - 08:40",
            "label": "",
            "description": "Alberto Paloschi (Swansea) meets a cross inside the box, but Asmir Begovic wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "1 - 07:27",
            "label": "",
            "description": "Jefferson Montero (Swansea) and Alberto Paloschi try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 05:18",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Lukasz Fabianski is alert and denies him."
        },
        {
            "gameTime": "1 - 03:35",
            "label": "",
            "description": "Alberto Paloschi (Swansea) is flagged for offside."
        },
        {
            "gameTime": "1 - 02:59",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 02:26",
            "label": "",
            "description": "Alberto Paloschi (Swansea) is penalised for a foul. Andre Marriner had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 00:16",
            "label": "",
            "description": "Chelsea will kick the game off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Andre Marriner is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. Neither of the teams could take the initiative and dominate today's game. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "09/04/2016 - 17:00",
    "gameHomeTeam": "Swansea",
    "gameScore": "1 - 0"
}