{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-09-11 - 16-00 AC Milan 0 - 1 Udinese/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 52:59",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. It was an even match on the whole, with both sides enjoying spells in the ascendancy. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        },
        {
            "gameTime": "2 - 52:58",
            "label": "whistle",
            "description": "That's it for today, Gianpaolo Calvarese has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 50:21",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) pounces on the rebound on the edge of the box but his wild shot goes high over the crossbar."
        },
        {
            "gameTime": "2 - 50:10",
            "label": "",
            "description": "Keisuke Honda (AC Milan) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 48:59",
            "label": "y-card",
            "description": "A yellow card for a tackle by Pablo Armero (Udinese). Gianpaolo Calvarese doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 48:21",
            "label": "",
            "description": "A cross is whipped into the box by Keisuke Honda (AC Milan) and Carlos Bacca controls it well. He lines up the ball, but one of the defenders produces a timely intervention."
        },
        {
            "gameTime": "2 - 47:23",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "8 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:55",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Rodrigo De Paul walks off the pitch to be replaced by Gabriele Angella (Udinese)."
        },
        {
            "gameTime": "2 - 42:57",
            "label": "soccer-ball",
            "description": "Badu sends a precise lofted cross into the box. Stipe Perica (Udinese) latches on to it and finishes with a quick shot inside the right post. The goalkeeper had no chance. The score changes to 0:1."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "substitution",
            "description": "Vincenzo Montella has decided to introduce fresh legs, with Gianluca Lapadula (AC Milan) replacing Andrea Poli."
        },
        {
            "gameTime": "2 - 40:56",
            "label": "substitution",
            "description": "A substitution has been made. Duvan Zapata (Udinese) is replaced by ."
        },
        {
            "gameTime": "2 - 40:01",
            "label": "",
            "description": "Carlos Bacca (AC Milan) gets on the ball and beats an opponent, but his run is stopped by the referee Gianpaolo Calvarese who sees an offensive foul."
        },
        {
            "gameTime": "2 - 39:03",
            "label": "",
            "description": "Orestis Karnezis displays his ability to read the game and clears the danger after Keisuke Honda (AC Milan) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "2 - 37:42",
            "label": "corner",
            "description": "Rodrigo De Paul (Udinese) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 37:23",
            "label": "",
            "description": "Emil Hallfredsson (Udinese) sends a pass into the box, but his attempt is thwarted and cleared. Udinese win a corner."
        },
        {
            "gameTime": "2 - 36:12",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "2 - 35:16",
            "label": "",
            "description": "Keisuke Honda (AC Milan) races towards goal but the defender gets back well to make a challenge. The ball is off of the pitch and it's a goal kick for Udinese."
        },
        {
            "gameTime": "2 - 33:46",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Keisuke Honda (AC Milan) replaces Jose Sosa."
        },
        {
            "gameTime": "2 - 31:49",
            "label": "corner",
            "description": "Suso (AC Milan) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 31:28",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) tries to slide the ball through to a teammate but it's well blocked by a defender. Good work from AC Milan as they win a corner."
        },
        {
            "gameTime": "2 - 30:51",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 29:57",
            "label": "",
            "description": "A free kick into the box, taken by Riccardo Montolivo (AC Milan), is comfortably cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 29:35",
            "label": "",
            "description": "Badu (Udinese) escapes without any punishment from the referee after using excessive force to foul his opponent. AC Milan have been awarded a free kick."
        },
        {
            "gameTime": "2 - 28:58",
            "label": "y-card",
            "description": "Rodrigo De Paul (Udinese) attempts to discuss the decision with Gianpaolo Calvarese, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "2 - 27:52",
            "label": "y-card",
            "description": "Gianpaolo Calvarese shows a yellow card to Stipe Perica (Udinese), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 26:12",
            "label": "",
            "description": "Orestis Karnezis doesn't have to worry about this one. Suso plays a pass into the feet of Carlos Bacca (AC Milan), who is unable to find the target as his effort from inside the box goes well wide of the right post."
        },
        {
            "gameTime": "2 - 22:50",
            "label": "",
            "description": "Carlos Bacca (AC Milan) attempts to score as he rises near the penalty spot and heads the ball to the roof of the net. Orestis Karnezis displays brilliant reflexes and pulls off a comfortable save to stop the ball from hitting the net."
        },
        {
            "gameTime": "2 - 21:19",
            "label": "",
            "description": "Suso (AC Milan) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "2 - 20:42",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Suso (AC Milan) takes it short."
        },
        {
            "gameTime": "2 - 20:19",
            "label": "",
            "description": "The ball is cleared after Suso (AC Milan) attempted to dribble past an opposing player. AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 19:28",
            "label": "",
            "description": "Wasted opportunity. Emil Hallfredsson (Udinese) gets to the rebound inside the box and smashes the ball just wide of the right post."
        },
        {
            "gameTime": "2 - 18:50",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) sends in a cross from a long range free kick. However, his effort lacks accuracy and the ball sails off the pitch."
        },
        {
            "gameTime": "2 - 17:24",
            "label": "y-card",
            "description": "Gianpaolo Calvarese shows a yellow card to Badu (Udinese) for a tough tackle."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "substitution",
            "description": "The manager makes a subsitution with Stipe Perica (Udinese) coming on for Cyril Thereau."
        },
        {
            "gameTime": "2 - 13:34",
            "label": "",
            "description": "The AC Milan players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 11:33",
            "label": "corner",
            "description": "A corner kick by AC Milan is thwarted by the well prepared Orestis Karnezis (Udinese)."
        },
        {
            "gameTime": "2 - 11:19",
            "label": "",
            "description": "Carlos Bacca (AC Milan) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The ball goes out of play. AC Milan are awarded a corner kick."
        },
        {
            "gameTime": "2 - 09:29",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "2 - 08:50",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 08:07",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) fouls an opponent. At least that's what referee Gianpaolo Calvarese signals."
        },
        {
            "gameTime": "2 - 06:18",
            "label": "substitution",
            "description": "Luca Antonelli is substituted due to injury. Vincenzo Montella gives a chance to Mattia De Sciglio (AC Milan)."
        },
        {
            "gameTime": "2 - 04:20",
            "label": "injury",
            "description": "Luca Antonelli (AC Milan) is down injured and the referee stops play so that he can receive medical treatment."
        },
        {
            "gameTime": "2 - 02:42",
            "label": "",
            "description": "Emil Hallfredsson (Udinese) rises high to meet a cross from the corner kick and plants a header from inside the penalty area. His effort went just narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 02:28",
            "label": "corner",
            "description": "Corner kick. Rodrigo De Paul (Udinese) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 02:00",
            "label": "",
            "description": "Duvan Zapata (Udinese) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. The ball goes out of play and Udinese have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:01",
            "label": "",
            "description": "Good defending. Duvan Zapata (Udinese) tries to find Rodrigo De Paul inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. No side has really dominated in this first half. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 46:27",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 46:10",
            "label": "corner",
            "description": "Suso (AC Milan) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 46:01",
            "label": "",
            "description": "Suso (AC Milan) sends the ball into the box from the side of the pitch, but his cross is blocked. The ball goes behind for a corner. AC Milan will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 43:44",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Suso (AC Milan)."
        },
        {
            "gameTime": "1 - 43:26",
            "label": "corner",
            "description": "Suso (AC Milan) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 42:50",
            "label": "",
            "description": "Suso (AC Milan) tries his luck from the edge of the box after a brilliant solo effort, but it is well blocked by the defender. AC Milan earn a corner."
        },
        {
            "gameTime": "1 - 41:10",
            "label": "corner",
            "description": "The corner by Rodrigo De Paul (Udinese) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "",
            "description": "Cyril Thereau (Udinese) looks to break free, but an opposing player clears the ball away. Udinese get a corner."
        },
        {
            "gameTime": "1 - 40:42",
            "label": "",
            "description": "Sven Kums (Udinese) sends in a lofted cross from a mid range free kick. His effort, however, goes out of play."
        },
        {
            "gameTime": "1 - 39:35",
            "label": "",
            "description": "Jose Sosa (AC Milan) brings an opponent down and Gianpaolo Calvarese interrupts the game. Udinese get a free kick."
        },
        {
            "gameTime": "1 - 36:33",
            "label": "",
            "description": "Carlos Bacca (AC Milan) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 35:21",
            "label": "corner",
            "description": "AC Milan have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "1 - 35:18",
            "label": "",
            "description": "Carlos Bacca (AC Milan) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort. The ball is out of play. AC Milan win a corner kick."
        },
        {
            "gameTime": "1 - 33:58",
            "label": "y-card",
            "description": "Today's referee Gianpaolo Calvarese rightly decides to book Felipe (Udinese) for his harsh tackle."
        },
        {
            "gameTime": "1 - 33:47",
            "label": "corner",
            "description": "Udinese take the corner, but their hopes of scoring a goal end with nice clearance by the defence."
        },
        {
            "gameTime": "1 - 33:23",
            "label": "",
            "description": "Duvan Zapata (Udinese) slaloms his way past challenges, but an opposing player does well to get the ball away. Udinese have a corner."
        },
        {
            "gameTime": "1 - 32:39",
            "label": "",
            "description": "Ignazio Abate (AC Milan) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 31:54",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) unleashes a shot from a mid range free kick that crashes into the defensive wall. The opposition's goalkeeper set it up perfectly."
        },
        {
            "gameTime": "1 - 30:00",
            "label": "corner",
            "description": "The resulting set piece from Udinese is comfortably intercepted by one of the defending players."
        },
        {
            "gameTime": "1 - 29:18",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. Now Udinese have a corner."
        },
        {
            "gameTime": "1 - 28:59",
            "label": "y-card",
            "description": "Carlos Bacca (AC Milan) sees a yellow card from Gianpaolo Calvarese after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 26:44",
            "label": "",
            "description": "Cyril Thereau (Udinese) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the bottom right corner. Gianluigi Donnarumma has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 24:08",
            "label": "",
            "description": "Lovely skill from Gabriel Paletta (AC Milan) as he gets away from defenders and unleashes a shot from 35 metres out, but his effort goes just over the bar."
        },
        {
            "gameTime": "1 - 23:59",
            "label": "corner",
            "description": "AC Milan didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "1 - 22:56",
            "label": "",
            "description": "Suso (AC Milan) wriggles into space and fires the ball from the edge of the area, but one of the defenders is there to block the effort. The referee signals a corner kick to AC Milan."
        },
        {
            "gameTime": "1 - 20:47",
            "label": "",
            "description": "Jose Sosa (AC Milan) unleashes a shot towards the goal, but his effort isn't precise at all and it flies high over the bar."
        },
        {
            "gameTime": "1 - 18:52",
            "label": "",
            "description": "Luca Antonelli (AC Milan) sends a chip pass into the box, but Orestis Karnezis is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 18:40",
            "label": "",
            "description": "Andrea Poli (AC Milan) tries to find Carlos Bacca, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 17:25",
            "label": "corner",
            "description": "Udinese have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "1 - 17:01",
            "label": "",
            "description": "Duvan Zapata (Udinese) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out for a corner. Udinese can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 14:50",
            "label": "",
            "description": "AC Milan continue the game with a quickly taken free kick."
        },
        {
            "gameTime": "1 - 14:31",
            "label": "",
            "description": "Gianpaolo Calvarese blows his whistle. Emil Hallfredsson (Udinese) commits a foul after dangerous play. AC Milan are awarded the free kick."
        },
        {
            "gameTime": "1 - 14:06",
            "label": "",
            "description": "Suso (AC Milan) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 13:34",
            "label": "corner",
            "description": "Udinese fail to score from a corner as Gianluigi Donnarumma (AC Milan) leaps to collect the ball."
        },
        {
            "gameTime": "1 - 13:06",
            "label": "",
            "description": "Sven Kums (Udinese) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. The ball is out of play. A goal scoring opportunity from a corner for Udinese."
        },
        {
            "gameTime": "1 - 12:44",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 12:28",
            "label": "",
            "description": "Emil Hallfredsson (Udinese) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 09:59",
            "label": "",
            "description": "Jose Sosa (AC Milan) commits a foul and Gianpaolo Calvarese immediately signals a free kick."
        },
        {
            "gameTime": "1 - 09:39",
            "label": "",
            "description": "Suso (AC Milan) creates himself some space on the edge of the box and unleashes a strong shot which is blocked by a defender."
        },
        {
            "gameTime": "1 - 08:24",
            "label": "corner",
            "description": "Udinese fail to threaten from the corner kick as the opposition's goalkeeper plucks the ball out of the air."
        },
        {
            "gameTime": "1 - 07:02",
            "label": "",
            "description": "Felipe (Udinese) delivers a promising cross into the box, but it's cleared. The linesman points to the corner flag, Udinese are going to take it."
        },
        {
            "gameTime": "1 - 06:25",
            "label": "corner",
            "description": "A corner kick by AC Milan is thwarted by the well prepared Orestis Karnezis (Udinese)."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "The free kick from long range, taken by AC Milan, is intercepted by one of the defenders. The ball is out of play and the linesman points at the corner flag. Corner to AC Milan."
        },
        {
            "gameTime": "1 - 02:25",
            "label": "",
            "description": "AC Milan players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gianpaolo Calvarese is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "is the latest signing for Udinese."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Udinese will miss the presence of Samir (Knee Injury), Stipe Perica (Ankle Injury), Emil Hallfredsson (Injury), Emil Hallfredsson (Yellow Cards), Molla Wague (Shoulder Injury), Danilo (Yellow Cards), Danilo (Red Card), Silvan Widmer (Head Injury), Seko Fofana (Broken Leg), Rodrigo De Paul (Red Card), Antonin Barak (Suspended), Ewandro (Broken Leg), Jakub Jankto (Yellow Cards), Stipe Perica (Leg Injury)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The latest signings for AC Milan are ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. It was an even match on the whole, with both sides enjoying spells in the ascendancy. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        }
    ],
    "gameAwayTeam": "Udinese",
    "gameDate": "11/09/2016 - 16:00",
    "gameHomeTeam": "AC Milan",
    "gameScore": "0 - 1"
}