{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2014-2015/2015-04-11 - 21-00 Sevilla 2 - 2 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The visiting team was controlling the game most of the time. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:30",
            "label": "",
            "description": "Stephane Mbia (Sevilla) was trying to get to the ball but clattered into the legs of the opponent as well. Juan Martinez Munuera blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:27",
            "label": "corner",
            "description": "Xavi (Barcelona) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "2 - 44:09",
            "label": "",
            "description": "The ball is cleared after Jordi Alba (Barcelona) attempted to dribble past an opposing player. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "",
            "description": "Kevin Gameiro (Sevilla) forces a pass into the box, but Claudio Bravo is alert and does a great job to rob him of the ball."
        },
        {
            "gameTime": "2 - 40:43",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Pedro (Barcelona) will replace Andres Iniesta."
        },
        {
            "gameTime": "2 - 38:44",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Aleix Vidal is the provider as he slips the ball to Kevin Gameiro (Sevilla) who simply steers it home from close range. It's 2:2."
        },
        {
            "gameTime": "2 - 37:24",
            "label": "",
            "description": "Luis Suarez (Barcelona) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 36:28",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Stephane Mbia (Sevilla) was quite harsh and Juan Martinez Munuera didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 35:50",
            "label": "",
            "description": "Flag goes up against Coke (Sevilla) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 35:32",
            "label": "attendance",
            "description": "The attendance is 40355."
        },
        {
            "gameTime": "2 - 33:41",
            "label": "corner",
            "description": "The corner from Jose Antonio Reyes (Sevilla) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 33:17",
            "label": "",
            "description": "Coke (Sevilla) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The referee blows his whistle, Sevilla are awarded a corner kick."
        },
        {
            "gameTime": "2 - 32:59",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Jose Antonio Reyes (Sevilla) takes it short."
        },
        {
            "gameTime": "2 - 32:39",
            "label": "",
            "description": "Jose Antonio Reyes (Sevilla) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it. The ball goes behind for a corner. Sevilla will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 31:51",
            "label": "y-card",
            "description": "The foul by Jose Antonio Reyes (Sevilla) is worthy of a card and a yellow is duly shown by Juan Martinez Munuera."
        },
        {
            "gameTime": "2 - 29:51",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Kevin Gameiro (Sevilla) for Carlos Bacca."
        },
        {
            "gameTime": "2 - 28:53",
            "label": "corner",
            "description": "Xavi (Barcelona) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 28:31",
            "label": "",
            "description": "Lionel Messi (Barcelona) slams the ball from a long range free kick. He should have curled it higher to avoid hitting the wall. The ball is out of play. Barcelona win a corner kick."
        },
        {
            "gameTime": "2 - 28:16",
            "label": "substitution",
            "description": "That's the end of the game for Neymar, who is replaced by Xavi (Barcelona)."
        },
        {
            "gameTime": "2 - 27:15",
            "label": "",
            "description": "Juan Martinez Munuera blows his whistle. Stephane Mbia (Sevilla) commits a foul after dangerous play. Barcelona have a free kick."
        },
        {
            "gameTime": "2 - 26:55",
            "label": "",
            "description": "Nice passing game by Barcelona. They are increasing their possession with a series of long passes and waiting for the right moment to create an attacking opportunity."
        },
        {
            "gameTime": "2 - 24:30",
            "label": "substitution",
            "description": "Unai Emery Etxegoien prepares a substitution. Victor Vitolo is replaced by Jose Antonio Reyes (Sevilla)."
        },
        {
            "gameTime": "2 - 24:20",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Iborra leaves the pitch and Stephane Mbia (Sevilla) comes on."
        },
        {
            "gameTime": "2 - 23:41",
            "label": "",
            "description": "Luis Suarez (Barcelona) is furious with himself as he misses a clear opportunity. He sends a rebound a few inches wide of the right post. The ball goes out of play and Sevilla will have a goal kick."
        },
        {
            "gameTime": "2 - 23:30",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 22:16",
            "label": "",
            "description": "The referee blows his whistle for a foul after Victor Vitolo (Sevilla) overruns the ball during an attack and makes an aggressive challenge on his opponent."
        },
        {
            "gameTime": "2 - 21:39",
            "label": "",
            "description": "Coke (Sevilla) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 20:20",
            "label": "funfact",
            "description": "2:7 the latest stats for both teams in respect of shots on target."
        },
        {
            "gameTime": "2 - 19:18",
            "label": "",
            "description": "The effort by Coke (Sevilla) failed to trouble the goalkeeper. He smashed the ball in from 23 metres but it went into the stands. The ball is off of the pitch and it's a goal kick for Barcelona."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "",
            "description": "Nicolas Pareja (Sevilla) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "2 - 16:36",
            "label": "y-card",
            "description": "Juan Martinez Munuera shows a yellow card to Gerard Pique (Barcelona) for a tough tackle. That's a free kick to Sevilla."
        },
        {
            "gameTime": "2 - 15:56",
            "label": "y-card",
            "description": "Sergio Busquets (Barcelona) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Juan Martinez Munuera ignores the protests."
        },
        {
            "gameTime": "2 - 15:27",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "2 - 14:35",
            "label": "",
            "description": "Barcelona are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "2 - 13:15",
            "label": "funfact",
            "description": "30:70 – this is the current ball possession ratio."
        },
        {
            "gameTime": "2 - 11:43",
            "label": "y-card",
            "description": "Juan Martinez Munuera shows the yellow card to Ever Banega (Sevilla) for a heavy challenge."
        },
        {
            "gameTime": "2 - 10:55",
            "label": "",
            "description": "Luis Suarez (Barcelona) is flagged for offside."
        },
        {
            "gameTime": "2 - 10:48",
            "label": "",
            "description": "Jeremy Mathieu (Barcelona) finds himself some space inside the box and gets on the end of the corner. He lashes the ball towards the left post, but Sergio Rico pulls off an amazing save to thwart him."
        },
        {
            "gameTime": "2 - 10:21",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 09:40",
            "label": "",
            "description": "Neymar (Barcelona) races towards goal but the defender gets back well to make a challenge. Now Barcelona have a corner."
        },
        {
            "gameTime": "2 - 09:05",
            "label": "",
            "description": "Carlos Bacca (Sevilla) receives a precise pass inside the box and takes a shot that flies just wide of the right post. The ball is off of the pitch and it's a goal kick for Barcelona."
        },
        {
            "gameTime": "2 - 08:42",
            "label": "",
            "description": "Sevilla enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 07:30",
            "label": "",
            "description": "Iborra (Sevilla) is caught offside!"
        },
        {
            "gameTime": "2 - 06:30",
            "label": "",
            "description": "Nicolas Pareja (Sevilla) jumps into a tackle and Juan Martinez Munuera blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 04:40",
            "label": "",
            "description": "Luis Suarez (Barcelona) misses a rebound from the penalty spot. The ball flies just a few inches over the bar. The ball is off of the pitch and it's a goal kick for Sevilla."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "",
            "description": "Sergio Rico pulls off a great save to deny Andres Iniesta (Barcelona) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "2 - 04:30",
            "label": "",
            "description": "Luis Suarez (Barcelona) and Andres Iniesta combine well with a quick one two and their attacking move continues."
        },
        {
            "gameTime": "2 - 04:10",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 02:02",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 00:40",
            "label": "y-card",
            "description": "Iborra (Sevilla) has tested the patience of referee Juan Martinez Munuera and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We are seeing a great game so far, let's hope the players will be able to sustain their level of performance and keep entertaining the fans in such a fabulous way. The visiting team dominated the first half in most aspects of the game, but the hosts will surely attempt to turn the situation in their favour. The home players attempt to beat the opposition's defence using mostly counter attacks. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 45:11",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 44:46",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "1 - 44:12",
            "label": "",
            "description": "Lionel Messi (Barcelona) unloads a good strike from the free kick just outside the box. His effort towards the roof of the net is stopped by Sergio Rico, who pulls off a glorious save! The referee points to the corner flag and Barcelona will take a corner."
        },
        {
            "gameTime": "1 - 43:27",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) trips an opponent with a slide tackle. Juan Martinez Munuera stops the game and he could give him a card, but eventually decides on just a warning. Barcelona have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "Luis Suarez (Barcelona) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 40:54",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) drifts into the box to meet the ball from the free kick and plants a header towards the bottom right corner. One of the defending players gets in its way and blocks it."
        },
        {
            "gameTime": "1 - 40:11",
            "label": "",
            "description": "Nicolas Pareja (Sevilla) takes a direct free kick."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Juan Martinez Munuera blows his whistle for a foul after Sergio Busquets (Barcelona) hacks down one of his opponents. Sevilla get a free kick."
        },
        {
            "gameTime": "1 - 37:31",
            "label": "soccer-ball",
            "description": "Ever Banega (Sevilla) receives a pass and doesn't hesitate to shoot from around 25 metres. And it was an excellent choice. His superb effort goes in off the left post."
        },
        {
            "gameTime": "1 - 37:01",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Benoit Tremoulinas (Sevilla)."
        },
        {
            "gameTime": "1 - 36:19",
            "label": "",
            "description": "Neymar (Barcelona) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 34:00",
            "label": "",
            "description": "What a big chance! Iborra (Sevilla) picks up an inch perfect pass inside the box and fires the ball just over the crossbar. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "1 - 32:48",
            "label": "",
            "description": "Neymar plays a lovely pass into Luis Suarez (Barcelona), but he can't find the target. His strike from inside the box goes narrowly over the crossbar. The ball is off of the pitch and it's a goal kick for Sevilla."
        },
        {
            "gameTime": "1 - 30:30",
            "label": "soccer-ball",
            "description": "Neymar (Barcelona) unleashes a spectacular free kick from just outside the box, hitting the top left corner. The noise inside the stadium is tremendous at the moment."
        },
        {
            "gameTime": "1 - 28:57",
            "label": "y-card",
            "description": "A yellow card for a tackle by Grzegorz Krychowiak (Sevilla). Juan Martinez Munuera doesn't hesitate at all to make this decision. Barcelona are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 27:05",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "1 - 26:43",
            "label": "",
            "description": "Ever Banega (Sevilla) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 25:59",
            "label": "",
            "description": "A cross from a mid range free kick, taken by Sevilla, is intercepted by one of the defenders. The ball is out of play. Sevilla will take a throw in."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "",
            "description": "Jordi Alba (Barcelona) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision! Sevilla are awarded a free kick."
        },
        {
            "gameTime": "1 - 24:49",
            "label": "",
            "description": "Lionel Messi (Barcelona) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 24:08",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Barcelona."
        },
        {
            "gameTime": "1 - 22:06",
            "label": "",
            "description": "Barcelona are seeing far more of the ball now."
        },
        {
            "gameTime": "1 - 20:40",
            "label": "",
            "description": "Juan Martinez Munuera blows his whistle and signals a foul after Benoit Tremoulinas (Sevilla) brought his opponent down."
        },
        {
            "gameTime": "1 - 18:17",
            "label": "",
            "description": "Barcelona spell of possession comes to an end after a mistake."
        },
        {
            "gameTime": "1 - 15:40",
            "label": "",
            "description": "Jeremy Mathieu (Barcelona) fouls an opponent. At least that's what referee Juan Martinez Munuera signals."
        },
        {
            "gameTime": "1 - 13:57",
            "label": "soccer-ball",
            "description": "Goal! Neymar produces a great pass that finds Lionel Messi (Barcelona) inside the penalty area, who takes advantage of the situation to rifle a shot into the left side of the goal. 0:1."
        },
        {
            "gameTime": "1 - 12:55",
            "label": "",
            "description": "Ever Banega (Sevilla) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 11:25",
            "label": "",
            "description": "Andres Iniesta (Barcelona) takes the ball on and fires in a shot from 25 metres out. Sergio Rico stops the effort which is headed to the middle of the target."
        },
        {
            "gameTime": "1 - 09:40",
            "label": "",
            "description": "Aleix Vidal (Sevilla) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 09:02",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "1 - 08:37",
            "label": "",
            "description": "Sergio Rico gets a well deserved ovation! He pulls off a remarkable save to block a long range effort from Neymar (Barcelona) towards the bottom left corner. Nice goalkeeping skills!"
        },
        {
            "gameTime": "1 - 08:13",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Lionel Messi (Barcelona). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "1 - 07:23",
            "label": "",
            "description": "Lionel Messi (Barcelona) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "1 - 06:50",
            "label": "",
            "description": "Juan Martinez Munuera blows the whistle, Ever Banega (Sevilla) is penalised for a foul. Barcelona are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 06:31",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) and Neymar try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 05:58",
            "label": "",
            "description": "Referee Juan Martinez Munuera sees the trip by Grzegorz Krychowiak (Sevilla) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 04:54",
            "label": "",
            "description": "Sevilla hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "1 - 02:55",
            "label": "",
            "description": "Lionel Messi (Barcelona) attempts to create a scoring opportunity with a wonderful long ball, but his pass is blocked."
        },
        {
            "gameTime": "1 - 01:52",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) commits an ugly challenge. The referee sees it and immediately blows his whistle. Sergio Busquets (Barcelona) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "1 - 01:11",
            "label": "",
            "description": "The Barcelona players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Sevilla will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Juan Martinez Munuera."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The visiting team was controlling the game most of the time. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "11/04/2015 - 21:00",
    "gameHomeTeam": "Sevilla",
    "gameScore": "2 - 2"
}