{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-12-12 - 23-00 AS Roma 1 - 0 AC Milan/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We can only hope that the managers will be able to motivate the players and spark them into life in the next games. The football on offer today has been disappointing. The hosts were superior today. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        },
        {
            "gameTime": "2 - 48:14",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:04",
            "label": "",
            "description": "Matias Fernandez (AC Milan) meets a pass on the edge of the penalty area and shoots towards the bottom right corner. He didn't put enough power into the effort, though, and Wojciech Szczesny pulls off an easy save."
        },
        {
            "gameTime": "2 - 44:59",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 42:54",
            "label": "corner",
            "description": "Suso (AC Milan) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 41:51",
            "label": "",
            "description": "Manuel Locatelli (AC Milan) reacts well to latch onto a rebound inside the box, but his shot is well blocked. Now AC Milan have a corner."
        },
        {
            "gameTime": "2 - 41:06",
            "label": "corner",
            "description": "The resulting corner, taken by Keisuke Honda (AC Milan), comes to nothing."
        },
        {
            "gameTime": "2 - 40:05",
            "label": "",
            "description": "M'Baye Niang (AC Milan) sends a lofted cross into the box which is headed clear. The referee points to the corner flag and AC Milan will take a corner."
        },
        {
            "gameTime": "2 - 38:14",
            "label": "substitution",
            "description": "Vincenzo Montella has decided to introduce fresh legs, with Keisuke Honda (AC Milan) replacing Mario Pasalic."
        },
        {
            "gameTime": "2 - 38:04",
            "label": "y-card",
            "description": "Antonio Rudiger (AS Roma) takes his opponent down and receives a yellow card from the referee."
        },
        {
            "gameTime": "2 - 37:47",
            "label": "corner",
            "description": "A dangerous looking corner kick from Emerson (AS Roma) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 37:12",
            "label": "",
            "description": "Edin Dzeko (AS Roma) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the middle of the goal. Gianluigi Donnarumma has a clear sight of it and makes a comfortable save. AS Roma have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 36:40",
            "label": "",
            "description": "The game is interrupted as Edin Dzeko (AS Roma) is flagged offside."
        },
        {
            "gameTime": "2 - 36:12",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) takes a direct free kick."
        },
        {
            "gameTime": "2 - 35:33",
            "label": "",
            "description": "Ignazio Abate (AC Milan) makes a slide tackle, but referee Paolo Mazzoleni blows for a foul. A free kick has been awarded to AS Roma."
        },
        {
            "gameTime": "2 - 33:19",
            "label": "y-card",
            "description": "Gabriel Paletta (AC Milan) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "2 - 30:36",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) unleashes a powerful shot from the free kick but it only hits the defensive wall."
        },
        {
            "gameTime": "2 - 30:35",
            "label": "",
            "description": "Emerson (AS Roma) is about to take a free kick in a very promising position after much deliberation with his teammates."
        },
        {
            "gameTime": "2 - 29:39",
            "label": "",
            "description": "Paolo Mazzoleni blows his whistle and signals a foul after Manuel Locatelli (AC Milan) brought his opponent down. AS Roma have a free kick."
        },
        {
            "gameTime": "2 - 25:04",
            "label": "substitution",
            "description": "Vincenzo Montella prepares a substitution. Gianluca Lapadula is replaced by Luiz Adriano (AC Milan)."
        },
        {
            "gameTime": "2 - 21:45",
            "label": "substitution",
            "description": "Substitution. Andrea Bertolacci did his best and is replaced by Matias Fernandez (AC Milan)."
        },
        {
            "gameTime": "2 - 20:41",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the left post."
        },
        {
            "gameTime": "2 - 16:34",
            "label": "soccer-ball",
            "description": "A wonderful pass found its target. Radja Nainggolan (AS Roma) received it well and shot from about 20 metres out. He did really well to send the ball past the goalkeeper and into the bottom left corner."
        },
        {
            "gameTime": "2 - 15:42",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball sails well over the bar!"
        },
        {
            "gameTime": "2 - 13:15",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) is caught offside after the linesman raises his flag."
        },
        {
            "gameTime": "2 - 10:46",
            "label": "",
            "description": "Diego Perotti (AS Roma) gets the ball from a rebound and shoots from long range, but sends the ball high over the crossbar. The goalkeeper doesn't have to worry about this one. Very poor attempt."
        },
        {
            "gameTime": "2 - 10:24",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Stephan El Shaarawy (AS Roma). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 10:08",
            "label": "",
            "description": "Diego Perotti (AS Roma) races towards goal but the defender gets back well to make a challenge. AS Roma force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 06:52",
            "label": "",
            "description": "Mario Pasalic (AC Milan) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the left post."
        },
        {
            "gameTime": "2 - 05:10",
            "label": "corner",
            "description": "Stephan El Shaarawy (AS Roma) works the corner short."
        },
        {
            "gameTime": "2 - 04:31",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. AS Roma have a corner."
        },
        {
            "gameTime": "2 - 03:53",
            "label": "",
            "description": "Suso (AC Milan) tries his luck with a low long range effort after receiving a precise pass, but Wojciech Szczesny has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Paolo Mazzoleni blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "We are watching a run of the mill game with only a few moments to ignite the crowd. The players surely can surely perform better, they just need to motivate themselves. It's difficult to say if one side enjoyed any superiority over the other in the first half. The home team tries to prevail using combination football, while the away teams uses mostly counter attacks."
        },
        {
            "gameTime": "1 - 48:12",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 47:10",
            "label": "",
            "description": "Edin Dzeko (AS Roma) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "1 - 41:49",
            "label": "substitution",
            "description": "The manager has been forced to make a substitution and the injured Bruno Peres leaves the pitch to be replaced by Stephan El Shaarawy (AS Roma)."
        },
        {
            "gameTime": "1 - 37:48",
            "label": "injury",
            "description": "Bruno Peres (AS Roma) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 35:44",
            "label": "",
            "description": "Edin Dzeko (AS Roma) latches on to a precise cross on the edge of the box and strikes the ball goalwards. However, it whistles wide of the left post so the goalkeeper can relax. The ball goes out of play and AC Milan will have a goal kick."
        },
        {
            "gameTime": "1 - 34:19",
            "label": "",
            "description": "AS Roma slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "1 - 27:37",
            "label": "corner",
            "description": "Ignazio Abate (AC Milan) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 26:45",
            "label": "penalty-missed",
            "description": "M'Baye Niang (AC Milan) wastes a huge opportunity to score from the penalty spot. He attempts to slot into the bottom right corner, but Wojciech Szczesny pulls off a superb save. The referee and his assistant both point at the corner flag. AC Milan will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 26:30",
            "label": "",
            "description": "M'Baye Niang (AC Milan) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 26:24",
            "label": "penalty",
            "description": "Wojciech Szczesny (AS Roma) brings an opponent down and Paolo Mazzoleni interrupts the game. A penalty is awarded to AC Milan!"
        },
        {
            "gameTime": "1 - 24:36",
            "label": "corner",
            "description": "Andrea Bertolacci (AC Milan) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 24:08",
            "label": "",
            "description": "An attempted cross from M'Baye Niang (AC Milan) is cleared. It will be a corner kick for AC Milan."
        },
        {
            "gameTime": "1 - 22:22",
            "label": "",
            "description": "Mario Pasalic (AC Milan) is able to continue to play."
        },
        {
            "gameTime": "1 - 22:03",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) takes a short corner kick."
        },
        {
            "gameTime": "1 - 21:41",
            "label": "",
            "description": "Diego Perotti (AS Roma) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. Corner kick. AS Roma will have an opportunity."
        },
        {
            "gameTime": "1 - 20:02",
            "label": "injury",
            "description": "Mario Pasalic (AC Milan) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 19:03",
            "label": "corner",
            "description": "AS Roma take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 18:47",
            "label": "",
            "description": "Bruno Peres (AS Roma) tries to slide the ball through to a teammate but it's well blocked by a defender. AS Roma have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 17:55",
            "label": "y-card",
            "description": "Mario Pasalic (AC Milan) receives a yellow card for infringement."
        },
        {
            "gameTime": "1 - 17:38",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "1 - 17:00",
            "label": "",
            "description": "Bruno Peres (AS Roma) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 16:24",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) jumps into a tackle and Paolo Mazzoleni blows his whistle for a foul. AS Roma are awarded the free kick."
        },
        {
            "gameTime": "1 - 15:35",
            "label": "",
            "description": "A lofted cross from Emerson (AS Roma) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The ball has crossed the sideline. AS Roma are taking a throw in."
        },
        {
            "gameTime": "1 - 08:38",
            "label": "",
            "description": "Edin Dzeko (AS Roma) is caught offside, but it was a really close call."
        },
        {
            "gameTime": "1 - 07:32",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) is forced to stop his forward run after being caught in an offside position by the linesman."
        },
        {
            "gameTime": "1 - 04:30",
            "label": "",
            "description": "Federico Fazio (AS Roma) misses a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball floats high over the crossbar!"
        },
        {
            "gameTime": "1 - 04:28",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 03:59",
            "label": "",
            "description": "Diego Perotti (AS Roma) slaloms his way past challenges, but an opposing player does well to get the ball away. AS Roma get a corner."
        },
        {
            "gameTime": "1 - 02:20",
            "label": "corner",
            "description": "Emerson (AS Roma) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 01:42",
            "label": "",
            "description": "Great solo effort by Edin Dzeko (AS Roma) as he beats two defenders before firing in a drive from just outside of the box towards the right side of the goal. The goalkeeper is ready and makes an amazing save. AS Roma earn a corner."
        },
        {
            "gameTime": "1 - 00:47",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) sends a cross into the box, but Gianluigi Donnarumma comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! AS Roma will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Paolo Mazzoleni."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AC Milan are unbeaten over their past 5 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma have won 7x at home this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko has already scored 12 goals and he is the top goal scorer for AS Roma in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We can only hope that the managers will be able to motivate the players and spark them into life in the next games. The football on offer today has been disappointing. The hosts were superior today. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        }
    ],
    "gameAwayTeam": "AC Milan",
    "gameDate": "12/12/2016 - 23:00",
    "gameHomeTeam": "AS Roma",
    "gameScore": "1 - 0"
}