{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-10-29 - 21-45 Juventus 2 - 1 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. The game was quite balanced and neither team had any obvious advantage. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 50:11",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 48:40",
            "label": "",
            "description": "The free kick is taken short by Juventus."
        },
        {
            "gameTime": "2 - 47:48",
            "label": "",
            "description": "Elseid Hysaj (Napoli) makes a reckless foul in order to win the ball from his opponent. Gianluca Rocchi has a clear sight of it and blows his whistle. Juventus win a free kick."
        },
        {
            "gameTime": "2 - 46:30",
            "label": "",
            "description": "Flag up against Jose Callejon (Napoli). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "",
            "description": "A clumsy foul by Amadou Diawara (Napoli) and Gianluca Rocchi blows his whistle."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "",
            "description": "unleashes a shot from 23 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 42:56",
            "label": "",
            "description": "Stefano Sturaro (Juventus) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "2 - 41:30",
            "label": "corner",
            "description": "Emanuele Giaccherini (Napoli) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 41:11",
            "label": "",
            "description": "Omar El Kaddouri (Napoli) connects with the free kick and produces a header goalwards which is well blocked. The goalkeeper doesn't have to worry about that one. Corner kick. Napoli will have an opportunity."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "y-card",
            "description": "Gianluca Rocchi shows a yellow card to Mario Mandzukic (Juventus), who isn't surprised as the tackle was really hard and late. Napoli have a free kick."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "substitution",
            "description": "The game has come to an end for Marek Hamsik. He has contributed as much as he could today. He will be replaced by the fresh legs of Omar El Kaddouri (Napoli)."
        },
        {
            "gameTime": "2 - 36:18",
            "label": "",
            "description": "Lovely cross from Juan Cuadrado to find Gonzalo Higuain (Juventus) deep in the box, but he steers his header well wide of the right post."
        },
        {
            "gameTime": "2 - 35:57",
            "label": "",
            "description": "Marek Hamsik (Napoli) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 34:48",
            "label": "",
            "description": "Amadou Diawara (Napoli) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "funfact",
            "description": "The percentage of ball possession is – 51:49."
        },
        {
            "gameTime": "2 - 31:50",
            "label": "",
            "description": "Alex Sandro (Juventus) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 30:58",
            "label": "substitution",
            "description": "Here is a change. Allan (Napoli) is going off and Maurizio Sarri gives the last tactical orders to ."
        },
        {
            "gameTime": "2 - 30:51",
            "label": "substitution",
            "description": "The manager makes a subsitution with Stefano Sturaro (Juventus) coming on for Hernanes."
        },
        {
            "gameTime": "2 - 29:58",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Juan Cuadrado (Juventus), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 29:31",
            "label": "",
            "description": "Mario Mandzukic (Juventus) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball is out of play and Juventus manage to earn a corner."
        },
        {
            "gameTime": "2 - 27:50",
            "label": "",
            "description": "Dries Mertens (Napoli) strikes a shot towards goal from the edge of the penalty box, but it flies just wide of the left post."
        },
        {
            "gameTime": "2 - 25:26",
            "label": "soccer-ball",
            "description": "Gonzalo Higuain (Juventus) collects a rebound and hits it precisely into the bottom right corner."
        },
        {
            "gameTime": "2 - 25:20",
            "label": "",
            "description": "A cross from Gonzalo Higuain (Juventus) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 23:29",
            "label": "",
            "description": "Hernanes (Juventus) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards over the bar."
        },
        {
            "gameTime": "2 - 22:24",
            "label": "substitution",
            "description": "Massimiliano Allegri decides to make a substitution. Miralem Pjanic will be replaced by Claudio Marchisio (Juventus)."
        },
        {
            "gameTime": "2 - 21:20",
            "label": "",
            "description": "Alex Sandro (Juventus) sends a short pass into the box, Miralem Pjanic takes a touch to control the ball, but one of the defenders robs him of it and clears to safety."
        },
        {
            "gameTime": "2 - 19:24",
            "label": "funfact",
            "description": "The current number of shots on goal is 3:2."
        },
        {
            "gameTime": "2 - 16:54",
            "label": "",
            "description": "Sami Khedira (Juventus) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger."
        },
        {
            "gameTime": "2 - 15:58",
            "label": "y-card",
            "description": "Today's referee Gianluca Rocchi rightly decides to book Hernanes (Juventus) for his harsh tackle."
        },
        {
            "gameTime": "2 - 15:33",
            "label": "substitution",
            "description": "Lorenzo Insigne goes off the pitch and Emanuele Giaccherini (Napoli) comes on."
        },
        {
            "gameTime": "2 - 15:07",
            "label": "",
            "description": "Amadou Diawara (Napoli) has a go from a long way out but it sails way over."
        },
        {
            "gameTime": "2 - 14:25",
            "label": "",
            "description": "The Juventus players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 12:07",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Mario Mandzukic (Juventus), but the defence gets it clear."
        },
        {
            "gameTime": "2 - 10:50",
            "label": "",
            "description": "Sami Khedira (Juventus) sends a teasing cross into the area, but Pepe Reina intercepts the ball."
        },
        {
            "gameTime": "2 - 08:58",
            "label": "soccer-ball",
            "description": "It's a goal! Jose Callejon (Napoli) scores with a brilliant low shot into the middle of the goal after being released inside the box by a superb lofted pass from Lorenzo Insigne. The score is now 0:0."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 06:50",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) produces a dangerous lofted cross into the box which is intercepted. Good work from Napoli as they win a corner."
        },
        {
            "gameTime": "2 - 06:45",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 05:32",
            "label": "",
            "description": "Dries Mertens (Napoli) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. Napoli have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 04:40",
            "label": "soccer-ball",
            "description": "GOAL! A terrible mistake leads to a goal. The defender ends up losing possession, allowing Leonardo Bonucci (Juventus) to pick up the ball before slotting it into the back of the net to make it 1:0."
        },
        {
            "gameTime": "2 - 03:44",
            "label": "corner",
            "description": "Miralem Pjanic (Juventus) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 03:39",
            "label": "",
            "description": "Sami Khedira (Juventus) swings in a cross, but the ball is cleared to safety by one of the defending players. The referee blows his whistle, Juventus are awarded a corner kick."
        },
        {
            "gameTime": "2 - 03:05",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 01:16",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) is picked out by his teammate with a brilliant short pass, but it takes him too long to control the ball inside the box and this allows one of the defending players to rob him."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. There wasn't any evident superiority by either side during the first half. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 46:58",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:21",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) fires in an effort from the free kick from some 25 metres. His strike is very inaccurate and ends in row Z."
        },
        {
            "gameTime": "1 - 42:56",
            "label": "",
            "description": "Miralem Pjanic (Juventus) was trying to get to the ball but clattered into the legs of the opponent as well. Gianluca Rocchi blows his whistle for an infringement. Napoli are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 41:52",
            "label": "",
            "description": "Juventus seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 39:08",
            "label": "substitution",
            "description": "Massimiliano Allegri is forced to make a change. Giorgio Chiellini is unable to continue due to injury, Juan Cuadrado (Juventus) comes on."
        },
        {
            "gameTime": "1 - 36:45",
            "label": "",
            "description": "Allan (Napoli) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 34:58",
            "label": "injury",
            "description": "The game is interrupted now, Allan (Napoli) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 33:56",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) sends a cross into the box, but Gianluigi Buffon comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 32:52",
            "label": "",
            "description": "Gianluca Rocchi blows his whistle for a foul after Mario Mandzukic (Juventus) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 30:59",
            "label": "",
            "description": "Miralem Pjanic (Juventus) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "1 - 30:52",
            "label": "",
            "description": "Miralem Pjanic (Juventus) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 29:57",
            "label": "y-card",
            "description": "The foul by Lorenzo Insigne (Napoli) is worthy of a card and a yellow is duly shown by Gianluca Rocchi. That's a free kick to Juventus."
        },
        {
            "gameTime": "1 - 29:07",
            "label": "",
            "description": "Allan (Napoli) hammers the ball goalwards from about 24 metres. The shot is directed low to the middle of the target but is thwarted by a save from Gianluigi Buffon."
        },
        {
            "gameTime": "1 - 25:30",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) shows too much aggression while trying to break free from his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 25:30",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) gets on the ball and beats an opponent, but his run is stopped by the referee Gianluca Rocchi who sees an offensive foul."
        },
        {
            "gameTime": "1 - 25:15",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 24:47",
            "label": "",
            "description": "Jose Callejon (Napoli) shoots from outside the box, but his effort is blocked. The referee points to the corner flag and Napoli will take a corner."
        },
        {
            "gameTime": "1 - 24:15",
            "label": "corner",
            "description": "Miralem Pjanic (Juventus) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 23:35",
            "label": "",
            "description": "Great chance! Gonzalo Higuain (Juventus) collects a great pass inside the box, but the goalkeeper does well to stop his effort. The ball goes behind for a corner. Juventus will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 22:45",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 21:14",
            "label": "y-card",
            "description": "Alex Sandro (Juventus) sees a yellow card from Gianluca Rocchi after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 20:29",
            "label": "y-card",
            "description": "A yellow card for a tackle by Giorgio Chiellini (Juventus). Gianluca Rocchi doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 19:39",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) finds space on the edge of the box, but his wild shot goes high over the bar."
        },
        {
            "gameTime": "1 - 18:22",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Napoli was in an offside position."
        },
        {
            "gameTime": "1 - 17:47",
            "label": "",
            "description": "Sami Khedira (Juventus) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "1 - 17:35",
            "label": "",
            "description": "A cross is clipped into the penalty area by Sami Khedira (Juventus) but poses no threat."
        },
        {
            "gameTime": "1 - 14:54",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) swings a cross into the box, but it's far too close to Gianluigi Buffon, who smothers the ball."
        },
        {
            "gameTime": "1 - 13:52",
            "label": "",
            "description": "A pass by Sami Khedira (Juventus) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 12:29",
            "label": "",
            "description": "Jose Callejon (Napoli) was standing in a clear offside position, making it an easy call for the linesman."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "",
            "description": "Elseid Hysaj (Napoli) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 11:22",
            "label": "",
            "description": "A defence splitting pass into the box is almost received by Mario Mandzukic (Juventus), but Pepe Reina is quick enough and comes off his line to intercept the pass."
        },
        {
            "gameTime": "1 - 11:01",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 10:14",
            "label": "",
            "description": "Jose Callejon (Napoli) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "1 - 09:52",
            "label": "",
            "description": "Jose Callejon (Napoli) commits a foul and Gianluca Rocchi immediately signals a free kick."
        },
        {
            "gameTime": "1 - 08:42",
            "label": "",
            "description": "Juventus keep the ball well and push forward with purpose, but here comes an interception from the opposition."
        },
        {
            "gameTime": "1 - 06:11",
            "label": "",
            "description": "The free kick is taken by Miralem Pjanic (Juventus), but ball is cleared."
        },
        {
            "gameTime": "1 - 05:56",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) jumps into a tackle and Gianluca Rocchi blows his whistle for a foul. Juventus will take a free kick."
        },
        {
            "gameTime": "1 - 03:58",
            "label": "",
            "description": "Dries Mertens (Napoli) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 01:59",
            "label": "",
            "description": "Juventus players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 00:06",
            "label": "",
            "description": "Juventus will kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Gianluca Rocchi."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Napoli is Jose Callejon with 7 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 3:1 in the last game between Juventus and Atalanta."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. The game was quite balanced and neither team had any obvious advantage. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "29/10/2016 - 21:45",
    "gameHomeTeam": "Juventus",
    "gameScore": "2 - 1"
}