{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-05-28 - 19-00 Sampdoria 2 - 4 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:09",
            "label": "whistle",
            "description": "Luca Banti is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "corner",
            "description": "Ricardo Alvarez (Sampdoria) will take the corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:47",
            "label": "soccer-ball",
            "description": "Goal Ricardo Alvarez (Sampdoria)! Ricardo Alvarez (Sampdoria) was put through by Patrik Schick and he showed brilliant composure inside the box to fire into the bottom left corner. 2:4."
        },
        {
            "gameTime": "2 - 43:16",
            "label": "",
            "description": "The game is interrupted as Dries Mertens (Napoli) is flagged offside."
        },
        {
            "gameTime": "2 - 41:26",
            "label": "corner",
            "description": "Ricardo Alvarez (Sampdoria) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 38:27",
            "label": "substitution",
            "description": "We are about to witness a substitution. Emanuele Giaccherini (Napoli) is replacing Marek Hamsik."
        },
        {
            "gameTime": "2 - 37:38",
            "label": "corner",
            "description": "Ricardo Alvarez (Sampdoria) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 36:25",
            "label": "funfact",
            "description": "The percentage of ball possession is – 32:68."
        },
        {
            "gameTime": "2 - 32:01",
            "label": "corner",
            "description": "Jose Callejon (Napoli) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 31:48",
            "label": "substitution",
            "description": "Marco Giampaolo has decided to substitute Edgar Barreto and he is replaced by Ricardo Alvarez (Sampdoria)."
        },
        {
            "gameTime": "2 - 26:50",
            "label": "",
            "description": "Karol Linetty (Sampdoria) skips perfectly past challenges but misdirects his shot from the edge of the box. The ball flies a few yards over the bar."
        },
        {
            "gameTime": "2 - 25:39",
            "label": "substitution",
            "description": "Substitution. Amadou Diawara (Napoli) in, Jorginho out."
        },
        {
            "gameTime": "2 - 22:17",
            "label": "corner",
            "description": "The corner from Faouzi Ghoulam (Napoli) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 21:52",
            "label": "corner",
            "description": "Jose Callejon (Napoli) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender. Napoli have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 21:41",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Piotr Zielinski walks off the pitch to be replaced by Marko Rog (Napoli)."
        },
        {
            "gameTime": "2 - 20:36",
            "label": "substitution",
            "description": "Marco Giampaolo prepares a substitution. Lucas Torreira is replaced by Angelo Palombo (Sampdoria)."
        },
        {
            "gameTime": "2 - 19:55",
            "label": "soccer-ball",
            "description": "Goal! Jose Callejon (Napoli) unleashes a first time shot from inside the box and beats the goalkeeper into the bottom left corner. 1:4."
        },
        {
            "gameTime": "2 - 18:18",
            "label": "corner",
            "description": "The referee awards a corner and Lucas Torreira (Sampdoria) goes over to take it."
        },
        {
            "gameTime": "2 - 14:56",
            "label": "",
            "description": "Vlad Chiriches (Napoli) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but it goes well wide of the left post."
        },
        {
            "gameTime": "2 - 14:38",
            "label": "corner",
            "description": "Jose Callejon (Napoli) will take a corner kick."
        },
        {
            "gameTime": "2 - 13:18",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner kick but the ball only finds the head of an opponent. Napoli force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 11:04",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner."
        },
        {
            "gameTime": "2 - 10:51",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance. It will be a corner kick for Napoli."
        },
        {
            "gameTime": "2 - 10:27",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) races towards goal but the defender gets back well to make a challenge. The referee and one of his assistants signal for a corner kick to Napoli."
        },
        {
            "gameTime": "2 - 09:45",
            "label": "corner",
            "description": "Corner kick. Faouzi Ghoulam (Napoli) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 09:29",
            "label": "",
            "description": "Marek Hamsik (Napoli) gets on the end of a good pass and from mid range he unleashes a decent strike, but the shot is blocked by the defender. The ball is out of play. Napoli will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 08:30",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 07:27",
            "label": "substitution",
            "description": "It's time for a substitution. Dennis Praet (Sampdoria) comes on in place of Bruno Fernandes."
        },
        {
            "gameTime": "2 - 07:12",
            "label": "y-card",
            "description": "Milan Skriniar (Sampdoria) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 06:26",
            "label": "corner",
            "description": "Lucas Torreira (Sampdoria) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 04:55",
            "label": "soccer-ball",
            "description": "Goal! Patrik Schick finds Fabio Quagliarella (Sampdoria) and he shows great determination to get to the ball and plant a header into the back of the net. 1:3."
        },
        {
            "gameTime": "2 - 03:35",
            "label": "soccer-ball",
            "description": "Goal! Nice headed pass by Jose Callejon to Marek Hamsik (Napoli), who latches on to it and puts the ball into the back of the net with a fine header. 1:3."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:11",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 41:55",
            "label": "soccer-ball",
            "description": "Goal! Marek Hamsik tees up Lorenzo Insigne (Napoli) on the edge of the box and he fires the ball into the top right corner. 0:2."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "",
            "description": "Napoli are ruled offside."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Dries Mertens (Napoli) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 38:39",
            "label": "injury",
            "description": "Dries Mertens (Napoli) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 35:51",
            "label": "soccer-ball",
            "description": "GOAL! Dries Mertens (Napoli) gets to the ball on the edge of the box after a huge mistake by an opponent and slams it into the back of the net. He makes it 0:1."
        },
        {
            "gameTime": "1 - 34:48",
            "label": "",
            "description": "What a chance for Lorenzo Insigne (Napoli) as he produced a stunning snap shot from the edge of the box! The goalkeeper was a bit lucky as the ball went just wide of the right post."
        },
        {
            "gameTime": "1 - 33:51",
            "label": "",
            "description": "Bruno Fernandes (Sampdoria) unleashes a shot from 22 metres out but is unable to find the target and it goes well wide of the left post."
        },
        {
            "gameTime": "1 - 31:48",
            "label": "",
            "description": "Fabio Quagliarella (Sampdoria) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "1 - 27:42",
            "label": "",
            "description": "Fabio Quagliarella (Sampdoria) is flagged for offside."
        },
        {
            "gameTime": "1 - 26:50",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) swings a cross into the box, but it's far too close to Christian Puggioni, who smothers the ball."
        },
        {
            "gameTime": "1 - 24:53",
            "label": "",
            "description": "Marek Hamsik (Napoli) jumps into a tackle and Luca Banti blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 22:47",
            "label": "",
            "description": "Marek Hamsik (Napoli) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 15:44",
            "label": "",
            "description": "Christian Puggioni (Sampdoria) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 11:58",
            "label": "",
            "description": "Excellent touch by Piotr Zielinski (Napoli)! He latches on to a precise pass on the edge of the box and produces a shot goalwards which goes way wide of the left post."
        },
        {
            "gameTime": "1 - 11:18",
            "label": "corner",
            "description": "Jose Callejon (Napoli) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from the edge of the box by Bruno Fernandes (Sampdoria) as his effort only hit the wall."
        },
        {
            "gameTime": "1 - 04:45",
            "label": "",
            "description": "Elseid Hysaj (Napoli) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul. Sampdoria are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 03:30",
            "label": "",
            "description": "Dries Mertens (Napoli) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Christian Puggioni was alert and the score remained the same."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Sampdoria will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Luca Banti."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli have an impressive 4 game winning streak."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dries Mertens from Napoli will look to add to his goal tally, he has netted 27 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sampdoria have not tasted victory over their past 7 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Luca Banti is looking at his watch and immediately ends this match."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "28/05/2017 - 19:00",
    "gameHomeTeam": "Sampdoria",
    "gameScore": "2 - 4"
}