{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-16 - 21-45 AS Roma 1 - 1 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. You have to say that the visitors have been the better side. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 49:49",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 49:46",
            "label": "",
            "description": "Sergi Roberto (Barcelona) sends a rebound goalwards towards the left hand post, but the goalkeeper stretches to stop it."
        },
        {
            "gameTime": "2 - 49:45",
            "label": "corner",
            "description": "The corner from Neymar (Barcelona) is intercepted by Morgan De Sanctis."
        },
        {
            "gameTime": "2 - 49:15",
            "label": "",
            "description": "Jordi Alba (Barcelona) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him. Good work from Barcelona as they win a corner."
        },
        {
            "gameTime": "2 - 48:23",
            "label": "corner",
            "description": "Morgan De Sanctis comes off his line to intercept the corner from Neymar (Barcelona)."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "",
            "description": "Gerard Pique (Barcelona) meets a cross inside the box, but his header is blocked by an opposing player. The ball is out of play and the linesman points at the corner flag. Corner to Barcelona."
        },
        {
            "gameTime": "2 - 47:06",
            "label": "corner",
            "description": "Neymar (Barcelona) takes a short corner kick."
        },
        {
            "gameTime": "2 - 46:49",
            "label": "",
            "description": "Wow, what an escape. Neymar (Barcelona) has an effort from inside the box but it's brilliantly blocked. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 45:24",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Luis Suarez (Barcelona)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 5 min. of added time."
        },
        {
            "gameTime": "2 - 42:44",
            "label": "",
            "description": "Edin Dzeko (AS Roma) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Marc Andre ter Stegen was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 40:51",
            "label": "",
            "description": "Mohamed Salah (AS Roma) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 39:43",
            "label": "substitution",
            "description": "Here is a change. Alessandro Florenzi is going off and Rudi Garcia gives the last tactical orders to Vassilios Torosidis (AS Roma)."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "",
            "description": "Lionel Messi (Barcelona) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "2 - 35:51",
            "label": "substitution",
            "description": "Substitution. Iago Falque is replaced by Juan Iturbe (AS Roma)."
        },
        {
            "gameTime": "2 - 35:09",
            "label": "corner",
            "description": "Neymar (Barcelona) swings in the corner, but the goalkeeper does a brilliant job to intercept the effort."
        },
        {
            "gameTime": "2 - 34:51",
            "label": "",
            "description": "Morgan De Sanctis was forced into action to thwart Andres Iniesta (Barcelona). He found himself some space after picking up a pass and unleashed a shot to the left post but couldn't beat the keeper. The referee and one of his assistants signal for a corner kick to Barcelona."
        },
        {
            "gameTime": "2 - 33:00",
            "label": "",
            "description": "Marc Andre ter Stegen doesn't have to worry about this one. Edin Dzeko plays a pass into the feet of Iago Falque (AS Roma), who is unable to find the target as his effort from inside the box goes high over the bar."
        },
        {
            "gameTime": "2 - 32:20",
            "label": "",
            "description": "OFF THE WOODWORK! Lionel Messi (Barcelona) picks up the ball inside the box and produces a snap shot that smashes against the crossbar!"
        },
        {
            "gameTime": "2 - 32:03",
            "label": "",
            "description": "Lionel Messi (Barcelona) plays an extraordinary diagonal pass and Neymar darts into free space to control the ball."
        },
        {
            "gameTime": "2 - 31:42",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 31:22",
            "label": "",
            "description": "Neymar (Barcelona) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. Barcelona force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 30:34",
            "label": "",
            "description": "Alessandro Florenzi (AS Roma) strikes from the edge of the box, but hits it really poorly and sends the ball way over the bar."
        },
        {
            "gameTime": "2 - 29:42",
            "label": "y-card",
            "description": "A yellow card for a tackle by Gerard Pique (Barcelona). Bjorn Kuipers doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 26:51",
            "label": "",
            "description": "Lionel Messi (Barcelona) plays a through ball but overhits it."
        },
        {
            "gameTime": "2 - 24:42",
            "label": "",
            "description": "Lucas Digne (AS Roma) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 21:15",
            "label": "",
            "description": "Lionel Messi (Barcelona) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "2 - 19:52",
            "label": "substitution",
            "description": "Rafinha is substituted due to injury. Luis Enrique gives a chance to Javier Mascherano (Barcelona)."
        },
        {
            "gameTime": "2 - 17:56",
            "label": "injury",
            "description": "Rafinha (Barcelona) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 17:02",
            "label": "y-card",
            "description": "Bjorn Kuipers shows the yellow card to Radja Nainggolan (AS Roma) for a heavy challenge."
        },
        {
            "gameTime": "2 - 15:47",
            "label": "substitution",
            "description": "Substitution. Rafinha (Barcelona) on for Ivan Rakitic."
        },
        {
            "gameTime": "2 - 12:33",
            "label": "",
            "description": "Luis Suarez (Barcelona) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net."
        },
        {
            "gameTime": "2 - 11:49",
            "label": "",
            "description": "Lionel Messi (Barcelona) sends a long ball in, but Morgan De Sanctis comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 08:53",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 08:36",
            "label": "",
            "description": "Neymar (Barcelona) has a shot blocked from inside the box. The ball goes out of play. Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "2 - 08:05",
            "label": "",
            "description": "The flag goes up and the referee blows his whistle another offside by Luis Suarez (Barcelona), who has already been caught several times today."
        },
        {
            "gameTime": "2 - 06:55",
            "label": "",
            "description": "Some great controlled play and passing from Barcelona. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 04:32",
            "label": "substitution",
            "description": "Wojciech Szczesny is being substituted because of an injury. Rudi Garcia sends Morgan De Sanctis (AS Roma) on the pitch."
        },
        {
            "gameTime": "2 - 02:47",
            "label": "injury",
            "description": "Looks like Wojciech Szczesny (AS Roma) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 02:23",
            "label": "",
            "description": "Lionel Messi (Barcelona) darts into the penalty area to latch on to a pass, and he unleashes a shot in the direction of the right post. Morgan De Sanctis is alert and denies him with a nice save."
        },
        {
            "gameTime": "2 - 00:42",
            "label": "",
            "description": "Sergi Roberto (Barcelona) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We are seeing a great game so far, let's hope the players will be able to sustain their level of performance and keep entertaining the fans in such a fabulous way. The away side is controlling this game. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "Luis Suarez (Barcelona) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "1 - 44:56",
            "label": "",
            "description": "Mohamed Salah (AS Roma) takes the chance to have an effort at goal from inside the box but blazes it just over the crossbar."
        },
        {
            "gameTime": "1 - 44:39",
            "label": "",
            "description": "Flag goes up against Iago Falque (AS Roma) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 44:27",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the right post is, however, superbly saved by Marc Andre ter Stegen!"
        },
        {
            "gameTime": "1 - 41:49",
            "label": "",
            "description": "Alessandro Florenzi (AS Roma) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball."
        },
        {
            "gameTime": "1 - 39:31",
            "label": "",
            "description": "Half chance! Lionel Messi (Barcelona) plays a pass into the box, but Morgan De Sanctis reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 36:24",
            "label": "",
            "description": "Lionel Messi (Barcelona) unleashed a promising strike from a long distance free kick, but his effort goes high over the bar so it's going to be a goal kick."
        },
        {
            "gameTime": "1 - 35:47",
            "label": "",
            "description": "Poor challenge! Radja Nainggolan (AS Roma) is penalised for tripping and Bjorn Kuipers blows his whistle. Barcelona will take a free kick."
        },
        {
            "gameTime": "1 - 33:46",
            "label": "",
            "description": "Lionel Messi (Barcelona) fires the ball towards goal from just outside the penalty area, but it goes narrowly over the crossbar after coming very close to hitting the roof of the net."
        },
        {
            "gameTime": "1 - 30:17",
            "label": "soccer-ball",
            "description": "Goal! The ball sits up nicely for Alessandro Florenzi (AS Roma) and he hits a crackerjack of a strike that ricochets off the left post into the back of the net. This could be the goal of the month."
        },
        {
            "gameTime": "1 - 27:36",
            "label": "",
            "description": "Lucas Digne (AS Roma) swings a cross into the box, but it's far too close to Marc Andre ter Stegen, who smothers the ball."
        },
        {
            "gameTime": "1 - 25:26",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 25:06",
            "label": "",
            "description": "Gerard Pique (Barcelona) picks out Lionel Messi with a fine lofted pass, but the latter wasn't able to create some space to get into shooting range. The ball is out of play. Barcelona win a corner kick."
        },
        {
            "gameTime": "1 - 23:26",
            "label": "",
            "description": "Wonderful pass from Andres Iniesta (Barcelona) for Luis Suarez, but they can't profit from it as Morgan De Sanctis comes off his line to collect."
        },
        {
            "gameTime": "1 - 20:49",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Ivan Rakitic puts the ball on a plate for Luis Suarez (Barcelona), who has an easy finish with a header into an empty net. The score is 0:1."
        },
        {
            "gameTime": "1 - 19:33",
            "label": "",
            "description": "Luis Suarez (Barcelona) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 17:02",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "1 - 16:23",
            "label": "",
            "description": "Barcelona are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 13:16",
            "label": "",
            "description": "A crossfield pass from Neymar (Barcelona) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 12:26",
            "label": "",
            "description": "Bjorn Kuipers blows his whistle. Alessandro Florenzi (AS Roma) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 10:45",
            "label": "",
            "description": "Lionel Messi (Barcelona) finds some space inside the box and produces a first time shot that goes high over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "1 - 09:52",
            "label": "",
            "description": "Jordi Alba clips a neat ball into the box towards Luis Suarez (Barcelona), whose header from the centre of the box goes a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 08:37",
            "label": "",
            "description": "Edin Dzeko (AS Roma) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "1 - 07:26",
            "label": "corner",
            "description": "Iago Falque (AS Roma) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 07:13",
            "label": "",
            "description": "The ball is cleared after Mohamed Salah (AS Roma) attempted to dribble past an opposing player. The referee points to the corner flag. It's a corner to AS Roma."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "Luis Suarez (Barcelona) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 04:21",
            "label": "",
            "description": "Mohamed Salah (AS Roma) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 03:48",
            "label": "",
            "description": "Lionel Messi (Barcelona) makes a yard for himself and unleashes a stunning shot from 18 metres out. His great effort, however, goes painfully over the crossbar."
        },
        {
            "gameTime": "1 - 02:22",
            "label": "",
            "description": "Lionel Messi (Barcelona) attempted to pick out a free teammate inside the box, but Morgan De Sanctis comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 01:48",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) trips an opposition player and Bjorn Kuipers signals a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bjorn Kuipers will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. You have to say that the visitors have been the better side. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "16/09/2015 - 21:45",
    "gameHomeTeam": "AS Roma",
    "gameScore": "1 - 1"
}