{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-24 - 20-00 BATE 1 - 1 Bayer Leverkusen/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. It was an even match on the whole, with both sides enjoying spells in the ascendancy. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        },
        {
            "gameTime": "2 - 47:31",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:22",
            "label": "y-card",
            "description": "Giulio Donati (Bayer Leverkusen) receives a yellow card for infringement."
        },
        {
            "gameTime": "2 - 45:42",
            "label": "",
            "description": "Vladlen Yurchenko (Bayer Leverkusen) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 43:19",
            "label": "substitution",
            "description": "Substitution. Vladlen Yurchenko (Bayer Leverkusen) receives a signal from the referee and is now allowed to enter the pitch as Admir Mehmedi walks off."
        },
        {
            "gameTime": "2 - 42:30",
            "label": "",
            "description": "Chicharito (Bayer Leverkusen) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 42:24",
            "label": "",
            "description": "Wendell (Bayer Leverkusen) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Sergey Chernik guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 40:35",
            "label": "",
            "description": "Bayer Leverkusen are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "y-card",
            "description": "Clement Turpin shows a yellow card to Maksim Volodjko (BATE) for his blatant foul."
        },
        {
            "gameTime": "2 - 38:04",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the right post."
        },
        {
            "gameTime": "2 - 37:40",
            "label": "",
            "description": "Julian Brandt (Bayer Leverkusen) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 36:36",
            "label": "",
            "description": "Mikhail Gordejchuk (BATE) commits an ugly challenge. The referee sees it and immediately blows his whistle. Bayer Leverkusen are awarded a free kick."
        },
        {
            "gameTime": "2 - 36:21",
            "label": "funfact",
            "description": "The shots on goal statistics – 1:7."
        },
        {
            "gameTime": "2 - 34:55",
            "label": "",
            "description": "Mikhail Gordejchuk (BATE) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 34:20",
            "label": "",
            "description": "Nemanja Nikolic (BATE) collects a pass and strikes from about 21 metres out. It's a poor attempt which flies well over the bar."
        },
        {
            "gameTime": "2 - 33:43",
            "label": "y-card",
            "description": "Clement Turpin shows the yellow card to Wendell (Bayer Leverkusen) for a heavy challenge."
        },
        {
            "gameTime": "2 - 32:53",
            "label": "substitution",
            "description": "Aleksandr Yermakovich has decided to introduce fresh legs, with Nemanja Nikolic (BATE) replacing Aleksandr Volodjko."
        },
        {
            "gameTime": "2 - 32:22",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Hakan Calhanoglu leaves the pitch and Julian Brandt (Bayer Leverkusen) comes on."
        },
        {
            "gameTime": "2 - 31:39",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 31:14",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Bayer Leverkusen force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 30:53",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "2 - 29:56",
            "label": "",
            "description": "was too fierce in his attempt to get the ball from his opponent and Clement Turpin blows for a foul. A free kick has been awarded to Bayer Leverkusen."
        },
        {
            "gameTime": "2 - 28:56",
            "label": "",
            "description": "Kevin Kampl (Bayer Leverkusen) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 28:00",
            "label": "substitution",
            "description": "Here is a change. Aljaksandr Hleb is going off and Aleksandr Yermakovich gives the last tactical orders to Aleksandr Karnitskiy (BATE)."
        },
        {
            "gameTime": "2 - 25:21",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 24:54",
            "label": "",
            "description": "The ball is cleared after Admir Mehmedi (Bayer Leverkusen) attempted to dribble past an opposing player. Bayer Leverkusen force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 22:56",
            "label": "soccer-ball",
            "description": "GOAL 1:1! Hakan Calhanoglu found Admir Mehmedi (Bayer Leverkusen) inside the box, he spotted goalkeeper Sergey Chernik off his line and chipped the ball into the net. What a cheeky lob!"
        },
        {
            "gameTime": "2 - 21:24",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "2 - 19:42",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "2 - 17:49",
            "label": "y-card",
            "description": "Clement Turpin shows a yellow card to Denis Polyakov (BATE) for a tough tackle."
        },
        {
            "gameTime": "2 - 16:53",
            "label": "",
            "description": "Admir Mehmedi (Bayer Leverkusen) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards over the bar."
        },
        {
            "gameTime": "2 - 16:24",
            "label": "corner",
            "description": "The resulting corner, taken by Hakan Calhanoglu (Bayer Leverkusen), comes to nothing."
        },
        {
            "gameTime": "2 - 16:07",
            "label": "",
            "description": "Wendell (Bayer Leverkusen) wastes a good opportunity as his pass into the box is blocked by the defence. The ball goes out of play and Bayer Leverkusen have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 15:20",
            "label": "funfact",
            "description": "The possession of the ball – 37:63."
        },
        {
            "gameTime": "2 - 14:27",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) attempts to score from 22 metres out, but his decent effort flies towards the middle of the target and is stopped by Sergey Chernik. It didn't really trouble him."
        },
        {
            "gameTime": "2 - 12:21",
            "label": "",
            "description": "Admir Mehmedi (Bayer Leverkusen) latches on to a pass on the edge of the box, but he can't get any power into the shot and fails to trouble Sergey Chernik."
        },
        {
            "gameTime": "2 - 11:28",
            "label": "",
            "description": "Giulio Donati (Bayer Leverkusen) fouls an opponent. At least that's what referee Clement Turpin signals."
        },
        {
            "gameTime": "2 - 10:39",
            "label": "",
            "description": "Bayer Leverkusen slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "2 - 09:35",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 09:14",
            "label": "",
            "description": "Admir Mehmedi (Bayer Leverkusen) crosses the ball into the box, but one of the defending players averts the threat. The linesman points to the corner flag, Bayer Leverkusen are going to take it."
        },
        {
            "gameTime": "2 - 08:43",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 08:14",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) tries his luck from the edge of the box after a brilliant solo effort, but it is well blocked by the defender. Bayer Leverkusen will take a corner kick."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "",
            "description": "Maksim Zhavnerchik (BATE) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 07:38",
            "label": "",
            "description": "Clement Turpin interrupts the game for a tactical foul by Christoph Kramer (Bayer Leverkusen). BATE will take a free kick near the side line."
        },
        {
            "gameTime": "2 - 06:14",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) gets a shot from distance but fails to generate enough power to beat the goalkeeper."
        },
        {
            "gameTime": "2 - 05:40",
            "label": "",
            "description": "Giulio Donati (Bayer Leverkusen) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 03:43",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) had a golden opportunity. He volleyed from point blank range towards the middle of the goal, but Sergey Chernik was alert and made an amazing save!"
        },
        {
            "gameTime": "2 - 02:51",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "2 - 01:43",
            "label": "",
            "description": "Chicharito (Bayer Leverkusen) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the left post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Aleksandr Yermakovich gives a chance to Maksim Volodjko (BATE) and Aleksey Rios is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. It has been a tight contest so far. The home players attempt to beat the opposition's defence using mostly counter attacks. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 45:19",
            "label": "whistle",
            "description": "Clement Turpin has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 44:40",
            "label": "",
            "description": "The game is interrupted as Dmitri Mozolevski (BATE) is flagged offside."
        },
        {
            "gameTime": "1 - 44:18",
            "label": "",
            "description": "Sergey Chernik pulls off a great save to deny Chicharito (Bayer Leverkusen) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "1 - 43:05",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) tries his luck with a shot from 23 metres out, but his effort goes well wide of the left post."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Admir Mehmedi (Bayer Leverkusen)."
        },
        {
            "gameTime": "1 - 39:41",
            "label": "",
            "description": "Filip Mladenovic (BATE) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "1 - 39:26",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. BATE are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 37:59",
            "label": "",
            "description": "The cross into the penalty area from Giulio Donati (Bayer Leverkusen) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "1 - 36:47",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 35:18",
            "label": "",
            "description": "BATE are playing excellent possession football at the moment by exchanging some long passes."
        },
        {
            "gameTime": "1 - 33:33",
            "label": "y-card",
            "description": "The foul by Kevin Kampl (Bayer Leverkusen) is worthy of a card and a yellow is duly shown by Clement Turpin."
        },
        {
            "gameTime": "1 - 32:23",
            "label": "",
            "description": "Filip Mladenovic (BATE) commits a foul and Clement Turpin immediately signals a free kick."
        },
        {
            "gameTime": "1 - 31:48",
            "label": "y-card",
            "description": "Aljaksandr Hleb (BATE) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "1 - 31:16",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) tries a shot from distance, but the goalkeeper can stay calm as it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 29:46",
            "label": "",
            "description": "Mikhail Gordejchuk (BATE) sprays a pass out to Aleksey Rios, but he can't beat his man to get to the ball."
        },
        {
            "gameTime": "1 - 28:55",
            "label": "",
            "description": "Clement Turpin blows for a foul after Admir Mehmedi (Bayer Leverkusen) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 27:39",
            "label": "",
            "description": "Excellent touch by Admir Mehmedi (Bayer Leverkusen)! He latches on to a precise pass on the edge of the box and produces a shot goalwards which goes way wide of the left post."
        },
        {
            "gameTime": "1 - 25:59",
            "label": "",
            "description": "The foul by Denis Polyakov (BATE) was seen by Clement Turpin who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 25:55",
            "label": "",
            "description": "Filip Mladenovic (BATE) takes a direct free kick."
        },
        {
            "gameTime": "1 - 24:58",
            "label": "",
            "description": "Christoph Kramer (Bayer Leverkusen) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play. BATE have been awarded a free kick."
        },
        {
            "gameTime": "1 - 22:54",
            "label": "",
            "description": "The Bayer Leverkusen players keep hold of the ball by exchanging some long passes. One inaccurate pass, however, surrenders possession."
        },
        {
            "gameTime": "1 - 21:17",
            "label": "",
            "description": "Dmitri Mozolevski (BATE) received a clever through ball which could have put him in a promising position, but the defence was alert to the danger."
        },
        {
            "gameTime": "1 - 20:14",
            "label": "",
            "description": "Clement Turpin blows the whistle, Karim Bellarabi (Bayer Leverkusen) is penalised for a foul."
        },
        {
            "gameTime": "1 - 19:14",
            "label": "",
            "description": "Filip Mladenovic (BATE) races towards goal but the defender gets back well to make a challenge. The ball goes out of play and Bayer Leverkusen will have a goal kick."
        },
        {
            "gameTime": "1 - 18:28",
            "label": "",
            "description": "wins himself just enough space inside the box to connect with the corner. His header flies towards the middle of the goal, but the goalkeeper blocks the effort."
        },
        {
            "gameTime": "1 - 18:15",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) will take the corner."
        },
        {
            "gameTime": "1 - 17:45",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball. The ball goes out for a corner. Bayer Leverkusen can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 17:39",
            "label": "",
            "description": "The Bayer Leverkusen players keep hold of the ball by exchanging some long passes. One inaccurate pass, however, surrenders possession."
        },
        {
            "gameTime": "1 - 15:13",
            "label": "",
            "description": "Kevin Kampl (Bayer Leverkusen) gets on the ball and beats an opponent, but his run is stopped by the referee Clement Turpin who sees an offensive foul."
        },
        {
            "gameTime": "1 - 14:36",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) takes a mid range shot, but the ball sails high over the bar."
        },
        {
            "gameTime": "1 - 14:26",
            "label": "",
            "description": "Bayer Leverkusen show off their ball retention skills as they exchange one two passes and the move is only interrupted when the final pass is intercepted."
        },
        {
            "gameTime": "1 - 13:35",
            "label": "",
            "description": "Good clearance! Admir Mehmedi (Bayer Leverkusen) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him."
        },
        {
            "gameTime": "1 - 13:03",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 12:14",
            "label": "",
            "description": "Admir Mehmedi (Bayer Leverkusen) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "1 - 10:59",
            "label": "",
            "description": "Giulio Donati (Bayer Leverkusen) sends a long ball in, but Sergey Chernik comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 08:20",
            "label": "y-card",
            "description": "Clement Turpin shows a yellow card to Mikhail Gordejchuk (BATE), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 07:27",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 07:05",
            "label": "corner",
            "description": "Karim Bellarabi (Bayer Leverkusen) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 06:34",
            "label": "",
            "description": "Giulio Donati (Bayer Leverkusen) fails to send a pass into the box as his effort is cut out. Bayer Leverkusen force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "",
            "description": "Neat passing move from Bayer Leverkusen in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 03:56",
            "label": "",
            "description": "The Bayer Leverkusen players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 01:44",
            "label": "soccer-ball",
            "description": "Stunning strike! Mikhail Gordejchuk (BATE) latches on to a precise through ball from Aleksandr Volodjko and surprises the goalkeeper with a low shot from the edge of the box that goes into the middle of the goal. The score is now 1:0."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Bayer Leverkusen will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Clement Turpin will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. It was an even match on the whole, with both sides enjoying spells in the ascendancy. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        }
    ],
    "gameAwayTeam": "Bayer Leverkusen",
    "gameDate": "24/11/2015 - 20:00",
    "gameHomeTeam": "BATE",
    "gameScore": "1 - 1"
}