{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-04-01 - 21-45 AS Roma 2 - 0 Empoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:04",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:45",
            "label": "",
            "description": "Mohamed Salah (AS Roma) picks up a long through ball, but Lukasz Skorupski deserves praise for a brilliant reaction and interception."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "corner",
            "description": "A corner kick by AS Roma is thwarted by the well prepared Lukasz Skorupski (Empoli)."
        },
        {
            "gameTime": "2 - 41:47",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 39:57",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 39:51",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Federico Fazio as he is replaced by Juan Jesus (AS Roma)."
        },
        {
            "gameTime": "2 - 39:07",
            "label": "",
            "description": "Marcel Buchel (Empoli) blasts the ball high over the crossbar."
        },
        {
            "gameTime": "2 - 37:43",
            "label": "injury",
            "description": "Konstantinos Manolas (AS Roma) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 36:24",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) sends an accurate pass to Radja Nainggolan, who controls the ball with a fine first touch."
        },
        {
            "gameTime": "2 - 31:16",
            "label": "substitution",
            "description": "Federico Barba is substituted due to injury. Giovanni Martusciello gives a chance to Uros Cosic (Empoli)."
        },
        {
            "gameTime": "2 - 29:30",
            "label": "corner",
            "description": "AS Roma didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 27:30",
            "label": "substitution",
            "description": "Giovanni Martusciello prepares a substitution. Omar El Kaddouri is replaced by Massimo Maccarone (Empoli)."
        },
        {
            "gameTime": "2 - 27:27",
            "label": "substitution",
            "description": "The manager makes a subsitution with Francesco Totti (AS Roma) coming on for Edin Dzeko."
        },
        {
            "gameTime": "2 - 23:30",
            "label": "",
            "description": "A cross arrives in the goalmouth from the resulting corner kick. Mohamed Salah (AS Roma) outjumps the defence, but his promising header bounces away off the bar!"
        },
        {
            "gameTime": "2 - 23:20",
            "label": "corner",
            "description": "The ball goes out for a corner. AS Roma can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 22:07",
            "label": "",
            "description": "Wojciech Szczesny (AS Roma) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the roof of the net, but Lukasz Skorupski was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 19:42",
            "label": "",
            "description": "What a chance that is! Rade Krunic (Empoli) displays good awareness near the penalty spot to get on the end of a cross, but he sends his header narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 19:09",
            "label": "corner",
            "description": "Empoli take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 16:39",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Clement Grenier (AS Roma) is coming onto the pitch as Diego Perotti cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 16:08",
            "label": "corner",
            "description": "Mario Rui (AS Roma) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 15:43",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) fires a powerful shot which is blocked. AS Roma win a corner."
        },
        {
            "gameTime": "2 - 15:30",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 12:06",
            "label": "substitution",
            "description": "Guido Marilungo will be replaced by Andres Tello (Empoli)."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "soccer-ball",
            "description": "What a goal! Mohamed Salah plays it to Edin Dzeko (AS Roma), who finds himself unmarked inside the box and slots a first time shot past Lukasz Skorupski into the bottom right corner. 2:0."
        },
        {
            "gameTime": "2 - 09:10",
            "label": "corner",
            "description": "The corner from Leandro Paredes (AS Roma) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 05:32",
            "label": "corner",
            "description": "Mario Rui (AS Roma) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "corner",
            "description": "Empoli take the corner, but their hopes of scoring a goal end with nice clearance by the defence."
        },
        {
            "gameTime": "2 - 01:59",
            "label": "",
            "description": "Wojciech Szczesny pulls off a great save to deny Guido Marilungo (Empoli) after receiving a precise defence splitting pass. The effort is headed for the top right corner, but the goalkeeper dives superbly to stop it. Definitely the best save of this match so far! The ball is out of play. Empoli will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:15",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 42:02",
            "label": "y-card",
            "description": "Davide Massa shows a yellow card to Rade Krunic (Empoli) for a tough tackle."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) swings the ball into the box from the corner kick but it's a bit too strong and it goes out of play. The ball is off of the pitch and it's a goal kick for Empoli."
        },
        {
            "gameTime": "1 - 41:23",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Leandro Paredes (AS Roma). The defence is alert and manages to cut it out. The ball is out of play and the linesman points at the corner flag. Corner to AS Roma."
        },
        {
            "gameTime": "1 - 40:53",
            "label": "corner",
            "description": "Lukasz Skorupski leaps to collect the ball from the corner which was sent over by Leandro Paredes (AS Roma). AS Roma have a corner."
        },
        {
            "gameTime": "1 - 39:11",
            "label": "",
            "description": "Rade Krunic (Empoli) surprisingly hits a direct free kick goalwards from long distance, but the effort goes wide of the post."
        },
        {
            "gameTime": "1 - 36:11",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box into the stands."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "",
            "description": "Guido Marilungo (Empoli) latched on to an accurate pass deep into the box and attempted to fire the ball past the keeper, but the shot is way off target. What a miskick!"
        },
        {
            "gameTime": "1 - 32:18",
            "label": "",
            "description": "Great ball in from Mohamed Salah. Diego Perotti (AS Roma) should really have done better with a close range header, but he heads it a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 31:27",
            "label": "",
            "description": "Omar El Kaddouri (Empoli) creates a yard of space for himself and tries an effort from the edge of the box, but it goes just wide of the left post."
        },
        {
            "gameTime": "1 - 29:28",
            "label": "",
            "description": "Federico Fazio (AS Roma) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but it goes well wide of the left post."
        },
        {
            "gameTime": "1 - 28:54",
            "label": "corner",
            "description": "Antonio Rudiger (AS Roma) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 28:40",
            "label": "",
            "description": "Lukasz Skorupski leaps like a salmon to deny Leandro Paredes (AS Roma), whose effort is headed to the underside of the crossbar, but isn't powerful enough to find its way into the back of the net. The ball is out of play. A goal scoring opportunity from a corner for AS Roma."
        },
        {
            "gameTime": "1 - 26:43",
            "label": "corner",
            "description": "Empoli work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "1 - 18:16",
            "label": "",
            "description": "Mame Thiam (Empoli) meets a cross inside the box, but Wojciech Szczesny wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "1 - 16:56",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 16:20",
            "label": "",
            "description": "Mohamed Salah (AS Roma) bursts into the box and latches on to a pin point long through ball, but one of the defenders steps in to clear the ball to safety. AS Roma force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 14:50",
            "label": "",
            "description": "Omar El Kaddouri (Empoli) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 11:09",
            "label": "soccer-ball",
            "description": "Edin Dzeko (AS Roma) was in the right place at the right time. He manages to control the ball after the corner kick and quickly shoots inside the left post via the woodwork."
        },
        {
            "gameTime": "1 - 11:05",
            "label": "corner",
            "description": "Corner kick. Antonio Rudiger (AS Roma) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 08:46",
            "label": "",
            "description": "Edin Dzeko (AS Roma) climbs high to connect with a cross on the edge of the box, but his header is off target."
        },
        {
            "gameTime": "1 - 07:03",
            "label": "",
            "description": "Mame Thiam (Empoli) is clearly in an offside position after the ball is played through to him and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 04:25",
            "label": "corner",
            "description": "The resulting corner from Omar El Kaddouri (Empoli) is cleared by the defence."
        },
        {
            "gameTime": "1 - 04:02",
            "label": "",
            "description": "Mame Thiam (Empoli) tries to slide the ball through to a teammate but it's well blocked by a defender. Empoli will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! AS Roma will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Davide Massa."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Empoli have lost 6 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "21 the number of consecutive matches that AS Roma scored at least one goal."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The match has just finished."
        }
    ],
    "gameAwayTeam": "Empoli",
    "gameDate": "01/04/2017 - 21:45",
    "gameHomeTeam": "AS Roma",
    "gameScore": "2 - 0"
}