{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-04-14 - 21-45 Juventus 1 - 0 Monaco/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The host team were better throughout the game. The home team tried to prevail using combination football, while the away side adopted a defensive style of play."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 47:55",
            "label": "",
            "description": "Flag up against Alessandro Matri (Juventus). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 46:20",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) is unlucky with a goal bound effort from the edge of the box. A fortuitous save from Danijel Subasic stops the ball from going into the middle of the goal."
        },
        {
            "gameTime": "2 - 45:43",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) sends a teasing cross into the area, but Gianluigi Buffon intercepts the ball."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:47",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 13:16."
        },
        {
            "gameTime": "2 - 42:24",
            "label": "",
            "description": "The game is interrupted. Stefano Sturaro (Juventus) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "2 - 41:46",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Roberto Pereyra departs the field of play to be replaced by Stefano Sturaro (Juventus)."
        },
        {
            "gameTime": "2 - 41:18",
            "label": "substitution",
            "description": "That will be all from Anthony Martial who is being replaced by the fresh legs of Matheus Carvalho (Monaco)."
        },
        {
            "gameTime": "2 - 40:15",
            "label": "corner",
            "description": "Claudio Marchisio (Juventus) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 39:54",
            "label": "",
            "description": "Carlos Tevez (Juventus) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. Juventus will take a corner kick."
        },
        {
            "gameTime": "2 - 39:20",
            "label": "corner",
            "description": "Claudio Marchisio (Juventus) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 39:07",
            "label": "",
            "description": "Carlos Tevez (Juventus) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee and his assistant both point at the corner flag. Juventus will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 38:59",
            "label": "",
            "description": "Geoffrey Kondogbia (Monaco) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "2 - 38:20",
            "label": "corner",
            "description": "Joao Moutinho (Monaco) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 37:53",
            "label": "",
            "description": "Anthony Martial (Monaco) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The ball is out of play and Monaco manage to earn a corner."
        },
        {
            "gameTime": "2 - 37:03",
            "label": "substitution",
            "description": "Massimiliano Allegri has decided to introduce fresh legs, with Alessandro Matri (Juventus) replacing Alvaro Morata."
        },
        {
            "gameTime": "2 - 36:16",
            "label": "",
            "description": "Dimitar Berbatov (Monaco) commits a foul and Pavel Kralovec immediately signals a free kick."
        },
        {
            "gameTime": "2 - 34:17",
            "label": "corner",
            "description": "Claudio Marchisio (Juventus) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. The ball is out of play and the linesman points at the corner flag. Corner to Juventus."
        },
        {
            "gameTime": "2 - 32:25",
            "label": "",
            "description": "Geoffrey Kondogbia (Monaco) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Pavel Kralovec with no other option than to blow for a foul."
        },
        {
            "gameTime": "2 - 30:52",
            "label": "",
            "description": "Arturo Vidal (Juventus) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 30:29",
            "label": "injury",
            "description": "Arturo Vidal (Juventus) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 29:35",
            "label": "attendance",
            "description": "The attendance for today's match is 40801."
        },
        {
            "gameTime": "2 - 28:50",
            "label": "substitution",
            "description": "It's time for a substitution. Andrea Barzagli (Juventus) comes on in place of Andrea Pirlo."
        },
        {
            "gameTime": "2 - 27:09",
            "label": "",
            "description": "Dimitar Berbatov (Monaco) is quickest inside the box and leaps to connect with the resulting set piece. He produces a fine header, but it floats just over the crossbar."
        },
        {
            "gameTime": "2 - 26:32",
            "label": "corner",
            "description": "Yannick Carrasco (Monaco) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "",
            "description": "The ball is cleared after Yannick Carrasco (Monaco) attempted to dribble past an opposing player. The referee signals a corner kick to Monaco."
        },
        {
            "gameTime": "2 - 26:06",
            "label": "",
            "description": "Alvaro Morata (Juventus) sends a cross into the box, but Danijel Subasic comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 25:29",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Dimitar Berbatov (Monaco) is coming onto the pitch as Andrea Raggi cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 24:12",
            "label": "",
            "description": "What a poor attempt! Yannick Carrasco (Monaco) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "2 - 21:49",
            "label": "",
            "description": "Alvaro Morata (Juventus) makes a yard for himself and attempts to endanger the goalkeeper with a long range shot. His great effort, however, goes a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 21:08",
            "label": "",
            "description": "Patrice Evra (Juventus) plays a through ball which would have led to a great opportunity, if it hadn't been stopped by the defence."
        },
        {
            "gameTime": "2 - 20:01",
            "label": "",
            "description": "Carlos Tevez (Juventus) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "corner",
            "description": "Yannick Carrasco (Monaco) swings in the corner, but the goalkeeper does a brilliant job to intercept the effort."
        },
        {
            "gameTime": "2 - 17:31",
            "label": "",
            "description": "Anthony Martial (Monaco) decided to shoot after receiving a sweet pass. If it wasn't for Gianluigi Buffon's superb save the ball would have probably ended up in the top of the net. Monaco get a corner."
        },
        {
            "gameTime": "2 - 15:07",
            "label": "",
            "description": "Some patient build up play from Monaco as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 14:31",
            "label": "",
            "description": "Andrea Raggi (Monaco) finds Joao Moutinho with a nice pass so he can go on towards the goal."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "soccer-ball",
            "description": "Arturo Vidal (Juventus) coolly converts the penalty, sending the ball into the top left corner."
        },
        {
            "gameTime": "2 - 11:31",
            "label": "",
            "description": "Arturo Vidal (Juventus) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 09:51",
            "label": "y-card",
            "description": "A yellow card is awarded to Ricardo Carvalho (Monaco)."
        },
        {
            "gameTime": "2 - 09:50",
            "label": "penalty",
            "description": "Ricardo Carvalho (Monaco) commits a rough challenge and Pavel Kralovec blows his whistle for a foul. PENALTY! One of the players from Juventus is about to take a penalty kick."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "",
            "description": "Geoffrey Kondogbia (Monaco) gets to the ball from the resulting corner kick and attempts to curl it past the keeper. His wild shot sails wide of the goal."
        },
        {
            "gameTime": "2 - 08:49",
            "label": "corner",
            "description": "Bernardo Silva (Monaco) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 08:31",
            "label": "",
            "description": "Bernardo Silva (Monaco) collects a great pass inside the box and misses a sitter. His shot was directed towards the left post, but the goalkeeper pulls off a marvellous diving save and denies him. The ball goes out of play. Monaco are awarded a corner kick."
        },
        {
            "gameTime": "2 - 08:17",
            "label": "corner",
            "description": "Andrea Pirlo (Juventus) launches a cross from the corner, but Danijel Subasic is alert to thwart the effort."
        },
        {
            "gameTime": "2 - 08:09",
            "label": "",
            "description": "Carlos Tevez (Juventus) slaloms his way past challenges, but an opposing player does well to get the ball away. Juventus have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 06:02",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Andrea Pirlo (Juventus). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 05:41",
            "label": "substitution",
            "description": "Leonardo Jardim is forced to make a change. Nabil Dirar is not able to carry on due to injury. He is replaced by Bernardo Silva (Monaco)."
        },
        {
            "gameTime": "2 - 05:05",
            "label": "",
            "description": "Alvaro Morata (Juventus) looks to break free, but an opposing player clears the ball away. Juventus earn a corner."
        },
        {
            "gameTime": "2 - 04:27",
            "label": "",
            "description": "Arturo Vidal (Juventus) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the middle of the goal is, however, saved by Danijel Subasic!"
        },
        {
            "gameTime": "2 - 03:05",
            "label": "injury",
            "description": "Nabil Dirar (Monaco) picks up an injury."
        },
        {
            "gameTime": "2 - 02:46",
            "label": "",
            "description": "Andrea Raggi (Monaco) gets his head on the corner, but he can't find the target as his header flies high over the crossbar."
        },
        {
            "gameTime": "2 - 02:16",
            "label": "corner",
            "description": "Joao Moutinho (Monaco) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 02:06",
            "label": "",
            "description": "Nabil Dirar (Monaco) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball goes out of play. Monaco are awarded a corner kick."
        },
        {
            "gameTime": "2 - 00:18",
            "label": "",
            "description": "A crossfield pass from Andrea Raggi (Monaco) fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Pavel Kralovec starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "This is how football should be full of action, thrilling moments and spectacular opportunities. And we have only had the first 45 minutes, so the expectations for the second half are high. The first half was definitely edged by the home side. The tactic of the home side is slow build up play, while the away team's main priority is a flawless defence."
        },
        {
            "gameTime": "1 - 45:07",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Pavel Kralovec has ended it."
        },
        {
            "gameTime": "1 - 44:35",
            "label": "",
            "description": "Arturo Vidal (Juventus) misses a sitter as his shot goes over the bar."
        },
        {
            "gameTime": "1 - 43:43",
            "label": "",
            "description": "Claudio Marchisio (Juventus) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "1 - 43:13",
            "label": "",
            "description": "Andrea Pirlo (Juventus) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "",
            "description": "Joao Moutinho (Monaco) is penalised for holding. Pavel Kralovec signals a set piece. Juventus have a free kick."
        },
        {
            "gameTime": "1 - 40:51",
            "label": "",
            "description": "Alvaro Morata (Juventus) is penalised for a foul. Pavel Kralovec had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 39:47",
            "label": "",
            "description": "It wasn't the best example of how to strike the ball. Patrice Evra (Juventus) unleashed a first time shot from the edge of the box that went high over the crossbar."
        },
        {
            "gameTime": "1 - 38:29",
            "label": "",
            "description": "Anthony Martial (Monaco) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 36:57",
            "label": "",
            "description": "The foul by Carlos Tevez (Juventus) was seen by Pavel Kralovec who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 35:05",
            "label": "",
            "description": "Patrice Evra (Juventus) and Stephan Lichtsteiner exchanged a few one two short passes. Sometimes there's a need to switch play and change the tempo with some lofted passes to test the defence to see if it's alert."
        },
        {
            "gameTime": "1 - 33:01",
            "label": "",
            "description": "Yannick Carrasco (Monaco) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 32:11",
            "label": "",
            "description": "Rough tackle by Aymen Abdennour (Monaco). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 30:32",
            "label": "",
            "description": "Claudio Marchisio (Juventus) receives a precise low pass and attempts to finish. The shot, however, goes well wide of the left post."
        },
        {
            "gameTime": "1 - 29:42",
            "label": "",
            "description": "Alvaro Morata (Juventus) collects a pass and strikes from about 24 metres out. It's a poor attempt which flies well over the bar."
        },
        {
            "gameTime": "1 - 28:44",
            "label": "",
            "description": "Andrea Pirlo (Juventus) was trying to get to the ball but clattered into the legs of the opponent as well. Pavel Kralovec blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 27:45",
            "label": "corner",
            "description": "The corner kick from Andrea Pirlo (Juventus) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 27:31",
            "label": "",
            "description": "Andrea Pirlo (Juventus) crosses the ball forward but it is intercepted. Juventus have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 26:47",
            "label": "",
            "description": "Carlos Tevez (Juventus) makes a good run inside the box to meet a precise cross. He latches on to it and shoots, but the goalkeeper pulls off an excellent save."
        },
        {
            "gameTime": "1 - 24:40",
            "label": "",
            "description": "Arturo Vidal (Juventus) receives a pass and unleashes a shot which goes well wide of the right post."
        },
        {
            "gameTime": "1 - 24:14",
            "label": "",
            "description": "Joao Moutinho (Monaco) is unable to feed a through ball into the path of his teammates."
        },
        {
            "gameTime": "1 - 21:57",
            "label": "",
            "description": "Patrice Evra (Juventus) plays a one two with Arturo Vidal, but the move breaks down."
        },
        {
            "gameTime": "1 - 21:11",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 20:00",
            "label": "",
            "description": "Andrea Raggi (Monaco) makes a rough challenge and Pavel Kralovec blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 18:14",
            "label": "",
            "description": "Andrea Raggi (Monaco) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 17:06",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) finds enough space to climb high and plants a header well wide of the left post. What a poor effort."
        },
        {
            "gameTime": "1 - 16:51",
            "label": "corner",
            "description": "Joao Moutinho (Monaco) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 16:30",
            "label": "",
            "description": "Nabil Dirar (Monaco) tries to send the ball in front of the goal, but the opposition's defence averts the threat. Monaco have a corner."
        },
        {
            "gameTime": "1 - 14:32",
            "label": "",
            "description": "What a chance that is! Joao Moutinho (Monaco) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 13:25",
            "label": "",
            "description": "The ball is cleared after Yannick Carrasco (Monaco) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 12:16",
            "label": "",
            "description": "Claudio Marchisio (Juventus) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 10:49",
            "label": "corner",
            "description": "The corner by Joao Moutinho (Monaco) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 10:38",
            "label": "",
            "description": "Close! Yannick Carrasco (Monaco) picks up a pass and produces a ferocious strike towards the right post, but the goalkeeper gets his fingertips to the ball to keep it out. The referee and one of his assistants signal for a corner kick to Monaco."
        },
        {
            "gameTime": "1 - 10:02",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 09:09",
            "label": "",
            "description": "Yannick Carrasco (Monaco) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Gianluigi Buffon is alert and denies him."
        },
        {
            "gameTime": "1 - 08:07",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Layvin Kurzawa (Monaco) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "1 - 06:44",
            "label": "",
            "description": "Pavel Kralovec blows his whistle. Nabil Dirar (Monaco) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 05:04",
            "label": "",
            "description": "Carlos Tevez (Juventus) picks up a pass, lines up a shot and strikes from 22 metres out, but Danijel Subasic thwarts the effort which is headed to the left side of the goal."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "Alvaro Morata (Juventus) is flagged for offside."
        },
        {
            "gameTime": "1 - 03:18",
            "label": "",
            "description": "Alvaro Morata (Juventus) gets to the ball in the penalty box and immediately fires a first time effort. He didn't hit the ball properly and skies it high over the crossbar."
        },
        {
            "gameTime": "1 - 02:30",
            "label": "",
            "description": "Anthony Martial (Monaco) and Joao Moutinho attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 01:49",
            "label": "",
            "description": "Giorgio Chiellini (Juventus) sends an accurate short pass. Giorgio Chiellini controls the ball with a fine first touch and is able to come up with a new attacking effort."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Juventus will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Pavel Kralovec."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The host team were better throughout the game. The home team tried to prevail using combination football, while the away side adopted a defensive style of play."
        }
    ],
    "gameAwayTeam": "Monaco",
    "gameDate": "14/04/2015 - 21:45",
    "gameHomeTeam": "Juventus",
    "gameScore": "1 - 0"
}