{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-03 - 22-45 Real Madrid 1 - 0 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. An impressive display from the visitors, they had the better of it. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 47:55",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 46:40",
            "label": "y-card",
            "description": "The referee demonstrates he won't tolerate this behaviour. Keylor Navas (Real Madrid) is given a yellow card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:41",
            "label": "",
            "description": "Angel Di Maria (Paris SG) stands over the resulting free kick from around 20 metres out, but his terrific effort smashes against the crossbar!"
        },
        {
            "gameTime": "2 - 42:32",
            "label": "y-card",
            "description": "Casemiro (Real Madrid) infringed the rules and goes into the book. Mark Clattenburg pulls out a yellow card. Paris SG have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 41:52",
            "label": "",
            "description": "Kevin Trapp (Paris SG) is alert and has a clear sight of a long through ball from . Easy save!"
        },
        {
            "gameTime": "2 - 39:01",
            "label": "",
            "description": "A spell of possession for Paris SG in an attempt to control the game."
        },
        {
            "gameTime": "2 - 36:04",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Mateo Kovacic (Real Madrid) is coming onto the pitch as Isco cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 35:31",
            "label": "",
            "description": "Toni Kroos (Real Madrid) latches on to a precise pass and one on one with the keeper slams the ball towards the right hand post. Kevin Trapp is alert, though, and leaps like a salmon to deny him."
        },
        {
            "gameTime": "2 - 34:46",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 34:21",
            "label": "",
            "description": "sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "2 - 32:17",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) will take the corner."
        },
        {
            "gameTime": "2 - 32:04",
            "label": "",
            "description": "Serge Aurier (Paris SG) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. It will be a corner kick for Paris SG."
        },
        {
            "gameTime": "2 - 30:56",
            "label": "",
            "description": "The flag is raised and Zlatan Ibrahimovic (Paris SG) is offside again, not for the first time today."
        },
        {
            "gameTime": "2 - 29:23",
            "label": "substitution",
            "description": "The substitution has been made. Lucas (Paris SG) has replaced Blaise Matuidi."
        },
        {
            "gameTime": "2 - 29:01",
            "label": "",
            "description": "Mark Clattenburg blows his whistle and it's Sergio Ramos (Real Madrid) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 28:37",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 28:04",
            "label": "",
            "description": "Isco (Real Madrid) makes a good run inside the box to meet a precise cross. He latches on to it and shoots, but the goalkeeper pulls off an excellent save. Real Madrid force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 26:47",
            "label": "funfact",
            "description": "13:16 – this is the total number of shots produced by both teams."
        },
        {
            "gameTime": "2 - 23:33",
            "label": "",
            "description": "The linesman raises his flag for offside before Edinson Cavani (Paris SG) heads on."
        },
        {
            "gameTime": "2 - 22:09",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) is adjudged offside."
        },
        {
            "gameTime": "2 - 21:18",
            "label": "y-card",
            "description": "Yellow card! It's like David Luiz (Paris SG) was asking for a caution with his behaviour. Mark Clattenburg agrees and books him."
        },
        {
            "gameTime": "2 - 20:38",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 20:27",
            "label": "",
            "description": "Angel Di Maria (Paris SG) tries to send the ball in front of the goal, but the opposition's defence averts the threat. Paris SG will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 19:48",
            "label": "",
            "description": "Isco (Real Madrid) receives a lofted pass and is given time inside the box to unleash a shot goalwards. The ball is directed towards the middle of the goal, but it lacks power and Kevin Trapp pulls off a comfortable save to thwart the effort."
        },
        {
            "gameTime": "2 - 18:51",
            "label": "",
            "description": "Toni Kroos (Real Madrid) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "2 - 18:08",
            "label": "",
            "description": "Mark Clattenburg blows his whistle after Maxwell (Paris SG) brings one of his opponents down with a strong tackle. A free kick is awarded to Real Madrid."
        },
        {
            "gameTime": "2 - 17:27",
            "label": "substitution",
            "description": "Rafael Benitez has decided to make a change. Lucas (Real Madrid) replaces Jese."
        },
        {
            "gameTime": "2 - 15:05",
            "label": "",
            "description": "Jese (Real Madrid) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "2 - 14:24",
            "label": "",
            "description": "A pass into the penalty area from Zlatan Ibrahimovic (Paris SG) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 11:16",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 11:05",
            "label": "",
            "description": "Isco (Real Madrid) picks up a pass, lines up a shot and strikes from 19 metres out, but Kevin Trapp thwarts the effort which is headed to the roof of the net. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) has a go from a long way out but it sails way over."
        },
        {
            "gameTime": "2 - 07:41",
            "label": "",
            "description": "Angel Di Maria (Paris SG) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "2 - 07:19",
            "label": "",
            "description": "Maxwell (Paris SG) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety."
        },
        {
            "gameTime": "2 - 06:26",
            "label": "",
            "description": "Angel Di Maria (Paris SG) is having a lively performance. He is causing problems and wanting the ball at every opportunity."
        },
        {
            "gameTime": "2 - 04:40",
            "label": "",
            "description": "Angel Di Maria (Paris SG) attempted to pick out a free teammate inside the box, but Keylor Navas comes off the line to clear the ball away."
        },
        {
            "gameTime": "2 - 03:21",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Cristiano Ronaldo (Real Madrid) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "2 - 02:48",
            "label": "",
            "description": "Angel Di Maria (Paris SG) receives a lofted cross on the edge of the box and sends a shot to the middle of the goal. The goalkeeper had no trouble saving this one."
        },
        {
            "gameTime": "2 - 02:34",
            "label": "",
            "description": "Casemiro (Real Madrid) was trying to get to the ball but clattered into the legs of the opponent as well. Mark Clattenburg blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Mark Clattenburg blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "There has been no time for the supporters to get bored during an eventful opening 45 minutes. Both teams provided some breathtaking moments. The away side are dominant and dictating the tempo of the game, mainly because of their higher activity and more accurate passing. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 48:58",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 48:39",
            "label": "",
            "description": "Edinson Cavani (Paris SG) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 48:17",
            "label": "corner",
            "description": "The resulting corner, taken by Isco (Real Madrid), comes to nothing."
        },
        {
            "gameTime": "1 - 47:56",
            "label": "",
            "description": "Isco (Real Madrid) picks up a precise pass deep inside the box, but his strike is saved by the keeper. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 47:20",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) gives away a foul for a clumsy challenge. Referee Mark Clattenburg saw the whole situation."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:25",
            "label": "y-card",
            "description": "Serge Aurier (Paris SG) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "1 - 43:56",
            "label": "",
            "description": "The linesman raises his flag. Edinson Cavani (Paris SG) is adjudged offside."
        },
        {
            "gameTime": "1 - 43:27",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) wins himself enough space to meet the resulting corner and fires the ball at goal, but the keeper does well to stop his effort."
        },
        {
            "gameTime": "1 - 43:03",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 42:45",
            "label": "",
            "description": "Serge Aurier (Paris SG) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The ball goes out of play. Paris SG are awarded a corner kick."
        },
        {
            "gameTime": "1 - 39:39",
            "label": "",
            "description": "Maxwell (Paris SG) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "1 - 38:52",
            "label": "",
            "description": "Adrien Rabiot (Paris SG) goes for goal but he directs his effort just wide of the left post."
        },
        {
            "gameTime": "1 - 37:02",
            "label": "",
            "description": "Flag goes up against Zlatan Ibrahimovic (Paris SG) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 36:50",
            "label": "",
            "description": "Good touch by Adrien Rabiot (Paris SG) as he latched on to an accurate pass before attempting to threaten the goalkeeper with his long range shot. Unluckily for him, his attempt only rattles the left post."
        },
        {
            "gameTime": "1 - 34:56",
            "label": "soccer-ball",
            "description": "Nacho (Real Madrid) picks up a rebound and scores."
        },
        {
            "gameTime": "1 - 34:55",
            "label": "",
            "description": "Toni Kroos (Real Madrid) hammers the ball towards goal from long range, but one of the defenders reacts brilliantly to block the shot."
        },
        {
            "gameTime": "1 - 32:19",
            "label": "substitution",
            "description": "Marcelo just cannot continue due to injury and has to be substituted. Nacho (Real Madrid) replaces him."
        },
        {
            "gameTime": "1 - 31:16",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger."
        },
        {
            "gameTime": "1 - 29:47",
            "label": "",
            "description": "Half chance! Serge Aurier (Paris SG) plays a pass into the box, but Keylor Navas reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 28:36",
            "label": "",
            "description": "The free kick from long distance is taken by Zlatan Ibrahimovic (Paris SG), who fires in a direct effort just wide of the right post. What a chance!"
        },
        {
            "gameTime": "1 - 27:49",
            "label": "",
            "description": "The players claim that Sergio Ramos (Real Madrid) handled the ball and it seems they are right. Paris SG have a free kick."
        },
        {
            "gameTime": "1 - 25:34",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) took the direct free kick from distance, but his attempt is well saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 24:53",
            "label": "",
            "description": "Adrien Rabiot (Paris SG) commits a rough foul. Mark Clattenburg stops the game and makes a call. Real Madrid earn a free kick."
        },
        {
            "gameTime": "1 - 24:21",
            "label": "",
            "description": "Angel Di Maria (Paris SG) collects a pass and has an effort from 20 metres out, but it flies just wide of the right post."
        },
        {
            "gameTime": "1 - 23:23",
            "label": "",
            "description": "Serge Aurier (Paris SG) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 22:04",
            "label": "",
            "description": "Good team movement sets up Zlatan Ibrahimovic (Paris SG) on the edge of the box, but he slices the ball narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 20:10",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) decided to shoot after receiving a sweet pass. The ball went to the middle of the goal, but Keylor Navas made an easy save."
        },
        {
            "gameTime": "1 - 19:05",
            "label": "",
            "description": "The foul by Blaise Matuidi (Paris SG) was seen by Mark Clattenburg who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 16:20",
            "label": "substitution",
            "description": "Laurent Blanc is forced to make an unplanned substitution as Marco Verratti suffers an injury and Adrien Rabiot (Paris SG) comes on."
        },
        {
            "gameTime": "1 - 15:27",
            "label": "",
            "description": "Isco (Real Madrid) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 14:59",
            "label": "",
            "description": "Marco Verratti (Paris SG) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 12:55",
            "label": "injury",
            "description": "Marco Verratti (Paris SG) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 12:10",
            "label": "",
            "description": "Serge Aurier (Paris SG) is able to continue to play."
        },
        {
            "gameTime": "1 - 09:49",
            "label": "injury",
            "description": "Looks like Serge Aurier (Paris SG) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 09:24",
            "label": "injury",
            "description": "Isco (Real Madrid) is asking for medical treatment after picking up an injury."
        },
        {
            "gameTime": "1 - 09:05",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 08:31",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "1 - 08:14",
            "label": "",
            "description": "Jese (Real Madrid) tries to send a low pass into the box, but it's blocked and cleared. The ball is out of play. Real Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 06:49",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) and Marcelo attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 04:17",
            "label": "",
            "description": "Angel Di Maria (Paris SG) sends a cross into the box, but Keylor Navas comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 03:43",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) finds some space for a shot after collecting the ball and unleashes a rocket of a shot from long distance towards the net. The goalkeeper thwarts the effort."
        },
        {
            "gameTime": "1 - 02:50",
            "label": "",
            "description": "Edinson Cavani (Paris SG) makes a driving run into the box but he cannot work any space for a shot."
        },
        {
            "gameTime": "1 - 01:25",
            "label": "",
            "description": "Serge Aurier (Paris SG) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paris SG will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Mark Clattenburg."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. An impressive display from the visitors, they had the better of it. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "03/11/2015 - 22:45",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "1 - 0"
}