{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-05-21 - 21-00 Barcelona 4 - 2 Eibar/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:09",
            "label": "whistle",
            "description": "That's it for today, Alejandro Hernandez has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 47:48",
            "label": "",
            "description": "What a chance that is! Garcia Kike (Eibar) displays good awareness near the penalty spot to get on the end of a cross, but he sends his header narrowly wide of the right post. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "2 - 46:37",
            "label": "soccer-ball",
            "description": "Lionel Messi (Barcelona) finishes his beautiful individual effort with a superb strike from inside the box. Yoel is just a bystander as the ball flies into the bottom left corner. The score is 4:2."
        },
        {
            "gameTime": "2 - 46:12",
            "label": "attendance",
            "description": "The attendance is 74932."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:04",
            "label": "",
            "description": "Daniel Garcia (Eibar) sends a cross into the box, but the opposition's defence clears the ball to safety. The ball is out of play. Eibar will have a throw in."
        },
        {
            "gameTime": "2 - 42:47",
            "label": "",
            "description": "Lionel Messi (Barcelona) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 41:49",
            "label": "",
            "description": "Anaitz Arbilla (Eibar) commits a rough foul. Alejandro Hernandez stops the game and makes a call. Another situation results in a direct free kick for Barcelona."
        },
        {
            "gameTime": "2 - 37:59",
            "label": "substitution",
            "description": "Jose Mendilibar prepares a substitution. Gonzalo Escalante is replaced by Cristian Rivera (Eibar)."
        },
        {
            "gameTime": "2 - 37:54",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Lionel Messi (Barcelona) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "2 - 37:29",
            "label": "",
            "description": "A lofted cross from Neymar (Barcelona) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "substitution",
            "description": "Substitution. Alejandro Galvez (Eibar) in, Sergio Enrich out."
        },
        {
            "gameTime": "2 - 29:59",
            "label": "soccer-ball",
            "description": "Lionel Messi (Barcelona) takes the penalty and perfectly sends the ball inside the right post."
        },
        {
            "gameTime": "2 - 29:45",
            "label": "",
            "description": "Lionel Messi (Barcelona) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 29:19",
            "label": "penalty",
            "description": "Alejandro Hernandez blows his whistle for a foul after Ander Capa (Eibar) hacks down one of his opponents. The referee makes a call and blows his whistle for an infringement. Barcelona are awarded a penalty."
        },
        {
            "gameTime": "2 - 28:59",
            "label": "yr-card",
            "description": "Ander Capa (Eibar) sees a yellow card in the hand of Alejandro Hernandez. And as it's a second one this game, a red follows and Ander Capa (Eibar) is sent from the pitch."
        },
        {
            "gameTime": "2 - 28:56",
            "label": "",
            "description": "Andres Iniesta (Barcelona) passes the ball and slows down the tempo so his team can continue with their combination play."
        },
        {
            "gameTime": "2 - 27:25",
            "label": "soccer-ball",
            "description": "Goal! The resulting corner is whipped into the box and Luis Suarez (Barcelona) buries the ball into the back of the net from a Alcacer Paco knock down. 2:2."
        },
        {
            "gameTime": "2 - 27:21",
            "label": "corner",
            "description": "There's an opportunity for Neymar (Barcelona) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 25:28",
            "label": "substitution",
            "description": "Here is a change. Ivan Rakitic is going off and Luis Enrique gives the last tactical orders to Alcacer Paco (Barcelona)."
        },
        {
            "gameTime": "2 - 24:57",
            "label": "penalty-missed",
            "description": "Lionel Messi (Barcelona) blows a huge chance to score! He sends the penalty to the underside of the crossbar, but it's not enough to beat Yoel who easily stops the effort. Now Barcelona have a corner."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "corner",
            "description": "Neymar (Barcelona) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 22:56",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Ruben Pena departs the field of play to be replaced by Pedro Leon (Eibar)."
        },
        {
            "gameTime": "2 - 21:37",
            "label": "",
            "description": "Neymar (Barcelona) and his stunning dribble! He zig zags through the defence and gets in front of the keeper. He faints to shoot and then suddenly strikes goalwards, but his effort misses the target by a whisker. Very unlucky for Neymar (Barcelona). This could have been a legendary goal. The ball goes out of play and Eibar will have a goal kick."
        },
        {
            "gameTime": "2 - 19:52",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "soccer-ball-own",
            "description": "It's an own goal! David Junca (Eibar) puts the ball into his own net."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "",
            "description": "Neymar (Barcelona) expertly controls a neat clever pass on the edge of the penalty area, but his effort smashes against the right post! What a shot that was!"
        },
        {
            "gameTime": "2 - 15:41",
            "label": "soccer-ball",
            "description": "After receiving a beautiful pass, Takashi Inui (Eibar) had a huge opportunity. He coolly unleashed a perfect shot, which went towards the top left corner, bouncing in off the post."
        },
        {
            "gameTime": "2 - 14:23",
            "label": "",
            "description": "Luis Suarez (Barcelona) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 10:47",
            "label": "",
            "description": "Lionel Messi (Barcelona) received a killer pass and let fly from close range. Unluckily for him, it flew just wide of the left post. The ball is off of the pitch and it's a goal kick for Eibar."
        },
        {
            "gameTime": "2 - 08:36",
            "label": "y-card",
            "description": "Caution goes to Ruben Pena (Eibar)."
        },
        {
            "gameTime": "2 - 07:59",
            "label": "",
            "description": "Alejandro Hernandez blows his whistle and it's Luis Suarez (Barcelona) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 07:38",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 06:56",
            "label": "",
            "description": "Andres Iniesta (Barcelona) sends a rebound goalwards towards the right hand post, but the goalkeeper stretches to stop it. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 04:39",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) produces a ferocious strike from the edge of the box. His dangerous effort towards the bottom right corner is blocked by Yoel, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "2 - 01:33",
            "label": "corner",
            "description": "David Junca (Eibar) takes the corner, but he overhits it and none of his teammates are able to reach the ball. The ball is off of the pitch and it's a goal kick for Barcelona."
        },
        {
            "gameTime": "2 - 01:07",
            "label": "",
            "description": "Takashi Inui (Eibar) goes on a mazy run, skips past two defenders and pulls the trigger in front of the keeper. Marc Andre ter Stegen makes a decent save to deny his effort directed to the left side of the target. Eibar have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 00:36",
            "label": "substitution",
            "description": "Luis Enrique decides to make a substitution. Sergi Roberto will be replaced by Andre Gomes (Barcelona)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:25",
            "label": "whistle",
            "description": "Alejandro Hernandez has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 44:20",
            "label": "",
            "description": "Ruben Pena (Eibar) has a huge chance to score from close range, but his effort goes just a few inches wide of the right hand post."
        },
        {
            "gameTime": "1 - 41:41",
            "label": "corner",
            "description": "David Junca (Eibar) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 41:13",
            "label": "corner",
            "description": "David Junca (Eibar) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger. Eibar have a corner."
        },
        {
            "gameTime": "1 - 40:37",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Takashi Inui (Eibar), is intercepted by the opposition's defence. It will be a corner kick for Eibar."
        },
        {
            "gameTime": "1 - 40:17",
            "label": "y-card",
            "description": "The yellow card is received by Sergio Busquets (Barcelona)."
        },
        {
            "gameTime": "1 - 38:14",
            "label": "",
            "description": "Neymar (Barcelona) dribbles into the box, but Yoel is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "1 - 37:12",
            "label": "",
            "description": "Andres Iniesta clips a neat ball into the box towards Lionel Messi (Barcelona), whose header from the centre of the box goes a whisker wide of the right post. The ball is off of the pitch and it's a goal kick for Eibar."
        },
        {
            "gameTime": "1 - 36:47",
            "label": "corner",
            "description": "A dangerous looking corner kick from Neymar (Barcelona) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 36:00",
            "label": "",
            "description": "Yoel pulls off a great save to deny Luis Suarez (Barcelona), who makes himself some space inside the box and unleashes a quick low drive to the bottom left corner. Barcelona force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Yoel guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 29:55",
            "label": "y-card",
            "description": "Ander Capa (Eibar) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "1 - 28:10",
            "label": "",
            "description": "Neymar (Barcelona) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 27:06",
            "label": "corner",
            "description": "Neymar (Barcelona) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 22:39",
            "label": "corner",
            "description": "Neymar (Barcelona) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 22:13",
            "label": "",
            "description": "The ball is cleared after Lionel Messi (Barcelona) attempted to dribble past an opposing player. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 20:11",
            "label": "",
            "description": "Lionel Messi (Barcelona) makes a run beyond the last defender, but he's offside."
        },
        {
            "gameTime": "1 - 18:57",
            "label": "y-card",
            "description": "Alejandro Hernandez shows a yellow card to Gonzalo Escalante (Eibar) for his blatant foul."
        },
        {
            "gameTime": "1 - 17:25",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Neymar (Barcelona)."
        },
        {
            "gameTime": "1 - 16:52",
            "label": "",
            "description": "Jordi Alba (Barcelona) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance. The referee signals a corner kick to Barcelona."
        },
        {
            "gameTime": "1 - 14:54",
            "label": "corner",
            "description": "The corner from Neymar (Barcelona) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 14:33",
            "label": "",
            "description": "Luis Suarez (Barcelona) looks to break free, but an opposing player clears the ball away. The ball is out of play and the linesman points at the corner flag. Corner to Barcelona."
        },
        {
            "gameTime": "1 - 13:52",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Luis Suarez (Barcelona) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "1 - 12:27",
            "label": "",
            "description": "Luis Suarez (Barcelona) smashes the ball from the edge of the box and misses well wide of the left post. The ball is off of the pitch and it's a goal kick for Eibar."
        },
        {
            "gameTime": "1 - 10:44",
            "label": "corner",
            "description": "Anaitz Arbilla (Eibar) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 08:37",
            "label": "",
            "description": "Luis Suarez (Barcelona) makes a good run with the ball, but his shot from the edge of the penalty area goes just wide of the left post. Terrific solo effort, though. The ball is off of the pitch and it's a goal kick for Eibar."
        },
        {
            "gameTime": "1 - 06:54",
            "label": "soccer-ball",
            "description": "Goal! Ander Capa puts a cross into the box and finds Takashi Inui (Eibar), who latches on to it and strikes the ball into the top left corner. He makes it 0:1."
        },
        {
            "gameTime": "1 - 05:19",
            "label": "",
            "description": "Takashi Inui (Eibar) sprays a pass out to Garcia Kike, but he can't beat his man to get to the ball. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "1 - 04:31",
            "label": "corner",
            "description": "Neymar (Barcelona) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 04:15",
            "label": "",
            "description": "Neymar (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The linesman points to the corner flag, Barcelona are going to take it."
        },
        {
            "gameTime": "1 - 02:56",
            "label": "",
            "description": "Luis Suarez (Barcelona) is in a clear offside position and the referee blows his whistle after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 02:05",
            "label": "",
            "description": "Garcia Kike (Eibar) races towards goal but the defender gets back well to make a challenge. The ball has crossed the sideline. Eibar are taking a throw in."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Eibar will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alejandro Hernandez is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Eibar have played 18 games so far this season that have had over 2.5 total goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona have won 6 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's it for today, Alejandro Hernandez has blown his whistle and the game is over."
        }
    ],
    "gameAwayTeam": "Eibar",
    "gameDate": "21/05/2017 - 21:00",
    "gameHomeTeam": "Barcelona",
    "gameScore": "4 - 2"
}