{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-25 - 22-45 Juventus 1 - 0 Manchester City/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The away side dominated this game. Both teams attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 49:06",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 48:07",
            "label": "",
            "description": "Juan Cuadrado (Juventus) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "",
            "description": "Raheem Sterling (Manchester City) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net."
        },
        {
            "gameTime": "2 - 46:07",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:24",
            "label": "",
            "description": "Yaya Toure (Manchester City) was close to scoring after he unleashed a powerful shot which went a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 43:34",
            "label": "",
            "description": "Fabian Delph (Manchester City) fouls an opponent. At least that's what referee Felix Brych signals."
        },
        {
            "gameTime": "2 - 42:50",
            "label": "",
            "description": "Raheem Sterling (Manchester City) sends in a lofted cross from a long range free kick, but it goes out of play."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "",
            "description": "Juan Cuadrado (Juventus) touches the ball with his hand. A free kick is awarded to Manchester City."
        },
        {
            "gameTime": "2 - 41:40",
            "label": "",
            "description": "Yaya Toure (Manchester City) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 40:13",
            "label": "corner",
            "description": "The corner from Kevin De Bruyne (Manchester City) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 40:10",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball goes out of play and Manchester City have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "",
            "description": "Gael Clichy (Manchester City) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "",
            "description": "Juan Cuadrado (Juventus) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 36:45",
            "label": "substitution",
            "description": "Massimiliano Allegri has decided to introduce fresh legs, with Juan Cuadrado (Juventus) replacing Paulo Dybala."
        },
        {
            "gameTime": "2 - 35:50",
            "label": "substitution",
            "description": "The manager has been forced to make a substitution and the injured Joe Hart leaves the pitch to be replaced by Wilfredo Caballero (Manchester City)."
        },
        {
            "gameTime": "2 - 34:30",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 34:28",
            "label": "",
            "description": "Raheem Sterling (Manchester City) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety. The ball is out of play and the linesman points at the corner flag. Corner to Manchester City."
        },
        {
            "gameTime": "2 - 33:25",
            "label": "",
            "description": "Alvaro Morata (Juventus) bursts inside the box, beats two defenders and produces a strike from the penalty spot. The shot has power, but lacks precision and the goalkeeper stops it easily. The scoreline remains the same."
        },
        {
            "gameTime": "2 - 32:01",
            "label": "substitution",
            "description": "Massimiliano Allegri has decided to make a change. Patrice Evra (Juventus) replaces Alex Sandro."
        },
        {
            "gameTime": "2 - 30:20",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 30:07",
            "label": "",
            "description": "The ball is cleared after Raheem Sterling (Manchester City) attempted to dribble past an opposing player. Manchester City earn a corner."
        },
        {
            "gameTime": "2 - 29:20",
            "label": "attendance",
            "description": "The attendance for today's match is 38193."
        },
        {
            "gameTime": "2 - 28:31",
            "label": "",
            "description": "Claudio Marchisio (Juventus) swings a cross into the box, but it's far too close to Joe Hart, who smothers the ball."
        },
        {
            "gameTime": "2 - 27:28",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Paulo Dybala (Juventus). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 27:11",
            "label": "",
            "description": "Alex Sandro (Juventus) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee points to the corner flag. It's a corner to Juventus."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "",
            "description": "Alvaro Morata (Juventus) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 23:56",
            "label": "y-card",
            "description": "Bacary Sagna (Manchester City) is booked after bringing down an opponent. Felix Brych had an easy decision to make."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "y-card",
            "description": "Jesus Navas (Manchester City) was probably a bit loose with his words to Felix Brych, who decides to show him a yellow."
        },
        {
            "gameTime": "2 - 23:17",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Sergio Aguero leaves the pitch and Raheem Sterling (Manchester City) comes on."
        },
        {
            "gameTime": "2 - 23:01",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 21:56",
            "label": "",
            "description": "Sergio Aguero (Manchester City) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him. Corner kick. Manchester City will have an opportunity."
        },
        {
            "gameTime": "2 - 21:34",
            "label": "",
            "description": "Kevin De Bruyne almost found himself in a promising position after Yaya Toure (Manchester City) tried to send a defence splitting pass, but one of the defenders reacts well and makes a timely interception."
        },
        {
            "gameTime": "2 - 20:24",
            "label": "",
            "description": "Sergio Aguero (Manchester City) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 19:02",
            "label": "",
            "description": "Fabian Delph (Manchester City) makes a reckless foul in order to win the ball from his opponent. Felix Brych has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 18:08",
            "label": "",
            "description": "Paulo Dybala (Juventus) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 17:45",
            "label": "",
            "description": "Yaya Toure (Manchester City) sends a long ball in, but Gianluigi Buffon comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 16:45",
            "label": "injury",
            "description": "Paulo Dybala (Juventus) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 16:23",
            "label": "",
            "description": "Bacary Sagna (Manchester City) makes a slide tackle, but referee Felix Brych blows for a foul."
        },
        {
            "gameTime": "2 - 14:49",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Fabian Delph (Manchester City) for Fernandinho."
        },
        {
            "gameTime": "2 - 14:22",
            "label": "",
            "description": "Claudio Marchisio (Juventus) attempts to surprise the keeper with a nice shot, but it lacks more accuracy and goes way wide of the left post."
        },
        {
            "gameTime": "2 - 13:00",
            "label": "",
            "description": "The linesman raises his flag for offside before Sergio Aguero (Manchester City) heads on."
        },
        {
            "gameTime": "2 - 11:40",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Kevin De Bruyne (Manchester City), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 11:17",
            "label": "",
            "description": "Yaya Toure (Manchester City) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety. Manchester City have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 10:04",
            "label": "",
            "description": "Stefano Sturaro (Juventus) squanders a great opportunity after striking the ball onto the post!"
        },
        {
            "gameTime": "2 - 09:12",
            "label": "substitution",
            "description": "The substitution has been made. Alvaro Morata (Juventus) has replaced Mario Mandzukic."
        },
        {
            "gameTime": "2 - 08:13",
            "label": "",
            "description": "Fernandinho (Manchester City) jumps inside the box to meet the corner and aims a low header towards the right post, but the goalkeeper pulls off an astonishing save to deny him."
        },
        {
            "gameTime": "2 - 07:45",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 07:31",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) whips a promising cross into the box, but the opposition's defence intercepts the ball. The linesman makes the right call and Manchester City will have a corner."
        },
        {
            "gameTime": "2 - 05:59",
            "label": "",
            "description": "Claudio Marchisio (Juventus) tries his luck with a long range effort after receiving a precise pass, but Joe Hart has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "",
            "description": "Alex Sandro (Juventus) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 03:09",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "2 - 02:23",
            "label": "",
            "description": "Fernandinho (Manchester City) brings his opponent down. Felix Brych has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Felix Brych blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. Neither side is enjoying any significant control of the game. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 44:45",
            "label": "",
            "description": "Jesus Navas (Manchester City) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "1 - 44:24",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 44:02",
            "label": "",
            "description": "Sergio Aguero (Manchester City) shoots from the edge of the penalty area. The ball travels towards the target, but Gianluigi Buffon easily deals with the threat. The ball goes behind for a corner. Manchester City will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 41:38",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Joe Hart."
        },
        {
            "gameTime": "1 - 40:41",
            "label": "",
            "description": "Jesus Navas (Manchester City) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 39:36",
            "label": "",
            "description": "Yaya Toure (Manchester City) receives a precise pass on the edge of the box and releases a promising effort. Unfortunately for him, his strike flies painfully close to the right post."
        },
        {
            "gameTime": "1 - 39:29",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) shows his brilliant passing ability after picking out Jesus Navas with a fine lofted pass."
        },
        {
            "gameTime": "1 - 37:04",
            "label": "",
            "description": "Mario Mandzukic (Juventus) was too forceful with his tackle and Felix Brych interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 34:25",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Fernandinho (Manchester City) was quite harsh and Felix Brych didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 32:55",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 32:32",
            "label": "",
            "description": "Flag goes up against Sergio Aguero (Manchester City) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 31:55",
            "label": "",
            "description": "A poorly executed mid range free kick by Kevin De Bruyne (Manchester City) as he fails to deliver a decent cross."
        },
        {
            "gameTime": "1 - 31:07",
            "label": "",
            "description": "Alex Sandro (Juventus) tackles a bit over zealously and Felix Brych blows for a foul. Manchester City will take a free kick."
        },
        {
            "gameTime": "1 - 29:57",
            "label": "",
            "description": "Yaya Toure (Manchester City) attempts to surprise the keeper with a nice shot, but it lacks accuracy and goes well wide of the right post."
        },
        {
            "gameTime": "1 - 29:12",
            "label": "",
            "description": "Yaya Toure (Manchester City) received a pass and didn't think long what to do with it. He fired a powerful long range shot which went painfully close to the bar."
        },
        {
            "gameTime": "1 - 28:08",
            "label": "corner",
            "description": "The corner kick from Paulo Dybala (Juventus) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 27:22",
            "label": "",
            "description": "Joe Hart was forced into action to thwart Mario Mandzukic (Juventus). He found himself some space after latching on to a pass and unleashed a shot to the right post but couldn't beat the keeper. It will be a corner kick for Juventus."
        },
        {
            "gameTime": "1 - 25:03",
            "label": "",
            "description": "Paul Pogba (Juventus) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 23:01",
            "label": "",
            "description": "Yaya Toure (Manchester City) and Sergio Aguero try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 22:26",
            "label": "",
            "description": "A cross from Alex Sandro (Juventus) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 21:48",
            "label": "",
            "description": "Juventus quickly take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 20:59",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Martin Demichelis (Manchester City). Felix Brych saw the sliding tackle and blows for a foul. Juventus are awarded the free kick."
        },
        {
            "gameTime": "1 - 17:32",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Alex Sandro plays it into the box, and Mario Mandzukic (Juventus) gets on the end of the cross to put it into the back of the net. 1:0."
        },
        {
            "gameTime": "1 - 16:45",
            "label": "",
            "description": "Claudio Marchisio (Juventus) sends a long ball in, but Joe Hart comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 16:18",
            "label": "",
            "description": "Fernandinho (Manchester City) finds himself in a promising position to finish! He unleashes a poor shot which flies into the stands. What a poor effort that was!"
        },
        {
            "gameTime": "1 - 14:12",
            "label": "",
            "description": "Paulo Dybala (Juventus) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 12:43",
            "label": "",
            "description": "Yaya Toure (Manchester City) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 11:11",
            "label": "",
            "description": "Manchester City are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "1 - 08:27",
            "label": "",
            "description": "Stefano Sturaro (Juventus) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 08:14",
            "label": "",
            "description": "Alex Sandro (Juventus) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball is out of play. Juventus will have a throw in."
        },
        {
            "gameTime": "1 - 06:24",
            "label": "",
            "description": "Mario Mandzukic (Juventus) meets a cross from Claudio Marchisio, but he cannot keep his header on target. It goes well wide of the right post."
        },
        {
            "gameTime": "1 - 05:07",
            "label": "",
            "description": "Fernandinho (Manchester City) strikes a shot towards goal from the edge of the penalty box, but it flies just wide of the left post."
        },
        {
            "gameTime": "1 - 04:45",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 03:41",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Bacary Sagna (Manchester City). The ball goes out for a corner. Manchester City can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 02:16",
            "label": "",
            "description": "Paulo Dybala (Juventus) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the left post."
        },
        {
            "gameTime": "1 - 01:13",
            "label": "",
            "description": "Felix Brych has a clear sight and sees a foul from Fernandinho (Manchester City)."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Manchester City will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Felix Brych was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The away side dominated this game. Both teams attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Manchester City",
    "gameDate": "25/11/2015 - 22:45",
    "gameHomeTeam": "Juventus",
    "gameScore": "1 - 0"
}