{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-05-06 - 21-45 Barcelona 3 - 0 Bayern Munich/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side dominated the game. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 50:04",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 48:26",
            "label": "soccer-ball",
            "description": "Goal! Lionel Messi puts the ball on a plate for Neymar (Barcelona), who scores with a simple close range finish. It's 3:0."
        },
        {
            "gameTime": "2 - 46:51",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "2 - 45:12",
            "label": "",
            "description": "Xavi (Barcelona) serves up a nice cross, but Manuel Neuer punches the ball away."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 43:31",
            "label": "substitution",
            "description": "The manager has been forced to make a substitution and the injured Javier Mascherano leaves the pitch to be replaced by Marc Bartra (Barcelona)."
        },
        {
            "gameTime": "2 - 41:36",
            "label": "substitution",
            "description": "A substitution has been made. Andres Iniesta goes off and Rafinha (Barcelona) comes on."
        },
        {
            "gameTime": "2 - 40:48",
            "label": "",
            "description": "Bastian Schweinsteiger (Bayern Munich) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "2 - 38:13",
            "label": "",
            "description": "Luis Suarez (Barcelona) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "2 - 36:56",
            "label": "substitution",
            "description": "Luis Enrique has decided to introduce fresh legs, with Xavi (Barcelona) replacing Ivan Rakitic."
        },
        {
            "gameTime": "2 - 34:15",
            "label": "soccer-ball",
            "description": "What a goal that is! Lionel Messi (Barcelona) goes on a mazy run and from inside the box he beats Manuel Neuer with a delightful chip. He makes it 2:0."
        },
        {
            "gameTime": "2 - 33:19",
            "label": "substitution",
            "description": "It's time for a substitution. Mario Gotze (Bayern Munich) comes on in place of Thomas Muller."
        },
        {
            "gameTime": "2 - 31:50",
            "label": "soccer-ball",
            "description": "Goal! Dani Alves slips it to Lionel Messi (Barcelona) on the edge of the box and he finds the right side of the net with a great effort. The score is 1:0."
        },
        {
            "gameTime": "2 - 29:25",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 28:04",
            "label": "",
            "description": "The ball is cleared after Andres Iniesta (Barcelona) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 27:19",
            "label": "",
            "description": "Luis Suarez (Barcelona) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "2 - 26:40",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger."
        },
        {
            "gameTime": "2 - 25:12",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 17:8."
        },
        {
            "gameTime": "2 - 23:12",
            "label": "y-card",
            "description": "Neymar (Barcelona) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Nicola Rizzoli didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 22:15",
            "label": "corner",
            "description": "Thiago Alcantara (Bayern Munich) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 22:01",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger. The ball is out of play and Bayern Munich manage to earn a corner."
        },
        {
            "gameTime": "2 - 21:49",
            "label": "",
            "description": "Bayern Munich are awarded a mid range free kick."
        },
        {
            "gameTime": "2 - 20:06",
            "label": "y-card",
            "description": "Gerard Pique (Barcelona) sees a yellow card from Nicola Rizzoli after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 18:31",
            "label": "",
            "description": "Neymar (Barcelona) latched on to a good low pass and attempted to surprise the goalkeeper with a snap shot, but the ball skewed off his foot flew well over the bar."
        },
        {
            "gameTime": "2 - 17:16",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) jumps into a tackle and Nicola Rizzoli blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 15:49",
            "label": "",
            "description": "Manuel Neuer is alert and has a clear sight of a long through ball from Lionel Messi (Barcelona). Easy save!"
        },
        {
            "gameTime": "2 - 14:05",
            "label": "",
            "description": "Neymar (Barcelona) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 12:07",
            "label": "",
            "description": "Lionel Messi (Barcelona) picks up a pass, lines up a shot and strikes from 18 metres out, but Manuel Neuer thwarts the effort which is headed to the middle of the goal."
        },
        {
            "gameTime": "2 - 11:39",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) was too fierce in his attempt to get the ball from his opponent and Nicola Rizzoli blows for a foul."
        },
        {
            "gameTime": "2 - 10:26",
            "label": "corner",
            "description": "Thiago Alcantara (Bayern Munich) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 10:12",
            "label": "",
            "description": "An attempted cross from Robert Lewandowski (Bayern Munich) is cleared. The ball is out of play. Bayern Munich will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "y-card",
            "description": "A yellow card for a tackle by Juan Bernat (Bayern Munich). Nicola Rizzoli doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 09:35",
            "label": "",
            "description": "The game is interrupted as Thomas Muller (Bayern Munich) is flagged offside."
        },
        {
            "gameTime": "2 - 08:44",
            "label": "",
            "description": "Philipp Lahm receives a short pass from Thomas Muller (Bayern Munich), but the opposition's defence thwarts his effort."
        },
        {
            "gameTime": "2 - 06:06",
            "label": "y-card",
            "description": "Mehdi Benatia (Bayern Munich) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 04:54",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net."
        },
        {
            "gameTime": "2 - 04:28",
            "label": "",
            "description": "Nicola Rizzoli blows his whistle after Luis Suarez (Barcelona) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "2 - 02:13",
            "label": "corner",
            "description": "Marc Andre ter Stegen leaps to collect the ball from the corner which was sent over by Thiago Alcantara (Bayern Munich)."
        },
        {
            "gameTime": "2 - 01:52",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) wasted an opportunity to score from the free kick from about 19 metres out. His attempt hit the defensive wall. The ball is out of play. A goal scoring opportunity from a corner for Bayern Munich."
        },
        {
            "gameTime": "2 - 00:54",
            "label": "",
            "description": "Bayern Munich are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 00:43",
            "label": "y-card",
            "description": "Nicola Rizzoli shows a yellow card to Dani Alves (Barcelona) for a tough tackle."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Nicola Rizzoli starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. The hosts were superior in their performance in the first half. They were more active and precise. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 45:04",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 44:41",
            "label": "",
            "description": "What a chance that is! Lionel Messi (Barcelona) squanders a huge opportunity as he latches on to a perfect cross from the wing. He and produces a bullet header from around the penalty spot which goes well wide of the left post!"
        },
        {
            "gameTime": "1 - 44:09",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 43:09",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) sends a long ball in, but Marc Andre ter Stegen comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 41:18",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 40:41",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) is adjudged offside."
        },
        {
            "gameTime": "1 - 39:35",
            "label": "",
            "description": "Dani Alves (Barcelona) hammers a powerful first time shot from close range, sending the ball towards the middle of the target, but the goalkeeper stops it with a miraculous save."
        },
        {
            "gameTime": "1 - 38:13",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Lionel Messi (Barcelona), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "1 - 37:46",
            "label": "",
            "description": "Nicola Rizzoli blows the whistle, Mehdi Benatia (Bayern Munich) is penalised for a foul. Barcelona will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 37:08",
            "label": "",
            "description": "A pass from Robert Lewandowski (Bayern Munich) is intercepted by Marc Andre ter Stegen and the move breaks down."
        },
        {
            "gameTime": "1 - 36:23",
            "label": "",
            "description": "The referee blows his whistle as Ivan Rakitic (Barcelona) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 35:37",
            "label": "",
            "description": "Lionel Messi (Barcelona) stands over the free kick and opts to take it himself, sending it towards the right post only for Manuel Neuer to dive and make a save."
        },
        {
            "gameTime": "1 - 34:54",
            "label": "",
            "description": "Barcelona win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 34:30",
            "label": "y-card",
            "description": "Nicola Rizzoli shows the yellow card to Xabi Alonso (Bayern Munich) for a heavy challenge."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "",
            "description": "The game is interrupted. Thomas Muller (Bayern Munich) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "1 - 30:06",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 29:31",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 28:03",
            "label": "",
            "description": "Nicola Rizzoli interrupts the game for a tactical foul by Jordi Alba (Barcelona)."
        },
        {
            "gameTime": "1 - 26:09",
            "label": "",
            "description": "Luis Suarez (Barcelona) receives a fine cross inside the box and attempts to score a goal, but his strike flies just a few inches over the bar."
        },
        {
            "gameTime": "1 - 26:06",
            "label": "corner",
            "description": "Corner kick. Ivan Rakitic (Barcelona) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 25:32",
            "label": "",
            "description": "Jordi Alba (Barcelona) serves up a nice cross, but the defence clears the danger. Now Barcelona have a corner."
        },
        {
            "gameTime": "1 - 25:13",
            "label": "",
            "description": "Lionel Messi (Barcelona) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "1 - 24:37",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "1 - 22:35",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) crosses the ball from the free kick, but it goes out of play."
        },
        {
            "gameTime": "1 - 21:56",
            "label": "",
            "description": "Javier Mascherano (Barcelona) was trying to get to the ball but clattered into the legs of the opponent as well. Nicola Rizzoli blows his whistle for an infringement. Bayern Munich will take a free kick."
        },
        {
            "gameTime": "1 - 20:48",
            "label": "",
            "description": "A brilliant individual effort! Lionel Messi (Barcelona) tricks his way past challenges into the box and drags his shot narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 19:45",
            "label": "",
            "description": "Jordi Alba (Barcelona) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 17:21",
            "label": "",
            "description": "Marc Andre ter Stegen doesn't have to worry about this one. Thomas Muller plays a pass into the feet of Robert Lewandowski (Bayern Munich), who is unable to find the target as his effort from inside the box goes well wide of the left post."
        },
        {
            "gameTime": "1 - 16:13",
            "label": "",
            "description": "Lionel Messi (Barcelona) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "1 - 15:17",
            "label": "",
            "description": "Luis Suarez (Barcelona) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but it goes well wide of the left post."
        },
        {
            "gameTime": "1 - 14:50",
            "label": "corner",
            "description": "There's an opportunity for Lionel Messi (Barcelona) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 14:28",
            "label": "",
            "description": "Neymar (Barcelona) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. Barcelona have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 14:15",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "1 - 13:18",
            "label": "",
            "description": "Lionel Messi (Barcelona) trips an opponent with a slide tackle. Nicola Rizzoli stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 11:36",
            "label": "",
            "description": "Luis Suarez (Barcelona) zig zags his way into the box and fires the ball towards the middle of the goal, but the goalkeeper makes a great reaction save to stop the effort."
        },
        {
            "gameTime": "1 - 10:44",
            "label": "",
            "description": "A clumsy foul by Mehdi Benatia (Bayern Munich) and Nicola Rizzoli blows his whistle."
        },
        {
            "gameTime": "1 - 09:39",
            "label": "",
            "description": "Luis Suarez (Barcelona) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 07:32",
            "label": "",
            "description": "Lionel Messi (Barcelona) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 06:56",
            "label": "",
            "description": "A neat pass is well received by Luis Suarez (Barcelona), who is lurking on the edge of the box and strikes the ball on goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "1 - 06:36",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) makes a strong challenge and Nicola Rizzoli blows for a foul."
        },
        {
            "gameTime": "1 - 06:35",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 04:53",
            "label": "",
            "description": "Javier Mascherano (Barcelona) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 03:28",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 01:56",
            "label": "",
            "description": "Dani Alves (Barcelona) commits a rough challenge and Nicola Rizzoli blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 00:48",
            "label": "",
            "description": "Neymar (Barcelona) is clearly in an offside position after the ball is played through to him and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bayern Munich will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Nicola Rizzoli."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side dominated the game. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Bayern Munich",
    "gameDate": "06/05/2015 - 21:45",
    "gameHomeTeam": "Barcelona",
    "gameScore": "3 - 0"
}