{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2017-05-06 - 17-00 Leicester 3 - 0 Watford/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:22",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:40",
            "label": "soccer-ball",
            "description": "Jamie Vardy plays a neat ball into the path of Marc Albrighton (Leicester), who makes room for a shot and fires in off the right post! 3:0."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:51",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 43:34",
            "label": "",
            "description": "Jamie Vardy (Leicester) misses a good chance to score. An inch perfect cross into the box finds Jamie Vardy (Leicester) who rises for a header, but sends the ball well over the bar. Corner kick. Leicester will have an opportunity."
        },
        {
            "gameTime": "2 - 43:05",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "",
            "description": "A cross from Demarai Gray (Leicester) fails to reach the box as the defence clears the ball away to safety. Now Leicester have a corner."
        },
        {
            "gameTime": "2 - 40:30",
            "label": "",
            "description": "Juan Zuniga (Watford) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity!"
        },
        {
            "gameTime": "2 - 39:08",
            "label": "",
            "description": "Troy Deeney (Watford) is caught offside!"
        },
        {
            "gameTime": "2 - 38:11",
            "label": "substitution",
            "description": "Walter Mazzarri has decided to substitute M'Baye Niang and he is replaced by Dion Pereira (Watford)."
        },
        {
            "gameTime": "2 - 37:48",
            "label": "",
            "description": "Andy King (Leicester) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 35:01",
            "label": "",
            "description": "Flag goes up against Jamie Vardy (Leicester) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 32:58",
            "label": "substitution",
            "description": "Substitution. Riyad Mahrez did his best and is replaced by Demarai Gray (Leicester)."
        },
        {
            "gameTime": "2 - 31:56",
            "label": "",
            "description": "Sebastian Prodl (Watford) wastes a great chance from the resulting corner. He times his header superbly when he leaps high to meet a precise cross, but can't aim better than into the middle of the goal, straight into the arms of the goalkeeper."
        },
        {
            "gameTime": "2 - 31:35",
            "label": "corner",
            "description": "The referee awards a corner and Tom Cleverley (Watford) goes over to take it."
        },
        {
            "gameTime": "2 - 31:13",
            "label": "",
            "description": "Tom Cleverley (Watford) receives a low pass just outside the box and unleashes a fine strike towards the roof of the net. Kasper Schmeichel pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed. Watford win a corner."
        },
        {
            "gameTime": "2 - 30:10",
            "label": "",
            "description": "Islam Slimani (Leicester) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 29:58",
            "label": "",
            "description": "M'Baye Niang (Watford) meets a delivery on the edge of the penalty area and shoots towards the top of the net. He didn't put enough power into the effort, though, and Kasper Schmeichel produces an easy save."
        },
        {
            "gameTime": "2 - 29:14",
            "label": "",
            "description": "Nordin Amrabat (Watford) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 26:58",
            "label": "substitution",
            "description": "Substitution. Christian Kabasele is replaced by Juan Zuniga (Watford)."
        },
        {
            "gameTime": "2 - 26:28",
            "label": "",
            "description": "Christian Fuchs (Leicester) failed to convert a mid range free kick and sends the ball narrowly over the bar."
        },
        {
            "gameTime": "2 - 24:35",
            "label": "",
            "description": "What a big chance! Islam Slimani (Leicester) picks up an inch perfect pass inside the box and skies the ball well over the bar."
        },
        {
            "gameTime": "2 - 23:17",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 22:48",
            "label": "",
            "description": "Heurelho Gomes was forced into action to thwart Jamie Vardy (Leicester). He found himself some space after latching on to a pass and unleashed a shot to the right post but couldn't beat the keeper."
        },
        {
            "gameTime": "2 - 21:55",
            "label": "substitution",
            "description": "A substitution has been made. Etienne Capoue is replaced by Troy Deeney (Watford)."
        },
        {
            "gameTime": "2 - 21:34",
            "label": "substitution",
            "description": "Craig Shakespeare prepares a substitution. Daniel Drinkwater is replaced by Andy King (Leicester)."
        },
        {
            "gameTime": "2 - 17:11",
            "label": "substitution",
            "description": "Here's the change. Shinji Okazaki leaves the pitch and Islam Slimani (Leicester) comes on as a substitute."
        },
        {
            "gameTime": "2 - 16:32",
            "label": "",
            "description": "Nordin Amrabat (Watford) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 13:00",
            "label": "soccer-ball",
            "description": "Goal! Riyad Mahrez (Leicester) fires the rebound into the bottom right corner after the ball breaks to him in the box. The score is 2:0."
        },
        {
            "gameTime": "2 - 11:55",
            "label": "",
            "description": "The linesman signals that Stefano Okaka (Watford) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 11:05",
            "label": "",
            "description": "Jamie Vardy (Leicester) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 10:45",
            "label": "corner",
            "description": "A dangerous looking corner kick from Riyad Mahrez (Leicester) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 10:38",
            "label": "",
            "description": "Riyad Mahrez (Leicester) flights in the cross, but the defender is alert and clears to safety. The ball is out of play and Leicester manage to earn a corner."
        },
        {
            "gameTime": "2 - 09:24",
            "label": "",
            "description": "Nordin Amrabat (Watford) sends a teasing cross into the area, but Kasper Schmeichel intercepts the ball."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "",
            "description": "Stefano Okaka (Watford) misses a good chance to score. A perfect cross into the box finds Stefano Okaka (Watford) who rises for a header, but he sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 04:21",
            "label": "",
            "description": "Jamie Vardy (Leicester) latches on to an accurate pass into the box and immediately unleashes a low shot goalwards. His effort is well saved by the keeper."
        },
        {
            "gameTime": "2 - 02:36",
            "label": "",
            "description": "Nordin Amrabat (Watford) sends a cross into the box, but Kasper Schmeichel comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:16",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Roger East has ended it."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 41:42",
            "label": "corner",
            "description": "Riyad Mahrez (Leicester) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 41:15",
            "label": "",
            "description": "Riyad Mahrez (Leicester) latches on to a sweet pass on the edge of the box and unleashes a brilliant shot towards the goal, but he hits the crossbar!"
        },
        {
            "gameTime": "1 - 38:00",
            "label": "soccer-ball",
            "description": "Goal! Wilfred Ndidi (Leicester) fires the rebound into the roof of the net after the ball breaks to him in the box. The score is 1:0."
        },
        {
            "gameTime": "1 - 37:55",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Marc Albrighton (Leicester) takes it short."
        },
        {
            "gameTime": "1 - 37:46",
            "label": "",
            "description": "Riyad Mahrez (Leicester) takes the free kick from the edge of the box, but the goalkeeper perfectly sets up the defensive wall and his effort is thwarted. The linesman makes the right call and Leicester will have a corner."
        },
        {
            "gameTime": "1 - 36:44",
            "label": "",
            "description": "Sebastian Prodl (Watford) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Roger East blows for the foul but keeps his cards in his pocket on this occasion. Leicester are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 36:02",
            "label": "",
            "description": "Tom Cleverley (Watford) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the left hand post, but Kasper Schmeichel was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 33:23",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) receives a precise pass on the edge of the box and bends his effort inches wide of the left post."
        },
        {
            "gameTime": "1 - 31:10",
            "label": "",
            "description": "Stefano Okaka (Watford) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 30:19",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Daryl Janmaat (Watford). Roger East saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "1 - 28:39",
            "label": "",
            "description": "Stefano Okaka (Watford) was in a good shooting position inside the six yard box and produced a first time shot towards the inside of the right post, but the goalkeeper made an astonishing save to thwart him."
        },
        {
            "gameTime": "1 - 26:46",
            "label": "",
            "description": "Nordin Amrabat (Watford) is unable to feed a through ball into the path of his teammates. The ball goes out of play and Leicester will have a goal kick."
        },
        {
            "gameTime": "1 - 25:06",
            "label": "",
            "description": "M'Baye Niang (Watford) latches on to an accurate pass on the edge of the box and immediately unleashes a shot which is wide of the mark."
        },
        {
            "gameTime": "1 - 24:00",
            "label": "corner",
            "description": "The corner from Marc Albrighton (Leicester) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 23:52",
            "label": "",
            "description": "Christian Fuchs (Leicester) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The referee signals a corner kick to Leicester."
        },
        {
            "gameTime": "1 - 20:59",
            "label": "",
            "description": "Daryl Janmaat (Watford) serves up a nice cross, but Kasper Schmeichel punches the ball away."
        },
        {
            "gameTime": "1 - 18:50",
            "label": "",
            "description": "Jamie Vardy (Leicester) connects with a cross from the free kick inside the six yard box and attempts to score with his foot. He hits one of the defenders and the ball ricochets onto the post off him."
        },
        {
            "gameTime": "1 - 17:39",
            "label": "",
            "description": "Leicester are awarded the free kick."
        },
        {
            "gameTime": "1 - 13:12",
            "label": "",
            "description": "Nordin Amrabat (Watford) is adjudged offside."
        },
        {
            "gameTime": "1 - 12:41",
            "label": "",
            "description": "Tom Cleverley (Watford) receives a pass and unleashes a shot which goes well wide of the right post."
        },
        {
            "gameTime": "1 - 12:28",
            "label": "",
            "description": "Stefano Okaka (Watford) meets a cross inside the box, but Kasper Schmeichel wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "1 - 10:00",
            "label": "corner",
            "description": "Riyad Mahrez (Leicester) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 09:16",
            "label": "",
            "description": "Leicester seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "1 - 06:00",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Marc Albrighton (Leicester), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 05:58",
            "label": "",
            "description": "Marc Albrighton (Leicester) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. Leicester have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 05:10",
            "label": "",
            "description": "Flag up against Jamie Vardy (Leicester). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 03:57",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "",
            "description": "Riyad Mahrez (Leicester) delivers a promising cross into the box, but it's cleared. The referee points to the corner flag. It's a corner to Leicester."
        },
        {
            "gameTime": "1 - 01:05",
            "label": "",
            "description": "Daryl Janmaat (Watford) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the right post."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "",
            "description": "The linesman raises his flag. Jamie Vardy (Leicester) is adjudged offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Roger East."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last 8 Watford matches finished without a draw."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "In the 36 games that Leicester have played so far this season, 23 have had over 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "In the last 5 games between these two teams there were 4 matches with over 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The match has just finished."
        }
    ],
    "gameAwayTeam": "Watford",
    "gameDate": "06/05/2017 - 17:00",
    "gameHomeTeam": "Leicester",
    "gameScore": "3 - 0"
}