{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-11-20 - 22-45 AC Milan 2 - 2 Inter/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. There wasn't any significant dominance by either side in this game. The hosts defended well and were deadly on the counter attack. The away side displayed some nice build up play using a lot of passes."
        },
        {
            "gameTime": "2 - 48:11",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 48:00",
            "label": "y-card",
            "description": "Ivan Perisic (Inter) picks up a yellow card."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "soccer-ball",
            "description": "Goal! The resulting corner is whipped into the box and Ivan Perisic (Inter) buries the ball into the back of the net from a Jeison Murillo knock down. 2:2."
        },
        {
            "gameTime": "2 - 46:00",
            "label": "corner",
            "description": "Joao Mario (Inter) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Inter get a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:34",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Antonio Candreva (Inter), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 42:17",
            "label": "substitution",
            "description": "Today's match ends for Giacomo Bonaventura who will be replaced by Mario Pasalic (AC Milan)."
        },
        {
            "gameTime": "2 - 41:54",
            "label": "",
            "description": "Geoffrey Kondogbia (Inter) has an effort from distance but it's blocked."
        },
        {
            "gameTime": "2 - 40:43",
            "label": "",
            "description": "Joao Mario (Inter) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 39:19",
            "label": "",
            "description": "Antonio Candreva (Inter) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 38:28",
            "label": "",
            "description": "Gianluigi Donnarumma pulls off a great save to deny Mauro Icardi (Inter) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "2 - 38:00",
            "label": "",
            "description": "Antonio Candreva (Inter) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 36:08",
            "label": "",
            "description": "Stevan Jovetic (Inter) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "funfact",
            "description": "The current number of corner kicks is 1:8."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "substitution",
            "description": "Vincenzo Montella has decided to substitute M'Baye Niang and he is replaced by Gianluca Lapadula (AC Milan)."
        },
        {
            "gameTime": "2 - 32:29",
            "label": "y-card",
            "description": "Paolo Tagliavento shows a yellow card to Stevan Jovetic (Inter) for his blatant foul."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "",
            "description": "Ivan Perisic (Inter) gets on the end of a pass and takes a low shot from the edge of the box which is straight at Gianluigi Donnarumma, who makes a comfortable save."
        },
        {
            "gameTime": "2 - 29:47",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Marcelo Brozovic walks off the pitch to be replaced by Stevan Jovetic (Inter)."
        },
        {
            "gameTime": "2 - 28:32",
            "label": "",
            "description": "Juraj Kucka (AC Milan) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies into the stands."
        },
        {
            "gameTime": "2 - 28:22",
            "label": "",
            "description": "AC Milan take a quick free kick and immediately restart play."
        },
        {
            "gameTime": "2 - 26:58",
            "label": "",
            "description": "Geoffrey Kondogbia (Inter) makes a strong challenge and Paolo Tagliavento blows for a foul. AC Milan have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 26:43",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 25:19",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Carlos Bacca as he is replaced by Matias Fernandez (AC Milan)."
        },
        {
            "gameTime": "2 - 25:15",
            "label": "",
            "description": "Antonio Candreva (Inter) looks to break free, but an opposing player clears the ball away. Inter earn a corner."
        },
        {
            "gameTime": "2 - 24:07",
            "label": "",
            "description": "Mauro Icardi (Inter) latches on to a precise pass and finds himself one on one with the keeper, but his effort is straight at Gianluigi Donnarumma, who is alert and makes an easy save to deny him."
        },
        {
            "gameTime": "2 - 23:34",
            "label": "",
            "description": "A pass from Joao Mario (Inter) is intercepted by Gianluigi Donnarumma and the move breaks down."
        },
        {
            "gameTime": "2 - 21:48",
            "label": "",
            "description": "What a sensational goal that would have been! Ivan Perisic (Inter) picks up the ball inside the box and fires a beautiful first time shot, but it goes just a few inches wide of the right post."
        },
        {
            "gameTime": "2 - 20:00",
            "label": "substitution",
            "description": "It will be a substitution. Yuto Nagatomo (Inter) is ready to enter the pitch as Cristian Ansaldi walks off."
        },
        {
            "gameTime": "2 - 18:43",
            "label": "",
            "description": "Cristian Ansaldi (Inter) gives away a foul for a clumsy challenge. Referee Paolo Tagliavento saw the whole situation."
        },
        {
            "gameTime": "2 - 17:58",
            "label": "",
            "description": "Joao Mario (Inter) attempts to find Danilo D'Ambrosio, but puts far too much on the pass and the chance is gone. The ball goes out of play and AC Milan will have a goal kick."
        },
        {
            "gameTime": "2 - 15:48",
            "label": "",
            "description": "Antonio Candreva (Inter) sends a teasing cross into the area, but Gianluigi Donnarumma intercepts the ball."
        },
        {
            "gameTime": "2 - 14:38",
            "label": "",
            "description": "Good defending. Ivan Perisic (Inter) tries to find Joao Mario inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 12:40",
            "label": "soccer-ball",
            "description": "An amazing individual effort from Suso (AC Milan) ends with a strike from inside the penalty area. He sends the ball precisely into the bottom left corner and makes it 2:1. Samir Handanovic was helpless."
        },
        {
            "gameTime": "2 - 10:50",
            "label": "",
            "description": "Gabriel Paletta (AC Milan) tries his luck with a long range shot from a rebound, but it isn't precise at all and the ball flies well wide of the left post towards the corner flag. Very poor shot."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "",
            "description": "A cross into the box from Juraj Kucka (AC Milan) is cleared."
        },
        {
            "gameTime": "2 - 07:55",
            "label": "soccer-ball",
            "description": "Antonio Candreva (Inter) received a pass and blasted a beautiful rocket of a shot from just outside the penalty area into the top right corner. He was given an ovation. Excellent finish."
        },
        {
            "gameTime": "2 - 06:45",
            "label": "",
            "description": "Suso (AC Milan) gets a shot away from distance, but wasn't really set to take it and fires well wide of the left post."
        },
        {
            "gameTime": "2 - 06:05",
            "label": "",
            "description": "Great solo effort by Antonio Candreva (Inter) as he beats two defenders before firing in a drive from just outside of the box towards the middle of the goal. The goalkeeper is ready and makes an amazing save."
        },
        {
            "gameTime": "2 - 05:36",
            "label": "",
            "description": "M'Baye Niang (AC Milan) collects a pass on the edge of the box and unleashes a low drive to the middle, but Samir Handanovic makes a save."
        },
        {
            "gameTime": "2 - 05:14",
            "label": "corner",
            "description": "Samir Handanovic comes off his line to intercept the corner from Giacomo Bonaventura (AC Milan)."
        },
        {
            "gameTime": "2 - 04:38",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) goes on a weaving run through the defence and gets within shooting range but his effort is blocked. AC Milan force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 03:51",
            "label": "y-card",
            "description": "Cristian Ansaldi (Inter) is very lucky to stay on the pitch after using excessive force to bring down his opponent with a two footed challenge."
        },
        {
            "gameTime": "2 - 02:53",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 02:50",
            "label": "",
            "description": "Suso (AC Milan) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 02:35",
            "label": "",
            "description": "Miranda (Inter) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. The ball is out of play and Inter manage to earn a corner."
        },
        {
            "gameTime": "2 - 01:22",
            "label": "",
            "description": "Ignazio Abate (AC Milan) sends a long through ball to Carlos Bacca, but he fails to control it properly and loses it to one of the defending players."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. Both teams are unsuccessfully trying to control the game and it's pretty even so far. The home team's main weapon is fast counter attacks, while the away side attempts to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:10",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:01",
            "label": "",
            "description": "Carlos Bacca (AC Milan) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:12",
            "label": "",
            "description": "Referee Paolo Tagliavento sees the trip by Ignazio Abate (AC Milan) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "soccer-ball",
            "description": "Brilliant finish! Suso (AC Milan) perfectly collected a pass on the edge of the penalty area from Giacomo Bonaventura, then produced a nice strike into the left side of the goal. The score is 1:0."
        },
        {
            "gameTime": "1 - 41:34",
            "label": "",
            "description": "A neat pass is well received by Carlos Bacca (AC Milan), who is lurking on the edge of the box and produces a low drive directed towards the middle of the goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) tries his luck with a long range effort after receiving a precise pass. It goes to the roof of the net, but Samir Handanovic has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 39:00",
            "label": "",
            "description": "Mauro Icardi (Inter) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 36:32",
            "label": "substitution",
            "description": "Stefano Pioli is forced to make a change. Gary Medel is unable to continue due to injury, Jeison Murillo (Inter) comes on."
        },
        {
            "gameTime": "1 - 34:46",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 34:22",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. The referee and his assistant both point at the corner flag. Inter will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 33:16",
            "label": "",
            "description": "Handball by Suso (AC Milan)."
        },
        {
            "gameTime": "1 - 32:46",
            "label": "",
            "description": "The free kick is delivered by Marcelo Brozovic (Inter) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "1 - 31:48",
            "label": "y-card",
            "description": "Mattia De Sciglio (AC Milan) makes a bad challenge on his opponent and is booked by the referee."
        },
        {
            "gameTime": "1 - 31:17",
            "label": "",
            "description": "Paolo Tagliavento blows the whistle, Mattia De Sciglio (AC Milan) is penalised for a foul. Inter earn a free kick."
        },
        {
            "gameTime": "1 - 30:17",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 28:55",
            "label": "",
            "description": "Antonio Candreva (Inter) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the right post. The ball is off of the pitch and it's a goal kick for AC Milan."
        },
        {
            "gameTime": "1 - 27:35",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 27:07",
            "label": "",
            "description": "The ball is cleared after Antonio Candreva (Inter) attempted to dribble past an opposing player. The ball is out of play and the linesman points at the corner flag. Corner to Inter."
        },
        {
            "gameTime": "1 - 26:28",
            "label": "",
            "description": "Suso (AC Milan) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 25:13",
            "label": "",
            "description": "Geoffrey Kondogbia (Inter) reacts well and displays good awareness inside the box to get on the end of the resulting corner kick. He fails to direct the ball into the net as it flies narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 25:12",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 24:49",
            "label": "",
            "description": "Ivan Perisic (Inter) sends a pass into the box, but his attempt is thwarted and cleared. The referee and one of his assistants signal for a corner kick to Inter."
        },
        {
            "gameTime": "1 - 23:45",
            "label": "",
            "description": "Ivan Perisic (Inter) has a great chance! He climbs highest deep in the penalty box and strikes a powerful header towards the net. Next time he should aim better as his effort ends wide of the left post."
        },
        {
            "gameTime": "1 - 22:28",
            "label": "",
            "description": "Marcelo Brozovic (Inter) sends in a lofted cross from a long range free kick, but his poor effort goes out of play."
        },
        {
            "gameTime": "1 - 21:50",
            "label": "y-card",
            "description": "Juraj Kucka (AC Milan) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "1 - 20:33",
            "label": "",
            "description": "The free kick is taken by Giacomo Bonaventura (AC Milan), but ball is cleared."
        },
        {
            "gameTime": "1 - 19:00",
            "label": "y-card",
            "description": "Geoffrey Kondogbia (Inter) is booked after bringing down an opponent. Paolo Tagliavento had an easy decision to make."
        },
        {
            "gameTime": "1 - 17:38",
            "label": "",
            "description": "Joao Mario (Inter) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 16:18",
            "label": "",
            "description": "Antonio Candreva (Inter) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The ball is out of play. Inter will take a throw in."
        },
        {
            "gameTime": "1 - 14:53",
            "label": "",
            "description": "Ivan Perisic (Inter) collects a rebound and his promising attempt heads low towards the middle of the goal, but Gianluigi Donnarumma keeps it out with an amazing save."
        },
        {
            "gameTime": "1 - 12:44",
            "label": "",
            "description": "Flag goes up against Juraj Kucka (AC Milan) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 11:25",
            "label": "",
            "description": "Geoffrey Kondogbia (Inter) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but he sent it well over the bar."
        },
        {
            "gameTime": "1 - 11:24",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 10:44",
            "label": "",
            "description": "Marcelo Brozovic (Inter) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The ball is out of play. Inter win a corner kick."
        },
        {
            "gameTime": "1 - 10:01",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) sends a long ball in, but Gianluigi Donnarumma comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 09:16",
            "label": "",
            "description": "Antonio Candreva (Inter) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "1 - 08:34",
            "label": "",
            "description": "Great teamplay by Inter as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 07:32",
            "label": "",
            "description": "Ivan Perisic (Inter) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 05:42",
            "label": "corner",
            "description": "Ivan Perisic (Inter) takes a short corner kick."
        },
        {
            "gameTime": "1 - 05:21",
            "label": "",
            "description": "Ivan Perisic (Inter) wastes a good opportunity as his pass into the box is blocked by the defence. The ball goes behind for a corner. Inter will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 04:56",
            "label": "",
            "description": "Ivan Perisic (Inter) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "1 - 03:26",
            "label": "",
            "description": "M'Baye Niang (AC Milan) races towards goal but the defender gets back well to make a challenge. The ball goes out of play and Inter will have a goal kick."
        },
        {
            "gameTime": "1 - 01:58",
            "label": "",
            "description": "Suso (AC Milan) slaloms his way past challenges, but an opposing player does well to get the ball away. The linesman signals a throw in for AC Milan."
        },
        {
            "gameTime": "1 - 01:04",
            "label": "",
            "description": "Paolo Tagliavento has a clear sight and sees a foul from Danilo D'Ambrosio (Inter)."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and AC Milan will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paolo Tagliavento was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "7 The number of away defeats for Inter."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "1 the number of home defeats for AC Milan this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Bacca is the biggest threat to an opponent! He has already scored 8 goals and is top scorer in this AC Milan team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. There wasn't any significant dominance by either side in this game. The hosts defended well and were deadly on the counter attack. The away side displayed some nice build up play using a lot of passes."
        }
    ],
    "gameAwayTeam": "Inter",
    "gameDate": "20/11/2016 - 22:45",
    "gameHomeTeam": "AC Milan",
    "gameScore": "2 - 2"
}