{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-12-10 - 22-45 Barcelona 3 - 1 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side were better today. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        },
        {
            "gameTime": "2 - 47:41",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:30",
            "label": "",
            "description": "Barcelona quickly take the free kick with a short pass."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "",
            "description": "Edinson Cavani (Paris SG) was too fierce in his attempt to get the ball from his opponent and Martin Atkinson blows for a foul."
        },
        {
            "gameTime": "2 - 46:39",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Adriano (Barcelona) for Marc Bartra."
        },
        {
            "gameTime": "2 - 45:48",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) failed to convert a mid range free kick and sends the ball narrowly over the bar. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "2 - 45:36",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) will take the free kick."
        },
        {
            "gameTime": "2 - 45:12",
            "label": "",
            "description": "Javier Mascherano (Barcelona) makes an overly aggressive challenge and Martin Atkinson blows his whistle for a foul. Paris SG have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "2 - 43:36",
            "label": "",
            "description": "That was close by Lionel Messi (Barcelona)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post. The ball goes out of play and Paris SG will have a goal kick."
        },
        {
            "gameTime": "2 - 42:53",
            "label": "",
            "description": "Javier Pastore (Paris SG) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 41:59",
            "label": "funfact",
            "description": "The number of shots on goal at present is 5:3."
        },
        {
            "gameTime": "2 - 40:40",
            "label": "corner",
            "description": "Neymar (Barcelona) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 40:34",
            "label": "",
            "description": "Lionel Messi (Barcelona) tries to find Luis Suarez with a clever through ball from the corner of the box, but the defence is alert to the danger and makes a clearance. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 39:26",
            "label": "",
            "description": "Lionel Messi (Barcelona) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 39:01",
            "label": "",
            "description": "David Luiz (Paris SG) trips an opposition player and Martin Atkinson signals a foul. Barcelona earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 38:09",
            "label": "",
            "description": "Maxwell (Paris SG) sends a teasing cross into the area, but Marc Andre ter Stegen intercepts the ball."
        },
        {
            "gameTime": "2 - 37:12",
            "label": "",
            "description": "Barcelona keep possession of the ball by producing one two passes, but an opponent steps in and wins the ball."
        },
        {
            "gameTime": "2 - 36:47",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) serves up a nice cross, but Marc Andre ter Stegen punches the ball away."
        },
        {
            "gameTime": "2 - 36:16",
            "label": "",
            "description": "David Luiz (Paris SG) probably spotted the goalkeeper off his line, but he misdirected his long range shot as it went a few yards over the bar. The ball is off of the pitch and it's a goal kick for Barcelona."
        },
        {
            "gameTime": "2 - 35:50",
            "label": "corner",
            "description": "Ezequiel Lavezzi (Paris SG) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 35:18",
            "label": "",
            "description": "Ezequiel Lavezzi (Paris SG) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 34:54",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement. Paris SG have a free kick."
        },
        {
            "gameTime": "2 - 33:20",
            "label": "",
            "description": "Barcelona take a quick free kick and immediately restart play."
        },
        {
            "gameTime": "2 - 33:05",
            "label": "",
            "description": "It looks like Lucas (Paris SG) saw red with that tackle. Martin Atkinson won't tolerate such behaviour on the pitch and blows for a foul. Barcelona are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 31:52",
            "label": "soccer-ball",
            "description": "Goal! Luis Suarez (Barcelona) fires the rebound into the bottom right corner after the ball breaks to him in the box. The score is 3:1."
        },
        {
            "gameTime": "2 - 31:45",
            "label": "",
            "description": "Salvatore Sirigu was forced into action to thwart Neymar (Barcelona). He found himself some space after latching on to a pass and unleashed a shot to the bottom right corner but couldn't beat the keeper."
        },
        {
            "gameTime": "2 - 30:36",
            "label": "corner",
            "description": "The resulting corner from Ezequiel Lavezzi (Paris SG) is cleared by the defence."
        },
        {
            "gameTime": "2 - 29:51",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) tries to send a pass but it's blocked. The ball goes out of play and Paris SG have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 29:36",
            "label": "substitution",
            "description": "Here comes a substitution. Tired Blaise Matuidi (Paris SG) left the pitch, and Ezequiel Lavezzi (Paris SG) is coming on to help his team."
        },
        {
            "gameTime": "2 - 28:34",
            "label": "",
            "description": "Barcelona decide to take a short pass from the free kick and the attacking effort continues."
        },
        {
            "gameTime": "2 - 28:20",
            "label": "",
            "description": "Thiago Silva (Paris SG) makes a bad challenge and the referee blows his whistle for a foul. A free kick has been awarded to Barcelona."
        },
        {
            "gameTime": "2 - 28:03",
            "label": "",
            "description": "Barcelona take a quick free kick with a short pass and play continues."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "substitution",
            "description": "Andres Iniesta comes off the pitch to be replaced by Xavi (Barcelona)."
        },
        {
            "gameTime": "2 - 27:30",
            "label": "",
            "description": "Javier Pastore (Paris SG) commits a rough challenge and Martin Atkinson blows his whistle for an infringement. Barcelona earn a free kick."
        },
        {
            "gameTime": "2 - 27:20",
            "label": "attendance",
            "description": "The attendance is 82570."
        },
        {
            "gameTime": "2 - 25:23",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "injury",
            "description": "Blaise Matuidi (Paris SG) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 24:38",
            "label": "",
            "description": "A pass by Lucas (Paris SG) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 23:01",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 22:41",
            "label": "",
            "description": "Paris SG are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. The referee blows his whistle, Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "2 - 22:30",
            "label": "substitution",
            "description": "A substitution has been made. Pedro is replaced by Ivan Rakitic (Barcelona)."
        },
        {
            "gameTime": "2 - 21:07",
            "label": "",
            "description": "The Barcelona players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 19:41",
            "label": "",
            "description": "Sergio Busquets latches onto a perfect defence splitting pass from Gerard Pique (Barcelona) and heads towards goal."
        },
        {
            "gameTime": "2 - 19:01",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) swings a cross into the box, but it's far too close to Marc Andre ter Stegen, who smothers the ball."
        },
        {
            "gameTime": "2 - 18:45",
            "label": "",
            "description": "Lucas (Paris SG) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 17:26",
            "label": "",
            "description": "Barcelona are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. The ball has crossed the sideline. Paris SG are taking a throw in."
        },
        {
            "gameTime": "2 - 16:45",
            "label": "substitution",
            "description": "Substitution. Marco Verratti will be replaced by Javier Pastore (Paris SG)."
        },
        {
            "gameTime": "2 - 16:13",
            "label": "",
            "description": "Lucas (Paris SG) goes on a mazy run and tries his luck with a mid range strike, but one of the defending players steps in and makes a block."
        },
        {
            "gameTime": "2 - 15:08",
            "label": "",
            "description": "The Barcelona players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 14:53",
            "label": "",
            "description": "David Luiz (Paris SG) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 14:18",
            "label": "injury",
            "description": "David Luiz (Paris SG) is asking for medical treatment after picking up an injury."
        },
        {
            "gameTime": "2 - 13:36",
            "label": "",
            "description": "A through ball from Neymar (Barcelona) fails to reach Lionel Messi as one of the defending players reacts brilliantly to intercept the effort. If the pass had been produced a little bit earlier, Lionel Messi could have got into a promising position."
        },
        {
            "gameTime": "2 - 12:33",
            "label": "",
            "description": "The free kick is taken short by Barcelona."
        },
        {
            "gameTime": "2 - 11:55",
            "label": "y-card",
            "description": "Edinson Cavani (Paris SG) is literally asking for a yellow card with his behaviour. The referee agrees and books him."
        },
        {
            "gameTime": "2 - 11:10",
            "label": "",
            "description": "A pass by Maxwell (Paris SG) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 10:18",
            "label": "",
            "description": "Dangerous play by Lucas (Paris SG). Martin Atkinson blows his whistle for a foul. That's a free kick to Barcelona."
        },
        {
            "gameTime": "2 - 09:20",
            "label": "",
            "description": "The referee blows his whistle after Luis Suarez (Barcelona) does a good impression of a basketball player and handles the ball."
        },
        {
            "gameTime": "2 - 09:08",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) is flagged for offside."
        },
        {
            "gameTime": "2 - 07:25",
            "label": "",
            "description": "The ball is cleared after Lucas (Paris SG) attempted to dribble past an opposing player. Blaise Matuidi (Paris SG) is first to the rebound and sends a header goalwards but it's blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "2 - 06:25",
            "label": "",
            "description": "A brilliant through ball from Lionel Messi (Barcelona) as he picks out Pedro, who darted into free space to take the pass. Pedro (Barcelona) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball is off of the pitch and it's a goal kick for Paris SG."
        },
        {
            "gameTime": "2 - 05:12",
            "label": "",
            "description": "Barcelona are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. Luis Suarez (Barcelona) attempts to outfox the defender, but he only tricks himself after getting caught in the offside trap."
        },
        {
            "gameTime": "2 - 03:59",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) finds enough space to climb high and plants a header way over the bar. What a poor effort."
        },
        {
            "gameTime": "2 - 03:36",
            "label": "corner",
            "description": "Thiago Motta (Paris SG) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 02:59",
            "label": "",
            "description": "Edinson Cavani latches onto a perfect defence splitting pass from Lucas (Paris SG) and heads towards goal. Gregory van der Wiel (Paris SG) delivers a promising cross into the box, but it's cleared. The referee points to the corner flag. It's a corner to Paris SG."
        },
        {
            "gameTime": "2 - 02:26",
            "label": "",
            "description": "Barcelona produce a short pass from the free kick."
        },
        {
            "gameTime": "2 - 02:00",
            "label": "",
            "description": "Lucas (Paris SG) commits a foul after unfairly battling his opponent for the ball. Barcelona win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 01:20",
            "label": "",
            "description": "David Luiz (Paris SG) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "2 - 01:08",
            "label": "",
            "description": "Pedro (Barcelona) was holding his opponent and can be glad he didn't receive a yellow card. A free kick to Paris SG. They can move closer towards the goal."
        },
        {
            "gameTime": "2 - 00:57",
            "label": "",
            "description": "Neymar (Barcelona) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 00:29",
            "label": "",
            "description": "Barcelona are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Martin Atkinson blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "There was certainly plenty of action during that opening 45 minutes. The first half was definitely edged by the home side. The home side have dominated the possession and midfield so far. The visitors have spent most of their time defending and waiting for the right moment to launch counter attacks."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "whistle",
            "description": "Martin Atkinson has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:04",
            "label": "",
            "description": "Marco Verratti (Paris SG) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:28",
            "label": "",
            "description": "Andres Iniesta (Barcelona) plays a one two with Neymar, but the move breaks down."
        },
        {
            "gameTime": "1 - 42:22",
            "label": "",
            "description": "The Barcelona players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 41:06",
            "label": "soccer-ball",
            "description": "What a spectacular moment! Neymar (Barcelona) skips past defenders and finds some space before firing a long range strike at goal. The fans are amazed when they see the ball go inside the right post. The scoreline is 1:1."
        },
        {
            "gameTime": "1 - 39:44",
            "label": "",
            "description": "Barcelona exchange some short passes over a small area and control the game. Now they make a mistake and lose the ball and the whole situation changes completely."
        },
        {
            "gameTime": "1 - 38:34",
            "label": "",
            "description": "Luis Suarez (Barcelona) gets on the end of a pass and produces a promising first time shot at goal. His effort is blocked by Salvatore Sirigu with a brilliant diving save!"
        },
        {
            "gameTime": "1 - 37:44",
            "label": "",
            "description": "Lucas (Paris SG) finds himself beyond the last defender but the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 37:32",
            "label": "",
            "description": "Paris SG try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "1 - 37:20",
            "label": "",
            "description": "Martin Atkinson blows his whistle. Neymar (Barcelona) commits a foul after dangerous play. Free kick. Paris SG will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 37:00",
            "label": "",
            "description": "Neymar (Barcelona) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 36:37",
            "label": "",
            "description": "Neymar (Barcelona) unleashes a shot from long range but it's well blocked."
        },
        {
            "gameTime": "1 - 35:36",
            "label": "",
            "description": "Javier Mascherano (Barcelona) fouls an opponent. At least that's what referee Martin Atkinson signals. Paris SG have a free kick."
        },
        {
            "gameTime": "1 - 35:22",
            "label": "",
            "description": "Neymar (Barcelona) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 35:07",
            "label": "",
            "description": "Barcelona keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "1 - 33:53",
            "label": "",
            "description": "A raking crossfield pass from Thiago Silva (Paris SG) lacks accuracy and the opposition gain possession."
        },
        {
            "gameTime": "1 - 33:07",
            "label": "",
            "description": "Paris SG try to speed play up by taking a quick free kick."
        },
        {
            "gameTime": "1 - 32:58",
            "label": "",
            "description": "Pedro (Barcelona) makes a rough challenge and Martin Atkinson blows his whistle for a foul. A free kick has been awarded to Paris SG."
        },
        {
            "gameTime": "1 - 32:24",
            "label": "",
            "description": "Marc Bartra (Barcelona) attempts to slip the ball through the defence, but is unable to find any of his teammates. The ball is off of the pitch and it's a goal kick for Paris SG."
        },
        {
            "gameTime": "1 - 31:52",
            "label": "",
            "description": "Barcelona restart play with a quick free kick."
        },
        {
            "gameTime": "1 - 31:40",
            "label": "",
            "description": "Martin Atkinson has a clear sight and sees a foul from Zlatan Ibrahimovic (Paris SG). Barcelona are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 30:24",
            "label": "",
            "description": "Marc Andre ter Stegen gets a well deserved ovation! Edinson Cavani (Paris SG) produces a decent first time strike towards the bottom left corner, but the goalkeeper is positioned well to block it."
        },
        {
            "gameTime": "1 - 29:55",
            "label": "",
            "description": "Paris SG take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 29:43",
            "label": "",
            "description": "Pedro (Barcelona) commits a rough challenge and Martin Atkinson blows his whistle for a foul. Paris SG have a free kick."
        },
        {
            "gameTime": "1 - 29:21",
            "label": "",
            "description": "Lionel Messi (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 28:35",
            "label": "",
            "description": "Lucas (Paris SG) does well to meet a cross from Blaise Matuidi, but he directs his shot just wide of the left post. The ball is off of the pitch and it's a goal kick for Barcelona."
        },
        {
            "gameTime": "1 - 27:21",
            "label": "",
            "description": "Barcelona exchange some short passes over a small area and control the game. Now they make a mistake and lose the ball and the whole situation changes completely. It's a throw in for Paris SG."
        },
        {
            "gameTime": "1 - 26:44",
            "label": "",
            "description": "A crossfield pass from Marc Bartra (Barcelona) fails to find any of his teammates. The ball is out of play. Paris SG will have a throw in."
        },
        {
            "gameTime": "1 - 25:54",
            "label": "",
            "description": "Pedro (Barcelona) sends a cross into the box, but Salvatore Sirigu comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 25:41",
            "label": "",
            "description": "Barcelona are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 24:34",
            "label": "",
            "description": "Pedro (Barcelona) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 23:33",
            "label": "",
            "description": "Sergio Busquets (Barcelona) attempts to surprise the keeper with a shot from distance, but it lacks accuracy and goes high over the crossbar. The ball goes out of play and Paris SG will have a goal kick."
        },
        {
            "gameTime": "1 - 23:23",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Lionel Messi (Barcelona), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 22:38",
            "label": "",
            "description": "Luis Suarez (Barcelona) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender. Barcelona win a corner."
        },
        {
            "gameTime": "1 - 21:41",
            "label": "",
            "description": "Paris SG exchange some short passes over a small area and control the game. Now they make a mistake and lose the ball and the whole situation changes completely."
        },
        {
            "gameTime": "1 - 20:53",
            "label": "",
            "description": "The free kick from long range, taken by Paris SG, is overhit and the ball goes out of play."
        },
        {
            "gameTime": "1 - 20:39",
            "label": "",
            "description": "Lionel Messi (Barcelona) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Martin Atkinson with no other option than to blow for a foul. It's a free kick to Paris SG, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 20:05",
            "label": "",
            "description": "Luis Suarez (Barcelona) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "1 - 18:46",
            "label": "soccer-ball",
            "description": "Goal 1:1! Luis Suarez laid the ball off to Lionel Messi (Barcelona), who shot from close range into the right side of the goal, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "1 - 18:30",
            "label": "",
            "description": "Andres Iniesta (Barcelona) smashes the ball upfield and Luis Suarez brings it down with a fine first touch."
        },
        {
            "gameTime": "1 - 17:45",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) sends a teasing cross into the area, but Marc Andre ter Stegen intercepts the ball."
        },
        {
            "gameTime": "1 - 17:14",
            "label": "",
            "description": "Quick reactions by Edinson Cavani (Paris SG) and Maxwell, tricking their opponents with a cheeky chip pass. A beautiful football moment and great skill, which caused the noise in the stadium to go up a notch."
        },
        {
            "gameTime": "1 - 16:26",
            "label": "",
            "description": "Luis Suarez (Barcelona) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "1 - 14:50",
            "label": "soccer-ball",
            "description": "What a goal! Blaise Matuidi plays it to Zlatan Ibrahimovic (Paris SG), who finds himself unmarked inside the box and slots a first time shot past Marc Andre ter Stegen into the bottom right corner. 0:1."
        },
        {
            "gameTime": "1 - 14:30",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) releases Lucas, who latched on to his perfect through pass and can continue with his team's attack."
        },
        {
            "gameTime": "1 - 13:55",
            "label": "",
            "description": "Marco Verratti (Paris SG) releases Blaise Matuidi, who latched on to his perfect through pass and can continue with his team's attack."
        },
        {
            "gameTime": "1 - 12:36",
            "label": "",
            "description": "Barcelona are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "1 - 11:24",
            "label": "",
            "description": "Luis Suarez (Barcelona) was too forceful with his tackle and Martin Atkinson interrupted the game to signal a free kick. A free kick to Paris SG."
        },
        {
            "gameTime": "1 - 10:51",
            "label": "",
            "description": "Thiago Silva (Paris SG) sends a long ball in, but Marc Andre ter Stegen comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 10:37",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 09:24",
            "label": "",
            "description": "A cross by Gregory van der Wiel (Paris SG) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor. The ball is behind the touchline and Barcelona will take a throw in."
        },
        {
            "gameTime": "1 - 08:28",
            "label": "",
            "description": "The Paris SG players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball."
        },
        {
            "gameTime": "1 - 08:03",
            "label": "",
            "description": "Paris SG continue the game with a quickly taken free kick."
        },
        {
            "gameTime": "1 - 07:52",
            "label": "",
            "description": "Javier Mascherano (Barcelona) makes a reckless foul in order to win the ball from his opponent. Martin Atkinson has a clear sight of it and blows his whistle. It's a free kick to Paris SG, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 07:22",
            "label": "",
            "description": "Neymar (Barcelona) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 06:40",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 06:04",
            "label": "",
            "description": "Jeremy Mathieu (Barcelona) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 05:44",
            "label": "",
            "description": "Sergio Busquets (Barcelona) takes a short free kick."
        },
        {
            "gameTime": "1 - 05:31",
            "label": "",
            "description": "Martin Atkinson couldn't ignore the rough tackle by Lucas (Paris SG) and blew his whistle. There is a free kick near the sideline to Barcelona."
        },
        {
            "gameTime": "1 - 03:42",
            "label": "",
            "description": "Lionel Messi (Barcelona) stands over the resultant free kick from mid range, but his shot goes just over the crossbar. It could have been a fantastic goal! The ball is off of the pitch and it's a goal kick for Paris SG."
        },
        {
            "gameTime": "1 - 03:13",
            "label": "",
            "description": "Lionel Messi (Barcelona) will take a free kick. Is he going to strike the ball directly at the goal? Let's find out!"
        },
        {
            "gameTime": "1 - 02:42",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) brings his opponent down. Martin Atkinson has a clear sight of it and blows his whistle for a foul. Barcelona win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 02:18",
            "label": "",
            "description": "Barcelona are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "1 - 01:10",
            "label": "",
            "description": "Gerard Pique (Barcelona) shows his brilliant passing ability after picking out Pedro with a fine lofted pass."
        },
        {
            "gameTime": "1 - 00:12",
            "label": "",
            "description": "Paris SG are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. The referee and the linesman both signal a throw in for Barcelona."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Paris SG will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Martin Atkinson is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side were better today. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "10/12/2014 - 22:45",
    "gameHomeTeam": "Barcelona",
    "gameScore": "3 - 1"
}