{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2014-2015/2015-02-21 - 18-00 Crystal Palace 1 - 2 Arsenal/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. Great display from the home side, you have to say that they were the better side today. Long balls and crosses were the main weapons of the home team. The away team tried to find the weakness in the opposition's defence especially with rapid counter attacks."
        },
        {
            "gameTime": "2 - 50:10",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 48:45",
            "label": "soccer-ball",
            "description": "Goal! Glenn Murray (Crystal Palace) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball low inside the right post. It's 1:2."
        },
        {
            "gameTime": "2 - 48:44",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) latches on to a fine cross from the resulting corner kick and slams the ball in from close range. He should have aimed better, however, as he hit his own teammate in front of him."
        },
        {
            "gameTime": "2 - 48:43",
            "label": "corner",
            "description": "There's an opportunity for Jordon Mutch (Crystal Palace) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 48:30",
            "label": "",
            "description": "Joel Ward (Crystal Palace) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. The ball is out of play. A goal scoring opportunity from a corner for Crystal Palace."
        },
        {
            "gameTime": "2 - 46:27",
            "label": "",
            "description": "He should have done better. Glenn Murray (Crystal Palace) is afforded space to connect with a Jason Puncheon cross, but his header from the centre of the box flies well wide of the left post."
        },
        {
            "gameTime": "2 - 45:02",
            "label": "",
            "description": "Glenn Murray (Crystal Palace) is adjudged offside."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 5 min. of added time."
        },
        {
            "gameTime": "2 - 43:49",
            "label": "substitution",
            "description": "Here comes a substitution. Alexis Sanchez is given a rest as he is replaced by Gabriel (Arsenal)."
        },
        {
            "gameTime": "2 - 42:06",
            "label": "",
            "description": "Glenn Murray (Crystal Palace) rises highest from the corner to head at goal, but his effort towards the middle of the goal is comfortably saved by the goalkeeper."
        },
        {
            "gameTime": "2 - 41:51",
            "label": "corner",
            "description": "Jordon Mutch (Crystal Palace) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 41:35",
            "label": "",
            "description": "Shola Ameobi (Crystal Palace) swings in a cross, but the ball is cleared to safety by one of the defending players. Crystal Palace force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 40:04",
            "label": "injury",
            "description": "The game is interrupted now, Scott Dann (Crystal Palace) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 39:49",
            "label": "y-card",
            "description": "Mark Clattenburg shows a yellow card to Calum Chambers (Arsenal), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 38:43",
            "label": "",
            "description": "A pass from Kieran Gibbs (Arsenal) is intercepted by Julian Speroni and the move breaks down."
        },
        {
            "gameTime": "2 - 38:02",
            "label": "",
            "description": "David Ospina makes a brilliant save! Yannick Bolasie (Crystal Palace) easily weaves through the defence and unleashes a shot from just outside of the box. His low shot goes towards the middle of the goal but is saved by keeper!"
        },
        {
            "gameTime": "2 - 37:26",
            "label": "",
            "description": "Great teamplay by Arsenal as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 35:01",
            "label": "",
            "description": "Tomas Rosicky (Arsenal) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 34:25",
            "label": "substitution",
            "description": "Alan Pardew prepares a substitution. Joe Ledley is replaced by Shola Ameobi (Crystal Palace)."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "substitution",
            "description": "Substitution. Dwight Gayle is replaced by Glenn Murray (Crystal Palace)."
        },
        {
            "gameTime": "2 - 32:33",
            "label": "",
            "description": "The free kick into the penalty area from Jason Puncheon (Crystal Palace) is cleared."
        },
        {
            "gameTime": "2 - 32:18",
            "label": "",
            "description": "Tomas Rosicky (Arsenal) is penalised for holding. Mark Clattenburg signals a set piece. Free kick. Crystal Palace will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 31:33",
            "label": "substitution",
            "description": "Here is a change. Danny Welbeck is going off and Arsene Wenger gives the last tactical orders to Kieran Gibbs (Arsenal)."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "substitution",
            "description": "Mesut Ozil comes off the pitch to be replaced by Tomas Rosicky (Arsenal)."
        },
        {
            "gameTime": "2 - 30:21",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 29:21",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) produces a shot from a direct free kick on the edge of the box. His effort sails narrowly wide of the left post. The goalkeeper was lucky there."
        },
        {
            "gameTime": "2 - 28:43",
            "label": "",
            "description": "Mark Clattenburg has a clear sight and sees a foul from Nacho Monreal (Arsenal). Crystal Palace are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 28:02",
            "label": "funfact",
            "description": "10:1 – the corner kicks stats."
        },
        {
            "gameTime": "2 - 27:32",
            "label": "corner",
            "description": "The resulting corner from Jason Puncheon (Crystal Palace) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 26:58",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Crystal Palace will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 25:25",
            "label": "",
            "description": "Yannick Bolasie (Crystal Palace) fizzes over a cross which doesn't cause any problems. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "2 - 24:28",
            "label": "",
            "description": "Pape Souare swings the cross over. Dwight Gayle (Crystal Palace) gets his head to it but it goes just over the crossbar."
        },
        {
            "gameTime": "2 - 23:54",
            "label": "",
            "description": "Yannick Bolasie (Crystal Palace) sends a cross into the box, but David Ospina comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 22:40",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) commits a foul and Mark Clattenburg immediately signals a free kick."
        },
        {
            "gameTime": "2 - 20:47",
            "label": "",
            "description": "David Ospina (Arsenal) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 19:24",
            "label": "injury",
            "description": "David Ospina (Arsenal) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 18:41",
            "label": "",
            "description": "Jordon Mutch (Crystal Palace) makes some space to meet a perfect cross inside the box, but he blazes his shot over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "",
            "description": "An attempted cross from Yannick Bolasie (Crystal Palace) is cleared."
        },
        {
            "gameTime": "2 - 16:35",
            "label": "",
            "description": "Olivier Giroud (Arsenal) shows too much aggression while trying to break free from his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 15:58",
            "label": "",
            "description": "Yannick Bolasie (Crystal Palace) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 15:40",
            "label": "",
            "description": "Olivier Giroud (Arsenal) had a great opportunity from mid range. His powerful volley was directed towards the right side of the goal, but Julian Speroni was alert and made an astonishing save!"
        },
        {
            "gameTime": "2 - 14:36",
            "label": "",
            "description": "Crystal Palace are happy showing off their ball keeping skills and that is only interrupted when the defender steps in."
        },
        {
            "gameTime": "2 - 12:56",
            "label": "",
            "description": "Olivier Giroud (Arsenal) is flagged for offside."
        },
        {
            "gameTime": "2 - 11:56",
            "label": "substitution",
            "description": "Alan Pardew is forced to make a change. Fraizer Campbell is unable to continue due to injury, Yannick Bolasie (Crystal Palace) comes on."
        },
        {
            "gameTime": "2 - 11:33",
            "label": "",
            "description": "What a big chance! Alexis Sanchez (Arsenal) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 10:48",
            "label": "y-card",
            "description": "Olivier Giroud (Arsenal) sees a yellow card from Mark Clattenburg after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 10:22",
            "label": "corner",
            "description": "Dwight Gayle (Crystal Palace) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 10:20",
            "label": "injury",
            "description": "Fraizer Campbell (Crystal Palace) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 10:01",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Jason Puncheon (Crystal Palace). The ball is out of play. Crystal Palace will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 09:27",
            "label": "",
            "description": "Good clearance! Dwight Gayle (Crystal Palace) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him. The ball is out of play. Crystal Palace will take a throw in."
        },
        {
            "gameTime": "2 - 07:54",
            "label": "corner",
            "description": "David Ospina comes off his line to intercept the corner from Jason Puncheon (Crystal Palace)."
        },
        {
            "gameTime": "2 - 07:35",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) fires the ball at goal from inside the area, but it's well blocked. Good work from Crystal Palace as they win a corner."
        },
        {
            "gameTime": "2 - 06:54",
            "label": "",
            "description": "Mesut Ozil (Arsenal) leaps high to meet a lofted pass around the penalty spot, but his header crashes against the crossbar!"
        },
        {
            "gameTime": "2 - 05:56",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Calum Chambers (Arsenal)."
        },
        {
            "gameTime": "2 - 04:07",
            "label": "",
            "description": "Fraizer Campbell (Crystal Palace) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 03:28",
            "label": "corner",
            "description": "Jason Puncheon (Crystal Palace) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 03:14",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) wastes a good opportunity as his pass into the box is blocked by the defence. Crystal Palace have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 03:04",
            "label": "corner",
            "description": "Jason Puncheon (Crystal Palace) works the corner short."
        },
        {
            "gameTime": "2 - 02:48",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) whips a promising cross into the box, but the opposition's defence intercepts the ball. Crystal Palace earn a corner."
        },
        {
            "gameTime": "2 - 02:38",
            "label": "corner",
            "description": "Jason Puncheon (Crystal Palace) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 02:04",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. Crystal Palace win a corner."
        },
        {
            "gameTime": "2 - 01:13",
            "label": "",
            "description": "Flag goes up against Fraizer Campbell (Crystal Palace) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Let's hope the players will show us more in the second half as the first one has been rather ordinary, devoid of goalscoring opportunities. There wasn't any evident superiority by either side during the first half. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 47:07",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:55",
            "label": "soccer-ball",
            "description": "Goal! Olivier Giroud (Arsenal) fires the rebound inside the right post after the ball breaks to him in the box. The score is 0:2."
        },
        {
            "gameTime": "1 - 45:40",
            "label": "",
            "description": "Great chance! Danny Welbeck (Arsenal) collects a great pass inside the box, but the goalkeeper does well to stop his effort."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:32",
            "label": "",
            "description": "Julian Speroni displays his ability to read the game and clears the danger after Olivier Giroud (Arsenal) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "1 - 43:02",
            "label": "",
            "description": "Calum Chambers (Arsenal) races towards goal but the defender gets back well to make a challenge. The linesman signals a throw in for Arsenal."
        },
        {
            "gameTime": "1 - 42:18",
            "label": "corner",
            "description": "Dwight Gayle (Crystal Palace) launches a cross from the corner, but David Ospina is alert to thwart the effort."
        },
        {
            "gameTime": "1 - 41:59",
            "label": "",
            "description": "Dwight Gayle (Crystal Palace) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. The ball goes out of play. Crystal Palace are awarded a corner kick."
        },
        {
            "gameTime": "1 - 41:06",
            "label": "",
            "description": "Mesut Ozil (Arsenal) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 39:51",
            "label": "",
            "description": "Danny Welbeck almost found himself in a promising position after Calum Chambers (Arsenal) tried to send a defence splitting pass, but one of the defenders reacts well and makes a timely interception."
        },
        {
            "gameTime": "1 - 39:18",
            "label": "",
            "description": "A spell of possession for Arsenal in an attempt to control the game."
        },
        {
            "gameTime": "1 - 37:20",
            "label": "",
            "description": "The free kick is taken by Santi Cazorla (Arsenal), but ball is cleared."
        },
        {
            "gameTime": "1 - 37:05",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. Arsenal have a free kick."
        },
        {
            "gameTime": "1 - 36:09",
            "label": "",
            "description": "Olivier Giroud (Arsenal) pulls the jersey of one of the opposition players and Mark Clattenburg blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 35:03",
            "label": "",
            "description": "Francis Coquelin (Arsenal) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "1 - 34:04",
            "label": "",
            "description": "Fraizer Campbell (Crystal Palace) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 33:21",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 31:58",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 31:17",
            "label": "",
            "description": "A beautiful low pass from the side is received by Dwight Gayle (Crystal Palace), who was waiting for his chance. However, the defence is alert and spanks the ball away."
        },
        {
            "gameTime": "1 - 30:42",
            "label": "",
            "description": "Santi Cazorla (Arsenal) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "1 - 29:59",
            "label": "",
            "description": "Neat passing move from Arsenal in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 27:55",
            "label": "y-card",
            "description": "The foul by Francis Coquelin (Arsenal) is worthy of a card and a yellow is duly shown by Mark Clattenburg."
        },
        {
            "gameTime": "1 - 27:18",
            "label": "",
            "description": "Mark Clattenburg interrupts the game for a tactical foul by Jason Puncheon (Crystal Palace)."
        },
        {
            "gameTime": "1 - 26:29",
            "label": "",
            "description": "Dwight Gayle (Crystal Palace) takes the free kick from mid range, but he balloons his effort high over the bar. What a miskick!"
        },
        {
            "gameTime": "1 - 25:52",
            "label": "",
            "description": "The referee blows his whistle as Calum Chambers (Arsenal) was too aggressive in his challenge. Crystal Palace win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 24:22",
            "label": "",
            "description": "Fraizer Campbell (Crystal Palace) meets a perfect cross on the edge of the box and rips a shot that goes well wide of the right post."
        },
        {
            "gameTime": "1 - 22:03",
            "label": "",
            "description": "Nacho Monreal (Arsenal) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Mark Clattenburg with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 21:15",
            "label": "",
            "description": "Laurent Koscielny (Arsenal) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but his attempt went well wide of the right post."
        },
        {
            "gameTime": "1 - 20:49",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 20:34",
            "label": "",
            "description": "Calum Chambers (Arsenal) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The referee blows his whistle, Arsenal are awarded a corner kick."
        },
        {
            "gameTime": "1 - 18:50",
            "label": "y-card",
            "description": "Jordon Mutch (Crystal Palace) picks up a yellow card for a foul."
        },
        {
            "gameTime": "1 - 18:22",
            "label": "",
            "description": "Damien Delaney (Crystal Palace) attempts a long crossfield pass, but the defence does well to intercept the ball."
        },
        {
            "gameTime": "1 - 15:40",
            "label": "",
            "description": "The Arsenal players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 13:53",
            "label": "",
            "description": "The ball is cleared after Wilfried Zaha (Crystal Palace) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 12:18",
            "label": "",
            "description": "Dwight Gayle (Crystal Palace) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 11:22",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) takes the resultant free kick from the edge of the box and tries to find one of his teammates with a cross, but the keeper climbs high and gets to it first, collecting the ball with ease."
        },
        {
            "gameTime": "1 - 10:28",
            "label": "",
            "description": "Nacho Monreal (Arsenal) makes a reckless foul in order to win the ball from his opponent. Mark Clattenburg has a clear sight of it and blows his whistle. Crystal Palace have a free kick."
        },
        {
            "gameTime": "1 - 09:39",
            "label": "corner",
            "description": "The resulting corner from Dwight Gayle (Crystal Palace) is cleared."
        },
        {
            "gameTime": "1 - 09:12",
            "label": "",
            "description": "Pape Souare (Crystal Palace) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The referee points to the corner flag. It's a corner to Crystal Palace."
        },
        {
            "gameTime": "1 - 07:55",
            "label": "soccer-ball",
            "description": "Santi Cazorla (Arsenal) slots home the penalty after firing the ball in the opposite direction to which the goalkeeper dives!"
        },
        {
            "gameTime": "1 - 06:58",
            "label": "penalty",
            "description": "Poor challenge! Pape Souare (Crystal Palace) is penalised for tripping and Mark Clattenburg blows his whistle. The referee points to the penalty spot. PENALTY to Arsenal!"
        },
        {
            "gameTime": "1 - 06:48",
            "label": "",
            "description": "Pape Souare (Crystal Palace) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 05:28",
            "label": "",
            "description": "Jordon Mutch (Crystal Palace) was holding his opponent and can be glad he didn't receive a yellow card."
        },
        {
            "gameTime": "1 - 03:52",
            "label": "",
            "description": "It looks like Francis Coquelin (Arsenal) saw red with that tackle. Mark Clattenburg won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 02:57",
            "label": "",
            "description": "Mesut Ozil (Arsenal) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 02:30",
            "label": "",
            "description": "Danny Welbeck (Arsenal) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 01:46",
            "label": "",
            "description": "Arsenal are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 00:28",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Arsenal will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Mark Clattenburg."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. Great display from the home side, you have to say that they were the better side today. Long balls and crosses were the main weapons of the home team. The away team tried to find the weakness in the opposition's defence especially with rapid counter attacks."
        }
    ],
    "gameAwayTeam": "Arsenal",
    "gameDate": "21/02/2015 - 18:00",
    "gameHomeTeam": "Crystal Palace",
    "gameScore": "1 - 2"
}