{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-16 - 21-45 Gent 1 - 1 Lyon/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. Neither of the teams had any obvious superiority in this game. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        },
        {
            "gameTime": "2 - 48:03",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 45:38",
            "label": "y-card",
            "description": "Steed Malbranque (Lyon) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but William Collum ignores the protests."
        },
        {
            "gameTime": "2 - 44:51",
            "label": "substitution",
            "description": "It's time for a substitution. Rafinha (Gent) comes on in place of Benito Raman."
        },
        {
            "gameTime": "2 - 44:37",
            "label": "",
            "description": "A player from Lyon commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "2 - 44:25",
            "label": "corner",
            "description": "The corner from Mathieu Valbuena (Lyon) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 44:24",
            "label": "",
            "description": "Christophe Jallet (Lyon) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "2 - 43:40",
            "label": "corner",
            "description": "The goalkeeper punched the ball away after Mathieu Valbuena (Lyon) took the corner."
        },
        {
            "gameTime": "2 - 42:17",
            "label": "penalty-missed",
            "description": "Penalty saved! Alexandre Lacazette (Lyon) sends the penalty towards the middle of the target, but Matz Sels doesn't move and easily saves the effort. The ball goes behind for a corner. Lyon will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 42:03",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 41:42",
            "label": "r-card",
            "description": "We have witnessed a sending off. Thomas Foket (Gent) is shown a red card and it's an early bath for him I guess."
        },
        {
            "gameTime": "2 - 41:41",
            "label": "penalty",
            "description": "Thomas Foket (Gent) robs an opponent of the ball and explodes in anger when William Collum blows for a foul. Penalty! A huge opportunity to score for Lyon."
        },
        {
            "gameTime": "2 - 41:32",
            "label": "",
            "description": "William Collum blows his whistle as Corentin Tolisso (Lyon) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 38:03",
            "label": "corner",
            "description": "Sven Kums (Gent) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 38:03",
            "label": "",
            "description": "Benito Raman (Gent) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. Good work from Gent as they win a corner."
        },
        {
            "gameTime": "2 - 37:35",
            "label": "",
            "description": "Benito Raman (Gent) attempts to find one of his teammates with a ball from a free kick outside the box. The goalkeeper climbs high above all the players in the box to intercept the cross and snuff out the opportunity."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "",
            "description": "Poor challenge! Corentin Tolisso (Lyon) is penalised for tripping and William Collum blows his whistle."
        },
        {
            "gameTime": "2 - 36:20",
            "label": "substitution",
            "description": "Here is a change. Danijel Milicevic is going off and Hein Vanhaezebrouck gives the last tactical orders to Thomas Matton (Gent)."
        },
        {
            "gameTime": "2 - 35:51",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Jordan Ferri trots off the pitch and is replaced by Steed Malbranque (Lyon)."
        },
        {
            "gameTime": "2 - 35:30",
            "label": "",
            "description": "Maxime Gonalons (Lyon) fouls an opponent. At least that's what referee William Collum signals. Gent are awarded a free kick."
        },
        {
            "gameTime": "2 - 35:11",
            "label": "",
            "description": "A cross from the free kick is whipped in by Danijel Milicevic (Gent), but one of the defenders steps in and averts the threat."
        },
        {
            "gameTime": "2 - 34:43",
            "label": "",
            "description": "Samuel Umtiti (Lyon) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "2 - 31:45",
            "label": "",
            "description": "Gent are happy to keep the ball as they wait for gaps in defence to open up. However, an opposing player steps in and clears."
        },
        {
            "gameTime": "2 - 28:49",
            "label": "",
            "description": "Great ball in from Christophe Jallet. Mathieu Valbuena (Lyon) should really have done better with a close range header, but he heads it a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 28:32",
            "label": "",
            "description": "Jeremy Morel (Lyon) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 28:04",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 25:36",
            "label": "y-card",
            "description": "Laurent Depoitre (Gent) will have to be careful for the rest of the match as he is shown a yellow card."
        },
        {
            "gameTime": "2 - 25:35",
            "label": "y-card",
            "description": "Samuel Umtiti (Lyon) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. William Collum didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 23:57",
            "label": "substitution",
            "description": "A substitution has been made. Moses Simon is replaced by Benito Raman (Gent)."
        },
        {
            "gameTime": "2 - 23:56",
            "label": "substitution",
            "description": "Hubert Fournier has decided to make a change. Aldo Kalulu (Lyon) replaces Claudio Beauvue."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "soccer-ball",
            "description": "Goal 1:1! Sven Kums laid the ball off to Danijel Milicevic (Gent), who shot from close range low into the back of the net, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 21:22",
            "label": "corner",
            "description": "The corner kick from Danijel Milicevic (Gent) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 21:13",
            "label": "",
            "description": "Danijel Milicevic (Gent) crosses the ball into the box, but one of the defending players averts the threat. The ball is out of play. Gent will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 20:00",
            "label": "",
            "description": "Mathieu Valbuena sprays a wonderful pass out to Christophe Jallet (Lyon), who cannot get enough power or direction to cause Matz Sels problems and the goalkeeper is able to watch the ball go just wide of the right post."
        },
        {
            "gameTime": "2 - 18:59",
            "label": "",
            "description": "A goal, which was scored by Alexandre Lacazette (Lyon), was disallowed due to offside."
        },
        {
            "gameTime": "2 - 17:37",
            "label": "",
            "description": "Nana Asare (Gent) sends a long ball across the pitch, but it misses its target. It's a throw in for Lyon."
        },
        {
            "gameTime": "2 - 16:02",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Claudio Beauvue (Lyon). William Collum saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "2 - 15:44",
            "label": "",
            "description": "Gent are happy to keep the ball as they wait for gaps in defence to open up. However, an opposing player steps in and clears. The ball has crossed the sideline. Gent are taking a throw in."
        },
        {
            "gameTime": "2 - 14:31",
            "label": "",
            "description": "Sven Kums (Gent) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "soccer-ball",
            "description": "Christophe Jallet (Lyon) meets the corner and displays his eye for goal as he coolly plants a header from close range into the bottom right corner. The score is 0:1."
        },
        {
            "gameTime": "2 - 12:48",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 12:35",
            "label": "corner",
            "description": "The resulting corner from Mathieu Valbuena (Lyon) only finds one of the defenders, who heads it out of danger. The ball goes out for a corner. Lyon can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 12:22",
            "label": "",
            "description": "Jeremy Morel (Lyon) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The ball goes out of play. Lyon are awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:20",
            "label": "injury",
            "description": "The game is interrupted now, Sven Kums (Gent) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 11:02",
            "label": "",
            "description": "Referee William Collum sees the trip by Sven Kums (Gent) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "2 - 09:26",
            "label": "",
            "description": "Corentin Tolisso (Lyon) connects with a cross and has an effort on goal from the edge of the box, but it ends somewhere in row Z."
        },
        {
            "gameTime": "2 - 09:02",
            "label": "",
            "description": "Moses Simon (Gent) creates himself some space on the edge of the box and unleashes a strong shot which is blocked by a defender."
        },
        {
            "gameTime": "2 - 06:51",
            "label": "",
            "description": "Danijel Milicevic (Gent) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 05:44",
            "label": "",
            "description": "William Collum blows the whistle, Maxime Gonalons (Lyon) is penalised for a foul."
        },
        {
            "gameTime": "2 - 05:15",
            "label": "",
            "description": "The linesman raises his flag. Danijel Milicevic (Gent) is adjudged offside."
        },
        {
            "gameTime": "2 - 05:02",
            "label": "",
            "description": "Christophe Jallet (Lyon) is penalised for a foul. William Collum had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 04:50",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 04:42",
            "label": "",
            "description": "Lyon have been awarded a corner kick. Christophe Jallet (Lyon) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 03:50",
            "label": "",
            "description": "Jeremy Morel (Lyon) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 02:51",
            "label": "",
            "description": "Corentin Tolisso (Lyon) misses a big chance! He fires the ball high over the crossbar from inside the 6 yard box after the ball rebounded to him."
        },
        {
            "gameTime": "2 - 02:48",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Mathieu Valbuena (Lyon). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 02:11",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) takes a wonderful touch after collecting a pass inside the box. He steers his low drive towards the right post, but the keeper dives low to keep the ball out. Lyon force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 00:32",
            "label": "substitution",
            "description": "Half time substitution. Hubert Fournier decided to make a change. Rafael is replaced by Christophe Jallet (Lyon)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The players have certainly not shown us their best yet in this clash. Let's hope the next 45 minutes will be much more attractive. No side has really dominated in this first half. The home players attempt to beat the opposition's defence using mostly counter attacks. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 47:19",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:53",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 46:37",
            "label": "",
            "description": "Jeremy Morel (Lyon) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety. Corner kick. Lyon will have an opportunity."
        },
        {
            "gameTime": "1 - 45:27",
            "label": "",
            "description": "Anthony Lopes (Lyon) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:18",
            "label": "injury",
            "description": "Anthony Lopes (Lyon) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 43:05",
            "label": "",
            "description": "Maxime Gonalons (Lyon) is able to continue to play."
        },
        {
            "gameTime": "1 - 43:00",
            "label": "",
            "description": "Corentin Tolisso (Lyon) is unable to feed a through ball into the path of his teammates. The ball is off of the pitch and it's a goal kick for Gent."
        },
        {
            "gameTime": "1 - 41:07",
            "label": "injury",
            "description": "Maxime Gonalons (Lyon) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 40:46",
            "label": "r-card",
            "description": "Brecht Dejaegere (Gent) is shown a red card by the referee for a horror tackle that simply has no place in football!"
        },
        {
            "gameTime": "1 - 39:55",
            "label": "",
            "description": "Nana Asare (Gent) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 38:56",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 38:28",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) misses a great opportunity to convert the free kick from the edge of the penalty box after firing the ball high over the crossbar of the goal."
        },
        {
            "gameTime": "1 - 37:57",
            "label": "",
            "description": "Lasse Nielsen (Gent) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. William Collum blows for the foul but keeps his cards in his pocket on this occasion. Lyon have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 37:50",
            "label": "",
            "description": "Moses Simon (Gent) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 35:14",
            "label": "",
            "description": "A pass by Lasse Nielsen (Gent) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 34:58",
            "label": "",
            "description": "Danijel Milicevic (Gent) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "1 - 33:43",
            "label": "",
            "description": "Claudio Beauvue (Lyon) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but he sent it well over the bar."
        },
        {
            "gameTime": "1 - 33:31",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) will take a corner kick."
        },
        {
            "gameTime": "1 - 32:59",
            "label": "",
            "description": "Matz Sels pulls off a great save to deny Alexandre Lacazette (Lyon) after receiving a precise defence splitting pass. The effort is headed for the bottom left corner, but the goalkeeper dives superbly to stop it. Definitely the best save of this match so far!"
        },
        {
            "gameTime": "1 - 32:37",
            "label": "",
            "description": "Lyon showcase their great team work by exchanging one two passes, but one wayward pass sees them lose possession."
        },
        {
            "gameTime": "1 - 30:23",
            "label": "",
            "description": "Thomas Foket (Gent) attempts to slip the ball through the defence, but is unable to find any of his teammates. The ball is off of the pitch and it's a goal kick for Lyon."
        },
        {
            "gameTime": "1 - 29:46",
            "label": "",
            "description": "Gent slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "1 - 27:49",
            "label": "",
            "description": "A neat pass is well received by Renato Neto (Gent), who is lurking on the edge of the box and strikes the ball on goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "1 - 25:56",
            "label": "",
            "description": "Laurent Depoitre (Gent) has a goal ruled out for offside!"
        },
        {
            "gameTime": "1 - 24:54",
            "label": "",
            "description": "Sven Kums (Gent) fashions a shot from the edge of the box after receiving an accurate pass. Anthony Lopes makes a comfortable save to stop the effort from flying into the middle of the goal."
        },
        {
            "gameTime": "1 - 23:16",
            "label": "",
            "description": "Nana Asare (Gent) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "1 - 21:40",
            "label": "",
            "description": "Gent show off their ball retention skills as they exchange one two passes and the move is only interrupted when the final pass is intercepted."
        },
        {
            "gameTime": "1 - 20:07",
            "label": "",
            "description": "Jordan Ferri (Lyon) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box well wide of the left post."
        },
        {
            "gameTime": "1 - 19:33",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Alexandre Lacazette (Lyon). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "1 - 19:12",
            "label": "",
            "description": "Lyon seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "1 - 18:14",
            "label": "",
            "description": "A crossfield pass from Lasse Nielsen (Gent) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 17:58",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) clearly handles the ball, but he is surprised when the referee blows his whistle."
        },
        {
            "gameTime": "1 - 16:50",
            "label": "corner",
            "description": "Danijel Milicevic (Gent) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 16:42",
            "label": "",
            "description": "Sven Kums (Gent) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. The referee points to the corner flag. It's a corner to Gent."
        },
        {
            "gameTime": "1 - 13:16",
            "label": "",
            "description": "Danijel Milicevic (Gent) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "1 - 12:56",
            "label": "",
            "description": "Long passes, short passes and one two passes. Gent are showcasing great team work by keeping possession and producing pin point passes from player to player. The opposition's players are finding it very difficult to intercept at the moment."
        },
        {
            "gameTime": "1 - 10:40",
            "label": "y-card",
            "description": "A yellow card for a tackle by Jordan Ferri (Lyon). William Collum doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 09:30",
            "label": "",
            "description": "OFF THE BAR! Laurent Depoitre (Gent) drifts into the box to give his teammate support. He receives a fantastic pass and shoots from close range, but it crashes against the crossbar! It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "1 - 09:25",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 06:05",
            "label": "",
            "description": "William Collum blows his whistle after Laurent Depoitre (Gent) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 04:53",
            "label": "",
            "description": "Jeremy Morel (Lyon) fails to find a teammate across the pitch with a long ball. The ball goes out of play and Gent will have a goal kick."
        },
        {
            "gameTime": "1 - 04:03",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 03:16",
            "label": "",
            "description": "Sven Kums (Gent) trips an opposition player and William Collum signals a foul."
        },
        {
            "gameTime": "1 - 02:15",
            "label": "corner",
            "description": "Danijel Milicevic (Gent) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 01:57",
            "label": "",
            "description": "Gent have a corner. Laurent Depoitre (Gent) collects a great pass inside the box and misses a golden opportunity. His low drive is headed for the bottom left corner, but the goalkeeper pulls off a marvellous diving save and denies him."
        },
        {
            "gameTime": "1 - 00:40",
            "label": "",
            "description": "A long pass, executed by Samuel Umtiti (Lyon), missed the precision to reach his teammates. The ball is out of play. Gent will have a throw in."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lyon will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "William Collum was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. Neither of the teams had any obvious superiority in this game. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        }
    ],
    "gameAwayTeam": "Lyon",
    "gameDate": "16/09/2015 - 21:45",
    "gameHomeTeam": "Gent",
    "gameScore": "1 - 1"
}