{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-25 - 22-45 Atl. Madrid 2 - 0 Galatasaray/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. This has been a real cat and mouse game, with the hosts coming out on top. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:32",
            "label": "",
            "description": "Luciano Vietto (Atl. Madrid) jumps for a cross in the goal area and produces a fine header which goes narrowly wide of the left post! What a huge opportunity!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "",
            "description": "Fernando Muslera was forced into action to thwart Oliver Torres (Atl. Madrid). He found himself some space after latching on to a pass and unleashed a shot to the right post but couldn't beat the keeper."
        },
        {
            "gameTime": "2 - 44:24",
            "label": "",
            "description": "Lukas Podolski (Galatasaray) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 43:33",
            "label": "",
            "description": "Filipe Luis (Atl. Madrid) skips past his man but can't keep the ball in play. The ball is off of the pitch and it's a goal kick for Galatasaray."
        },
        {
            "gameTime": "2 - 42:17",
            "label": "",
            "description": "Koke (Atl. Madrid) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 40:26",
            "label": "",
            "description": "Oliver Torres (Atl. Madrid) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "2 - 40:16",
            "label": "",
            "description": "Neat passing move from Atl. Madrid in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 39:10",
            "label": "",
            "description": "Olcan Adin (Galatasaray) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 38:07",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) attempts to beat the goalkeeper with an accurate shot from the free kick, which is placed dangerously close to the penalty area. However, Jan Oblak pulls off a great save to stop his attempt towards the middle of the goal."
        },
        {
            "gameTime": "2 - 37:09",
            "label": "",
            "description": "The referee blows his whistle as Jose Maria Gimenez (Atl. Madrid) was too aggressive in his challenge. Another situation results in a direct free kick for Galatasaray."
        },
        {
            "gameTime": "2 - 35:26",
            "label": "corner",
            "description": "Wesley Sneijder (Galatasaray) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 35:16",
            "label": "",
            "description": "A cross into the box from Yasin Oztekin (Galatasaray) is cleared. The ball goes out for a corner. Galatasaray can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 34:26",
            "label": "corner",
            "description": "Sinan Gumus (Galatasaray) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 34:07",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) produces a dangerous lofted cross into the box which is intercepted. Good work from Galatasaray as they win a corner."
        },
        {
            "gameTime": "2 - 32:27",
            "label": "substitution",
            "description": "Substitution. Sinan Gumus (Galatasaray) on for Hakan Balta."
        },
        {
            "gameTime": "2 - 31:25",
            "label": "",
            "description": "Koke (Atl. Madrid) picks up a lofted cross inside the box and fires a quick shot to the middle of the goal. His promising effort is kept out by Fernando Muslera, who pulls off a stunning save!"
        },
        {
            "gameTime": "2 - 30:18",
            "label": "attendance",
            "description": "The attendance is 35753."
        },
        {
            "gameTime": "2 - 30:18",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Wesley Sneijder (Galatasaray). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 30:06",
            "label": "",
            "description": "Lukas Podolski (Galatasaray) races towards goal but the defender gets back well to make a challenge. Now Galatasaray have a corner."
        },
        {
            "gameTime": "2 - 29:57",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Tiago walks off the pitch to be replaced by Saul Niguez (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 29:00",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) produces a ferocious strike from the edge of the box. His dangerous effort towards the bottom left corner is blocked by Fernando Muslera, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "2 - 27:51",
            "label": "",
            "description": "Tiago (Atl. Madrid) won himself some space after the corner kick and tries his luck with a shot from the edge of the box. His effort is directed towards the bottom right corner, but the goalkeeper is alert and makes the save."
        },
        {
            "gameTime": "2 - 27:44",
            "label": "corner",
            "description": "Corner kick. Koke (Atl. Madrid) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 27:24",
            "label": "",
            "description": "Koke (Atl. Madrid) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 26:27",
            "label": "",
            "description": "Jose Maria Gimenez (Atl. Madrid) receives a precise low pass inside the box, controls the ball and drills it to the middle of the goal, but Fernando Muslera makes a comfortable save to stop his effort."
        },
        {
            "gameTime": "2 - 25:34",
            "label": "substitution",
            "description": "That's the end of the game for Yannick Carrasco, who is replaced by Oliver Torres (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 23:06",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 22:35",
            "label": "substitution",
            "description": "Diego Simeone has decided to introduce fresh legs, with Luciano Vietto (Atl. Madrid) replacing Antoine Griezmann."
        },
        {
            "gameTime": "2 - 21:32",
            "label": "corner",
            "description": "Yannick Carrasco (Atl. Madrid) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 21:22",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee points to the corner flag and Atl. Madrid will take a corner."
        },
        {
            "gameTime": "2 - 19:25",
            "label": "soccer-ball",
            "description": "Goal! Antoine Griezmann (Atl. Madrid) fires home from very close range after latching on to a pass from Gabi. The score is 2:0."
        },
        {
            "gameTime": "2 - 18:49",
            "label": "",
            "description": "Gabi (Atl. Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "substitution",
            "description": "The game has come to an end for Bilal Kisa. He has contributed as much as he could today. He will be replaced by the fresh legs of Umut Bulut (Galatasaray)."
        },
        {
            "gameTime": "2 - 17:00",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) sprays a pass out to Fernando Torres, but he can't beat his man inside the box."
        },
        {
            "gameTime": "2 - 15:19",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) attempts to find Yannick Carrasco, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "2 - 13:16",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) threw away a promising scoring opportunity. He received a fine cross inside the 6 yard box, but his shot missed the target close to the right post."
        },
        {
            "gameTime": "2 - 11:15",
            "label": "",
            "description": "Koke (Atl. Madrid) takes a mid range free kick, but his miskick only goes into the stands. Poor shot!"
        },
        {
            "gameTime": "2 - 10:59",
            "label": "y-card",
            "description": "Olcan Adin (Galatasaray) is booked after bringing down an opponent. Nicola Rizzoli had an easy decision to make."
        },
        {
            "gameTime": "2 - 10:28",
            "label": "",
            "description": "A clumsy foul by Olcan Adin (Galatasaray) and Nicola Rizzoli blows his whistle. Atl. Madrid are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "",
            "description": "Koke (Atl. Madrid) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 09:25",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Fernando Torres (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 06:22",
            "label": "",
            "description": "Koke (Atl. Madrid) misses a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball floats high over the crossbar! The ball is off of the pitch and it's a goal kick for Galatasaray."
        },
        {
            "gameTime": "2 - 05:49",
            "label": "corner",
            "description": "The resulting corner from Gabi (Atl. Madrid) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 05:32",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort. Atl. Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 04:07",
            "label": "",
            "description": "Koke (Atl. Madrid) meets a cross inside the penalty area and unloads a good attempt towards the top left corner. Fernando Muslera is prepared, though, and denies him with a fantastic save."
        },
        {
            "gameTime": "2 - 00:48",
            "label": "",
            "description": "Jose Maria Gimenez (Atl. Madrid) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 00:40",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 00:23",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) receives a precise pass and is given time inside the box to send a promising strike towards the bottom right corner. Fernando Muslera guesses his intention and denies him with a fine save. The referee and one of his assistants signal for a corner kick to Atl. Madrid."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. The home fans will be really pleased with what they've seen from their players so far. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 47:04",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:13",
            "label": "",
            "description": "The players claim that Antoine Griezmann (Atl. Madrid) handled the ball and it seems they are right."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:43",
            "label": "",
            "description": "Good defending. Gabi (Atl. Madrid) tries to find Antoine Griezmann inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 43:09",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 42:39",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence. Atl. Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "A cross from Koke (Atl. Madrid) fails to reach the box as the defence clears the ball away to safety. The ball goes out of play. Atl. Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 41:23",
            "label": "",
            "description": "Koke (Atl. Madrid) serves up a nice cross, but Fernando Muslera punches the ball away."
        },
        {
            "gameTime": "1 - 39:36",
            "label": "",
            "description": "Gabi (Atl. Madrid) dinks a fine lofted pass from the free kick. However, one of the defenders heads the ball out of danger."
        },
        {
            "gameTime": "1 - 39:22",
            "label": "",
            "description": "Yasin Oztekin (Galatasaray) jumps into a tackle and Nicola Rizzoli blows his whistle for a foul. Atl. Madrid earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 39:03",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort."
        },
        {
            "gameTime": "1 - 38:05",
            "label": "",
            "description": "Semih Kaya (Galatasaray) brings his opponent down with a tackle and Nicola Rizzoli blows his whistle for a foul. Atl. Madrid have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 36:53",
            "label": "",
            "description": "Koke (Atl. Madrid) sprays a pass out to Antoine Griezmann, but he can't beat his man inside the box."
        },
        {
            "gameTime": "1 - 36:02",
            "label": "",
            "description": "Filipe Luis (Atl. Madrid) latches on to an accurate pass into the box and immediately unleashes a low shot goalwards. His effort is well saved by the keeper."
        },
        {
            "gameTime": "1 - 34:28",
            "label": "",
            "description": "Jose Maria Gimenez (Atl. Madrid) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 33:05",
            "label": "",
            "description": "Jose Maria Gimenez (Atl. Madrid) creates himself some space around the penalty spot and connects with the free kick. His header is badly mistimed and sails high over the bar."
        },
        {
            "gameTime": "1 - 32:49",
            "label": "",
            "description": "Gabi (Atl. Madrid) will take the free kick."
        },
        {
            "gameTime": "1 - 32:33",
            "label": "",
            "description": "Yasin Oztekin (Galatasaray) makes a reckless foul in order to win the ball from his opponent. Nicola Rizzoli has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) creates a good chance for himself and goes for goal from mid range, but the effort is well wide of the right post."
        },
        {
            "gameTime": "1 - 30:34",
            "label": "",
            "description": "Jesus Gamez (Atl. Madrid) has the ability to send the ball deep into the penalty area from throw ins and it can lead to very promising situations for his team."
        },
        {
            "gameTime": "1 - 30:10",
            "label": "",
            "description": "Jesus Gamez (Atl. Madrid) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 29:16",
            "label": "",
            "description": "Jesus Gamez (Atl. Madrid) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 28:22",
            "label": "",
            "description": "Gabi (Atl. Madrid) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 27:03",
            "label": "",
            "description": "Jem Karacan (Galatasaray) gives away a foul for a clumsy challenge. Referee Nicola Rizzoli saw the whole situation."
        },
        {
            "gameTime": "1 - 26:40",
            "label": "",
            "description": "Koke (Atl. Madrid) attempted to send a defence splitting pass into space where Fernando Torres was lurking. It could have put him one on one with the goalkeeper, but one of the defending players somehow manages to avert the threat."
        },
        {
            "gameTime": "1 - 24:42",
            "label": "substitution",
            "description": "Taffarel is forced to make a change. Jason Denayer is not able to carry on due to injury. He is replaced by Olcan Adin (Galatasaray)."
        },
        {
            "gameTime": "1 - 22:09",
            "label": "injury",
            "description": "The game is interrupted now, Jason Denayer (Galatasaray) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 21:29",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) connects with the corner kick around the penalty spot, but steers his header inches over the bar."
        },
        {
            "gameTime": "1 - 21:18",
            "label": "corner",
            "description": "There's an opportunity for Gabi (Atl. Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 21:09",
            "label": "",
            "description": "Gabi (Atl. Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball. Atl. Madrid have a corner."
        },
        {
            "gameTime": "1 - 20:58",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 20:25",
            "label": "",
            "description": "The free kick into the penalty area from Gabi (Atl. Madrid) is cleared."
        },
        {
            "gameTime": "1 - 19:41",
            "label": "",
            "description": "Koke (Atl. Madrid) smashes the ball towards goal from the edge of the penalty box, but his effort flies just a few inches wide of the right post."
        },
        {
            "gameTime": "1 - 18:21",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) clips a neat ball into the box in the direction of Antoine Griezmann, but he can't get on the end of the pass. The ball goes out of play and Galatasaray will have a goal kick."
        },
        {
            "gameTime": "1 - 18:06",
            "label": "",
            "description": "Atl. Madrid control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 17:04",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 15:29",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) receives a low pass just outside the box and unleashes a fine strike towards the middle of the goal. Fernando Muslera pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 12:22",
            "label": "soccer-ball",
            "description": "It's a goal! Antoine Griezmann (Atl. Madrid) makes it 1:0. He jumped highest to connect with a perfect cross from Gabi and planted his close range header into the right side of the goal. Fernando Muslera was helpless."
        },
        {
            "gameTime": "1 - 11:53",
            "label": "",
            "description": "Koke (Atl. Madrid) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 10:34",
            "label": "",
            "description": "What a big chance! Wesley Sneijder (Galatasaray) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 09:50",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) tries to find Fernando Torres, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 07:08",
            "label": "",
            "description": "Koke (Atl. Madrid) passes the ball onto Antoine Griezmann, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 05:00",
            "label": "corner",
            "description": "Koke (Atl. Madrid) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 04:45",
            "label": "",
            "description": "Jesus Gamez (Atl. Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away. The referee and his assistant both point at the corner flag. Atl. Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 03:41",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "",
            "description": "Koke (Atl. Madrid) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 01:11",
            "label": "",
            "description": "Tiago (Atl. Madrid) swings it in and Fernando Torres gets on the end of it, but Fernando Muslera shows good awareness and comes off his line to thwart the move."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Galatasaray will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Nicola Rizzoli was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. This has been a real cat and mouse game, with the hosts coming out on top. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "Galatasaray",
    "gameDate": "25/11/2015 - 22:45",
    "gameHomeTeam": "Atl. Madrid",
    "gameScore": "2 - 0"
}