{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-03-18 - 22-45 Dortmund 0 - 3 Juventus/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. You have to say that the visitors have been the better side. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 46:08",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 45:26",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball sails well over the bar!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:27",
            "label": "injury",
            "description": "The game is interrupted now, Leonardo Bonucci (Juventus) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 43:07",
            "label": "attendance",
            "description": "The attendance is 65851."
        },
        {
            "gameTime": "2 - 42:36",
            "label": "",
            "description": "Juventus enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 41:49",
            "label": "",
            "description": "Oliver Kirch (Dortmund) tries his luck with and strikes the ball towards goal from long range, but it is blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 40:07",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards wide of the left post."
        },
        {
            "gameTime": "2 - 38:52",
            "label": "",
            "description": "Adrian Ramos (Dortmund) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 38:39",
            "label": "",
            "description": "Kevin Kampl (Dortmund) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 38:17",
            "label": "corner",
            "description": "The corner kick from Marco Reus (Dortmund) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 37:46",
            "label": "",
            "description": "Jakub Blaszczykowski (Dortmund) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender. The ball goes out for a corner. Dortmund can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 35:43",
            "label": "substitution",
            "description": "The substitution has been made. Simone Pepe (Juventus) has replaced Carlos Tevez."
        },
        {
            "gameTime": "2 - 33:49",
            "label": "soccer-ball",
            "description": "Goal! Roberto Pereyra displays great vision and sends a pass to Carlos Tevez (Juventus), who shows brilliant composure inside the box to bury the ball into the back of the net. The score is 0:3."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "",
            "description": "Adrian Ramos (Dortmund) after a cross wins the header inside the box and steers it goalwards, but Gianluigi Buffon produces a wonderful reflex save."
        },
        {
            "gameTime": "2 - 32:36",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Alessandro Matri (Juventus) comes onto the pitch so that Alvaro Morata can be given a rest."
        },
        {
            "gameTime": "2 - 30:47",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "2 - 28:49",
            "label": "",
            "description": "Sokratis (Dortmund) is adjudged offside."
        },
        {
            "gameTime": "2 - 28:41",
            "label": "",
            "description": "Dangerous play by Arturo Vidal (Juventus). Milorad Mazic blows his whistle for a foul. Dortmund will take a free kick."
        },
        {
            "gameTime": "2 - 27:17",
            "label": "y-card",
            "description": "Marco Reus (Dortmund) fails to control his temper and is booked by the referee for dissent."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "Oliver Kirch (Dortmund) was trying to get to the ball but clattered into the legs of the opponent as well. Milorad Mazic blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 24:56",
            "label": "soccer-ball",
            "description": "Goal! Carlos Tevez feeds Alvaro Morata (Juventus), who taps the ball into an empty net. He makes it 0:2."
        },
        {
            "gameTime": "2 - 22:19",
            "label": "corner",
            "description": "The resulting corner from Marco Reus (Dortmund) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 21:52",
            "label": "",
            "description": "Neven Subotic (Dortmund) hammers the ball towards goal from long range, but one of the defenders reacts brilliantly to block the shot. Dortmund force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 21:38",
            "label": "",
            "description": "An attempted cross from Ilkay Gundogan (Dortmund) is cleared."
        },
        {
            "gameTime": "2 - 18:40",
            "label": "",
            "description": "Sokratis (Dortmund) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to make a change. Adrian Ramos (Dortmund) replaces Sven Bender."
        },
        {
            "gameTime": "2 - 17:52",
            "label": "substitution",
            "description": "Jakub Blaszczykowski (Dortmund) joins the action as a substitute, replacing Henrikh Mkhitaryan."
        },
        {
            "gameTime": "2 - 17:30",
            "label": "",
            "description": "Kevin Kampl (Dortmund) produces a good strike that sails to the middle of the goal, but his effort ends up in the goalkeeper's gloves."
        },
        {
            "gameTime": "2 - 15:42",
            "label": "",
            "description": "Good defending. Henrikh Mkhitaryan (Dortmund) tries to find Kevin Kampl inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 14:57",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Dortmund."
        },
        {
            "gameTime": "2 - 12:17",
            "label": "",
            "description": "Juventus are enjoying a spell of pressure at the moment, but one of the defenders gets it clear. The ball is out of play. Juventus will take a throw in."
        },
        {
            "gameTime": "2 - 10:16",
            "label": "",
            "description": "Roman Weidenfeller pulls off a great save to deny Alvaro Morata (Juventus), who makes himself some space inside the box and unleashes a quick low drive to the bottom left corner."
        },
        {
            "gameTime": "2 - 09:43",
            "label": "",
            "description": "Flag goes up against Mats Hummels (Dortmund) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 09:08",
            "label": "",
            "description": "A clumsy foul by Roberto Pereyra (Juventus) and Milorad Mazic blows his whistle."
        },
        {
            "gameTime": "2 - 08:15",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "2 - 07:42",
            "label": "",
            "description": "The linesman raises his flag for offside before Alvaro Morata (Juventus) heads on."
        },
        {
            "gameTime": "2 - 05:51",
            "label": "corner",
            "description": "The resulting corner from Claudio Marchisio (Juventus) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 05:32",
            "label": "",
            "description": "Claudio Marchisio (Juventus) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The referee blows his whistle, Juventus are awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:12",
            "label": "",
            "description": "Giorgio Chiellini (Juventus) gets himself onto the end of the corner, but his header is blocked."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "corner",
            "description": "Claudio Marchisio (Juventus) will take the corner."
        },
        {
            "gameTime": "2 - 04:22",
            "label": "",
            "description": "Alvaro Morata (Juventus) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Roman Weidenfeller guesses his intention and denies him with a fine save. Juventus get a corner."
        },
        {
            "gameTime": "2 - 03:49",
            "label": "",
            "description": "Oliver Kirch (Dortmund) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 03:09",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) looks to break free, but an opposing player clears the ball away. The ball has crossed the sideline. Dortmund are taking a throw in."
        },
        {
            "gameTime": "2 - 01:50",
            "label": "",
            "description": "Juventus continue the game with a quickly taken free kick."
        },
        {
            "gameTime": "2 - 01:40",
            "label": "",
            "description": "Kevin Kampl (Dortmund) fouls an opponent. At least that's what referee Milorad Mazic signals."
        },
        {
            "gameTime": "2 - 00:02",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to make a substitution during the half time break. Oliver Kirch (Dortmund) comes on the pitch for Marcel Schmelzer."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We are watching a run of the mill game with only a few moments to ignite the crowd. The players surely can surely perform better, they just need to motivate themselves. The game is quite balanced. The home team are playing possession football, while the away team look to find a weakness in the opposition's defence mainly with their rapid counter attacks."
        },
        {
            "gameTime": "1 - 46:04",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Milorad Mazic has ended it."
        },
        {
            "gameTime": "1 - 45:28",
            "label": "",
            "description": "Claudio Marchisio (Juventus) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Milorad Mazic with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:28",
            "label": "",
            "description": "Decent spell from Dortmund here and they keep the pressure on until one of the defending players steps in."
        },
        {
            "gameTime": "1 - 42:55",
            "label": "",
            "description": "Leonardo Bonucci (Juventus) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "1 - 42:45",
            "label": "",
            "description": "Sven Bender (Dortmund) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 41:50",
            "label": "",
            "description": "Alvaro Morata (Juventus) fails to score from close range. He picks up a rebound, but sends it wide of the target!"
        },
        {
            "gameTime": "1 - 40:01",
            "label": "",
            "description": "Sokratis (Dortmund) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates. The ball is behind the touchline and Juventus will take a throw in."
        },
        {
            "gameTime": "1 - 37:12",
            "label": "",
            "description": "The ball is cleared after Roberto Pereyra (Juventus) attempted to dribble past an opposing player. The linesman signals a throw in for Dortmund."
        },
        {
            "gameTime": "1 - 36:36",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) unleashes a shot, but it's well wide of the left hand post."
        },
        {
            "gameTime": "1 - 35:49",
            "label": "",
            "description": "Claudio Marchisio (Juventus) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "1 - 34:33",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 34:20",
            "label": "",
            "description": "Some patient build up play from Dortmund as they look to unlock the defence."
        },
        {
            "gameTime": "1 - 32:42",
            "label": "",
            "description": "Sven Bender (Dortmund) sends a teasing cross into the area, but Gianluigi Buffon intercepts the ball."
        },
        {
            "gameTime": "1 - 31:19",
            "label": "",
            "description": "Marco Reus (Dortmund) plays a one two with Henrikh Mkhitaryan, but the move breaks down."
        },
        {
            "gameTime": "1 - 30:57",
            "label": "corner",
            "description": "Kevin Kampl (Dortmund) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 30:38",
            "label": "",
            "description": "Marco Reus (Dortmund) puts a cross into the box from the free kick, but the defender gets there first. The referee and one of his assistants signal for a corner kick to Dortmund."
        },
        {
            "gameTime": "1 - 29:28",
            "label": "",
            "description": "Milorad Mazic blows his whistle for a foul after Alvaro Morata (Juventus) hacks down one of his opponents. Dortmund get a free kick."
        },
        {
            "gameTime": "1 - 28:57",
            "label": "corner",
            "description": "Kevin Kampl (Dortmund) whips in a cross from the corner, but Gianluigi Buffon is well positioned and punches the ball away."
        },
        {
            "gameTime": "1 - 28:36",
            "label": "",
            "description": "A cross from Marcel Schmelzer (Dortmund) fails to reach the box as the defence clears the ball away to safety. Dortmund will take a corner kick."
        },
        {
            "gameTime": "1 - 26:39",
            "label": "substitution",
            "description": "Massimiliano Allegri is forced to make a change. Paul Pogba is not able to carry on due to injury. He is replaced by Andrea Barzagli (Juventus)."
        },
        {
            "gameTime": "1 - 26:20",
            "label": "",
            "description": "Arturo Vidal (Juventus) pounces on the rebound on the edge of the box but his wild shot goes high over the crossbar."
        },
        {
            "gameTime": "1 - 26:11",
            "label": "corner",
            "description": "Claudio Marchisio (Juventus) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 25:47",
            "label": "injury",
            "description": "Paul Pogba (Juventus) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 25:25",
            "label": "",
            "description": "Alvaro Morata (Juventus) tries to slide the ball through to a teammate but it's well blocked by a defender. Juventus earn a corner."
        },
        {
            "gameTime": "1 - 24:22",
            "label": "",
            "description": "Sokratis (Dortmund) was too forceful with his tackle and Milorad Mazic interrupted the game to signal a free kick. Juventus take a quick free kick and immediately restart play."
        },
        {
            "gameTime": "1 - 23:26",
            "label": "",
            "description": "Paul Pogba (Juventus) commits a rough foul. Milorad Mazic stops the game and makes a call."
        },
        {
            "gameTime": "1 - 23:09",
            "label": "",
            "description": "The linesman raises his flag. Roberto Pereyra (Juventus) is adjudged offside."
        },
        {
            "gameTime": "1 - 22:33",
            "label": "",
            "description": "Marco Reus (Dortmund) attempts to find one of his teammates with a ball from a free kick outside the box. The goalkeeper climbs high above all the players in the box to intercept the cross and snuff out the opportunity."
        },
        {
            "gameTime": "1 - 21:21",
            "label": "",
            "description": "Arturo Vidal (Juventus) makes an overly aggressive challenge and Milorad Mazic blows his whistle for a foul. Dortmund are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 20:57",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) pulls the trigger and strikes the ball towards goal from long range, but his effort is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 20:37",
            "label": "",
            "description": "Marco Reus (Dortmund) steps up to take a free kick and sends it in, but the opposition's defence is alert and clears the ball to safety."
        },
        {
            "gameTime": "1 - 19:30",
            "label": "",
            "description": "Milorad Mazic blows his whistle after Arturo Vidal (Juventus) kicks an opponent's legs instead of the ball. Dortmund have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 18:25",
            "label": "",
            "description": "Kevin Kampl (Dortmund) sends a cross into the box, but Gianluigi Buffon comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 17:53",
            "label": "",
            "description": "The Dortmund players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 15:48",
            "label": "",
            "description": "Arturo Vidal (Juventus) clearly handles the ball, but he is surprised when the referee blows his whistle."
        },
        {
            "gameTime": "1 - 15:31",
            "label": "corner",
            "description": "Claudio Marchisio (Juventus) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "1 - 14:58",
            "label": "",
            "description": "Roman Weidenfeller gets a well deserved ovation! He pulls off a remarkable save to block a long range effort from Stephan Lichtsteiner (Juventus) towards the left side of the target. Nice goalkeeping skills! The referee points to the corner flag and Juventus will take a corner."
        },
        {
            "gameTime": "1 - 14:07",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) sends a long ball in, but Gianluigi Buffon comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 13:05",
            "label": "",
            "description": "Alvaro Morata (Juventus) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 11:44",
            "label": "",
            "description": "Mats Hummels (Dortmund) fails to find a teammate across the pitch with a long ball. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "1 - 11:04",
            "label": "",
            "description": "Dortmund quickly take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 10:54",
            "label": "",
            "description": "The game is interrupted, a clear handball by Arturo Vidal (Juventus)."
        },
        {
            "gameTime": "1 - 09:41",
            "label": "",
            "description": "Kevin Kampl (Dortmund) and Henrikh Mkhitaryan try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 07:42",
            "label": "corner",
            "description": "Gianluigi Buffon comes off his line to intercept the corner from Marco Reus (Dortmund)."
        },
        {
            "gameTime": "1 - 07:11",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) fails to send a pass into the box as his effort is cut out. The ball goes out of play. Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 05:53",
            "label": "",
            "description": "Dortmund players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "1 - 04:17",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 02:33",
            "label": "soccer-ball",
            "description": "Carlos Tevez (Juventus) collected a pass and decided to shoot from about 24 metres out. He hit it perfectly! The ball zoomed around the goalkeeper and ended up in the top left corner."
        },
        {
            "gameTime": "1 - 01:41",
            "label": "",
            "description": "Carlos Tevez (Juventus) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 00:51",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) produces a killer pass onto Marco Reus, who loses the ball to one of the defenders."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Dortmund will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Milorad Mazic."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. You have to say that the visitors have been the better side. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "Juventus",
    "gameDate": "18/03/2015 - 22:45",
    "gameHomeTeam": "Dortmund",
    "gameScore": "0 - 3"
}