{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-12-20 - 18-00 Real Madrid 1 - 0 Rayo Vallecano/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Real Madrid were better today and displayed masterful control and movement. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        },
        {
            "gameTime": "2 - 47:08",
            "label": "whistle",
            "description": "Ignacio Iglesias Villanueva is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:46",
            "label": "soccer-ball",
            "description": "Goal! Mateo Kovacic plays in Karim Benzema (Real Madrid), who shows great determination to get to the ball before a couple of defenders and from inside the box slots it into the bottom right corner 10:2."
        },
        {
            "gameTime": "2 - 43:27",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "2 - 42:35",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is caught offside!"
        },
        {
            "gameTime": "2 - 41:19",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 41:02",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) has a shot blocked from inside the box. Real Madrid win a corner."
        },
        {
            "gameTime": "2 - 39:27",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) finds some space inside the box and produces a first time shot that goes high over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "2 - 39:11",
            "label": "corner",
            "description": "The resulting set piece from Real Madrid is comfortably intercepted by one of the defending players."
        },
        {
            "gameTime": "2 - 38:57",
            "label": "",
            "description": "Karim Benzema (Real Madrid) misses a good chance to score. An inch perfect cross into the box finds Karim Benzema (Real Madrid) who rises for a header, but sends the ball well over the bar. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "2 - 37:40",
            "label": "",
            "description": "Ignacio Iglesias Villanueva couldn't ignore the rough tackle by Luka Modric (Real Madrid) and blew his whistle."
        },
        {
            "gameTime": "2 - 34:53",
            "label": "substitution",
            "description": "That's the end of the game for Ze Castro, who is replaced by Jonatan Montiel Caballero (Rayo Vallecano)."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Luka Modric, who plays a vital role in the build up. He squares it to Karim Benzema (Real Madrid), who beats Yoel with a brilliant shot into the bottom left corner. 9:2."
        },
        {
            "gameTime": "2 - 33:50",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 33:42",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) is unlucky with a goal bound effort from the edge of the box. A fortuitous save from Yoel stops the ball from going into the middle of the goal. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 31:57",
            "label": "",
            "description": "CHANCE! Cristiano Ronaldo (Real Madrid) fires just wide of the right post from inside the box after running onto a splendid pass from Karim Benzema."
        },
        {
            "gameTime": "2 - 31:39",
            "label": "",
            "description": "This was a piece of cake for Keylor Navas. Marin Ruz Quini (Rayo Vallecano) found himself some space after latching on to a pass, but his strike only went low to the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 30:10",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives an accurate pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, his effort goes high above the crossbar."
        },
        {
            "gameTime": "2 - 28:18",
            "label": "substitution",
            "description": "Substitution. Alvaro Arbeloa (Real Madrid) in, Gareth Bale out."
        },
        {
            "gameTime": "2 - 26:14",
            "label": "y-card",
            "description": "Today's referee Ignacio Iglesias Villanueva rightly decides to book Danilo (Real Madrid) for his harsh tackle."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "soccer-ball",
            "description": "Gareth Bale (Real Madrid) has a great chance inside the box and puts the ball into the back of the net."
        },
        {
            "gameTime": "2 - 23:26",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) wins himself just enough space inside the box to connect with the corner. His header flies towards the middle of the goal, but the goalkeeper blocks the effort."
        },
        {
            "gameTime": "2 - 22:39",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "2 - 22:22",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Mateo Kovacic (Real Madrid). The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 21:13",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a lofted pass in the goal area and unleashes a dangerous header which sails narrowly wide of the right post!"
        },
        {
            "gameTime": "2 - 20:51",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "2 - 20:33",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to find any of his teammates inside the box as his pass is blocked. The ball is out of play and Real Madrid manage to earn a corner."
        },
        {
            "gameTime": "2 - 19:35",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from James Rodriguez as he is replaced by Mateo Kovacic (Real Madrid)."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "substitution",
            "description": "Here is a change. Lass Bangoura is going off and Francisco Jemez Martin gives the last tactical orders to Bebe (Rayo Vallecano)."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Lucas (Real Madrid) for Marcelo."
        },
        {
            "gameTime": "2 - 15:43",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Cristiano Ronaldo is the provider as he slips the ball to Gareth Bale (Real Madrid) who simply steers it home from close range. It's 7:2."
        },
        {
            "gameTime": "2 - 13:08",
            "label": "",
            "description": "produced a promising shot low towards the middle of the goal after his wonderful solo run, but Keylor Navas (Real Madrid) thwarted him with a fabulous save and the score remains the same."
        },
        {
            "gameTime": "2 - 11:42",
            "label": "",
            "description": "James Rodriguez (Real Madrid) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 10:44",
            "label": "",
            "description": "Marin Ruz Quini (Rayo Vallecano) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 10:19",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 07:55",
            "label": "soccer-ball",
            "description": "James Rodriguez produces a beautiful lofted cross into the box, where Cristiano Ronaldo (Real Madrid) rises high to head the ball into the left side of the goal and beyond the goalkeeper. He makes it 6:2."
        },
        {
            "gameTime": "2 - 07:36",
            "label": "",
            "description": "Good defending. Karim Benzema (Real Madrid) tries to find Cristiano Ronaldo inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 06:23",
            "label": "",
            "description": "tries his luck with a low long range effort after receiving a precise pass, but Keylor Navas (Real Madrid) has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 04:54",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 04:40",
            "label": "",
            "description": "Yoel can hear the fans clapping for his superb goalkeeping after he magnificently stops the close range effort from Cristiano Ronaldo (Real Madrid). The ball would have probably ended up low inside the middle of the net. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 02:46",
            "label": "soccer-ball",
            "description": "James Rodriguez produces a sweet pass and picks out Karim Benzema (Real Madrid) inside the box. He quickly takes a shot which goes into the bottom right corner and leaves the goalkeeper helpless. He makes it 4:2!"
        },
        {
            "gameTime": "2 - 01:51",
            "label": "",
            "description": "Karim Benzema (Real Madrid) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Ignacio Iglesias Villanueva blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. The home side is in control of this game. The tactic of the home side is slow build up play, while the away team's game is based on long passes and crosses into the box."
        },
        {
            "gameTime": "1 - 47:10",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:01",
            "label": "",
            "description": "A pass from Gareth Bale (Real Madrid) is intercepted by Yoel and the move breaks down."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:40",
            "label": "",
            "description": "A player from Real Madrid commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "1 - 43:45",
            "label": "",
            "description": "Real Madrid control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "soccer-ball",
            "description": "Goal! James Rodriguez displays great vision and sends a pass to Gareth Bale (Real Madrid), who shows brilliant composure inside the box to bury the ball into the bottom right corner. The score is 4:2."
        },
        {
            "gameTime": "1 - 40:36",
            "label": "",
            "description": "Gareth Bale (Real Madrid) clips a neat ball into the box in the direction of Cristiano Ronaldo, but he can't get on the end of the pass."
        },
        {
            "gameTime": "1 - 38:51",
            "label": "corner",
            "description": "Real Madrid take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 38:34",
            "label": "",
            "description": "Marcelo (Real Madrid) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat. Now Real Madrid have a corner."
        },
        {
            "gameTime": "1 - 36:40",
            "label": "",
            "description": "Luka Modric (Real Madrid) finds space on the edge of the box, but his wild shot goes high over the bar."
        },
        {
            "gameTime": "1 - 36:20",
            "label": "",
            "description": "James Rodriguez (Real Madrid) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "1 - 33:26",
            "label": "",
            "description": "Ignacio Iglesias Villanueva blows his whistle after Lass Bangoura (Rayo Vallecano) brings one of his opponents down with a strong tackle. Real Madrid are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 31:59",
            "label": "corner",
            "description": "Marcelo (Real Madrid) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 31:05",
            "label": "",
            "description": "Real Madrid are playing some nice combination football, sending it precisely from player to player, but a defender shows good anticipation and ends the move with a good block. Real Madrid get a corner."
        },
        {
            "gameTime": "1 - 29:34",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) smoothly converts the penalty with a beautiful low drive into the left side of the net."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 27:28",
            "label": "yr-card",
            "description": "picks up his second yellow card from referee Ignacio Iglesias Villanueva and is given his marching orders."
        },
        {
            "gameTime": "1 - 27:26",
            "label": "penalty",
            "description": "clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play. Real Madrid are awarded a penalty! What an opportunity to score."
        },
        {
            "gameTime": "1 - 27:20",
            "label": "",
            "description": "Toni Kroos (Real Madrid) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 26:56",
            "label": "y-card",
            "description": "Nacho Martinez (Rayo Vallecano) is punished with the yellow card."
        },
        {
            "gameTime": "1 - 24:58",
            "label": "soccer-ball",
            "description": "It's a goal! Gareth Bale (Real Madrid) makes it 1:2. He jumped highest to connect with a perfect cross from Danilo and planted his close range header into the bottom left corner. Yoel was helpless."
        },
        {
            "gameTime": "1 - 23:55",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) connects with the corner but his looping header goes well over."
        },
        {
            "gameTime": "1 - 23:20",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) will take the corner."
        },
        {
            "gameTime": "1 - 22:54",
            "label": "",
            "description": "Gareth Bale (Real Madrid) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. The referee points to the corner flag and Real Madrid will take a corner."
        },
        {
            "gameTime": "1 - 22:02",
            "label": "corner",
            "description": "Roberto Trashorras (Rayo Vallecano) sends over a poor, overhit cross from the corner kick and the ball goes out of play."
        },
        {
            "gameTime": "1 - 21:25",
            "label": "",
            "description": "Rayo Vallecano keep the ball well and push forward with purpose, but here comes an interception from the opposition. The ball goes out of play. Rayo Vallecano are awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:50",
            "label": "substitution",
            "description": "That will be all from Pablo Hernandez who is being replaced by the fresh legs of Marin Ruz Quini (Rayo Vallecano)."
        },
        {
            "gameTime": "1 - 20:04",
            "label": "",
            "description": "Gareth Bale (Real Madrid) stands over the free kick and opts to take it himself, but his low effort is straight at Yoel."
        },
        {
            "gameTime": "1 - 18:50",
            "label": "y-card",
            "description": "is awarded a yellow card. The referee showed him no mercy."
        },
        {
            "gameTime": "1 - 18:30",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 17:19",
            "label": "",
            "description": "Luka Modric (Real Madrid) unleashes a decent effort from just outside the box which goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 16:47",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 16:28",
            "label": "",
            "description": "Danilo (Real Madrid) tries to send a pass but it's blocked. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 14:46",
            "label": "y-card",
            "description": "Roberto Trashorras (Rayo Vallecano) is booked for saying more than Ignacio Iglesias Villanueva was willing to tolerate."
        },
        {
            "gameTime": "1 - 13:59",
            "label": "r-card",
            "description": "Tito (Rayo Vallecano) must think that he is playing a different sport because his behaviour has nothing to do with football and the referee has no choice but to show him a straight red card!"
        },
        {
            "gameTime": "1 - 13:55",
            "label": "corner",
            "description": "The resulting corner from Roberto Trashorras (Rayo Vallecano) is cleared."
        },
        {
            "gameTime": "1 - 12:53",
            "label": "",
            "description": "What a wasted opportunity by Pablo Hernandez (Rayo Vallecano)! He creates himself some space inside the penalty box and unleashes a decent strike towards the left side of the goal, but Keylor Navas makes an astonishing save to thwart him. The ball is out of play. A goal scoring opportunity from a corner for Rayo Vallecano."
        },
        {
            "gameTime": "1 - 11:49",
            "label": "soccer-ball",
            "description": "Jozabed Sanchez (Rayo Vallecano) leaps to meet a beautiful cross and produces a header which goes low inside the right post."
        },
        {
            "gameTime": "1 - 09:53",
            "label": "soccer-ball",
            "description": "Gooal! Roberto Trashorras takes over corner duties. Antonio Amaya (Rayo Vallecano) gets his head on the ball from the corner and puts it into the bottom right corner. 1:1."
        },
        {
            "gameTime": "1 - 09:21",
            "label": "corner",
            "description": "Roberto Trashorras (Rayo Vallecano) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 09:02",
            "label": "",
            "description": "attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. It will be a corner kick for Rayo Vallecano."
        },
        {
            "gameTime": "1 - 07:49",
            "label": "",
            "description": "The game is interrupted as is flagged offside."
        },
        {
            "gameTime": "1 - 06:29",
            "label": "",
            "description": "Lass Bangoura (Rayo Vallecano) brings his opponent down. Ignacio Iglesias Villanueva has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 02:55",
            "label": "soccer-ball",
            "description": "Goal Danilo (Real Madrid)! Danilo (Real Madrid) was put through by Gareth Bale and he showed brilliant composure inside the box to bury the ball into the back of the net. 1:0."
        },
        {
            "gameTime": "1 - 01:48",
            "label": "corner",
            "description": "The corner from Roberto Trashorras (Rayo Vallecano) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "",
            "description": "A cross from Pablo Hernandez (Rayo Vallecano) fails to reach the box as the defence clears the ball away to safety. The referee points to the corner flag. It's a corner to Rayo Vallecano."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ignacio Iglesias Villanueva was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Real Madrid were better today and displayed masterful control and movement. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        }
    ],
    "gameAwayTeam": "Rayo Vallecano",
    "gameDate": "20/12/2015 - 18:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "1 - 0"
}