{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-10-02 - 19-00 AC Milan 4 - 3 Sassuolo/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. It was an even match on the whole, with both sides enjoying spells in the ascendancy. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 49:14",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 48:21",
            "label": "",
            "description": "Luca Antei (Sassuolo) brings his opponent down. Marco Guida has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "y-card",
            "description": "Davide Biondini (Sassuolo) picks up a yellow card for an infringement."
        },
        {
            "gameTime": "2 - 45:35",
            "label": "y-card",
            "description": "Matteo Politano (Sassuolo) got a yellow card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:42",
            "label": "",
            "description": "Francesco Magnanelli (Sassuolo) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "2 - 43:24",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) brings an opponent down and Marco Guida interrupts the game. Sassuolo have a free kick."
        },
        {
            "gameTime": "2 - 43:07",
            "label": "",
            "description": "Pol Lirola (Sassuolo) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 40:17",
            "label": "",
            "description": "Matteo Politano (Sassuolo) swings a cross into the box, but it's far too close to Gianluigi Donnarumma, who smothers the ball."
        },
        {
            "gameTime": "2 - 38:51",
            "label": "",
            "description": "Federico Ricci (Sassuolo) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 38:41",
            "label": "corner",
            "description": "A dangerous looking corner kick from Federico Ricci (Sassuolo) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "",
            "description": "A beautiful low pass from the side is received by Pietro Iemmello (Sassuolo), who was waiting for his chance. However, the defence is alert and spanks the ball away. The ball is out of play and Sassuolo manage to earn a corner."
        },
        {
            "gameTime": "2 - 37:11",
            "label": "substitution",
            "description": "Vincenzo Montella has decided to introduce fresh legs, with Andrea Poli (AC Milan) replacing Carlos Bacca."
        },
        {
            "gameTime": "2 - 36:46",
            "label": "substitution",
            "description": "Substitution. Lorenzo Pellegrini makes his way off the pitch and Pietro Iemmello (Sassuolo) comes on as his replacement."
        },
        {
            "gameTime": "2 - 35:54",
            "label": "",
            "description": "Federico Ricci (Sassuolo) sends a chip pass into the box, but Gianluigi Donnarumma is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 34:58",
            "label": "corner",
            "description": "Matteo Politano (Sassuolo) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 34:39",
            "label": "",
            "description": "Gianluigi Donnarumma makes a sensational save to thwart a great chance. A rebound falls to Matteo Politano (Sassuolo) on the edge of the box and he strikes goalwards, but the ball ends up in the keeper's gloves instead of inside the right post. The ball goes out for a corner. Sassuolo can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 34:24",
            "label": "",
            "description": "Pol Lirola (Sassuolo) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 32:37",
            "label": "substitution",
            "description": "A substitution has been made. Claud Adjapong is replaced by Federico Ricci (Sassuolo)."
        },
        {
            "gameTime": "2 - 31:52",
            "label": "soccer-ball",
            "description": "Gabriel Paletta (AC Milan) scores from a quite difficult position as he leaps high to connect with a cross and powers his header low inside the left post. Excellent finish."
        },
        {
            "gameTime": "2 - 31:40",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 30:39",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) takes the resulting free kick from the edge of the box. His effort heads for the top of the net, but Andrea Consigli denies him. The ball goes out of play. AC Milan are awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:05",
            "label": "y-card",
            "description": "Marco Guida shows a yellow card to Lorenzo Pellegrini (Sassuolo), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 29:13",
            "label": "",
            "description": "Lorenzo Pellegrini (Sassuolo) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 27:55",
            "label": "soccer-ball",
            "description": "Manuel Locatelli (AC Milan) quickly gets to a rebound. He is not worried how far out he is and slams the ball towards the goal. To the amazement of all, it goes all the way into the top left corner. He makes it 1:1 with this magnificent strike."
        },
        {
            "gameTime": "2 - 26:50",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 26:41",
            "label": "",
            "description": "An attempted cross from Mattia De Sciglio (AC Milan) is cleared. The referee signals a corner kick to AC Milan."
        },
        {
            "gameTime": "2 - 25:44",
            "label": "",
            "description": "The AC Milan players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "soccer-ball",
            "description": "Carlos Bacca (AC Milan) scores from the penalty spot after firing the ball into the bottom left corner to give the goalkeeper no chance!"
        },
        {
            "gameTime": "2 - 23:40",
            "label": "",
            "description": "Carlos Bacca (AC Milan) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 22:54",
            "label": "y-card",
            "description": "Luca Antei (Sassuolo) picks up a caution."
        },
        {
            "gameTime": "2 - 22:53",
            "label": "penalty",
            "description": "Luca Antei (Sassuolo) pulls the jersey of one of the opposition players and Marco Guida blows his whistle for a foul. The advantage of a penalty kick is given to AC Milan."
        },
        {
            "gameTime": "2 - 22:18",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Davide Biondini (Sassuolo) will replace Luca Mazzitelli."
        },
        {
            "gameTime": "2 - 20:49",
            "label": "",
            "description": "The AC Milan players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 17:54",
            "label": "",
            "description": "Carlos Bacca (AC Milan) commits a rough foul. Marco Guida stops the game and makes a call."
        },
        {
            "gameTime": "2 - 14:58",
            "label": "",
            "description": "Marco Guida blows the whistle, Luca Antei (Sassuolo) is penalised for a foul."
        },
        {
            "gameTime": "2 - 14:02",
            "label": "",
            "description": "Luca Mazzitelli (Sassuolo) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 13:25",
            "label": "substitution",
            "description": "Substitution. Manuel Locatelli (AC Milan) has come on for Riccardo Montolivo."
        },
        {
            "gameTime": "2 - 12:54",
            "label": "injury",
            "description": "Luca Mazzitelli (Sassuolo) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 11:47",
            "label": "",
            "description": "Matteo Politano (Sassuolo) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 10:34",
            "label": "soccer-ball",
            "description": "Lorenzo Pellegrini (Sassuolo) scores as he latches on to a pass inside the penalty box and fires a perfect low strike, which goes inside the left post."
        },
        {
            "gameTime": "2 - 08:34",
            "label": "soccer-ball",
            "description": "Lorenzo Pellegrini sends a precise lofted cross into the box. Francesco Acerbi (Sassuolo) latches on to it and finishes with a quick shot into the bottom left corner. The goalkeeper had no chance. The score changes to 1:2."
        },
        {
            "gameTime": "2 - 08:30",
            "label": "corner",
            "description": "Lorenzo Pellegrini (Sassuolo) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 08:23",
            "label": "",
            "description": "Gregoire Defrel (Sassuolo) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance. Sassuolo have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 07:28",
            "label": "",
            "description": "Juraj Kucka (AC Milan) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "2 - 07:05",
            "label": "corner",
            "description": "Suso (AC Milan) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 06:53",
            "label": "",
            "description": "The ball is cleared after Giacomo Bonaventura (AC Milan) attempted to dribble past an opposing player. AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:59",
            "label": "y-card",
            "description": "The foul by Riccardo Montolivo (AC Milan) is worthy of a card and a yellow is duly shown by Marco Guida."
        },
        {
            "gameTime": "2 - 04:33",
            "label": "",
            "description": "Suso (AC Milan) shoots from the edge of the penalty area. The ball travels towards the left side of the target, but Andrea Consigli easily deals with the threat."
        },
        {
            "gameTime": "2 - 03:23",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) blows an opportunity as he sends a rebound from just outside of the box narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 02:31",
            "label": "",
            "description": "Suso (AC Milan) wasted an opportunity to score from the free kick from about 21 metres out. His attempt hit the defensive wall."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "",
            "description": "Francesco Magnanelli (Sassuolo) was trying to get to the ball but clattered into the legs of the opponent as well. Marco Guida blows his whistle for an infringement. AC Milan are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 00:52",
            "label": "",
            "description": "A lofted cross from Francesco Acerbi (Sassuolo) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The referee and the linesman both signal a throw in for Sassuolo."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The referee signals a substitution. M'Baye Niang (AC Milan) is brought on as a substitute for Luiz Adriano."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Marco Guida blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Although it hasn't been the most inspiring of performances so far, both teams have had their moments, and we might very well witness some thrilling football in the second half. It's difficult to say if one side enjoyed any superiority over the other in the first half. The home team makes a lot of passes and attempts to maintain possession. The same goes for the away side."
        },
        {
            "gameTime": "1 - 45:11",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 43:42",
            "label": "",
            "description": "Luca Mazzitelli (Sassuolo) makes a rough challenge and Marco Guida blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 39:42",
            "label": "",
            "description": "Ignazio Abate (AC Milan) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 38:49",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 38:24",
            "label": "",
            "description": "Suso (AC Milan) sends a cross into the box, but Andrea Consigli comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 36:28",
            "label": "",
            "description": "Carlos Bacca (AC Milan) meets a perfect cross on the edge of the box and rips a shot that goes well wide of the right post."
        },
        {
            "gameTime": "1 - 35:34",
            "label": "",
            "description": "Gregoire Defrel (Sassuolo) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 32:09",
            "label": "",
            "description": "Lorenzo Pellegrini (Sassuolo) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball goes out of play and AC Milan will have a goal kick."
        },
        {
            "gameTime": "1 - 30:08",
            "label": "",
            "description": "A clumsy foul by Luca Mazzitelli (Sassuolo) and Marco Guida blows his whistle."
        },
        {
            "gameTime": "1 - 29:14",
            "label": "corner",
            "description": "The goalkeeper punched the ball away after Matteo Politano (Sassuolo) took the corner."
        },
        {
            "gameTime": "1 - 28:56",
            "label": "",
            "description": "Pol Lirola (Sassuolo) wastes a good opportunity as his pass into the box is blocked by the defence. The linesman makes the right call and Sassuolo will have a corner."
        },
        {
            "gameTime": "1 - 27:51",
            "label": "",
            "description": "Suso (AC Milan) sends a teasing cross into the area, but Andrea Consigli intercepts the ball."
        },
        {
            "gameTime": "1 - 25:22",
            "label": "",
            "description": "Gianluigi Donnarumma gets a well deserved ovation! He pulls off a remarkable save to block a long range effort from Lorenzo Pellegrini (Sassuolo) towards the bottom left corner. Nice goalkeeping skills!"
        },
        {
            "gameTime": "1 - 24:18",
            "label": "",
            "description": "Suso (AC Milan) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 23:32",
            "label": "",
            "description": "Lorenzo Pellegrini (Sassuolo) gives away a foul for a clumsy challenge. Referee Marco Guida saw the whole situation."
        },
        {
            "gameTime": "1 - 22:44",
            "label": "y-card",
            "description": "That will be a yellow card for one of the players. The one who gets booked is Claud Adjapong (Sassuolo)."
        },
        {
            "gameTime": "1 - 21:11",
            "label": "",
            "description": "Neat passing move from Sassuolo in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 18:11",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 17:10",
            "label": "",
            "description": "Luiz Adriano (AC Milan) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 14:26",
            "label": "",
            "description": "Pol Lirola (Sassuolo) trips an opponent with a slide tackle. Marco Guida stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 13:18",
            "label": "",
            "description": "Luca Mazzitelli (Sassuolo) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "1 - 11:33",
            "label": "",
            "description": "Ignazio Abate (AC Milan) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 09:53",
            "label": "soccer-ball",
            "description": "GOAL! A terrible mistake leads to a goal. The defender ends up losing possession, allowing Matteo Politano (Sassuolo) to pick up the ball before slotting it into the back of the net to make it 1:1."
        },
        {
            "gameTime": "1 - 08:26",
            "label": "soccer-ball",
            "description": "GOAL 1:0! Giacomo Bonaventura (AC Milan) unleashes a shot from distance, which is deflected past Andrea Consigli. He had no chance of stopping it as the ball rapidly changed its direction."
        },
        {
            "gameTime": "1 - 06:43",
            "label": "corner",
            "description": "Suso (AC Milan) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 06:18",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Ignazio Abate (AC Milan), but the defence gets it clear. AC Milan get a corner."
        },
        {
            "gameTime": "1 - 03:25",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) takes a short corner kick."
        },
        {
            "gameTime": "1 - 03:11",
            "label": "",
            "description": "Luiz Adriano (AC Milan) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. AC Milan have a corner."
        },
        {
            "gameTime": "1 - 02:35",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) tries to find Suso, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 01:29",
            "label": "",
            "description": "Great teamplay by AC Milan as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and AC Milan will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Marco Guida will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sassuolo scored at least one goal in each of their last 4 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AC Milan have not conceded a single goal in their last 3 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Bacca looks sharp as he's the top goal scorer for AC Milan with 12 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. It was an even match on the whole, with both sides enjoying spells in the ascendancy. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Sassuolo",
    "gameDate": "02/10/2016 - 19:00",
    "gameHomeTeam": "AC Milan",
    "gameScore": "4 - 3"
}