{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-05-14 - 21-00 Real Madrid 4 - 1 Sevilla/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:53",
            "label": "whistle",
            "description": "Alberto Undiano Mallenco is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 46:09",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Toni Kroos (Real Madrid) takes it short."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:56",
            "label": "substitution",
            "description": "Jorge Sampaoli has decided to make a change. Diego Gonzalez (Sevilla) replaces Joaquin Correa."
        },
        {
            "gameTime": "2 - 43:23",
            "label": "substitution",
            "description": "Wissam Ben Yedder (Sevilla) joins the action as a substitute, replacing Michael Krohn Dehli."
        },
        {
            "gameTime": "2 - 38:15",
            "label": "soccer-ball",
            "description": "Goal! Toni Kroos (Real Madrid) finds himself some space inside the box to get on the end of a pass from Nacho, then sends the ball into the bottom right corner. 4:1."
        },
        {
            "gameTime": "2 - 37:40",
            "label": "y-card",
            "description": "Lucas (Real Madrid) receives a yellow card from the referee as expected."
        },
        {
            "gameTime": "2 - 34:25",
            "label": "y-card",
            "description": "The referee blows his whistle for unsporting behaviour, with Nacho (Real Madrid) the culprit. Nacho (Real Madrid) gives the referee no choice but to show him a yellow card."
        },
        {
            "gameTime": "2 - 34:19",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Joaquin Correa (Sevilla) was quite harsh and Alberto Undiano Mallenco didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 32:45",
            "label": "soccer-ball",
            "description": "Goal! Cristiano Ronaldo (Real Madrid) volleys the ball from the edge of the box and it goes in off the inside of the left post. Toni Kroos provided the assist. What a finish! 3:1."
        },
        {
            "gameTime": "2 - 29:59",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) darts to the edge of the box to meet the ball from the free kick and sends a header towards the middle of the target. One of the defending players gets in its way and blocks it."
        },
        {
            "gameTime": "2 - 28:32",
            "label": "",
            "description": "A clumsy foul by Daniel Carrico (Sevilla) and Alberto Undiano Mallenco blows his whistle. Real Madrid earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 27:27",
            "label": "corner",
            "description": "Joaquin Correa (Sevilla) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "Stevan Jovetic (Sevilla) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The ball is out of play and Sevilla manage to earn a corner."
        },
        {
            "gameTime": "2 - 26:26",
            "label": "substitution",
            "description": "Here is a change. Mateo Kovacic is going off and Zinedine Zidane gives the last tactical orders to Luka Modric (Real Madrid)."
        },
        {
            "gameTime": "2 - 24:35",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 23:04",
            "label": "y-card",
            "description": "Gabriel Mercado (Sevilla) picked up a yellow card for talking out of turn to the referee. He has to be careful for the remainder of the match."
        },
        {
            "gameTime": "2 - 20:12",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) stands over the free kick and opts to take it himself, sending it towards the right post only for Sergio Rico to dive and make a save."
        },
        {
            "gameTime": "2 - 19:40",
            "label": "",
            "description": "The free kick will be taken by Cristiano Ronaldo (Real Madrid)."
        },
        {
            "gameTime": "2 - 15:55",
            "label": "substitution",
            "description": "Zinedine Zidane prepares a substitution. Alvaro Morata is replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 15:48",
            "label": "substitution",
            "description": "That's the end of the game for James Rodriguez, who is replaced by Casemiro (Real Madrid)."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "corner",
            "description": "Joaquin Correa (Sevilla) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 10:24",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco interrupts the game for a tactical foul by Alvaro Morata (Real Madrid). Alvaro Morata (Real Madrid) picks up a yellow card."
        },
        {
            "gameTime": "2 - 08:58",
            "label": "",
            "description": "Alberto Undiano Mallenco couldn't ignore the rough tackle by Clement Lenglet (Sevilla) and blew his whistle. Real Madrid have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 08:38",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 06:59",
            "label": "",
            "description": "Good clearance! James Rodriguez (Real Madrid) receives a brilliant short pass and finds himself in a good position inside the box, but he's robbed of the ball by one of the defending players."
        },
        {
            "gameTime": "2 - 03:39",
            "label": "soccer-ball",
            "description": "Stevan Jovetic (Sevilla) doesn't hesitate to lash home from just outside the box. He hits the ball precisely into the bottom right corner and it nestles in the net."
        },
        {
            "gameTime": "2 - 02:20",
            "label": "",
            "description": "Good movement by Alvaro Morata (Real Madrid), but he can't find any of his teammates as the cross is poor. The ball goes out of play and Sevilla will have a goal kick."
        },
        {
            "gameTime": "2 - 01:39",
            "label": "attendance",
            "description": "The attendance for today's match is 66456."
        },
        {
            "gameTime": "2 - 01:14",
            "label": "",
            "description": "Gabriel Mercado (Sevilla) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 00:22",
            "label": "substitution",
            "description": "Jorge Sampaoli has made a change at the break. Walter Montoya (Sevilla) has come on in place of Nicolas Pareja."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 44:31",
            "label": "",
            "description": "The Real Madrid players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 40:22",
            "label": "",
            "description": "Joaquin Correa (Sevilla) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Alberto Undiano Mallenco with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 39:27",
            "label": "corner",
            "description": "Joaquin Correa (Sevilla) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 39:02",
            "label": "",
            "description": "Stevan Jovetic (Sevilla) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Keylor Navas. The ball goes out of play. Sevilla are awarded a corner kick."
        },
        {
            "gameTime": "1 - 38:19",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco shows a yellow card to Danilo (Real Madrid) for his blatant foul."
        },
        {
            "gameTime": "1 - 34:08",
            "label": "corner",
            "description": "The resulting corner from Joaquin Correa (Sevilla) is cleared."
        },
        {
            "gameTime": "1 - 33:52",
            "label": "",
            "description": "Gabriel Mercado (Sevilla) swings in a cross, but the ball is cleared to safety by one of the defending players. Sevilla will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 32:46",
            "label": "",
            "description": "Stevan Jovetic (Sevilla) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 31:33",
            "label": "",
            "description": "OFF THE BAR! Joaquin Correa (Sevilla) latches on to an accurate pass inside the box and fires a bullet of a shot that crashes against the crossbar."
        },
        {
            "gameTime": "1 - 30:56",
            "label": "",
            "description": "Joaquin Correa (Sevilla) goes on a mazy run through the defence and gets within shooting range inside the box, but his low effort to the middle of the target is thwarted by Keylor Navas."
        },
        {
            "gameTime": "1 - 29:56",
            "label": "",
            "description": "James Rodriguez (Real Madrid) takes a shot from a mid range free kick and the ball flies inches wide of the left post! The ball is off of the pitch and it's a goal kick for Sevilla."
        },
        {
            "gameTime": "1 - 28:58",
            "label": "",
            "description": "Stevan Jovetic (Sevilla) jumps for a header from the resulting corner kick inside the box and sends the ball in on goal, but the goalkeeper makes a very good save."
        },
        {
            "gameTime": "1 - 28:56",
            "label": "corner",
            "description": "There's an opportunity for Joaquin Correa (Sevilla) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 27:31",
            "label": "",
            "description": "A poorly taken free kick by Stevan Jovetic (Sevilla)! He sends a shot from the edge of the box into the defensive wall. Sevilla earn a corner."
        },
        {
            "gameTime": "1 - 27:08",
            "label": "",
            "description": "Stevan Jovetic (Sevilla) is about to take a free kick from a very dangerous position, just outside the box."
        },
        {
            "gameTime": "1 - 26:44",
            "label": "",
            "description": "Toni Kroos (Real Madrid) brings an opponent down and Alberto Undiano Mallenco interrupts the game. Sevilla win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 24:44",
            "label": "",
            "description": "Danilo (Real Madrid) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "1 - 22:17",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Cristiano Ronaldo (Real Madrid) and he fired home from close range. The score is 2:0."
        },
        {
            "gameTime": "1 - 22:15",
            "label": "",
            "description": "James Rodriguez (Real Madrid) is quickest to the rebound and shoots towards the middle of the net, but the goalkeeper pulls off a comfortable save to deny him."
        },
        {
            "gameTime": "1 - 20:34",
            "label": "",
            "description": "Stevan Jovetic (Sevilla) gets on the end of a pass and takes a low shot from the edge of the box which is straight at Keylor Navas, who makes a comfortable save."
        },
        {
            "gameTime": "1 - 20:09",
            "label": "",
            "description": "Stevan Jovetic (Sevilla) wastes a promising chance as he unleashes a first time shot from mid range which hits the right post! The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "1 - 18:48",
            "label": "",
            "description": "Marco Asensio (Real Madrid) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "1 - 17:47",
            "label": "corner",
            "description": "The resulting corner, taken by James Rodriguez (Real Madrid), comes to nothing."
        },
        {
            "gameTime": "1 - 17:37",
            "label": "",
            "description": "Toni Kroos (Real Madrid) crosses the ball into the box, but one of the defending players averts the threat. The referee blows his whistle, Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:59",
            "label": "",
            "description": "Nacho (Real Madrid) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 15:44",
            "label": "",
            "description": "Marco Asensio (Real Madrid) gets the ball from a rebound and shoots from long range, but sends the ball high over the crossbar. The goalkeeper doesn't have to worry about this one. Very poor attempt. The ball is off of the pitch and it's a goal kick for Sevilla."
        },
        {
            "gameTime": "1 - 15:12",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 09:28",
            "label": "soccer-ball",
            "description": "Nacho (Real Madrid) takes the free kick with a powerful low drive that goes inside the right hand post and ends up behind the goalkeeper. A real jaw dropper!"
        },
        {
            "gameTime": "1 - 09:24",
            "label": "",
            "description": "Poor challenge! Matias Kranevitter (Sevilla) is penalised for tripping and Alberto Undiano Mallenco blows his whistle. Real Madrid are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 08:36",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) dribbles into the box, but Sergio Rico is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "1 - 08:17",
            "label": "",
            "description": "Victor Vitolo (Sevilla) unleashes a shot from the edge of the box, but it goes straight at Keylor Navas."
        },
        {
            "gameTime": "1 - 06:51",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) makes his forward run a little too early and is caught in an offside position after his teammate tries to play a pass to him."
        },
        {
            "gameTime": "1 - 03:31",
            "label": "",
            "description": "Joaquin Correa (Sevilla) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 02:48",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Cristiano Ronaldo (Real Madrid). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "1 - 00:37",
            "label": "",
            "description": "The linesman raises his flag. Stevan Jovetic (Sevilla) is adjudged offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Sevilla will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alberto Undiano Mallenco will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There is an average of 4.2 goals per game between these two sides over the last 5 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sevilla scored at least one goal in each of their last 6 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid have already earned 8 penalties this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Alberto Undiano Mallenco is looking at his watch and immediately ends this match."
        }
    ],
    "gameAwayTeam": "Sevilla",
    "gameDate": "14/05/2017 - 21:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "4 - 1"
}