{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2016-01-31 - 19-30 Bayern Munich 2 - 0 Hoffenheim/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. Bayern Munich were dominant and more threatening of the two sides. It was a fairly one sided match. The home team played possession football and the away players really focused on a well organized defence."
        },
        {
            "gameTime": "2 - 45:15",
            "label": "whistle",
            "description": "Jochen Drees is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Douglas Costa will be replaced by Juan Bernat (Bayern Munich)."
        },
        {
            "gameTime": "2 - 42:06",
            "label": "",
            "description": "What a chance that is! Arjen Robben (Bayern Munich) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 39:56",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box into the stands."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 38:47",
            "label": "",
            "description": "A neat pass is well received by Steven Zuber (Hoffenheim), who is lurking on the edge of the box and produces a low drive directed towards the middle of the goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "",
            "description": "Jochen Drees couldn't ignore the rough tackle by Thiago Alcantara (Bayern Munich) and blew his whistle."
        },
        {
            "gameTime": "2 - 37:13",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 35:45",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) leaps highest around the penalty spot to meet a cross from the free kick and produces a promising goal bound header towards the left post, but Oliver Baumann pulls off a fine save to deny him."
        },
        {
            "gameTime": "2 - 35:03",
            "label": "",
            "description": "Referee Jochen Drees sees the trip by Sebastian Rudy (Hoffenheim) and doesn't hesitate to blow his whistle. There is a free kick near the sideline to Bayern Munich."
        },
        {
            "gameTime": "2 - 34:26",
            "label": "",
            "description": "Ermin Bicakcic (Hoffenheim) attempts a nice header from inside the penalty area, but his effort is blocked."
        },
        {
            "gameTime": "2 - 33:17",
            "label": "",
            "description": "Nadiem Amiri (Hoffenheim) will take the free kick."
        },
        {
            "gameTime": "2 - 32:41",
            "label": "",
            "description": "Holger Badstuber (Bayern Munich) knocks his opponent down with an over the top tackle. Hoffenheim are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 31:47",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Kevin Volland (Hoffenheim) will replace Jonathan Schmid."
        },
        {
            "gameTime": "2 - 31:01",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Bayern Munich."
        },
        {
            "gameTime": "2 - 30:50",
            "label": "funfact",
            "description": "29:5 – the total goal attempt statistics."
        },
        {
            "gameTime": "2 - 30:04",
            "label": "",
            "description": "Jochen Drees blows his whistle as Niklas Sule (Hoffenheim) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 29:48",
            "label": "corner",
            "description": "The resulting corner from Jonathan Schmid (Hoffenheim) is cleared."
        },
        {
            "gameTime": "2 - 29:36",
            "label": "",
            "description": "The ball is cleared after Pavel Kaderabek (Hoffenheim) attempted to dribble past an opposing player. The ball goes out of play. Hoffenheim are awarded a corner kick."
        },
        {
            "gameTime": "2 - 28:57",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 27:42",
            "label": "",
            "description": "David Alaba (Bayern Munich) smashes the ball towards goal from the edge of the penalty box, but his effort flies just a few inches wide of the right post."
        },
        {
            "gameTime": "2 - 25:39",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) fires a brilliant shot in from 20 metres out, but the effort rattles the right post! It could have been a superb goal."
        },
        {
            "gameTime": "2 - 25:28",
            "label": "",
            "description": "Bayern Munich are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "2 - 24:48",
            "label": "attendance",
            "description": "The attendance is 75000."
        },
        {
            "gameTime": "2 - 24:11",
            "label": "",
            "description": "Steven Zuber (Hoffenheim) is adjudged offside."
        },
        {
            "gameTime": "2 - 22:53",
            "label": "substitution",
            "description": "Substitution. Jiloan Hamad is replaced by Nadiem Amiri (Hoffenheim)."
        },
        {
            "gameTime": "2 - 22:52",
            "label": "substitution",
            "description": "Here comes a substitution. Andrej Kramaric is given a rest as he is replaced by Steven Zuber (Hoffenheim)."
        },
        {
            "gameTime": "2 - 21:54",
            "label": "",
            "description": "The game is interrupted as Arjen Robben (Bayern Munich) is flagged offside."
        },
        {
            "gameTime": "2 - 21:17",
            "label": "substitution",
            "description": "Pep Guardiola prepares a substitution. Thomas Muller is replaced by Arturo Vidal (Bayern Munich)."
        },
        {
            "gameTime": "2 - 20:38",
            "label": "",
            "description": "This shall not pass! Robert Lewandowski (Bayern Munich) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "2 - 18:50",
            "label": "soccer-ball",
            "description": "GOAL! Robert Lewandowski (Bayern Munich) collects a pass and from inside the box he lifts the ball over Oliver Baumann, who was off his line. What a finish that is! 2:0."
        },
        {
            "gameTime": "2 - 17:35",
            "label": "",
            "description": "David Alaba (Bayern Munich) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 16:31",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Thiago Alcantara (Bayern Munich) comes onto the pitch so that Kingsley Coman can be given a rest."
        },
        {
            "gameTime": "2 - 15:39",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) receives a precise pass inside the box and drills a promising first time blast towards the middle of the goal. His effort is blocked by Oliver Baumann who dives to keep the ball out. What a save!"
        },
        {
            "gameTime": "2 - 14:53",
            "label": "",
            "description": "Eduardo Vargas (Hoffenheim) connects with the corner kick around the penalty spot, but steers his header inches over the bar."
        },
        {
            "gameTime": "2 - 14:43",
            "label": "corner",
            "description": "Jonathan Schmid (Hoffenheim) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 13:52",
            "label": "",
            "description": "The Bayern Munich players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession. The ball is out of play and Hoffenheim manage to earn a corner."
        },
        {
            "gameTime": "2 - 13:02",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) missed a big chance! He produces a stunning volley from inside the box, but his effort goes not far wide of the right post."
        },
        {
            "gameTime": "2 - 11:51",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball goes well wide of the right post!"
        },
        {
            "gameTime": "2 - 11:25",
            "label": "funfact",
            "description": "The current number of corner kicks is 10:2."
        },
        {
            "gameTime": "2 - 10:36",
            "label": "",
            "description": "Golden chance! Andrej Kramaric (Hoffenheim) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the left post."
        },
        {
            "gameTime": "2 - 09:57",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) reacts well and displays good awareness inside the box to get on the end of the resulting corner kick. He fails to direct the ball into the net as it flies narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 09:50",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 09:27",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. The ball goes out of play and Bayern Munich have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "",
            "description": "Holger Badstuber swings the cross over. Robert Lewandowski (Bayern Munich) gets his head to it but it goes just wide of the left post."
        },
        {
            "gameTime": "2 - 07:29",
            "label": "corner",
            "description": "The corner from Douglas Costa (Bayern Munich) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 07:12",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition. The ball goes behind for a corner. Bayern Munich will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 06:44",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 06:26",
            "label": "",
            "description": "David Alaba (Bayern Munich) collects a pass and has an effort from distance which is blocked. It will be a corner kick for Bayern Munich."
        },
        {
            "gameTime": "2 - 06:00",
            "label": "",
            "description": "Jiloan Hamad (Hoffenheim) brings an opponent down and Jochen Drees interrupts the game."
        },
        {
            "gameTime": "2 - 03:10",
            "label": "",
            "description": "The linesman raises his flag for offside before Arjen Robben (Bayern Munich) heads on."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Arjen Robben (Bayern Munich)."
        },
        {
            "gameTime": "2 - 02:26",
            "label": "",
            "description": "A cross from Kingsley Coman (Bayern Munich) fails to reach the box as the defence clears the ball away to safety. The ball is out of play. Bayern Munich will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 01:29",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "2 - 01:19",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 00:44",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) shoots from the edge of the penalty area. The ball travels towards the crossbar, but Oliver Baumann easily deals with the threat. Bayern Munich force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they continue playing this attractive football, the fans will surely be satisfied. Bayern Munich dominated the opening period and easily created the most chances. The home team makes a lot of passes and attempts to maintain possession. As for the away side, it's obvious that defence has the highest priority for them."
        },
        {
            "gameTime": "1 - 45:28",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:12",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) gets on the ball and beats an opponent, but his run is stopped by the referee Jochen Drees who sees an offensive foul."
        },
        {
            "gameTime": "1 - 44:43",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) receives a pin point pass in the middle of the pitch which gives him a great opportunity to score. He is unfazed by the distance and slams the ball towards the goal. He is unlucky as he hits one of his own teammates."
        },
        {
            "gameTime": "1 - 44:27",
            "label": "corner",
            "description": "Arjen Robben (Bayern Munich) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 44:10",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball is out of play and the linesman points at the corner flag. Corner to Bayern Munich."
        },
        {
            "gameTime": "1 - 43:11",
            "label": "",
            "description": "Flag goes up against Jiloan Hamad (Hoffenheim) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 42:41",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 41:02",
            "label": "",
            "description": "What a sweet touch by Andrej Kramaric (Hoffenheim) as he collects a pass deep inside the box and decides to go for goal. It's on target but easy for Manuel Neuer to hold."
        },
        {
            "gameTime": "1 - 40:30",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 40:11",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) whips a promising cross into the box, but the opposition's defence intercepts the ball. Bayern Munich get a corner."
        },
        {
            "gameTime": "1 - 39:33",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) picks up a pass, lines up a shot and strikes from 25 metres out, but Oliver Baumann thwarts the effort which is headed to the bottom left corner."
        },
        {
            "gameTime": "1 - 37:46",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 29:5."
        },
        {
            "gameTime": "1 - 37:01",
            "label": "corner",
            "description": "The corner from Douglas Costa (Bayern Munich) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 36:50",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Bayern Munich have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 34:56",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) takes a direct free kick. Thomas Muller (Bayern Munich) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "",
            "description": "Jochen Drees blows his whistle for a foul after Sebastian Rudy (Hoffenheim) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 31:59",
            "label": "soccer-ball",
            "description": "Goal! Douglas Costa puts the ball across the area and Robert Lewandowski (Bayern Munich) has the easiest task in the world to tuck the ball into an empty net. 1:0."
        },
        {
            "gameTime": "1 - 30:15",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends a low pass from outside the box to Robert Lewandowski. He lines up a shot, but the defence intercepts at the last moment."
        },
        {
            "gameTime": "1 - 29:41",
            "label": "",
            "description": "David Alaba (Bayern Munich) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 27:55",
            "label": "y-card",
            "description": "Tobias Strobl (Hoffenheim) is booked after bringing down an opponent. Jochen Drees had an easy decision to make."
        },
        {
            "gameTime": "1 - 27:36",
            "label": "y-card",
            "description": "The referee had an easy decision to make. A yellow card is given to Douglas Costa (Bayern Munich) for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 24:40",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) pulls the jersey of one of the opposition players and Jochen Drees blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 22:31",
            "label": "",
            "description": "What a big chance! Arjen Robben (Bayern Munich) picks up an inch perfect pass inside the box and fires the ball just over the crossbar."
        },
        {
            "gameTime": "1 - 21:19",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) makes contact with a cross and strikes a shot that lacks the power to find the back of the net, but the goalkeeper still has to make a good save to keep his effort out."
        },
        {
            "gameTime": "1 - 21:10",
            "label": "",
            "description": "Quick reactions by David Alaba (Bayern Munich) and Robert Lewandowski, tricking their opponents with a cheeky chip pass. A beautiful football moment and great skill, which caused the noise in the stadium to go up a notch."
        },
        {
            "gameTime": "1 - 19:16",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 18:33",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) has a great chance inside the six yard box, shoots low to the middle of the goal, but Oliver Baumann pulls off an exquisite save to deny him."
        },
        {
            "gameTime": "1 - 17:12",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) robs an opponent of the ball and explodes in anger when Jochen Drees blows for a foul."
        },
        {
            "gameTime": "1 - 16:31",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) releases a powerful first time effort from the edge of the box which goes low in the direction of the middle of the target, but the keeper reacts quickly enough to deny him. Excellent goalkeeping!"
        },
        {
            "gameTime": "1 - 15:31",
            "label": "",
            "description": "Hoffenheim concede a free kick after one of their players holds onto an opposition player."
        },
        {
            "gameTime": "1 - 14:10",
            "label": "",
            "description": "A cross is clipped into the penalty area by Arjen Robben (Bayern Munich) but poses no threat. The ball goes out of play and Hoffenheim will have a goal kick."
        },
        {
            "gameTime": "1 - 13:11",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "1 - 12:16",
            "label": "",
            "description": "Jonathan Schmid (Hoffenheim) jumps into a tackle and Jochen Drees blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 08:57",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Arjen Robben (Bayern Munich), whose instinctive shot towards goal flashes inches over the top."
        },
        {
            "gameTime": "1 - 08:18",
            "label": "",
            "description": "Jochen Drees blows his whistle. Andrej Kramaric (Hoffenheim) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 06:43",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) creates some space for himself to pick up a pass on the edge of the box and unleashes a decent strike which goes a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 06:21",
            "label": "",
            "description": "Bayern Munich seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "1 - 04:52",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) dribbled past his opponents before finding himself in a great position to strike. His attempt from just outside of the box went towards the bottom left corner, but it wasn't dangerous and Oliver Baumann made a comfortable save."
        },
        {
            "gameTime": "1 - 03:45",
            "label": "corner",
            "description": "The resulting corner from Xabi Alonso (Bayern Munich) is cleared by the defence."
        },
        {
            "gameTime": "1 - 03:29",
            "label": "",
            "description": "A pass into the penalty area from Arjen Robben (Bayern Munich) is intercepted by the defence. Bayern Munich have a corner."
        },
        {
            "gameTime": "1 - 01:46",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) gets to the ball from the resulting corner but blazes it well over the bar."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "1 - 01:15",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) races towards goal but the defender gets back well to make a challenge. Good work from Bayern Munich as they win a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Bayern Munich will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jochen Drees will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. Bayern Munich were dominant and more threatening of the two sides. It was a fairly one sided match. The home team played possession football and the away players really focused on a well organized defence."
        }
    ],
    "gameAwayTeam": "Hoffenheim",
    "gameDate": "31/01/2016 - 19:30",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "2 - 0"
}