{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2015-2016/2015-09-22 - 21-45 Udinese 2 - 3 AC Milan/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. Neither of the teams had any obvious superiority in this game. The tactic of the home side was slow build up play and the away side was creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "2 - 49:14",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:55",
            "label": "yr-card",
            "description": "This was really stupid from Bruno Fernandes (Udinese)! He is booked for the second time today and is forced to leave the pitch after seeing a red card in the hand of Daniele Doveri."
        },
        {
            "gameTime": "2 - 46:16",
            "label": "",
            "description": "Molla Wague (Udinese) rises above the defence to meet the corner. His timing is good, but he arrows his header just a few inches wide of the right post."
        },
        {
            "gameTime": "2 - 46:11",
            "label": "corner",
            "description": "Antonio Di Natale (Udinese) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 46:05",
            "label": "",
            "description": "Bruno Fernandes (Udinese) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the roof of the net, but Diego Lopez was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 46:00",
            "label": "corner",
            "description": "Antonio Di Natale (Udinese) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:42",
            "label": "",
            "description": "Edenilson (Udinese) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition. The ball goes behind for a corner. Udinese will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 42:46",
            "label": "",
            "description": "Wonderful movement by AC Milan. The players are holding possession, mostly exchanging one touch passes. They control the pace of the game now."
        },
        {
            "gameTime": "2 - 40:18",
            "label": "y-card",
            "description": "Marquinho (Udinese) sees a yellow card from Daniele Doveri after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 39:38",
            "label": "",
            "description": "Antonio Di Natale (Udinese) whips a long ball in from the free kick which is intercepted by Diego Lopez."
        },
        {
            "gameTime": "2 - 39:09",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul. A free kick to Udinese."
        },
        {
            "gameTime": "2 - 38:57",
            "label": "substitution",
            "description": "Substitution. Manuel Iturra makes his way off the pitch and Marquinho (Udinese) comes on as his replacement."
        },
        {
            "gameTime": "2 - 34:28",
            "label": "substitution",
            "description": "Sinisa Mihajlovic has decided to introduce fresh legs, with Luiz Adriano (AC Milan) replacing Carlos Bacca."
        },
        {
            "gameTime": "2 - 31:50",
            "label": "",
            "description": "Antonio Di Natale (Udinese) sends a cross into the box, but Diego Lopez comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 27:27",
            "label": "substitution",
            "description": "The substitution has been made. Giovanni Pasquale (Udinese) has replaced Ali Adnan."
        },
        {
            "gameTime": "2 - 26:32",
            "label": "corner",
            "description": "Antonio Di Natale (Udinese) launches a cross from the corner, but Diego Lopez is alert to thwart the effort."
        },
        {
            "gameTime": "2 - 26:30",
            "label": "",
            "description": "Edenilson (Udinese) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The referee blows his whistle, Udinese are awarded a corner kick."
        },
        {
            "gameTime": "2 - 26:11",
            "label": "corner",
            "description": "Antonio Di Natale (Udinese) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 25:38",
            "label": "",
            "description": "Cyril Thereau (Udinese) sends a chip pass into the box, but Diego Lopez is quickest to intercept the ball. The ball goes out of play. Udinese are awarded a corner kick."
        },
        {
            "gameTime": "2 - 24:21",
            "label": "y-card",
            "description": "Daniele Doveri shows the yellow card to Cristian Zapata (AC Milan) for a heavy challenge."
        },
        {
            "gameTime": "2 - 18:27",
            "label": "substitution",
            "description": "Keisuke Honda will be replaced by Andrea Poli (AC Milan)."
        },
        {
            "gameTime": "2 - 17:20",
            "label": "corner",
            "description": "A dangerous looking corner kick from Antonio Di Natale (Udinese) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 17:05",
            "label": "",
            "description": "Edenilson (Udinese) flights in the cross, but the defender is alert and clears to safety. Corner kick. Udinese will have an opportunity."
        },
        {
            "gameTime": "2 - 16:41",
            "label": "",
            "description": "Maurizio Domizzi (Udinese) delivers a crossfield pass, but the ball is cut out before it reaches its intended target. Udinese will take a corner kick."
        },
        {
            "gameTime": "2 - 16:35",
            "label": "corner",
            "description": "The corner kick from Antonio Di Natale (Udinese) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "",
            "description": "A cross from Edenilson (Udinese) fails to reach the box as the defence clears the ball away to safety. It will be a corner kick for Udinese."
        },
        {
            "gameTime": "2 - 13:02",
            "label": "y-card",
            "description": "Bruno Fernandes (Udinese) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Daniele Doveri didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 12:41",
            "label": "soccer-ball",
            "description": "Goal! Cyril Thereau puts the ball across the area and Duvan Zapata (Udinese) has the easiest task in the world to tuck the ball into an empty net. 2:3."
        },
        {
            "gameTime": "2 - 11:58",
            "label": "corner",
            "description": "The ball goes out for a corner. Udinese can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 11:43",
            "label": "",
            "description": "Ali Adnan (Udinese) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "2 - 07:29",
            "label": "y-card",
            "description": "Molla Wague (Udinese) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 05:14",
            "label": "soccer-ball",
            "description": "Goal! Antonio Di Natale provides Badu (Udinese) with a nice pass inside the box. It allows him to finish with a precise effort into the bottom left corner. 1:3."
        },
        {
            "gameTime": "2 - 03:47",
            "label": "substitution",
            "description": "Sinisa Mihajlovic prepares a substitution. Davide Calabria is replaced by Alex (AC Milan)."
        },
        {
            "gameTime": "2 - 01:06",
            "label": "",
            "description": "Badu (Udinese) latches on to a sweet cross into the box and misses with a header way wide of the left post."
        },
        {
            "gameTime": "2 - 00:51",
            "label": "substitution",
            "description": "Half time substitution. Ivan Rodrigo Piris is replaced by Duvan Zapata (Udinese)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 48:00",
            "label": "",
            "description": "We are seeing a great game so far, let's hope the players will be able to sustain their level of performance and keep entertaining the fans in such a fabulous way. The visitors dominated that half and looked more dangerous in attack. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 47:03",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:40",
            "label": "soccer-ball",
            "description": "Perfectly executed corner kick. Cristian Zapata (AC Milan) rises highest and nods home from the corner kick. His stunning header goes low inside the right post."
        },
        {
            "gameTime": "1 - 45:38",
            "label": "corner",
            "description": "The ball is out of play and the linesman points at the corner flag. Corner to AC Milan."
        },
        {
            "gameTime": "1 - 45:11",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 5 min. of added time."
        },
        {
            "gameTime": "1 - 43:45",
            "label": "",
            "description": "Manuel Iturra (Udinese) fouls an opponent. At least that's what referee Daniele Doveri signals."
        },
        {
            "gameTime": "1 - 42:59",
            "label": "",
            "description": "Davide Calabria (AC Milan) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 41:38",
            "label": "injury",
            "description": "Davide Calabria (AC Milan) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 38:19",
            "label": "y-card",
            "description": "Manuel Iturra (Udinese) is punished with a yellow card for violating the rules."
        },
        {
            "gameTime": "1 - 36:13",
            "label": "",
            "description": "Edenilson (Udinese) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 33:43",
            "label": "",
            "description": "The linesman signals a throw in for AC Milan."
        },
        {
            "gameTime": "1 - 30:19",
            "label": "y-card",
            "description": "A yellow card for a tackle by Ivan Rodrigo Piris (Udinese). Daniele Doveri doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 29:22",
            "label": "",
            "description": "Molla Wague (Udinese) is able to continue to play."
        },
        {
            "gameTime": "1 - 28:51",
            "label": "injury",
            "description": "Molla Wague (Udinese) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 25:47",
            "label": "",
            "description": "Carlos Bacca (AC Milan) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 23:08",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) cracks a volley from just outside the box and his bad shot goes way wide of the right post. It will be a goal kick."
        },
        {
            "gameTime": "1 - 22:04",
            "label": "",
            "description": "Ali Adnan (Udinese) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 20:06",
            "label": "",
            "description": "Udinese keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 17:31",
            "label": "y-card",
            "description": "Daniele Doveri shows a yellow card to Davide Calabria (AC Milan), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 16:55",
            "label": "",
            "description": "Antonio Di Natale (Udinese) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 14:59",
            "label": "y-card",
            "description": "The foul by Mario Balotelli (AC Milan) is worthy of a card and a yellow is duly shown by Daniele Doveri."
        },
        {
            "gameTime": "1 - 12:17",
            "label": "",
            "description": "Edenilson (Udinese) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 10:37",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Riccardo Montolivo plays it into the box, and Giacomo Bonaventura (AC Milan) gets on the end of the cross to put it into the bottom right corner. 0:2."
        },
        {
            "gameTime": "1 - 06:51",
            "label": "",
            "description": "Cyril Thereau (Udinese) jumps for a cross and produces a fine header from near the penalty spot, but it goes narrowly wide of the left post!"
        },
        {
            "gameTime": "1 - 04:45",
            "label": "soccer-ball",
            "description": "Mario Balotelli (AC Milan) unleashes a beautiful rocket of a shot from a long range free kick. The ball goes into the top left corner and leaves the goalkeeper beaten. This takes hours and hours on the training ground. The score is 0:1."
        },
        {
            "gameTime": "1 - 04:33",
            "label": "",
            "description": "Daniele Doveri blows his whistle for a foul after Manuel Iturra (Udinese) hacks down one of his opponents. That's a free kick to AC Milan."
        },
        {
            "gameTime": "1 - 01:51",
            "label": "",
            "description": "Mario Balotelli (AC Milan) pulls the shirt of his opponent and the referee stops play for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Udinese will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Daniele Doveri was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "49:43 That's AC Milan's goals for and against."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Udinese's latest transfer: Francesco Lodi (Catania)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let's have a look at Udinese's latest matches: Atalanta (1:1), Torino (1:5), Inter (1:3), Fiorentina (2:1)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. Neither of the teams had any obvious superiority in this game. The tactic of the home side was slow build up play and the away side was creating their opportunities using lightning fast counter attacks."
        }
    ],
    "gameAwayTeam": "AC Milan",
    "gameDate": "22/09/2015 - 21:45",
    "gameHomeTeam": "Udinese",
    "gameScore": "2 - 3"
}