{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2015-09-22 - 21-00 Bayern Munich 5 - 1 Wolfsburg/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 44:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. Bayern Munich were better today and displayed masterful control and movement. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        },
        {
            "gameTime": "2 - 44:54",
            "label": "whistle",
            "description": "That's it for today, Tobias Stieler has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Josuha Guilavogui (Wolfsburg) sacrificed accuracy for power, and thus his attempt went well wide of the right post."
        },
        {
            "gameTime": "2 - 44:03",
            "label": "funfact",
            "description": "12:2 – this is the current number of shots on target."
        },
        {
            "gameTime": "2 - 43:12",
            "label": "",
            "description": "Dangerous play by David Alaba (Bayern Munich). Tobias Stieler blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 42:15",
            "label": "",
            "description": "What a chance for Thomas Muller (Bayern Munich) as he produced a stunning snap shot from the edge of the box! The goalkeeper was a bit lucky as the ball goes inches over the crossbar."
        },
        {
            "gameTime": "2 - 40:34",
            "label": "attendance",
            "description": "The attendance is 75000."
        },
        {
            "gameTime": "2 - 37:30",
            "label": "",
            "description": "The linesman signals that Nicklas Bendtner (Wolfsburg) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 36:30",
            "label": "y-card",
            "description": "Arturo Vidal (Bayern Munich) has tested the patience of referee Tobias Stieler and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 34:42",
            "label": "corner",
            "description": "Joshua Kimmich (Bayern Munich) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 34:02",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. Now Bayern Munich have a corner."
        },
        {
            "gameTime": "2 - 34:01",
            "label": "",
            "description": "Quick reactions by Thomas Muller (Bayern Munich) and Robert Lewandowski, tricking their opponents with a cheeky chip pass. A beautiful football moment and great skill, which caused the noise in the stadium to go up a notch."
        },
        {
            "gameTime": "2 - 33:06",
            "label": "corner",
            "description": "The resulting corner from Douglas Costa (Bayern Munich) is cleared."
        },
        {
            "gameTime": "2 - 32:54",
            "label": "substitution",
            "description": "Substitution. Max Kruse will be replaced by Andre Schurrle (Wolfsburg)."
        },
        {
            "gameTime": "2 - 32:42",
            "label": "substitution",
            "description": "Dieter Hecking has decided to make a change. Nicklas Bendtner (Wolfsburg) replaces Bas Dost."
        },
        {
            "gameTime": "2 - 32:19",
            "label": "substitution",
            "description": "Xabi Alonso will be replaced by Joshua Kimmich (Bayern Munich)."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Douglas Costa (Bayern Munich). The referee and one of his assistants signal for a corner kick to Bayern Munich."
        },
        {
            "gameTime": "2 - 31:34",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 29:33",
            "label": "",
            "description": "Julian Draxler (Wolfsburg) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "2 - 28:48",
            "label": "y-card",
            "description": "Ricardo Rodriguez (Wolfsburg) goes into the book for a horrible tackle. A yellow card is necessary in this case."
        },
        {
            "gameTime": "2 - 27:08",
            "label": "",
            "description": "Dante (Wolfsburg) fouls an opponent. At least that's what referee Tobias Stieler signals."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) is having a lively performance. He is causing problems and wanting the ball at every opportunity."
        },
        {
            "gameTime": "2 - 24:14",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) had a golden opportunity. He volleyed from point blank range low towards the middle of the net, but Diego Benaglio was alert and made an amazing save!"
        },
        {
            "gameTime": "2 - 22:29",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) clutches his head in despair after he blew a huge opportunity! He received the ball from the free kick, took a good first touch and unleashed a projectile from close range to the middle of the goal, but Diego Benaglio makes a nice save."
        },
        {
            "gameTime": "2 - 22:06",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "2 - 21:19",
            "label": "",
            "description": "Tobias Stieler blows his whistle and signals a foul after Naldo (Wolfsburg) brought his opponent down. Bayern Munich have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 19:53",
            "label": "",
            "description": "What a poor attempt! Maximilian Arnold (Wolfsburg) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes miles wide to the right."
        },
        {
            "gameTime": "2 - 18:58",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 17:02",
            "label": "",
            "description": "David Alaba (Bayern Munich) did his best to latch onto a through ball, but it was too strong."
        },
        {
            "gameTime": "2 - 14:58",
            "label": "soccer-ball",
            "description": "Robert Lewandowski (Bayern Munich) gets to the ball on the edge of the box and fires in a first time shot without any hesitation. The strike is excellent and goes inside the left post. He couldn't have done it any better. 5:1."
        },
        {
            "gameTime": "2 - 13:30",
            "label": "substitution",
            "description": "A substitution has been made. Luiz Gustavo is replaced by Maximilian Arnold (Wolfsburg)."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "soccer-ball",
            "description": "It's a goal! Robert Lewandowski (Bayern Munich) shows off his superb ability as he volleys the ball from inside the box into the roof of the net. The assist goes to Douglas Costa and the score changes to 4:1."
        },
        {
            "gameTime": "2 - 09:24",
            "label": "soccer-ball",
            "description": "Goal! Robert Lewandowski (Bayern Munich) fires the rebound into the middle of the goal after the ball breaks to him in the box. The score is 3:1."
        },
        {
            "gameTime": "2 - 09:22",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) gets to the rebound inside the box and shoots to the middle of the goal, but his sidefooter is blocked by an alert Diego Benaglio. What a save!"
        },
        {
            "gameTime": "2 - 09:20",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) expertly controls a neat clever pass inside the box, but his effort crashes against the left post! What an opportunity that was!"
        },
        {
            "gameTime": "2 - 06:39",
            "label": "soccer-ball",
            "description": "Robert Lewandowski (Bayern Munich) latches on to a pass and controls it with a good first touch. He unleashes a deadly strike from around 22 metres out which goes into the bottom left corner."
        },
        {
            "gameTime": "2 - 06:00",
            "label": "soccer-ball",
            "description": "Robert Lewandowski (Bayern Munich) has a great chance inside the box and puts the ball into the back of the net."
        },
        {
            "gameTime": "2 - 04:59",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) and Thomas Muller attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 04:55",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 03:33",
            "label": "",
            "description": "Christian Trasch (Wolfsburg) creates a yard of space for himself and tries an effort from distance, but it's blocked."
        },
        {
            "gameTime": "2 - 01:29",
            "label": "",
            "description": "Half chance! David Alaba (Bayern Munich) plays a pass into the box, but Diego Benaglio reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Juan Bernat is replaced by Javi Martinez (Bayern Munich)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Thiago Alcantara will not participate anymore and Robert Lewandowski (Bayern Munich) is coming on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Let's hope the managers of both teams will be able to stir up the players as up till now the game has lacked any interesting or exciting moments. The game is quite balanced. The home side are keeping possession of the ball with some short passes, while the visitors are waiting to open up their defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 46:09",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:15",
            "label": "corner",
            "description": "Julian Draxler (Wolfsburg) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 43:57",
            "label": "",
            "description": "This shall not pass! Max Kruse (Wolfsburg) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. Wolfsburg have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 43:20",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "1 - 41:35",
            "label": "y-card",
            "description": "The referee had an easy decision to make. A yellow card is given to Daniel Caligiuri (Wolfsburg) for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 39:11",
            "label": "corner",
            "description": "A dangerous looking corner kick from Thiago Alcantara (Bayern Munich) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) sends a pass into the box, but his attempt is thwarted and cleared. The linesman points to the corner flag, Bayern Munich are going to take it."
        },
        {
            "gameTime": "1 - 38:08",
            "label": "",
            "description": "Josuha Guilavogui (Wolfsburg) fires a brilliant shot in from 50 metres out, but the effort rattles the left post! It could have been a superb goal."
        },
        {
            "gameTime": "1 - 37:35",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) swings in a cross from the corner, but Diego Benaglio reads it well and gathers the ball."
        },
        {
            "gameTime": "1 - 37:20",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) looks to break free, but an opposing player clears the ball away. Bayern Munich force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 33:47",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "",
            "description": "Julian Draxler (Wolfsburg) receives a pass and tries his luck with a shot from 18 metres out. Manuel Neuer pulls off a decent save to stop the effort going into the top of the net."
        },
        {
            "gameTime": "1 - 32:09",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 31:10",
            "label": "corner",
            "description": "The resulting corner from Xabi Alonso (Bayern Munich) is cleared by the defence."
        },
        {
            "gameTime": "1 - 30:45",
            "label": "",
            "description": "Chance! Douglas Costa (Bayern Munich) gets to the rebound on the edge of the box and smashes the ball towards the top of the net, but Diego Benaglio is alert and makes a great save to deny him. The ball goes out of play. Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "1 - 30:09",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 27:42",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) dispossess an opponent of the ball with but is penalised for a foul. The referee blows his whistle and stops the game. A free kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 25:30",
            "label": "soccer-ball",
            "description": "Daniel Caligiuri (Wolfsburg) meets a perfect cross from Julian Draxler deep inside the box and controls it with a nice first touch. He produces an accurate strike inside the right post. The score is 0:1."
        },
        {
            "gameTime": "1 - 25:27",
            "label": "",
            "description": "Ricardo Rodriguez (Wolfsburg) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 24:37",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) finds himself in a promising position after receiving a beautiful cross from the side, but the opposition defence is ready and one of the defenders averts the threat with a quick interception."
        },
        {
            "gameTime": "1 - 21:12",
            "label": "",
            "description": "A cross into the box from Julian Draxler (Wolfsburg) is cleared."
        },
        {
            "gameTime": "1 - 18:56",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) announces himself with a wonderful first time strike from around 30 metres out. He fires the ball towards the bottom right corner, but Diego Benaglio has a clear sight of the shot and makes a decent save."
        },
        {
            "gameTime": "1 - 18:19",
            "label": "",
            "description": "Julian Draxler (Wolfsburg) cracks a first time shot from inside the box, but it flies way wide of the left post."
        },
        {
            "gameTime": "1 - 16:04",
            "label": "",
            "description": "Mario Gotze links up with Thomas Muller (Bayern Munich), who fires just wide of the right post from the edge of the box."
        },
        {
            "gameTime": "1 - 14:06",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 13:45",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "1 - 13:17",
            "label": "",
            "description": "Christian Trasch (Wolfsburg) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "1 - 12:21",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) collects a pass and has an effort from 25 metres out, but it flies just over the crossbar."
        },
        {
            "gameTime": "1 - 11:58",
            "label": "",
            "description": "Bayern Munich are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 10:21",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "1 - 09:48",
            "label": "",
            "description": "Rough tackle by Luiz Gustavo (Wolfsburg). The referee blows his whistle for a foul. Bayern Munich are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 06:51",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) tries his luck with a low long range effort after receiving a precise pass, but Diego Benaglio has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 06:12",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 04:26",
            "label": "",
            "description": "Flag goes up against Mario Gotze (Bayern Munich) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 03:42",
            "label": "",
            "description": "Poor challenge! Luiz Gustavo (Wolfsburg) is penalised for tripping and Tobias Stieler blows his whistle."
        },
        {
            "gameTime": "1 - 02:12",
            "label": "",
            "description": "The Wolfsburg players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bayern Munich will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Tobias Stieler will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "15 That's the number of clean sheets Wolfsburg have already kept in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Wolfsburg's top scorer is Andre Schurrle with 9 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Kingsley Coman (Juventus) is Bayern Munich's latest signing."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bayern Munich have already scored 80 goals this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. Bayern Munich were better today and displayed masterful control and movement. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        }
    ],
    "gameAwayTeam": "Wolfsburg",
    "gameDate": "22/09/2015 - 21:00",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "5 - 1"
}