{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-29 - 21-45 Bayern Munich 5 - 0 D. Zagreb/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Bayern Munich were better today and displayed masterful control and movement. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        },
        {
            "gameTime": "2 - 47:04",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:44",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) collects a pass and strikes from about 20 metres out. It's a poor attempt which flies well over the bar."
        },
        {
            "gameTime": "2 - 45:08",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) produces a killer pass onto Robert Lewandowski, who loses the ball to one of the defenders."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:27",
            "label": "",
            "description": "Domagoj Antolic (Din. Zagreb) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 42:45",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) takes the resulting free kick from 22 metres out. He attempts to send his effort into the middle of the goal, but Eduardo is alert and keeps the ball out."
        },
        {
            "gameTime": "2 - 41:53",
            "label": "",
            "description": "Goncalo (Din. Zagreb) pulls the jersey of one of the opposition players and Aleksei Kulbakov blows his whistle for a foul. Bayern Munich are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 40:37",
            "label": "",
            "description": "That was close by Thiago Alcantara (Bayern Munich)! He receives a pass on the edge of the box and shoots, but the ball goes by a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) is disappointed with himself because he got into a good area but produced a poor cross. The ball is out of play. D. Zagreb will take a throw in."
        },
        {
            "gameTime": "2 - 37:48",
            "label": "corner",
            "description": "Kingsley Coman (Bayern Munich) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 37:20",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) receives a pass and fires a shot in from long range, but it's blocked. Good work from Bayern Munich as they win a corner."
        },
        {
            "gameTime": "2 - 36:41",
            "label": "",
            "description": "David Alaba (Bayern Munich) takes a mid range free kick and the effort crashes into the defensive wall."
        },
        {
            "gameTime": "2 - 35:56",
            "label": "y-card",
            "description": "Arijan Ademi (Din. Zagreb) has tested the patience of referee Aleksei Kulbakov and goes into the book for a previous late challenge. Another situation results in a direct free kick for Bayern Munich."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) strikes the ball from the resulting free kick from the edge of the box, but his effort goes high over the bar."
        },
        {
            "gameTime": "2 - 32:40",
            "label": "",
            "description": "Referee Aleksei Kulbakov sees the trip by Jeremy Taravel (Din. Zagreb) and doesn't hesitate to blow his whistle. Bayern Munich have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 31:21",
            "label": "corner",
            "description": "Marko Rog (Din. Zagreb) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 30:57",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) tries to send a low pass into the box, but it's blocked and cleared. D. Zagreb have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:06",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) dribbles into the box, but Eduardo is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 29:03",
            "label": "funfact",
            "description": "Total attempts – 27:6."
        },
        {
            "gameTime": "2 - 28:16",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) picks up an accurate pass inside the box and unleashes a shot goalwards that smashes against the left post. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "2 - 26:49",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Angelo Henriquez (Din. Zagreb) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "2 - 25:52",
            "label": "",
            "description": "Junior Fernandes (Din. Zagreb) unleashes a shot from 20 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Kingsley Coman (Bayern Munich)."
        },
        {
            "gameTime": "2 - 23:47",
            "label": "substitution",
            "description": "Zoran Mamic has decided to introduce fresh legs, with Angelo Henriquez (Din. Zagreb) replacing Marko Pjaca."
        },
        {
            "gameTime": "2 - 23:20",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. Corner kick. Bayern Munich will have an opportunity."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "",
            "description": "David Alaba (Bayern Munich) steps up to take a free kick and sends it in, but the opposition's defence is alert and clears the ball to safety."
        },
        {
            "gameTime": "2 - 21:00",
            "label": "y-card",
            "description": "Aleksei Kulbakov shows a yellow card to Josip Pivaric (Din. Zagreb) for his blatant foul. Bayern Munich earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 20:28",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) plays a one two with Robert Lewandowski, but the move breaks down."
        },
        {
            "gameTime": "2 - 20:10",
            "label": "corner",
            "description": "Thiago Alcantara (Bayern Munich) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 19:40",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) looks to break free, but an opposing player clears the ball away. Bayern Munich force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 18:27",
            "label": "substitution",
            "description": "Here comes a substitution. Jerome Boateng is given a rest as he is replaced by Rafinha (Bayern Munich)."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) had a good opportunity when he latched on to a cross from the wing, but his header wasn't accurate at all and the ball went well wide of the left post."
        },
        {
            "gameTime": "2 - 17:07",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) takes a long range shot, but his attempt is not a big threat to the goalkeeper."
        },
        {
            "gameTime": "2 - 15:40",
            "label": "substitution",
            "description": "Zoran Mamic has decided to make a change. Marko Rog (Din. Zagreb) replaces Paulo Ricardo Machado."
        },
        {
            "gameTime": "2 - 14:55",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) and Thomas Muller attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 13:36",
            "label": "",
            "description": "Good clearance! Robert Lewandowski (Bayern Munich) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him."
        },
        {
            "gameTime": "2 - 12:08",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Thomas Muller (Bayern Munich) comes onto the pitch for Douglas Costa."
        },
        {
            "gameTime": "2 - 11:28",
            "label": "",
            "description": "David Alaba (Bayern Munich) unleashes a superb first time shot from the edge of the box, but it flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "soccer-ball",
            "description": "GOAL 5:0! Thiago Alcantara found Robert Lewandowski (Bayern Munich) inside the box, he spotted goalkeeper Eduardo off his line and chipped the ball into the net. What a cheeky lob!"
        },
        {
            "gameTime": "2 - 07:49",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 05:34",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 03:45",
            "label": "corner",
            "description": "Thiago Alcantara (Bayern Munich) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 03:22",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) races towards goal but the defender gets back well to make a challenge. The referee points to the corner flag and Bayern Munich will take a corner."
        },
        {
            "gameTime": "2 - 02:15",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "2 - 00:02",
            "label": "substitution",
            "description": "Half time substitution. Filip Benkovic is replaced by Goncalo (Din. Zagreb)."
        },
        {
            "gameTime": "2 - 00:02",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Pep Guardiola gives a chance to Javi Martinez (Bayern Munich) and Juan Bernat is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. Bayern Munich dominated the opening period and easily created the most chances. The home side attempts to hold onto the ball for as long as possible, while the away side focuses on defending and lets the opposition keep possession."
        },
        {
            "gameTime": "1 - 45:04",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 43:11",
            "label": "funfact",
            "description": "Corner kicks – 12:1."
        },
        {
            "gameTime": "1 - 42:18",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 41:38",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender. The ball is out of play. Bayern Munich will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 40:50",
            "label": "corner",
            "description": "Kingsley Coman (Bayern Munich) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 40:27",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) serves up a nice cross, but the defence clears the danger. The referee signals a corner kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 38:40",
            "label": "corner",
            "description": "Jerome Boateng (Bayern Munich) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 38:20",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) whips a promising cross into the box, but the opposition's defence intercepts the ball. Bayern Munich earn a corner."
        },
        {
            "gameTime": "1 - 38:09",
            "label": "corner",
            "description": "Kingsley Coman (Bayern Munich) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 37:46",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) tries to send the ball in front of the goal, but the opposition's defence averts the threat. The referee and one of his assistants signal for a corner kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 36:36",
            "label": "",
            "description": "What a poor attempt! Jerome Boateng (Bayern Munich) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "1 - 35:40",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 34:00",
            "label": "",
            "description": "Bayern Munich are playing some nice combination football, sending it precisely from player to player, but a defender shows good anticipation and ends the move with a good block."
        },
        {
            "gameTime": "1 - 31:49",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 30:29",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 29:10",
            "label": "",
            "description": "David Alaba (Bayern Munich) takes the ball on and fires in a shot from 25 metres out. Eduardo stops the effort which is headed to the middle of the target."
        },
        {
            "gameTime": "1 - 27:48",
            "label": "soccer-ball",
            "description": "The ball hits the back of the net! Douglas Costa delivers a superb cross from the corner kick, Robert Lewandowski (Bayern Munich) finds himself some space inside the box and unleashes an unstoppable shot. His effort goes in off the crossbar and past the helpless goalkeeper. 4:0."
        },
        {
            "gameTime": "1 - 27:27",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 26:48",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball goes out of play and Bayern Munich have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 26:09",
            "label": "",
            "description": "Junior Fernandes (Din. Zagreb) sends a teasing cross into the area, but Manuel Neuer intercepts the ball."
        },
        {
            "gameTime": "1 - 25:23",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) shoots from the edge of the penalty area. The ball travels towards the bottom right corner, but Manuel Neuer easily deals with the threat."
        },
        {
            "gameTime": "1 - 24:25",
            "label": "soccer-ball",
            "description": "Mario Gotze (Bayern Munich) receives a brilliant pass inside the box from Kingsley Coman, and he beats the goalkeeper with a low accurate shot into the middle of the goal. He makes it 3:0."
        },
        {
            "gameTime": "1 - 22:20",
            "label": "",
            "description": "The game is interrupted as El Arbi Soudani (Din. Zagreb) is flagged offside."
        },
        {
            "gameTime": "1 - 20:55",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Thiago Alcantara sprays a pass out to Robert Lewandowski (Bayern Munich), and he has an easy job to slot the ball into an empty net. The score is 2:0."
        },
        {
            "gameTime": "1 - 20:21",
            "label": "y-card",
            "description": "Jerome Boateng (Bayern Munich) goes into the book for a horrible tackle. A yellow card is necessary in this case."
        },
        {
            "gameTime": "1 - 18:54",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) attempts to find one of his teammates with a cross from the resultant free kick, but he fails to hit the ball properly and sends it off the pitch."
        },
        {
            "gameTime": "1 - 18:37",
            "label": "",
            "description": "Josip Pivaric (Din. Zagreb) gives away a foul for a fierce tackle on an opponent. Bayern Munich will take a free kick."
        },
        {
            "gameTime": "1 - 17:17",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) passes the ball into the box but an opposing player clears."
        },
        {
            "gameTime": "1 - 16:15",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes a short corner kick."
        },
        {
            "gameTime": "1 - 15:41",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) sends a pass into the box, but his attempt is thwarted and cleared. The referee blows his whistle, Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "1 - 13:00",
            "label": "soccer-ball",
            "description": "Douglas Costa (Bayern Munich) makes a great solo run and pulls the trigger from inside the box, beating Eduardo with a strike into the bottom left corner. He makes it 1:0."
        },
        {
            "gameTime": "1 - 11:20",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Eduardo is alert and denies him."
        },
        {
            "gameTime": "1 - 10:21",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "1 - 09:57",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends a cross into the box, but the opposition's defence clears the ball to safety. Now Bayern Munich have a corner."
        },
        {
            "gameTime": "1 - 09:38",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) had a good opportunity from long range. His shot was directed towards the bottom left corner, but Eduardo was alert and made a comfortable save."
        },
        {
            "gameTime": "1 - 08:38",
            "label": "",
            "description": "A cross is clipped into the penalty area by Jerome Boateng (Bayern Munich) but poses no threat. The ball goes out of play and D. Zagreb will have a goal kick."
        },
        {
            "gameTime": "1 - 07:54",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 06:55",
            "label": "",
            "description": "The game is interrupted. Joshua Kimmich (Bayern Munich) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "1 - 05:22",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 04:16",
            "label": "",
            "description": "Domagoj Antolic (Din. Zagreb) fouls an opponent. At least that's what referee Aleksei Kulbakov signals."
        },
        {
            "gameTime": "1 - 03:24",
            "label": "",
            "description": "Douglas Costa plays a pass to Mario Gotze (Bayern Munich), but he fails to get a decent shot away from inside the box and the ball goes high over the bar."
        },
        {
            "gameTime": "1 - 02:15",
            "label": "",
            "description": "A dangerous towering header by Joshua Kimmich (Bayern Munich) from around the penalty spot goes just over the bar. This corner kick didn't change the score."
        },
        {
            "gameTime": "1 - 02:01",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) delivers a promising cross into the box, but it's cleared. The ball goes out of play. Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bayern Munich will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Aleksei Kulbakov was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Bayern Munich were better today and displayed masterful control and movement. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        }
    ],
    "gameAwayTeam": "D. Zagreb",
    "gameDate": "29/09/2015 - 21:45",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "5 - 0"
}