{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-09-16 - 21-45 Sampdoria 0 - 1 AC Milan/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 51:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 51:41",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 50:43",
            "label": "y-card",
            "description": "It's like he was asking for a caution. Gianluigi Donnarumma (AC Milan) receives a yellow card."
        },
        {
            "gameTime": "2 - 49:55",
            "label": "corner",
            "description": "The corner from Bruno Fernandes (Sampdoria) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 49:35",
            "label": "",
            "description": "Bruno Fernandes (Sampdoria) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The referee signals a corner kick to Sampdoria."
        },
        {
            "gameTime": "2 - 49:32",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Vasco Regini (Sampdoria)."
        },
        {
            "gameTime": "2 - 49:14",
            "label": "",
            "description": "Lucas Torreira (Sampdoria) slaloms his way past challenges, but an opposing player does well to get the ball away. The linesman points to the corner flag, Sampdoria are going to take it."
        },
        {
            "gameTime": "2 - 48:51",
            "label": "",
            "description": "Gustavo Gomez (AC Milan) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "injury",
            "description": "Looks like Gustavo Gomez (AC Milan) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 47:38",
            "label": "",
            "description": "Milan Skriniar (Sampdoria) makes a reckless foul in order to win the ball from his opponent. Massimiliano Irrati has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "corner",
            "description": "The resulting corner, taken by Bruno Fernandes (Sampdoria), comes to nothing."
        },
        {
            "gameTime": "2 - 46:45",
            "label": "",
            "description": "Luis Muriel (Sampdoria) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee blows his whistle, Sampdoria are awarded a corner kick."
        },
        {
            "gameTime": "2 - 46:22",
            "label": "",
            "description": "A poorly taken free kick by Bruno Fernandes (Sampdoria)! He sends a shot from the edge of the box into the defensive wall."
        },
        {
            "gameTime": "2 - 45:44",
            "label": "substitution",
            "description": "Vincenzo Montella has decided to introduce fresh legs, with Gustavo Gomez (AC Milan) replacing Suso."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "Manuel Locatelli (AC Milan) makes a rough challenge and the referee blows for a foul. Sampdoria earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "",
            "description": "Suso (AC Milan) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "2 - 42:26",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Edgar Barreto trots off the pitch and is replaced by Patrik Schick (Sampdoria)."
        },
        {
            "gameTime": "2 - 41:50",
            "label": "",
            "description": "Sampdoria are just stroking the ball across the park now, but the defence is doing very well breaking up their possession."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Superb finishing from Carlos Bacca (AC Milan). Suso plays a fantastic through ball and finds Carlos Bacca (AC Milan), who reacts quickly to get in front of the goalkeeper and fire a close range shot into the right side of the goal. It's now 0:1."
        },
        {
            "gameTime": "2 - 38:30",
            "label": "y-card",
            "description": "The booking goes to Luis Muriel (Sampdoria)."
        },
        {
            "gameTime": "2 - 38:29",
            "label": "",
            "description": "Goal, no wait. Massimiliano Irrati blows his whistle for handball and Luis Muriel (Sampdoria) can't celebrate. Disallowed goal."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "",
            "description": "Luis Muriel (Sampdoria) is having a lively performance. He is causing problems and wanting the ball at every opportunity."
        },
        {
            "gameTime": "2 - 35:56",
            "label": "",
            "description": "Carlos Bacca (AC Milan) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 34:20",
            "label": "",
            "description": "OFF THE POST! Luis Muriel (Sampdoria) drifts into the box to give his teammate support. He receives a fantastic pass and shoots from close range, but it crashes against the left post. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "",
            "description": "Davide Calabria (AC Milan) is able to continue to play."
        },
        {
            "gameTime": "2 - 32:57",
            "label": "injury",
            "description": "Davide Calabria (AC Milan) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 32:29",
            "label": "corner",
            "description": "Suso (AC Milan) works the corner short."
        },
        {
            "gameTime": "2 - 32:09",
            "label": "",
            "description": "Suso (AC Milan) tries to send the ball in front of the goal, but the opposition's defence averts the threat. The ball is out of play. AC Milan win a corner kick."
        },
        {
            "gameTime": "2 - 31:06",
            "label": "",
            "description": "M'Baye Niang (AC Milan) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 30:02",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 29:31",
            "label": "",
            "description": "Good clearance! Carlos Bacca (AC Milan) receives a brilliant short pass and finds himself in a good position inside the box, but he's robbed of the ball by one of the defending players. AC Milan force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 28:39",
            "label": "",
            "description": "Carlos Bacca (AC Milan) latches on to a pin point pass on the edge of the box and unleashes a daisy cutter shot towards the bottom right corner, but the goalkeeper produces an amazing acrobatic dive to deny him. The ball bounces off his gloves and hits the post."
        },
        {
            "gameTime": "2 - 27:42",
            "label": "",
            "description": "Carlos Bacca (AC Milan) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 26:27",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) fails to send in a decent cross from the free kick from the edge of the box. His effort goes out of play."
        },
        {
            "gameTime": "2 - 25:43",
            "label": "y-card",
            "description": "Pedro Pereira (Sampdoria) is booked after bringing down an opponent. Massimiliano Irrati had an easy decision to make. Another situation results in a direct free kick for AC Milan."
        },
        {
            "gameTime": "2 - 24:14",
            "label": "",
            "description": "GOAL DISALLOWED! Controversy and anger as Edgar Barreto (Sampdoria) has a goal ruled out, incredibly, for offside."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "corner",
            "description": "Bruno Fernandes (Sampdoria) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 23:46",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Bruno Fernandes (Sampdoria) comes onto the pitch for Dennis Praet."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "",
            "description": "The ball is cleared after Edgar Barreto (Sampdoria) attempted to dribble past an opposing player. It will be a corner kick for Sampdoria."
        },
        {
            "gameTime": "2 - 20:40",
            "label": "",
            "description": "Carlos Bacca (AC Milan) is caught offside after the linesman raises his flag."
        },
        {
            "gameTime": "2 - 19:03",
            "label": "",
            "description": "Pedro Pereira (Sampdoria) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 18:32",
            "label": "substitution",
            "description": "It's time for a substitution. Carlos Bacca (AC Milan) comes on in place of Gianluca Lapadula."
        },
        {
            "gameTime": "2 - 16:46",
            "label": "",
            "description": "Manuel Locatelli (AC Milan) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 15:51",
            "label": "",
            "description": "The Sampdoria players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition."
        },
        {
            "gameTime": "2 - 14:37",
            "label": "",
            "description": "Dennis Praet (Sampdoria) commits a foul and Massimiliano Irrati immediately signals a free kick."
        },
        {
            "gameTime": "2 - 13:25",
            "label": "",
            "description": "Emiliano Viviano blocks a long range effort from Suso (AC Milan) towards the middle of the goal."
        },
        {
            "gameTime": "2 - 12:19",
            "label": "",
            "description": "M'Baye Niang (AC Milan) feels very aggrieved after the referee stops play for a foul that he commits while in possession of the ball."
        },
        {
            "gameTime": "2 - 11:47",
            "label": "substitution",
            "description": "That's the end of the game for Jose Sosa, who is replaced by Manuel Locatelli (AC Milan)."
        },
        {
            "gameTime": "2 - 10:39",
            "label": "",
            "description": "Dennis Praet (Sampdoria) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 09:51",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) is penalised for a foul. Massimiliano Irrati had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 09:20",
            "label": "",
            "description": "Pedro Pereira (Sampdoria) commits a rough challenge and Massimiliano Irrati blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 08:44",
            "label": "",
            "description": "Davide Calabria (AC Milan) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 07:34",
            "label": "injury",
            "description": "Davide Calabria (AC Milan) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 06:45",
            "label": "corner",
            "description": "The corner kick from Dennis Praet (Sampdoria) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 06:17",
            "label": "",
            "description": "Luis Muriel (Sampdoria) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety. The ball is out of play. Sampdoria will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 05:26",
            "label": "",
            "description": "Davide Calabria (AC Milan) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 04:38",
            "label": "",
            "description": "Dennis Praet (Sampdoria) skips past his man but can't keep the ball in play. The ball is off of the pitch and it's a goal kick for AC Milan."
        },
        {
            "gameTime": "2 - 03:23",
            "label": "",
            "description": "Massimiliano Irrati blows his whistle and it's Luis Muriel (Sampdoria) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 02:35",
            "label": "",
            "description": "Vasco Regini (Sampdoria) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "2 - 01:46",
            "label": "y-card",
            "description": "Giacomo Bonaventura (AC Milan) sees a yellow card from Massimiliano Irrati after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. It has been a tight contest so far. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:01",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:01",
            "label": "",
            "description": "Jose Sosa (AC Milan) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:57",
            "label": "corner",
            "description": "Lucas Torreira (Sampdoria) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 43:14",
            "label": "",
            "description": "A neat pass is well received by Edgar Barreto (Sampdoria), who is lurking on the edge of the box and strikes the ball towards the right post, but the goalkeeper makes an incredible diving save to block his shot. Sampdoria earn a corner."
        },
        {
            "gameTime": "1 - 42:18",
            "label": "",
            "description": "AC Milan are playing some nice combination football, sending it precisely from player to player, but a defender shows good anticipation and ends the move with a good block."
        },
        {
            "gameTime": "1 - 40:41",
            "label": "",
            "description": "Luis Muriel (Sampdoria) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards wide of the right post."
        },
        {
            "gameTime": "1 - 39:53",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from 23 metres out by Luis Muriel (Sampdoria) as his effort only hit the wall."
        },
        {
            "gameTime": "1 - 38:01",
            "label": "y-card",
            "description": "Gianluca Lapadula (AC Milan) is booked. Handball by Gianluca Lapadula (AC Milan). Sampdoria are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 37:36",
            "label": "",
            "description": "The resulting free kick from 32 metres out taken by Luis Muriel (Sampdoria) was blocked by the defensive wall, which was perfectly positioned by the goalkeeper."
        },
        {
            "gameTime": "1 - 37:11",
            "label": "",
            "description": "Massimiliano Irrati has a clear sight and sees a foul from Gianluca Lapadula (AC Milan). A free kick has been awarded to Sampdoria."
        },
        {
            "gameTime": "1 - 36:45",
            "label": "corner",
            "description": "Lucas Torreira (Sampdoria) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 36:14",
            "label": "",
            "description": "Vasco Regini (Sampdoria) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. Sampdoria have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 34:14",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by M'Baye Niang (AC Milan)."
        },
        {
            "gameTime": "1 - 33:27",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) is adjudged offside."
        },
        {
            "gameTime": "1 - 32:00",
            "label": "",
            "description": "Jose Sosa (AC Milan) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat. The ball goes out of play and Sampdoria will have a goal kick."
        },
        {
            "gameTime": "1 - 29:59",
            "label": "substitution",
            "description": "Jacopo Sala is substituted due to injury. Marco Giampaolo gives a chance to Pedro Pereira (Sampdoria)."
        },
        {
            "gameTime": "1 - 29:16",
            "label": "injury",
            "description": "Jacopo Sala (Sampdoria) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 28:33",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) makes room to connect with a cross, but his strike from the penalty spot isn't accurate at all and the ball goes well over the bar."
        },
        {
            "gameTime": "1 - 26:30",
            "label": "",
            "description": "Fabio Quagliarella (Sampdoria) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 25:33",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) unleashed a long range shot, but it misses narrowly over the bar. It could have been the goal of the month, at least."
        },
        {
            "gameTime": "1 - 25:20",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Giacomo Bonaventura (AC Milan) takes it short."
        },
        {
            "gameTime": "1 - 24:53",
            "label": "",
            "description": "M'Baye Niang (AC Milan) races towards goal but the defender gets back well to make a challenge. The referee and one of his assistants signal for a corner kick to AC Milan."
        },
        {
            "gameTime": "1 - 22:55",
            "label": "",
            "description": "It's a throw in for AC Milan."
        },
        {
            "gameTime": "1 - 20:35",
            "label": "",
            "description": "Lucas Torreira (Sampdoria) attempts to surprise the keeper with a shot from distance, but it lacks accuracy and goes high over the crossbar."
        },
        {
            "gameTime": "1 - 20:06",
            "label": "",
            "description": "Luis Muriel (Sampdoria) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort."
        },
        {
            "gameTime": "1 - 19:32",
            "label": "corner",
            "description": "Suso (AC Milan) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 18:49",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Gianluca Lapadula (AC Milan), but the defence gets it clear. The referee and his assistant both point at the corner flag. AC Milan will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 17:50",
            "label": "",
            "description": "Dennis Praet (Sampdoria) commits a foul after unfairly pressing his opponent during an attacking move."
        },
        {
            "gameTime": "1 - 16:39",
            "label": "",
            "description": "Jose Sosa (AC Milan) was too forceful with his tackle and Massimiliano Irrati interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 15:06",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) makes his forward run a little too early and is caught in an offside position after his teammate tries to play a pass to him."
        },
        {
            "gameTime": "1 - 14:26",
            "label": "",
            "description": "The ball spins up and hits the hand of Riccardo Montolivo (AC Milan) after he fails to control it and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 13:35",
            "label": "",
            "description": "Jacopo Sala (Sampdoria) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 12:01",
            "label": "",
            "description": "M'Baye Niang (AC Milan) swings a cross into the box, but it's far too close to Emiliano Viviano, who smothers the ball."
        },
        {
            "gameTime": "1 - 11:26",
            "label": "",
            "description": "Matias Silvestre (Sampdoria) misses a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball floats high over the crossbar!"
        },
        {
            "gameTime": "1 - 11:09",
            "label": "corner",
            "description": "Lucas Torreira (Sampdoria) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 10:34",
            "label": "",
            "description": "Lucas Torreira (Sampdoria) produces a long range cannon of a shot after a nice pass. The ball heads under the crossbar, but is stopped by a great save from Gianluigi Donnarumma. The ball is out of play and Sampdoria manage to earn a corner."
        },
        {
            "gameTime": "1 - 09:51",
            "label": "",
            "description": "Edgar Barreto (Sampdoria) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "1 - 08:25",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) takes a short corner kick."
        },
        {
            "gameTime": "1 - 07:55",
            "label": "",
            "description": "M'Baye Niang (AC Milan) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. AC Milan get a corner."
        },
        {
            "gameTime": "1 - 06:47",
            "label": "",
            "description": "Ignazio Abate (AC Milan) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "1 - 05:30",
            "label": "",
            "description": "Edgar Barreto (Sampdoria) darts into the box and immediately fires a first time effort that ends well wide of the right post."
        },
        {
            "gameTime": "1 - 04:45",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) pulls the trigger and strikes the ball towards goal from long range, but his effort is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 04:03",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 02:38",
            "label": "",
            "description": "Karol Linetty (Sampdoria) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Massimiliano Irrati with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! AC Milan will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Massimiliano Irrati."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AC Milan suffered their worst defeat of the season on 25.10. against Genoa, losing 0:3."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Bacca has already scored 6 goals and he is the top goal scorer for AC Milan in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Sampdoria players have rippled the net at least once in their last 3 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "AC Milan",
    "gameDate": "16/09/2016 - 21:45",
    "gameHomeTeam": "Sampdoria",
    "gameScore": "0 - 1"
}