{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-02-03 - 22-45 Watford 0 - 0 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. There wasn't any evident superiority by either side today. The home side played long passes and crosses into the box. The tactic of the away side, on the other hand, was slow build up play."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "whistle",
            "description": "Michael Dean is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "",
            "description": "John Terry (Chelsea) sends a long ball in, but Heurelho Gomes comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 46:27",
            "label": "",
            "description": "Troy Deeney (Watford) is penalised for a foul. Michael Dean had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 45:24",
            "label": "corner",
            "description": "Jose Holebas (Watford) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 45:08",
            "label": "",
            "description": "Odion Ighalo (Watford) slaloms his way past challenges, but an opposing player does well to get the ball away. Watford have a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:51",
            "label": "corner",
            "description": "Oscar (Chelsea) works the corner short."
        },
        {
            "gameTime": "2 - 43:21",
            "label": "",
            "description": "Heurelho Gomes makes a superb save to deny a header which was nodded towards the left hand post by Diego Costa (Chelsea) after a cross from the side."
        },
        {
            "gameTime": "2 - 42:28",
            "label": "corner",
            "description": "Willian (Chelsea) takes a short corner kick."
        },
        {
            "gameTime": "2 - 42:15",
            "label": "",
            "description": "Willian (Chelsea) sends a cross into the box, but the opposition's defence clears the ball to safety. Chelsea force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 41:17",
            "label": "substitution",
            "description": "Here comes a substitution. Etienne Capoue is given a rest as he is replaced by Mario Suarez (Watford)."
        },
        {
            "gameTime": "2 - 40:55",
            "label": "corner",
            "description": "Willian (Chelsea) sends over a poor, overhit cross from the corner kick and the ball goes out of play."
        },
        {
            "gameTime": "2 - 40:20",
            "label": "",
            "description": "Diego Costa (Chelsea) races towards goal but the defender gets back well to make a challenge. The ball is out of play. Chelsea will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 39:06",
            "label": "",
            "description": "Chance! Diego Costa (Chelsea) comes within inches of scoring after picking up a pass from Eden Hazard, but his shot from inside the box flashes inches wide of the right post."
        },
        {
            "gameTime": "2 - 36:18",
            "label": "",
            "description": "Neat link up play between Willian (Chelsea) and Eden Hazard, but Heurelho Gomes reads the game well and the move breaks down."
        },
        {
            "gameTime": "2 - 35:05",
            "label": "",
            "description": "Oscar (Chelsea) commits a foul and Michael Dean immediately signals a free kick."
        },
        {
            "gameTime": "2 - 33:16",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "2 - 32:36",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Heurelho Gomes to get hold of the ball. The ball goes out of play and Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 31:29",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Ben Watson (Watford), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 31:09",
            "label": "corner",
            "description": "The resulting corner from Ben Watson (Watford) is cleared by the defence. The referee blows his whistle, Watford are awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:42",
            "label": "",
            "description": "Etienne Capoue (Watford) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The ball goes behind for a corner. Watford will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 30:05",
            "label": "",
            "description": "Kurt Zouma (Chelsea) pulls the shirt of his opponent and only escapes without punishment due to the benevolence of the referee."
        },
        {
            "gameTime": "2 - 29:19",
            "label": "",
            "description": "Oscar (Chelsea) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety."
        },
        {
            "gameTime": "2 - 28:23",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net."
        },
        {
            "gameTime": "2 - 27:14",
            "label": "substitution",
            "description": "Eden Hazard (Chelsea) joins the action as a substitute, replacing Nemanja Matic."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "corner",
            "description": "Willian (Chelsea) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 24:19",
            "label": "",
            "description": "Oscar (Chelsea) shoots from the edge of the penalty area. The ball travels towards the left side of the target, but Heurelho Gomes easily deals with the threat. Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 22:11",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Allan Nyom (Watford) is coming onto the pitch as Juan Carlos Paredes cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 21:24",
            "label": "corner",
            "description": "Ben Watson (Watford) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 21:10",
            "label": "",
            "description": "Troy Deeney (Watford) fails to send a pass into the box as his effort is cut out. The referee points to the corner flag and Watford will take a corner."
        },
        {
            "gameTime": "2 - 20:19",
            "label": "",
            "description": "A pass from Cesc Fabregas (Chelsea) is intercepted by Heurelho Gomes and the move breaks down."
        },
        {
            "gameTime": "2 - 18:03",
            "label": "substitution",
            "description": "Quique Flores decides to make a substitution. Jose Manuel Jurado will be replaced by Almen Abdi (Watford)."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "",
            "description": "A cross from the free kick is whipped in by Ben Watson (Watford), but one of the defenders steps in and averts the threat."
        },
        {
            "gameTime": "2 - 16:36",
            "label": "",
            "description": "Michael Dean blows his whistle and signals a foul after Oscar (Chelsea) brought his opponent down. It's a free kick to Watford, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "",
            "description": "Nemanja Matic (Chelsea) wastes an opportunity! He unleashed a strong shot from distance after the rebound fell at his feet. It went in the direction of the middle of the target and the goalkeeper pulled off a save to deny him."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "",
            "description": "Jose Holebas (Watford) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 09:30",
            "label": "",
            "description": "CHANCE! Oscar (Chelsea) fires just wide of the left post from inside the box after running onto a splendid pass from Diego Costa."
        },
        {
            "gameTime": "2 - 08:51",
            "label": "",
            "description": "Juan Carlos Paredes (Watford) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 06:10",
            "label": "",
            "description": "Golden chance! Jose Holebas (Watford) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the left post."
        },
        {
            "gameTime": "2 - 04:34",
            "label": "",
            "description": "Diego Costa (Chelsea) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "2 - 03:49",
            "label": "",
            "description": "Troy Deeney (Watford) creates a yard of space for himself and tries an effort from the edge of the box, but it goes just wide of the left post."
        },
        {
            "gameTime": "2 - 02:22",
            "label": "corner",
            "description": "The corner kick from Willian (Chelsea) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 02:11",
            "label": "",
            "description": "John Obi Mikel (Chelsea) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it. The ball is out of play. A goal scoring opportunity from a corner for Chelsea."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "",
            "description": "What a goal scoring opportunity! Oscar (Chelsea) makes a good run into the box to meet a cross and fires the ball in on goal, but the shot is amazingly blocked by a defender."
        },
        {
            "gameTime": "2 - 01:03",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) sends a teasing cross into the area, but Heurelho Gomes intercepts the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "The game can't be described as attractive. We are hoping against hope that the second half will bring more exciting moments and goal opportunities. No side has really dominated in this first half. The home side are playing 'kick and rush' football, which is the exact opposite of the away team who are making a lot of passes and attempting to maintain possession."
        },
        {
            "gameTime": "1 - 48:55",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 48:36",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 46:51",
            "label": "y-card",
            "description": "Juan Carlos Paredes (Watford) is booked."
        },
        {
            "gameTime": "1 - 46:02",
            "label": "y-card",
            "description": "Michael Dean has issued a yellow card to Diego Costa (Chelsea)."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 41:57",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the right post."
        },
        {
            "gameTime": "1 - 39:18",
            "label": "",
            "description": "Willian (Chelsea) sends a cross into the box, but Heurelho Gomes comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 37:24",
            "label": "",
            "description": "Chelsea are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 35:08",
            "label": "",
            "description": "A cross from Diego Costa (Chelsea) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 33:23",
            "label": "",
            "description": "Oscar (Chelsea) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "1 - 32:53",
            "label": "corner",
            "description": "Willian (Chelsea) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 32:32",
            "label": "",
            "description": "Diego Costa (Chelsea) fires the ball at goal from inside the area, but it's well blocked. The referee and one of his assistants signal for a corner kick to Chelsea."
        },
        {
            "gameTime": "1 - 30:21",
            "label": "",
            "description": "Jose Holebas (Watford) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 29:53",
            "label": "",
            "description": "Kurt Zouma (Chelsea) pulls the jersey of one of the opposition players and Michael Dean blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 27:55",
            "label": "",
            "description": "Etienne Capoue (Watford) picks up a precise pass deep inside the box, but his strike is saved by the keeper."
        },
        {
            "gameTime": "1 - 27:31",
            "label": "",
            "description": "Odion Ighalo (Watford) meets a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Thibaut Courtois pulls off an easy save."
        },
        {
            "gameTime": "1 - 26:44",
            "label": "",
            "description": "Sebastian Prodl (Watford) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "1 - 26:31",
            "label": "corner",
            "description": "Ben Watson (Watford) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 26:03",
            "label": "",
            "description": "The ball is cleared after Jose Manuel Jurado (Watford) attempted to dribble past an opposing player. Watford will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 24:44",
            "label": "",
            "description": "Jose Manuel Jurado (Watford) clips a neat ball into the box in the direction of Odion Ighalo, but he can't get on the end of the pass."
        },
        {
            "gameTime": "1 - 23:38",
            "label": "",
            "description": "Odion Ighalo (Watford) unleashes a bullet of a shot that is blocked by a defender."
        },
        {
            "gameTime": "1 - 21:21",
            "label": "",
            "description": "The game is interrupted as Oscar (Chelsea) is flagged offside."
        },
        {
            "gameTime": "1 - 20:26",
            "label": "",
            "description": "Jose Holebas (Watford) slams the ball from a long range free kick. He should have curled it higher to avoid hitting the wall."
        },
        {
            "gameTime": "1 - 19:56",
            "label": "",
            "description": "John Terry (Chelsea) gives away a foul for a fierce tackle on an opponent. It's a free kick to Watford in a dangerous position."
        },
        {
            "gameTime": "1 - 18:23",
            "label": "y-card",
            "description": "Michael Dean shows a yellow card to Sebastian Prodl (Watford) for a tough tackle."
        },
        {
            "gameTime": "1 - 17:52",
            "label": "",
            "description": "Odion Ighalo (Watford) gets himself onto the end of the corner, but his header is blocked."
        },
        {
            "gameTime": "1 - 17:48",
            "label": "corner",
            "description": "Ben Watson (Watford) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 16:49",
            "label": "",
            "description": "Etienne Capoue (Watford) tries to send a pass but it's blocked. It will be a corner kick for Watford."
        },
        {
            "gameTime": "1 - 14:46",
            "label": "",
            "description": "Diego Costa (Chelsea) breaks into the penalty area but his shot is blocked."
        },
        {
            "gameTime": "1 - 12:31",
            "label": "",
            "description": "Diego Costa (Chelsea) commits a rough foul. Michael Dean stops the game and makes a call."
        },
        {
            "gameTime": "1 - 10:58",
            "label": "",
            "description": "Half chance! Willian (Chelsea) plays a pass into the box, but Heurelho Gomes reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 10:05",
            "label": "",
            "description": "Jose Manuel Jurado (Watford) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "1 - 09:28",
            "label": "",
            "description": "An attempted cross from Juan Carlos Paredes (Watford) is cleared."
        },
        {
            "gameTime": "1 - 08:13",
            "label": "",
            "description": "Willian (Chelsea) sends a chip pass into the box, but Heurelho Gomes is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 07:13",
            "label": "corner",
            "description": "Ben Watson (Watford) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 06:36",
            "label": "",
            "description": "Odion Ighalo (Watford) blasts the ball from just outside the box, but his attempt is blocked by the defender. The referee signals a corner kick to Watford."
        },
        {
            "gameTime": "1 - 06:07",
            "label": "",
            "description": "Ben Watson (Watford) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "1 - 05:25",
            "label": "",
            "description": "Michael Dean interrupts the game for a tactical foul by Branislav Ivanovic (Chelsea)."
        },
        {
            "gameTime": "1 - 03:19",
            "label": "",
            "description": "Oscar (Chelsea) swings a cross into the box, but it's far too close to Heurelho Gomes, who smothers the ball."
        },
        {
            "gameTime": "1 - 02:03",
            "label": "",
            "description": "Odion Ighalo (Watford) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 01:13",
            "label": "",
            "description": "Diego Costa (Chelsea) breaks past challenges inside the box, but puts too much pace on his pass to Cesar Azpilicueta."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Chelsea will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Michael Dean was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. There wasn't any evident superiority by either side today. The home side played long passes and crosses into the box. The tactic of the away side, on the other hand, was slow build up play."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "03/02/2016 - 22:45",
    "gameHomeTeam": "Watford",
    "gameScore": "0 - 0"
}