{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/france_ligue-1/2016-2017/2017-01-21 - 19-00 Nantes 0 - 2 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We can only hope that the managers will be able to motivate the players and spark them into life in the next games. The football on offer today has been disappointing. Paris SG were much the better side in today's clash. The home side's tactic was kick and rush football, the exact opposite of the away team who made a lot of passes and attempted to maintain possession."
        },
        {
            "gameTime": "2 - 48:07",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:26",
            "label": "",
            "description": "Angel Di Maria (Paris SG) misses a good chance to score. An inch perfect cross into the box finds Angel Di Maria (Paris SG) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 46:28",
            "label": "",
            "description": "Angel Di Maria (Paris SG) attempts to head the rebound low into the middle of the goal, but Maxime Dupe reads his intention and makes an incredible reflex save!"
        },
        {
            "gameTime": "2 - 45:50",
            "label": "",
            "description": "Adrien Rabiot (Paris SG) expertly controls a neat clever pass inside the box, but his effort crashes against the crossbar! What an opportunity that was!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:46",
            "label": "",
            "description": "Leo Dubois (Nantes) swings a cross into the box, but it's far too close to Kevin Trapp, who smothers the ball."
        },
        {
            "gameTime": "2 - 42:03",
            "label": "funfact",
            "description": "The current number of shots on goal is 0:5."
        },
        {
            "gameTime": "2 - 41:25",
            "label": "",
            "description": "Adrien Rabiot (Paris SG) had a golden opportunity. He volleyed from point blank range low towards the middle of the net, but Maxime Dupe was alert and made an amazing save!"
        },
        {
            "gameTime": "2 - 40:21",
            "label": "",
            "description": "Lima (Nantes) skips past his man but can't keep the ball in play. The ball is off of the pitch and it's a goal kick for Paris SG."
        },
        {
            "gameTime": "2 - 38:53",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 38:28",
            "label": "",
            "description": "Angel Di Maria (Paris SG) sends a lofted cross into the box which is headed clear. The ball is out of play. Paris SG will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 37:18",
            "label": "substitution",
            "description": "Here comes a substitution. Hatem Ben Arfa (Paris SG) is brought on as a substitute for Edinson Cavani."
        },
        {
            "gameTime": "2 - 36:42",
            "label": "",
            "description": "Angel Di Maria (Paris SG) misses a good chance to score. An inch perfect cross into the box finds Angel Di Maria (Paris SG) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 36:14",
            "label": "corner",
            "description": "The resulting corner from Lucas (Paris SG) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 35:42",
            "label": "corner",
            "description": "The resulting corner from Angel Di Maria (Paris SG) comes to nothing. The ball goes behind for a corner. Paris SG will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 33:57",
            "label": "",
            "description": "Lucas (Paris SG) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 31:19",
            "label": "corner",
            "description": "Lima (Nantes) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 30:58",
            "label": "",
            "description": "Emiliano Sala (Nantes) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. Nantes earn a corner."
        },
        {
            "gameTime": "2 - 30:28",
            "label": "substitution",
            "description": "Unai Emery Etxegoien prepares a substitution. Marco Verratti is replaced by Adrien Rabiot (Paris SG)."
        },
        {
            "gameTime": "2 - 27:57",
            "label": "substitution",
            "description": "The manager makes a subsitution with Adrien Thomasson (Nantes) coming on for Amine Harit."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "",
            "description": "Angel Di Maria (Paris SG) produces a ferocious strike from the edge of the box. His dangerous effort towards the left post is blocked by Maxime Dupe, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "2 - 24:02",
            "label": "corner",
            "description": "Nantes take the corner, but their hopes of scoring a goal end with nice clearance by the defence."
        },
        {
            "gameTime": "2 - 23:53",
            "label": "y-card",
            "description": "Felipe Pardo (Nantes) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 23:38",
            "label": "substitution",
            "description": "Angel Di Maria (Paris SG) comes onto the pitch after Julian Draxler signals to the bench that he cannot continue any longer after picking up an injury."
        },
        {
            "gameTime": "2 - 21:27",
            "label": "substitution",
            "description": "It is time for a substitution. Mariusz Stepinski (Nantes) is on for Yacine Bammou."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "soccer-ball",
            "description": "Edinson Cavani (Paris SG) can showcase his brilliant free kick ability, particularly from a distance like this. He hits the ball perfectly and it ends up inside the left post."
        },
        {
            "gameTime": "2 - 19:20",
            "label": "y-card",
            "description": "Santos Silva Diego (Nantes) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 17:10",
            "label": "",
            "description": "Thomas Meunier (Paris SG) wastes a great chance as he climbs high around the penalty spot to connect with a cross from the resulting free kick. He plants his header against the crossbar!"
        },
        {
            "gameTime": "2 - 16:37",
            "label": "",
            "description": "Koffi Djidji (Nantes) gives away a foul for a clumsy challenge. Referee Johan Hamel saw the whole situation. Paris SG earn a free kick."
        },
        {
            "gameTime": "2 - 15:45",
            "label": "",
            "description": "Marco Verratti (Paris SG) is able to continue to play."
        },
        {
            "gameTime": "2 - 14:14",
            "label": "injury",
            "description": "Marco Verratti (Paris SG) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 12:59",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) misses a good chance to score. An inch perfect cross into the box finds Blaise Matuidi (Paris SG) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 11:47",
            "label": "",
            "description": "Wow, what an escape. Edinson Cavani (Paris SG) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "2 - 10:45",
            "label": "",
            "description": "Emiliano Sala (Nantes) tries to find Yacine Bammou, but he puts too much power on the pass."
        },
        {
            "gameTime": "2 - 09:46",
            "label": "",
            "description": "Edinson Cavani (Paris SG) swings it in and Julian Draxler gets on the end of it, but Maxime Dupe shows good awareness and comes off his line to thwart the move."
        },
        {
            "gameTime": "2 - 09:17",
            "label": "",
            "description": "Felipe Pardo (Nantes) sends a teasing cross into the area, but Kevin Trapp intercepts the ball."
        },
        {
            "gameTime": "2 - 06:19",
            "label": "corner",
            "description": "Nantes quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 05:45",
            "label": "",
            "description": "Felipe Pardo (Nantes) misses a good chance to score. An inch perfect cross into the box finds Felipe Pardo (Nantes) who rises for a header, but sends the ball well over the bar. Now Nantes have a corner."
        },
        {
            "gameTime": "2 - 03:18",
            "label": "",
            "description": "The linesman raises his flag. Edinson Cavani (Paris SG) is adjudged offside."
        },
        {
            "gameTime": "2 - 02:59",
            "label": "",
            "description": "Lucas (Paris SG) decides to have a shot at goal from the free kick, but it hits the defensive wall."
        },
        {
            "gameTime": "2 - 01:43",
            "label": "",
            "description": "Johan Hamel blows his whistle for a foul after Valentin Rongier (Nantes) hacks down one of his opponents. Another situation results in a direct free kick for Paris SG."
        },
        {
            "gameTime": "2 - 00:49",
            "label": "",
            "description": "Lima (Nantes) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Sergio Conceicao gives a chance to Felipe Pardo (Nantes) and Jules Iloki is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 47:00",
            "label": "",
            "description": "It wasn't the most inspiring 45 minutes that you'll see this week. Let's hope that the second period will be more exciting. Both teams are unsuccessfully trying to control the game and it's pretty even so far. The home side are playing 'kick and rush' football, which is the exact opposite of the away team who are making a lot of passes and attempting to maintain possession."
        },
        {
            "gameTime": "1 - 46:06",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:14",
            "label": "",
            "description": "Leo Dubois (Nantes) sends a cross into the box, but Kevin Trapp comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 43:03",
            "label": "corner",
            "description": "Lima (Nantes) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "1 - 42:41",
            "label": "",
            "description": "Amine Harit (Nantes) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball goes out of play. Nantes are awarded a corner kick."
        },
        {
            "gameTime": "1 - 40:50",
            "label": "",
            "description": "Marco Verratti (Paris SG) brings his opponent down. Johan Hamel has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 39:57",
            "label": "",
            "description": "Edinson Cavani (Paris SG) and Julian Draxler try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 38:44",
            "label": "",
            "description": "Emiliano Sala (Nantes) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 38:24",
            "label": "",
            "description": "A cross from a mid range free kick, taken by Nantes, is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 37:25",
            "label": "",
            "description": "Thiago Motta (Paris SG) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. It's a free kick to Nantes in a dangerous position."
        },
        {
            "gameTime": "1 - 36:26",
            "label": "",
            "description": "He should have done better. Blaise Matuidi (Paris SG) is afforded space to connect with a Lucas cross, but his header from the centre of the box flies well wide of the right post. The ball is off of the pitch and it's a goal kick for Nantes."
        },
        {
            "gameTime": "1 - 34:21",
            "label": "",
            "description": "The foul by Blaise Matuidi (Paris SG) was seen by Johan Hamel who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 33:29",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 31:49",
            "label": "corner",
            "description": "The resulting corner from Lima (Nantes) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 31:29",
            "label": "corner",
            "description": "The corner kick from Lima (Nantes) is headed out of the penalty area by one of the defenders. Corner kick. Nantes will have an opportunity."
        },
        {
            "gameTime": "1 - 30:58",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from the edge of the box by Amine Harit (Nantes) as his effort only hit the wall. Nantes have a corner."
        },
        {
            "gameTime": "1 - 29:21",
            "label": "y-card",
            "description": "That's a clear yellow card. Marco Verratti (Paris SG) goes into the book."
        },
        {
            "gameTime": "1 - 28:04",
            "label": "corner",
            "description": "The corner from Lucas (Paris SG) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 27:46",
            "label": "",
            "description": "Lucas (Paris SG) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The ball is out of play and the linesman points at the corner flag. Corner to Paris SG."
        },
        {
            "gameTime": "1 - 24:57",
            "label": "",
            "description": "A cross into the box from Lima (Nantes) is cleared."
        },
        {
            "gameTime": "1 - 24:01",
            "label": "",
            "description": "Santos Silva Diego (Nantes) reacts well and displays good awareness near the penalty spot to get on the end of a cross from the free kick. He jumps high and produces a header which goes well over the crossbar. The ball goes out of play and Paris SG will have a goal kick."
        },
        {
            "gameTime": "1 - 23:06",
            "label": "",
            "description": "Thiago Motta (Paris SG) is penalised for holding. Johan Hamel signals a set piece."
        },
        {
            "gameTime": "1 - 20:24",
            "label": "soccer-ball",
            "description": "What a goal! Lucas plays it to Edinson Cavani (Paris SG), who finds himself unmarked inside the box and slots a first time shot past Maxime Dupe low into the middle of the net. 0:1."
        },
        {
            "gameTime": "1 - 18:48",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Blaise Matuidi (Paris SG), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "1 - 18:21",
            "label": "corner",
            "description": "Lucas (Paris SG) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 17:55",
            "label": "",
            "description": "Marco Verratti (Paris SG) races towards goal but the defender gets back well to make a challenge. The ball goes out for a corner. Paris SG can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 17:18",
            "label": "",
            "description": "A crossfield pass from Santos Silva Diego (Nantes) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 15:42",
            "label": "",
            "description": "Leo Dubois (Nantes) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 14:11",
            "label": "",
            "description": "Dangerous play by Koffi Djidji (Nantes). Johan Hamel blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 13:22",
            "label": "",
            "description": "Emiliano Sala (Nantes) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball is out of play. Nantes will take a throw in."
        },
        {
            "gameTime": "1 - 10:27",
            "label": "",
            "description": "Lucas (Paris SG) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "1 - 09:39",
            "label": "",
            "description": "A player from Nantes pulled an opponent down, forcing the referee to blow his whistle. A free kick is awarded to Paris SG."
        },
        {
            "gameTime": "1 - 09:10",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "1 - 07:50",
            "label": "",
            "description": "What a huge chance for Emiliano Sala (Nantes). He collects a precise pass inside the box and slices a shot that goes a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 06:55",
            "label": "",
            "description": "Johan Hamel blows his whistle and it's Lucas (Paris SG) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 06:12",
            "label": "",
            "description": "Paris SG are seeing far more of the ball now."
        },
        {
            "gameTime": "1 - 04:42",
            "label": "",
            "description": "Marco Verratti (Paris SG) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 03:33",
            "label": "",
            "description": "Julian Draxler (Paris SG) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation."
        },
        {
            "gameTime": "1 - 01:58",
            "label": "",
            "description": "Valentin Rongier (Nantes) brings an opponent down and Johan Hamel interrupts the game."
        },
        {
            "gameTime": "1 - 01:24",
            "label": "",
            "description": "Jules Iloki (Nantes) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paris SG will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Johan Hamel will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We can only hope that the managers will be able to motivate the players and spark them into life in the next games. The football on offer today has been disappointing. Paris SG were much the better side in today's clash. The home side's tactic was kick and rush football, the exact opposite of the away team who made a lot of passes and attempted to maintain possession."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "21/01/2017 - 19:00",
    "gameHomeTeam": "Nantes",
    "gameScore": "0 - 2"
}