{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/france_ligue-1/2016-2017/2017-03-12 - 23-00 Lorient 1 - 2 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:02",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:33",
            "label": "",
            "description": "Ambitious effort from Christopher Nkunku (Paris SG). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well over the bar."
        },
        {
            "gameTime": "2 - 42:45",
            "label": "substitution",
            "description": "Unai Emery Etxegoien prepares a substitution. Julian Draxler is replaced by Hatem Ben Arfa (Paris SG)."
        },
        {
            "gameTime": "2 - 40:48",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Pierre Yves Hamel (Lorient) for Arnold Mvuemba."
        },
        {
            "gameTime": "2 - 38:21",
            "label": "corner",
            "description": "Paris SG didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 38:18",
            "label": "y-card",
            "description": "Mathieu Peybernes (Lorient) picked up a yellow card for saying too much to the referee."
        },
        {
            "gameTime": "2 - 37:42",
            "label": "",
            "description": "That was a brilliant piece of goalkeeping! Benjamin Lecomte dived superbly to block a header by Edinson Cavani (Paris SG) from around the penalty spot. His effort was directed straight towards the roof of the net, but Benjamin Lecomte pulled off a remarkable save! Now Paris SG have a corner."
        },
        {
            "gameTime": "2 - 37:15",
            "label": "corner",
            "description": "The resulting corner, taken by Angel Di Maria (Paris SG), comes to nothing."
        },
        {
            "gameTime": "2 - 36:40",
            "label": "",
            "description": "Edinson Cavani (Paris SG) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. The linesman points to the corner flag, Paris SG are going to take it."
        },
        {
            "gameTime": "2 - 35:49",
            "label": "substitution",
            "description": "Unai Emery Etxegoien is forced to make a change. Thomas Meunier is unable to continue due to injury, Serge Aurier (Paris SG) comes on."
        },
        {
            "gameTime": "2 - 32:10",
            "label": "",
            "description": "Thomas Meunier (Paris SG) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 29:55",
            "label": "y-card",
            "description": "The game is interrupted. Christopher Nkunku (Paris SG) is given a yellow card. He has to be more careful now."
        },
        {
            "gameTime": "2 - 29:34",
            "label": "",
            "description": "A poorly taken free kick by Angel Di Maria (Paris SG)! He sends a shot from the edge of the box into the defensive wall."
        },
        {
            "gameTime": "2 - 28:27",
            "label": "injury",
            "description": "Thomas Meunier (Paris SG) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 26:55",
            "label": "y-card",
            "description": "Steven Moreira (Lorient) violates the laws of the game and is shown a yellow card by the referee, but it could have been a straight red as well."
        },
        {
            "gameTime": "2 - 22:55",
            "label": "soccer-ball",
            "description": "Michael Ciani (Lorient) jumps highest to meet the ball from the corner kick and finishes behind the helpless keeper with a fine header inside the right post. The defence stare motionlessly at each other. What a peach of a goal that is. Michael Ciani (Lorient) has every right to celebrate!"
        },
        {
            "gameTime": "2 - 22:29",
            "label": "corner",
            "description": "Lorient have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 22:20",
            "label": "",
            "description": "Jeremie Aliadiere (Lorient) produces a lovely chip pass into the box, but one of the opposition players cuts it out."
        },
        {
            "gameTime": "2 - 18:52",
            "label": "",
            "description": "Layvin Kurzawa (Paris SG) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "2 - 18:30",
            "label": "corner",
            "description": "Paris SG get a corner."
        },
        {
            "gameTime": "2 - 18:11",
            "label": "",
            "description": "Christopher Nkunku (Paris SG) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 12:45",
            "label": "substitution",
            "description": "Substitution. Benjamin Jeannot walks off the pitch and Jeremie Aliadiere (Lorient) comes on as a substitute."
        },
        {
            "gameTime": "2 - 10:38",
            "label": "",
            "description": "Edinson Cavani (Paris SG) creates himself some space around the penalty spot and connects with the free kick. His header is aimed towards the middle of the net, but Benjamin Lecomte pulls off a comfortable save to thwart him."
        },
        {
            "gameTime": "2 - 06:25",
            "label": "soccer-ball",
            "description": "Edinson Cavani looks around to decide who he is going to pass to. He picks out Christopher Nkunku (Paris SG) who receives the ball perfectly and unleashes a terrific low strike from long range. The ball finds its way towards the middle of the goal and ends behind the surprised goalkeeper. The score is now 0:2."
        },
        {
            "gameTime": "2 - 02:00",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 01:32",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear. Corner kick. Paris SG will have an opportunity."
        },
        {
            "gameTime": "2 - 00:58",
            "label": "",
            "description": "Angel Di Maria (Paris SG) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. The referee points to the corner flag and Paris SG will take a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:21",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Tony Chapron has ended it."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:33",
            "label": "",
            "description": "Romain Philippoteaux (Lorient) probably spotted the goalkeeper off his line, but he misdirected his long range shot as it went a few yards over the bar."
        },
        {
            "gameTime": "1 - 40:07",
            "label": "",
            "description": "Paris SG are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 32:08",
            "label": "",
            "description": "Sylvain Marveaux (Lorient) picks up a pass and unleashes a strong shot from inside the box, but the goalkeeper is equal to it!"
        },
        {
            "gameTime": "1 - 27:59",
            "label": "soccer-ball-own",
            "description": "It's an own goal! A pitiful moment for Benjamin Jeannot (Lorient), who tries to clear a cross into the six yard box from the corner but instead sends the ball behind his own keeper. The score is 0:1."
        },
        {
            "gameTime": "1 - 27:56",
            "label": "corner",
            "description": "Paris SG have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 27:27",
            "label": "",
            "description": "Edinson Cavani (Paris SG) receives a precise pass and is given time inside the box to send a promising strike towards the bottom right corner. Benjamin Lecomte guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 24:53",
            "label": "",
            "description": "Thiago Silva (Paris SG) attempts to convert a lofted cross as he jumps high and heads the ball to the right side of the goal. Benjamin Lecomte shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net."
        },
        {
            "gameTime": "1 - 24:36",
            "label": "corner",
            "description": "A dangerous looking corner kick from Angel Di Maria (Paris SG) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "Angel Di Maria (Paris SG) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. The referee signals a corner kick to Paris SG."
        },
        {
            "gameTime": "1 - 22:52",
            "label": "",
            "description": "Mathieu Peybernes (Lorient) trips an opposition player and Tony Chapron signals a foul. Paris SG earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 15:58",
            "label": "",
            "description": "Edinson Cavani (Paris SG) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "1 - 14:46",
            "label": "corner",
            "description": "The resulting corner from Sylvain Marveaux (Lorient) is cleared by the defence."
        },
        {
            "gameTime": "1 - 14:25",
            "label": "",
            "description": "A lofted cross from Romain Philippoteaux (Lorient) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The referee and his assistant both point at the corner flag. Lorient will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 09:55",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 09:50",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Angel Di Maria (Paris SG). The ball is out of play. A goal scoring opportunity from a corner for Paris SG."
        },
        {
            "gameTime": "1 - 09:15",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 06:47",
            "label": "corner",
            "description": "Sylvain Marveaux (Lorient) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "1 - 06:25",
            "label": "",
            "description": "Alhassan Wakaso (Lorient) had a great opportunity to score. He fired a first time low shot from long range towards the right side of the goal, but the goalkeeper made an astonishing diving save. The ball is out of play and the linesman points at the corner flag. Corner to Lorient."
        },
        {
            "gameTime": "1 - 02:25",
            "label": "",
            "description": "Edinson Cavani (Paris SG) fires in an effort from the free kick from some 17 metres. His strike is very inaccurate and ends in row Z."
        },
        {
            "gameTime": "1 - 01:32",
            "label": "",
            "description": "Michael Ciani (Lorient) was trying to get to the ball but clattered into the legs of the opponent as well. Tony Chapron blows his whistle for an infringement. Paris SG have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paris SG will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Tony Chapron got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The match has just finished."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "12/03/2017 - 23:00",
    "gameHomeTeam": "Lorient",
    "gameScore": "1 - 2"
}