{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-12-30 - 18-00 Real Madrid 3 - 1 Real Sociedad/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side were dominant and dictated the tempo of the game. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 48:04",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "Real Sociedad enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 45:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) stands over the resultant free kick from 30 metres out and his shot goes well over the bar."
        },
        {
            "gameTime": "2 - 45:03",
            "label": "",
            "description": "Markel Bergara (Real Sociedad) trips an opposition player and Jose Luis Gonzalez signals a foul. Real Madrid are awarded the free kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:04",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Marcelo (Real Madrid), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 43:47",
            "label": "",
            "description": "Marcelo (Real Madrid) flights in the cross, but the defender is alert and clears to safety. Real Madrid win a corner."
        },
        {
            "gameTime": "2 - 42:41",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Casemiro (Real Madrid) is coming onto the pitch as Luka Modric cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 40:53",
            "label": "soccer-ball",
            "description": "Goal! Gareth Bale puts a cross into the box and finds Lucas (Real Madrid), who latches on to it and strikes the ball into the bottom right corner. He makes it 3:1."
        },
        {
            "gameTime": "2 - 39:49",
            "label": "",
            "description": "Real Sociedad seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "2 - 38:37",
            "label": "",
            "description": "Lucas (Real Madrid) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender."
        },
        {
            "gameTime": "2 - 37:30",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 36:34",
            "label": "corner",
            "description": "Ruben Pardo (Real Sociedad) takes the corner kick, but Keylor Navas reads it well and stops the effort."
        },
        {
            "gameTime": "2 - 35:58",
            "label": "",
            "description": "Ruben Pardo (Real Sociedad) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. It will be a corner kick for Real Sociedad."
        },
        {
            "gameTime": "2 - 35:24",
            "label": "",
            "description": "Real Sociedad keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "2 - 33:12",
            "label": "",
            "description": "Lucas (Real Madrid) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety. The ball is off of the pitch and it's a goal kick for Real Sociedad."
        },
        {
            "gameTime": "2 - 32:31",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 32:20",
            "label": "",
            "description": "Marcelo (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball. Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 30:55",
            "label": "substitution",
            "description": "The referee signals a substitution. Lucas (Real Madrid) is brought on as a substitute for Karim Benzema."
        },
        {
            "gameTime": "2 - 29:39",
            "label": "",
            "description": "Bruma (Real Sociedad) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 29:04",
            "label": "attendance",
            "description": "The attendance is 69896."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Real Madrid."
        },
        {
            "gameTime": "2 - 25:44",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 24:42",
            "label": "",
            "description": "Karim Benzema (Real Madrid) latches on to a precise pass and one on one with the keeper slams the ball towards the right hand post. Geronimo Rulli is alert, though, and leaps like a salmon to deny him. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "2 - 22:28",
            "label": "substitution",
            "description": "Carlos Vela (Real Sociedad) joins the action as a substitute, replacing Jonathas."
        },
        {
            "gameTime": "2 - 21:59",
            "label": "soccer-ball",
            "description": "The ball hits the back of the net! Marcelo delivers the corner, Cristiano Ronaldo (Real Madrid) finds himself some space on the edge of the box and unleashes an unstoppable shot which goes into the bottom left corner and past the helpless goalkeeper. 2:1."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "corner",
            "description": "Marcelo (Real Madrid) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 21:34",
            "label": "",
            "description": "The ball is cleared after Karim Benzema (Real Madrid) attempted to dribble past an opposing player. Real Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 19:01",
            "label": "",
            "description": "Neat link up play between Bruma (Real Sociedad) and Asier Illarramendi, but Keylor Navas reads the game well and the move breaks down."
        },
        {
            "gameTime": "2 - 18:05",
            "label": "funfact",
            "description": "13:2 the latest stats for both teams in respect of shots on target."
        },
        {
            "gameTime": "2 - 17:19",
            "label": "",
            "description": "The Real Sociedad players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 16:17",
            "label": "y-card",
            "description": "Jose Luis Gonzalez shows the yellow card to Asier Illarramendi (Real Sociedad) for a heavy challenge."
        },
        {
            "gameTime": "2 - 15:29",
            "label": "",
            "description": "Karim Benzema (Real Madrid) receives a lofted pass and is given time inside the box to unleash a low shot goalwards. The ball is directed towards the middle of the goal, but it lacks power and Geronimo Rulli pulls off a comfortable save to thwart the effort."
        },
        {
            "gameTime": "2 - 13:59",
            "label": "substitution",
            "description": "Rafael Benitez decides to make a substitution. James Rodriguez will be replaced by Mateo Kovacic (Real Madrid)."
        },
        {
            "gameTime": "2 - 13:49",
            "label": "",
            "description": "A player from Real Madrid commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "2 - 12:59",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 12:58",
            "label": "",
            "description": "Gareth Bale (Real Madrid) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the bottom left corner, but Geronimo Rulli was alert and the score remains the same. The ball is out of play. Real Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 11:56",
            "label": "",
            "description": "Jonathas (Real Sociedad) and Bruma try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "2 - 10:53",
            "label": "y-card",
            "description": "Jose Luis Gonzalez shows a yellow card to Nacho (Real Madrid) for his blatant foul."
        },
        {
            "gameTime": "2 - 08:57",
            "label": "",
            "description": "Keylor Navas displays his ability to read the game and clears the danger after Bruma (Real Sociedad) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "2 - 07:55",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 07:40",
            "label": "",
            "description": "A promising cross into the box is nearly received by the lurking Cristiano Ronaldo (Real Madrid), but one of the defending players cuts it out to avert the threat. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 05:16",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) gets on the end of a cross from Marcelo, but his shot goes a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "soccer-ball",
            "description": "Bruma (Real Sociedad) receives a precise pass inside the box from Jonathas and he beats the goalkeeper with a brilliant shot into the top right corner. 1:1."
        },
        {
            "gameTime": "2 - 02:25",
            "label": "",
            "description": "Close! Ruben Pardo (Real Sociedad) takes the resultant free kick from 25 metres out and his shot goes just over the crossbar."
        },
        {
            "gameTime": "2 - 01:29",
            "label": "",
            "description": "Jose Luis Gonzalez blows his whistle for a foul after Luka Modric (Real Madrid) hacks down one of his opponents. Real Sociedad have a free kick."
        },
        {
            "gameTime": "2 - 00:56",
            "label": "",
            "description": "Xabi Prieto (Real Sociedad) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. The home team were mostly in control in the first half. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 47:07",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Luka Modric (Real Madrid). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "",
            "description": "Gareth Bale (Real Madrid) fails to find any of his teammates inside the box as his pass is blocked. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Ruben Pardo (Real Sociedad) is coming onto the pitch as Sergio Canales cannot continue after picking up an injury."
        },
        {
            "gameTime": "1 - 44:48",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) dances his way past two defending players and gets to the edge of the box from where he unleashes a shot that goes well wide of the right post."
        },
        {
            "gameTime": "1 - 41:52",
            "label": "soccer-ball",
            "description": "Goal! Cristiano Ronaldo (Real Madrid) slams home the penalty with a precise shot which goes inside the right post."
        },
        {
            "gameTime": "1 - 41:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 40:56",
            "label": "injury",
            "description": "Sergio Canales (Real Sociedad) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 39:59",
            "label": "y-card",
            "description": "Carlos Martinez (Real Sociedad) picked up a yellow card for talking out of turn to the referee. He has to be careful for the remainder of the match."
        },
        {
            "gameTime": "1 - 39:58",
            "label": "penalty",
            "description": "The players claim that Yuri Berchiche (Real Sociedad) handled the ball and it seems they are right. The referee uncompromisingly points to the spot and it's a penalty to Real Madrid."
        },
        {
            "gameTime": "1 - 37:25",
            "label": "",
            "description": "Geronimo Rulli blocks Karim Benzema (Real Madrid)'s effort from the edge of the box."
        },
        {
            "gameTime": "1 - 37:07",
            "label": "",
            "description": "A cross from Cristiano Ronaldo (Real Madrid) fails to reach the box as the defence clears the ball away to safety. It's a throw in for Real Madrid."
        },
        {
            "gameTime": "1 - 36:06",
            "label": "",
            "description": "Luka Modric (Real Madrid) takes the ball on and fires in a shot from 20 metres out. Geronimo Rulli stops the effort which is headed to the middle of the target."
        },
        {
            "gameTime": "1 - 35:45",
            "label": "",
            "description": "Bruma (Real Sociedad) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "1 - 34:50",
            "label": "",
            "description": "Jonathas (Real Sociedad) rises above the defence inside the box, but his header flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 33:08",
            "label": "",
            "description": "A long pass, executed by Yuri Berchiche (Real Sociedad), missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 31:58",
            "label": "y-card",
            "description": "Jose Luis Gonzalez shows a yellow card to Yuri Berchiche (Real Sociedad) for a tough tackle."
        },
        {
            "gameTime": "1 - 30:55",
            "label": "",
            "description": "Pepe (Real Madrid) gets his head on the corner, but he sees his header blocked."
        },
        {
            "gameTime": "1 - 30:47",
            "label": "corner",
            "description": "There's an opportunity for James Rodriguez (Real Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 30:10",
            "label": "",
            "description": "Marcelo (Real Madrid) plays a one two with Karim Benzema, but the move breaks down. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "1 - 28:52",
            "label": "",
            "description": "Jonathas (Real Sociedad) misses a good chance to score. A perfect cross into the box finds Jonathas (Real Sociedad) who rises for a header, but he sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 27:13",
            "label": "",
            "description": "Karim Benzema (Real Madrid) fails to pick a body out in the box with an over hit chip pass. The ball goes out of play and Real Sociedad will have a goal kick."
        },
        {
            "gameTime": "1 - 25:10",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 24:57",
            "label": "",
            "description": "Danilo (Real Madrid) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 23:52",
            "label": "penalty-missed",
            "description": "Cristiano Ronaldo (Real Madrid) fails to score from the penalty kick. His shot goes just a few inches over the crossbar."
        },
        {
            "gameTime": "1 - 23:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 23:24",
            "label": "y-card",
            "description": "Jonathas (Real Sociedad) gets a yellow card for protesting."
        },
        {
            "gameTime": "1 - 22:44",
            "label": "penalty",
            "description": "The referee blows his whistle as Yuri Berchiche (Real Sociedad) was too aggressive in his challenge. PENALTY to Real Madrid!"
        },
        {
            "gameTime": "1 - 21:56",
            "label": "",
            "description": "Karim Benzema (Real Madrid) sends a teasing cross into the area, but Geronimo Rulli intercepts the ball."
        },
        {
            "gameTime": "1 - 21:35",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "1 - 20:56",
            "label": "",
            "description": "Great solo effort by Jonathas (Real Sociedad) as he tricks his way through the defence before firing a low drive from just outside of the box towards the middle of the goal. Keylor Navas is alert and denies him."
        },
        {
            "gameTime": "1 - 19:54",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Real Madrid was in an offside position."
        },
        {
            "gameTime": "1 - 18:55",
            "label": "corner",
            "description": "The corner from Luka Modric (Real Madrid) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 18:40",
            "label": "",
            "description": "Toni Kroos (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared. Good work from Real Madrid as they win a corner."
        },
        {
            "gameTime": "1 - 18:14",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 17:57",
            "label": "",
            "description": "Danilo (Real Madrid) wastes a good opportunity as his pass into the box is blocked by the defence. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "1 - 17:31",
            "label": "substitution",
            "description": "Imanol Agirretxe is substituted due to injury. Eusebio Sacristan gives a chance to Bruma (Real Sociedad)."
        },
        {
            "gameTime": "1 - 17:05",
            "label": "",
            "description": "Marcelo (Real Madrid) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "1 - 15:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries his luck with a shot from 24 metres out, but his effort goes well wide of the left post."
        },
        {
            "gameTime": "1 - 14:20",
            "label": "injury",
            "description": "Looks like Imanol Agirretxe (Real Sociedad) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 13:10",
            "label": "",
            "description": "Imanol Agirretxe (Real Sociedad) picks up a lofted cross inside the box and unleashes a low shot to the middle of the goal. His promising effort is kept out by Keylor Navas, who pulls off a decent save!"
        },
        {
            "gameTime": "1 - 12:42",
            "label": "",
            "description": "Karim Benzema (Real Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 12:29",
            "label": "",
            "description": "The Real Madrid players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 11:07",
            "label": "",
            "description": "Inigo Martinez (Real Sociedad) is quickest inside the box and jumps to connect with the resulting set piece. He produces a fine header, but it flies just wide of the right post."
        },
        {
            "gameTime": "1 - 10:55",
            "label": "corner",
            "description": "Sergio Canales (Real Sociedad) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 10:33",
            "label": "",
            "description": "Yuri Berchiche (Real Sociedad) tries his luck with a shot from long range, but his effort is well blocked by one of the defending players. Now Real Sociedad have a corner."
        },
        {
            "gameTime": "1 - 09:41",
            "label": "",
            "description": "Jonathas (Real Sociedad) sends a pass into the penalty area, but the opponent manages to cut it out. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "1 - 07:50",
            "label": "",
            "description": "Karim Benzema (Real Madrid) quickly picks up the rebound and drills the ball towards the middle of the goal. The opponent's goalkeeper pulls off a comfortable save to deny him."
        },
        {
            "gameTime": "1 - 07:44",
            "label": "",
            "description": "Marcelo (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 07:25",
            "label": "",
            "description": "Geronimo Rulli pulls off a great save to deny Cristiano Ronaldo (Real Madrid) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "1 - 07:07",
            "label": "",
            "description": "Jonathas (Real Sociedad) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "Gareth Bale (Real Madrid) was the quickest one to orientate himself inside the box and leaps to connect with a cross from the corner kick. He produces a fine header, but it flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 04:40",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) will take a corner kick."
        },
        {
            "gameTime": "1 - 04:31",
            "label": "",
            "description": "Pepe (Real Madrid) rises highest from the corner to head at goal, but his effort towards the underside of the crossbar is brilliantly kept out by the goalkeeper. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "1 - 04:30",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 04:10",
            "label": "",
            "description": "Gareth Bale (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee points to the corner flag and Real Madrid will take a corner."
        },
        {
            "gameTime": "1 - 03:27",
            "label": "",
            "description": "Pepe (Real Madrid) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "1 - 02:59",
            "label": "",
            "description": "Imanol Agirretxe (Real Sociedad) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 01:37",
            "label": "",
            "description": "Sergio Canales (Real Sociedad) strikes from the edge of the box, but hits it really poorly and sends the ball way over the bar."
        },
        {
            "gameTime": "1 - 01:13",
            "label": "",
            "description": "Imanol Agirretxe (Real Sociedad) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Jose Luis Gonzalez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side were dominant and dictated the tempo of the game. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "Real Sociedad",
    "gameDate": "30/12/2015 - 18:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "3 - 1"
}