{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2014-2015/2015-04-29 - 21-00 Real Madrid 3 - 0 Almeria/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side were better today. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        },
        {
            "gameTime": "2 - 47:14",
            "label": "whistle",
            "description": "That's it for today, Ignacio Iglesias Villanueva has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:44",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) misses a good chance to score. A perfect cross into the box finds Cristiano Ronaldo (Real Madrid) who rises for a header, but he sends the ball well over the bar. The ball goes out of play and Almeria will have a goal kick."
        },
        {
            "gameTime": "2 - 44:22",
            "label": "corner",
            "description": "A quickly taken corner by Real Madrid."
        },
        {
            "gameTime": "2 - 43:59",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. Real Madrid will take a corner kick."
        },
        {
            "gameTime": "2 - 42:41",
            "label": "corner",
            "description": "The ball is out of play and Almeria manage to earn a corner. Javier Espinosa Gonzalez (Almeria) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 41:23",
            "label": "",
            "description": "Chicharito (Real Madrid) makes some space to meet a perfect cross inside the box, but he blazes his shot over the bar. High, wide and not at all pretty. The ball is off of the pitch and it's a goal kick for Almeria."
        },
        {
            "gameTime": "2 - 40:27",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Nacho (Real Madrid) replaces Raphael Varane."
        },
        {
            "gameTime": "2 - 38:56",
            "label": "soccer-ball",
            "description": "It's a goal! Chicharito plays a lovely pass into the box and finds Alvaro Arbeloa (Real Madrid). He tries his luck from close range and coolly strikes the ball into the back of the net. 3:0."
        },
        {
            "gameTime": "2 - 38:30",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 38:17",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Jese (Real Madrid). The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 37:51",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 36:37",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) made himself some space to unleash an effort goalwards from about 20 metres out, but the ball went well over the crossbar. The ball goes out of play and Almeria will have a goal kick."
        },
        {
            "gameTime": "2 - 36:30",
            "label": "attendance",
            "description": "The attendance for today's match is 63813."
        },
        {
            "gameTime": "2 - 35:54",
            "label": "",
            "description": "A beautiful low pass from the side is received by Javier Espinosa (Almeria), who was waiting for his chance. However, the defence is alert and spanks the ball away."
        },
        {
            "gameTime": "2 - 34:51",
            "label": "",
            "description": "Fabio Coentrao (Real Madrid) sends a cross into the box, but the opposition's defence clears the ball to safety. The linesman signals a throw in for Real Madrid."
        },
        {
            "gameTime": "2 - 33:58",
            "label": "",
            "description": "Sebastian Dubarbier (Almeria) is unable to feed an accurate cross into the box. The ball is out of play. Real Madrid will take a throw in."
        },
        {
            "gameTime": "2 - 32:48",
            "label": "funfact",
            "description": "The current number of shots on goal is 4:0."
        },
        {
            "gameTime": "2 - 31:48",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) finds himself in a promising position after receiving an excellent pass into the box, but one of the defenders produces a timely intervention to avert the threat. The ball is off of the pitch and it's a goal kick for Almeria."
        },
        {
            "gameTime": "2 - 31:24",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "2 - 30:16",
            "label": "y-card",
            "description": "Fabio Coentrao (Real Madrid) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "2 - 29:35",
            "label": "",
            "description": "Jonathan Zongo (Almeria) tries his luck from long range, but it doesn't give the goalkeeper anything to worry about as it goes high over the bar. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "2 - 28:56",
            "label": "",
            "description": "Golden chance! Chicharito (Real Madrid) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the right post. The ball goes out of play and Almeria will have a goal kick."
        },
        {
            "gameTime": "2 - 27:12",
            "label": "",
            "description": "Almeria are enjoying a spell of pressure at the moment, but one of the defenders gets it clear. It's a throw in for Almeria."
        },
        {
            "gameTime": "2 - 26:18",
            "label": "",
            "description": "Isco (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 25:20",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives the ball in the penalty box and immediately fires a first time effort that sails well wide of the right post. The ball goes out of play and Almeria will have a goal kick."
        },
        {
            "gameTime": "2 - 24:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "corner",
            "description": "Ruben comes off his line to intercept the corner from Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "2 - 23:38",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Jese (Real Madrid). Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "2 - 22:43",
            "label": "",
            "description": "Raphael Varane (Real Madrid) was the quickest one to orientate himself inside the box and leaps to connect with a cross from the corner kick. He produces a fine header, but it flies narrowly wide of the left post. The ball goes out of play and Almeria will have a goal kick."
        },
        {
            "gameTime": "2 - 22:40",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 22:16",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. Real Madrid win a corner."
        },
        {
            "gameTime": "2 - 21:48",
            "label": "corner",
            "description": "The corner by Toni Kroos (Real Madrid) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "2 - 21:42",
            "label": "substitution",
            "description": "Here is a change. Verza is going off and Sergi gives the last tactical orders to Ramon Azeez (Almeria)."
        },
        {
            "gameTime": "2 - 20:48",
            "label": "",
            "description": "Isco (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "substitution",
            "description": "The substitution is prepared. Lucas Silva (Real Madrid) joins the action as a substitute, replacing Asier Illarramendi."
        },
        {
            "gameTime": "2 - 19:42",
            "label": "substitution",
            "description": "Today's match ends for James Rodriguez who will be replaced by Isco (Real Madrid)."
        },
        {
            "gameTime": "2 - 18:34",
            "label": "",
            "description": "Real Madrid players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "substitution",
            "description": "Sergi has decided to introduce fresh legs, with Javier Espinosa Gonzalez (Almeria) replacing Thomas."
        },
        {
            "gameTime": "2 - 15:41",
            "label": "",
            "description": "Mane (Almeria) sends a cross into the box, but Keylor Navas comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 14:18",
            "label": "",
            "description": "James Rodriguez (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball. The ball is behind the touchline and Real Madrid will take a throw in."
        },
        {
            "gameTime": "2 - 13:27",
            "label": "",
            "description": "A cross from a mid range free kick, taken by Almeria, is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Edgar Mendez walks off the pitch to be replaced by Jonathan Zongo (Almeria)."
        },
        {
            "gameTime": "2 - 12:32",
            "label": "",
            "description": "Asier Illarramendi (Real Madrid) makes a slide tackle, but referee Ignacio Iglesias Villanueva blows for a foul. Almeria are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 10:56",
            "label": "corner",
            "description": "Mane (Almeria) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 10:33",
            "label": "",
            "description": "Mane (Almeria) whips the ball in from the long range free kick, but the first man gets it clear. It will be a corner kick for Almeria."
        },
        {
            "gameTime": "2 - 10:20",
            "label": "",
            "description": "Ignacio Iglesias Villanueva blows the whistle. James Rodriguez (Real Madrid) brings one of his opponents down with a harsh tackle. A free kick to Almeria."
        },
        {
            "gameTime": "2 - 09:14",
            "label": "corner",
            "description": "Verza (Almeria) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "",
            "description": "The ball is cleared after Ximo Navarro (Almeria) attempted to dribble past an opposing player. The referee points to the corner flag. It's a corner to Almeria."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 07:43",
            "label": "",
            "description": "Jese (Real Madrid) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee blows his whistle, Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:50",
            "label": "",
            "description": "Edgar Mendez (Almeria) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "2 - 03:53",
            "label": "soccer-ball-own",
            "description": "This is definitely not what Mauro Dos Santos (Almeria) wanted. Attempting to intercept an offensive pass, he scored an own goal and made it 2:0."
        },
        {
            "gameTime": "2 - 03:13",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is intercepted by Ruben."
        },
        {
            "gameTime": "2 - 03:00",
            "label": "",
            "description": "Jese (Real Madrid) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 02:45",
            "label": "",
            "description": "Thomas (Almeria) sends a teasing cross into the area, but Keylor Navas intercepts the ball."
        },
        {
            "gameTime": "2 - 00:51",
            "label": "",
            "description": "A cross is clipped into the penalty area by Toni Kroos (Real Madrid) but poses no threat."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. The home team were mostly in control in the first half. The home team tries to prevail using combination football, while the away teams uses mostly counter attacks."
        },
        {
            "gameTime": "1 - 45:18",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Ignacio Iglesias Villanueva has ended it."
        },
        {
            "gameTime": "1 - 43:59",
            "label": "soccer-ball",
            "description": "The ball rebounds and arrives at the feet of James Rodriguez (Real Madrid) just outside the box. He doesn't think twice and fires a strong shot into the top of the net. His attempt was beyond the reach of Ruben, so the score changes to 0:0."
        },
        {
            "gameTime": "1 - 43:55",
            "label": "",
            "description": "Toni Kroos (Real Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 42:41",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) jumps inside the box to meet the resulting set piece and aims a header towards the middle of the goal, but the goalkeeper shows his reflexes and makes a superb save."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 42:03",
            "label": "",
            "description": "Jese (Real Madrid) delivers a promising cross into the box, but it's cleared. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 41:42",
            "label": "",
            "description": "Fabio Coentrao (Real Madrid) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 40:59",
            "label": "",
            "description": "Ignacio Iglesias Villanueva has a clear sight and sees a foul from Cristiano Ronaldo (Real Madrid)."
        },
        {
            "gameTime": "1 - 40:23",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 38:39",
            "label": "",
            "description": "Almeria are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error."
        },
        {
            "gameTime": "1 - 36:59",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 36:47",
            "label": "",
            "description": "Jese (Real Madrid) looks to break free, but an opposing player clears the ball away. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 36:08",
            "label": "",
            "description": "Ximo Navarro (Almeria) makes a rough challenge and Ignacio Iglesias Villanueva blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 34:18",
            "label": "",
            "description": "Sebastian Dubarbier (Almeria) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 33:21",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to endanger the goal with the free kick from about 26 metres. The keeper can stay calm because he misses completely. The ball went well over the bar. The ball goes out of play and Almeria will have a goal kick."
        },
        {
            "gameTime": "1 - 32:08",
            "label": "",
            "description": "Ximo Navarro (Almeria) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. A free kick has been awarded to Real Madrid."
        },
        {
            "gameTime": "1 - 30:59",
            "label": "",
            "description": "A pass from Chicharito (Real Madrid) is intercepted by Ruben and the move breaks down."
        },
        {
            "gameTime": "1 - 28:53",
            "label": "",
            "description": "Corona (Almeria) did his best to latch on to a crossfield pass, but it was too long and it goes out of play. The referee and the linesman both signal a throw in for Real Madrid."
        },
        {
            "gameTime": "1 - 28:16",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) races towards goal but the defender gets back well to make a challenge. The linesman signals a throw in for Real Madrid."
        },
        {
            "gameTime": "1 - 27:27",
            "label": "",
            "description": "Close! Cristiano Ronaldo (Real Madrid) stands over the resulting free kick from around 27 metres out and his shot goes just over the crossbar. The ball goes out of play and Almeria will have a goal kick."
        },
        {
            "gameTime": "1 - 26:34",
            "label": "",
            "description": "Edgar Mendez (Almeria) is penalised after knocking an opponent down. Real Madrid will take a free kick."
        },
        {
            "gameTime": "1 - 25:36",
            "label": "",
            "description": "Asier Illarramendi (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play and Almeria will have a goal kick."
        },
        {
            "gameTime": "1 - 24:11",
            "label": "",
            "description": "A pass by Jese (Real Madrid) ends up in no man's land, and the attacking effort comes to an end. The ball is out of play. Almeria will have a throw in."
        },
        {
            "gameTime": "1 - 22:52",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 21:49",
            "label": "",
            "description": "Sebastian Dubarbier (Almeria) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 20:52",
            "label": "",
            "description": "The free kick is delivered by Mane (Almeria) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "1 - 20:12",
            "label": "",
            "description": "Referee Ignacio Iglesias Villanueva sees the trip by Fabio Coentrao (Real Madrid) and doesn't hesitate to blow his whistle. There is a free kick near the sideline to Almeria."
        },
        {
            "gameTime": "1 - 18:49",
            "label": "",
            "description": "James Rodriguez (Real Madrid) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 17:58",
            "label": "",
            "description": "Edgar Mendez (Almeria) makes an unfair challenge by holding his opponent to prevent him from getting the ball. A free kick has been awarded to Real Madrid."
        },
        {
            "gameTime": "1 - 17:38",
            "label": "",
            "description": "Fabio Coentrao (Real Madrid) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 14:56",
            "label": "",
            "description": "Lovely skill from Mane (Almeria) as he gets away from defenders and unleashes a shot from 27 metres out, but his effort goes just wide of the left post. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "1 - 14:21",
            "label": "corner",
            "description": "The resulting corner from Verza (Almeria) is cleared."
        },
        {
            "gameTime": "1 - 13:46",
            "label": "",
            "description": "Corona (Almeria) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away. Almeria have a corner."
        },
        {
            "gameTime": "1 - 13:17",
            "label": "",
            "description": "Pepe (Real Madrid) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 12:49",
            "label": "",
            "description": "James Rodriguez (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 11:40",
            "label": "",
            "description": "Mane (Almeria) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 11:05",
            "label": "",
            "description": "Mane (Almeria) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 10:43",
            "label": "",
            "description": "Good defending. Cristiano Ronaldo (Real Madrid) tries to find Chicharito inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 09:26",
            "label": "",
            "description": "Fabio Coentrao (Real Madrid) fails to send a pass into the box as his effort is cut out. The ball has crossed the sideline. Real Madrid are taking a throw in."
        },
        {
            "gameTime": "1 - 08:37",
            "label": "",
            "description": "The Real Madrid players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 07:38",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) did his best to latch on to a crossfield pass, but it was too long and it goes out of play. The ball is off of the pitch and it's a goal kick for Almeria."
        },
        {
            "gameTime": "1 - 06:41",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) finds enough space to climb high and plants a header way over the bar. What a poor effort. The ball goes out of play and Almeria will have a goal kick."
        },
        {
            "gameTime": "1 - 06:35",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner."
        },
        {
            "gameTime": "1 - 06:13",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) picks up the ball, dribbles to the edge of the penalty area and unleashes a brilliant low shot to the middle of the goal, but is thwarted by a decent save from Ruben. Good work from Real Madrid as they win a corner."
        },
        {
            "gameTime": "1 - 05:38",
            "label": "",
            "description": "The foul by Alvaro Arbeloa (Real Madrid) was seen by Ignacio Iglesias Villanueva who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 05:15",
            "label": "",
            "description": "Almeria play a few nice passes from player to player, but their possession doesn't last long as an opposition player intercepts a pass."
        },
        {
            "gameTime": "1 - 03:48",
            "label": "",
            "description": "Alvaro Arbeloa swings the cross over. James Rodriguez (Real Madrid) gets his head to it but it goes just wide of the left post. The ball is off of the pitch and it's a goal kick for Almeria."
        },
        {
            "gameTime": "1 - 02:41",
            "label": "",
            "description": "Asier Illarramendi (Real Madrid) swings a cross into the box, but it's far too close to Ruben, who smothers the ball."
        },
        {
            "gameTime": "1 - 01:55",
            "label": "",
            "description": "The game is interrupted, a clear handball by Edgar Mendez (Almeria)."
        },
        {
            "gameTime": "1 - 01:19",
            "label": "",
            "description": "The Almeria players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ignacio Iglesias Villanueva was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side were better today. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        }
    ],
    "gameAwayTeam": "Almeria",
    "gameDate": "29/04/2015 - 21:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "3 - 0"
}