{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-01-03 - 16-30 Crystal Palace 0 - 3 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was an entertaining 90 minutes of football. Both sides had good opportunities. The Chelsea fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        },
        {
            "gameTime": "2 - 48:20",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:12",
            "label": "",
            "description": "Half chance! Willian (Chelsea) plays a pass into the box, but Wayne Hennessey reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 42:34",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Oscar as he is replaced by Nemanja Matic (Chelsea)."
        },
        {
            "gameTime": "2 - 41:50",
            "label": "",
            "description": "Diego Costa (Chelsea) makes room to connect with a cross, but his strike from the penalty spot isn't accurate at all and the ball goes well over the bar."
        },
        {
            "gameTime": "2 - 41:31",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 41:14",
            "label": "",
            "description": "Willian (Chelsea) sends a sweet pass into the penalty area, but one of the defenders averts the danger. It will be a corner kick for Chelsea."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "",
            "description": "This shall not pass! Oscar (Chelsea) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "2 - 37:58",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Willian (Chelsea) takes it short."
        },
        {
            "gameTime": "2 - 37:04",
            "label": "",
            "description": "Diego Costa (Chelsea) finds himself in a promising position after receiving an excellent pass into the box, but one of the defenders produces a timely intervention to avert the threat. Chelsea force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 34:56",
            "label": "substitution",
            "description": "Substitution. Chung Yong Lee (Crystal Palace) makes way for ."
        },
        {
            "gameTime": "2 - 34:44",
            "label": "y-card",
            "description": "Scott Dann (Crystal Palace) commits a nasty foul by bringing down his opponent."
        },
        {
            "gameTime": "2 - 33:42",
            "label": "corner",
            "description": "Jason Puncheon (Crystal Palace) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 33:09",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) races towards goal but the defender gets back well to make a challenge. The referee points to the corner flag. It's a corner to Crystal Palace."
        },
        {
            "gameTime": "2 - 30:32",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation."
        },
        {
            "gameTime": "2 - 28:53",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "2 - 27:50",
            "label": "",
            "description": "Willian (Chelsea) is having a lively performance. He is causing problems and wanting the ball at every opportunity."
        },
        {
            "gameTime": "2 - 26:48",
            "label": "",
            "description": "Chelsea are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "2 - 23:13",
            "label": "",
            "description": "Pape Souare (Crystal Palace) swings a cross into the box, but it's far too close to Thibaut Courtois, who smothers the ball."
        },
        {
            "gameTime": "2 - 21:48",
            "label": "substitution",
            "description": "Substitution. Mile Jedinak will be replaced by Joe Ledley (Crystal Palace)."
        },
        {
            "gameTime": "2 - 21:46",
            "label": "substitution",
            "description": "Here is a change. Fraizer Campbell is going off and Alan Pardew gives the last tactical orders to Marouane Chamakh (Crystal Palace)."
        },
        {
            "gameTime": "2 - 20:35",
            "label": "soccer-ball",
            "description": "Goal! Diego Costa (Chelsea) fires the rebound into the bottom left corner after the ball breaks to him in the box. The score is 0:3."
        },
        {
            "gameTime": "2 - 19:08",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 17:20",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 14:44",
            "label": "soccer-ball",
            "description": "Oscar passes to Willian (Chelsea), who collects the ball and unleashes a terrific shot from the edge of the box. His effort goes into the top right corner. Fabulous goal! The score is 0:2."
        },
        {
            "gameTime": "2 - 14:35",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Thibaut Courtois."
        },
        {
            "gameTime": "2 - 13:09",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 11:40",
            "label": "y-card",
            "description": "Mile Jedinak (Crystal Palace) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 11:10",
            "label": "",
            "description": "The ball is cleared after Wilfried Zaha (Crystal Palace) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 09:25",
            "label": "",
            "description": "Oscar (Chelsea) brings his opponent down with a tackle and Kevin Friend blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "",
            "description": "Kurt Zouma (Chelsea) wasted a great chance as he climbed high to connect with a cross from the free kick inside the penalty area. He produced a header which went a whisker over the bar."
        },
        {
            "gameTime": "2 - 07:42",
            "label": "",
            "description": "Willian (Chelsea) will take the free kick."
        },
        {
            "gameTime": "2 - 06:51",
            "label": "",
            "description": "Mile Jedinak (Crystal Palace) pulls the jersey of one of the opposition players and Kevin Friend blows his whistle for a foul. Chelsea have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "corner",
            "description": "The corner from Willian (Chelsea) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 06:07",
            "label": "corner",
            "description": "Willian (Chelsea) swings in the corner kick, but one of the defenders leaps highest to head the ball away. The referee blows his whistle, Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:41",
            "label": "",
            "description": "Willian (Chelsea) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention. Chelsea have a corner."
        },
        {
            "gameTime": "2 - 03:59",
            "label": "",
            "description": "Pape Souare (Crystal Palace) plays in a hopeful cross, but it doesn't find its way to any of the attacking players. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "2 - 03:17",
            "label": "",
            "description": "Chelsea control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 02:07",
            "label": "",
            "description": "Kurt Zouma (Chelsea) escapes the opposition's pressure by passing the ball on the ground."
        },
        {
            "gameTime": "2 - 00:37",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) sends a cross into the box, but Thibaut Courtois comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. Both sides have struggled for dominance over the game. The home players attempt to beat the opposition's defence using mostly counter attacks. The away players try to win the ball back as quickly as possible every time they lose possession."
        },
        {
            "gameTime": "1 - 47:15",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 46:55",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) sends a teasing cross into the area, but Thibaut Courtois intercepts the ball."
        },
        {
            "gameTime": "1 - 46:14",
            "label": "",
            "description": "Kevin Friend has a clear sight and sees a foul from Pedro (Chelsea)."
        },
        {
            "gameTime": "1 - 45:46",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) takes the free kick which is inaccurate and the defence has no problem with the clearance."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 43:43",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "1 - 42:13",
            "label": "",
            "description": "Diego Costa (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 40:45",
            "label": "",
            "description": "Willian (Chelsea) passes the ball onto Cesar Azpilicueta, but one of the defenders dispossesses him. The ball is out of play. Crystal Palace will have a throw in."
        },
        {
            "gameTime": "1 - 36:13",
            "label": "corner",
            "description": "Willian (Chelsea) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 35:47",
            "label": "",
            "description": "Wayne Hennessey pulls off a great save to deny Cesar Azpilicueta (Chelsea), who makes himself some space inside the box and unleashes a quick shot to the left side of the goal. The linesman points to the corner flag, Chelsea are going to take it."
        },
        {
            "gameTime": "1 - 34:47",
            "label": "corner",
            "description": "Willian (Chelsea) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 34:22",
            "label": "",
            "description": "Good clearance! Diego Costa (Chelsea) receives a brilliant short pass and finds himself in a good position inside the box, but he's robbed of the ball by one of the defending players. Chelsea force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 33:18",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) sprays a pass out to Wilfried Zaha, but he can't beat his man inside the box."
        },
        {
            "gameTime": "1 - 32:03",
            "label": "",
            "description": "The cross into the penalty area from Willian (Chelsea) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "1 - 28:29",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Diego Costa sprays a pass out to Oscar (Chelsea), and he has an easy job to slot the ball into an empty net. The score is 0:1."
        },
        {
            "gameTime": "1 - 26:13",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) makes a slide tackle, but referee Kevin Friend blows for a foul."
        },
        {
            "gameTime": "1 - 25:45",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) receives the ball in the penalty box and immediately fires a first time effort that sails well wide of the right post."
        },
        {
            "gameTime": "1 - 24:52",
            "label": "corner",
            "description": "Jason Puncheon (Crystal Palace) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 24:18",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) slaloms his way past challenges, but an opposing player does well to get the ball away. The referee and his assistant both point at the corner flag. Crystal Palace will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 23:45",
            "label": "",
            "description": "Thibaut Courtois saves his team from danger as he rises high to pluck the ball out of the air from a free kick by Jason Puncheon (Crystal Palace)."
        },
        {
            "gameTime": "1 - 20:23",
            "label": "",
            "description": "Kevin Friend blows his whistle after John Obi Mikel (Chelsea) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 19:35",
            "label": "",
            "description": "Joel Ward (Crystal Palace) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 18:27",
            "label": "injury",
            "description": "Joel Ward (Crystal Palace) picks up an injury."
        },
        {
            "gameTime": "1 - 18:05",
            "label": "",
            "description": "Pedro (Chelsea) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "1 - 16:41",
            "label": "",
            "description": "Damien Delaney (Crystal Palace) peeled away from his marker and got on the end of the corner, but his fine header directed towards the goal is brilliantly saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 16:28",
            "label": "corner",
            "description": "Jason Puncheon (Crystal Palace) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 15:58",
            "label": "",
            "description": "A cross, provided by Chung Yong Lee (Crystal Palace), caused no threat to the opposition's defence as the ball was cleared out of danger. The ball is out of play. Crystal Palace win a corner kick."
        },
        {
            "gameTime": "1 - 15:36",
            "label": "substitution",
            "description": "Guus Hiddink is forced to make an unplanned substitution as Eden Hazard suffers an injury and Pedro (Chelsea) comes on."
        },
        {
            "gameTime": "1 - 14:06",
            "label": "",
            "description": "Kevin Friend blows his whistle for a foul after John Obi Mikel (Chelsea) hacks down one of his opponents. Crystal Palace earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 12:29",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Damien Delaney (Crystal Palace) was quite harsh and Kevin Friend didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 09:13",
            "label": "corner",
            "description": "Willian (Chelsea) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 08:41",
            "label": "",
            "description": "Eden Hazard (Chelsea) shoots from outside the box, but his effort is blocked. The ball is out of play. A goal scoring opportunity from a corner for Chelsea."
        },
        {
            "gameTime": "1 - 07:20",
            "label": "",
            "description": "That was close by Wilfried Zaha (Crystal Palace)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "1 - 06:06",
            "label": "corner",
            "description": "Chung Yong Lee (Crystal Palace) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 05:34",
            "label": "",
            "description": "Joel Ward (Crystal Palace) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The referee and one of his assistants signal for a corner kick to Crystal Palace."
        },
        {
            "gameTime": "1 - 05:01",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 03:32",
            "label": "injury",
            "description": "Cesar Azpilicueta (Chelsea) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 03:15",
            "label": "",
            "description": "Fraizer Campbell (Crystal Palace) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "1 - 02:42",
            "label": "",
            "description": "Good defending. Diego Costa (Chelsea) tries to find Cesc Fabregas inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 01:10",
            "label": "corner",
            "description": "The corner by Jason Puncheon (Crystal Palace) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 00:27",
            "label": "",
            "description": "Chung Yong Lee (Crystal Palace) looks to break free, but an opposing player clears the ball away. The ball goes behind for a corner. Crystal Palace will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Chelsea will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Kevin Friend will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an entertaining 90 minutes of football. Both sides had good opportunities. The Chelsea fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "03/01/2016 - 16:30",
    "gameHomeTeam": "Crystal Palace",
    "gameScore": "0 - 3"
}