{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-08-21 - 21-45 Pescara 2 - 2 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. We witnessed the away side dominate today's game. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        },
        {
            "gameTime": "2 - 49:58",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 46:48",
            "label": "y-card",
            "description": "Dries Mertens (Napoli) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Piero Giacomelli didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 5 min. of added time."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "",
            "description": "Raul Albiol (Napoli) robs an opponent of the ball and explodes in anger when Piero Giacomelli blows for a foul."
        },
        {
            "gameTime": "2 - 40:15",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Alessandro Crescenzi (Pescara) for Gaston Brugman."
        },
        {
            "gameTime": "2 - 38:59",
            "label": "corner",
            "description": "Jose Callejon (Napoli) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 38:46",
            "label": "",
            "description": "Dries Mertens (Napoli) races towards goal but the defender gets back well to make a challenge. Napoli win a corner."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "corner",
            "description": "The resulting corner from Faouzi Ghoulam (Napoli) is cleared."
        },
        {
            "gameTime": "2 - 37:07",
            "label": "",
            "description": "Albano Bizzarri hears the fans clapping his superb goalkeeping. Arkadiusz Milik (Napoli) shoots from the edge of the box towards the right side of the goal, but the goalkeeper makes a magnificent save. It will be a corner kick for Napoli."
        },
        {
            "gameTime": "2 - 35:56",
            "label": "",
            "description": "Dries Mertens (Napoli) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 32:58",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 31:04",
            "label": "",
            "description": "Dries Mertens (Napoli) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The ball is out of play and Napoli manage to earn a corner."
        },
        {
            "gameTime": "2 - 28:12",
            "label": "y-card",
            "description": "Piero Giacomelli shows a yellow card to Norbert Gyomber (Pescara) for a tough tackle."
        },
        {
            "gameTime": "2 - 25:56",
            "label": "substitution",
            "description": "Here comes a substitution. Marek Hamsik (Napoli) is given a rest as he is replaced by ."
        },
        {
            "gameTime": "2 - 25:55",
            "label": "substitution",
            "description": "Problems for Massimo Oddo as Andrea Coda is not able to play anymore. His injury is too serious and Dario Zuparic (Pescara) replaces him."
        },
        {
            "gameTime": "2 - 25:11",
            "label": "injury",
            "description": "Looks like Andrea Coda (Pescara) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 21:25",
            "label": "",
            "description": "Napoli are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "2 - 18:24",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Rey Manaj (Pescara) comes onto the pitch for Ledian Memushaj."
        },
        {
            "gameTime": "2 - 17:05",
            "label": "soccer-ball",
            "description": "Goal! It's a catastrophic error from the opponent which has gifted a chance to Dries Mertens (Napoli), who rolls the ball into the back of the net from close range. 2:2."
        },
        {
            "gameTime": "2 - 16:40",
            "label": "",
            "description": "The ball is cleared after Marek Hamsik (Napoli) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 14:50",
            "label": "soccer-ball",
            "description": "Goal 2:1! Dries Mertens (Napoli) tries his luck from the edge of the box and scores with an accurate shot inside the right post. Mirko Valdifiori provided an assist for the goal."
        },
        {
            "gameTime": "2 - 10:52",
            "label": "funfact",
            "description": "9:22 – this is the total number of shots produced by both teams."
        },
        {
            "gameTime": "2 - 07:21",
            "label": "substitution",
            "description": "Maurizio Sarri decides to make a substitution. Manolo Gabbiadini will be replaced by Arkadiusz Milik (Napoli)."
        },
        {
            "gameTime": "2 - 07:13",
            "label": "substitution",
            "description": "Here comes a substitution. Dries Mertens (Napoli) is brought on as a substitute for Lorenzo Insigne."
        },
        {
            "gameTime": "2 - 07:12",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 06:40",
            "label": "y-card",
            "description": "Albano Bizzarri (Pescara) kept talking out of turn to the referee until Piero Giacomelli lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "corner",
            "description": "Jose Callejon (Napoli) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender. The ball goes out of play. Napoli are awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:39",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. The ball goes out for a corner. Napoli can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 04:16",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 04:03",
            "label": "",
            "description": "Jose Callejon (Napoli) serves up a nice cross, but the defence clears the danger. The referee signals a corner kick to Napoli."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "y-card",
            "description": "The foul by Gaston Brugman (Pescara) is worthy of a card and a yellow is duly shown by Piero Giacomelli."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "There was plenty of entertainment during the first 45 minutes. Hopefully more of the same in the second half. The visitors were more active and dominated the home side in the first half, who weren't able to keep up. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "whistle",
            "description": "Piero Giacomelli has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:51",
            "label": "",
            "description": "What a wasted chance that was! A precise cross into the box finds Raul Albiol (Napoli), whose header goes wide of the goal."
        },
        {
            "gameTime": "1 - 44:39",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 44:06",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner but it's cleared. Napoli will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 43:41",
            "label": "",
            "description": "Elseid Hysaj (Napoli) passes the ball into the box but an opposing player clears. Napoli force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 41:31",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) is adjudged offside."
        },
        {
            "gameTime": "1 - 41:03",
            "label": "corner",
            "description": "Jose Callejon (Napoli) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 40:51",
            "label": "",
            "description": "A pass into the penalty area from Lorenzo Insigne (Napoli) is intercepted by the defence. The ball is out of play. A goal scoring opportunity from a corner for Napoli."
        },
        {
            "gameTime": "1 - 40:11",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 37:29",
            "label": "",
            "description": "Napoli keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 34:29",
            "label": "soccer-ball",
            "description": "Goal 2:0! Francesco Zampano laid the ball off to Gianluca Caprari (Pescara), who slots it into the back of the net from close range, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "1 - 33:41",
            "label": "corner",
            "description": "Gianluca Caprari (Pescara) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 33:16",
            "label": "",
            "description": "Francesco Zampano (Pescara) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net. Now Pescara have a corner."
        },
        {
            "gameTime": "1 - 32:21",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Gianluca Caprari (Pescara). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 32:05",
            "label": "",
            "description": "Bryan Cristante (Pescara) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball is out of play. Pescara will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 30:51",
            "label": "",
            "description": "Close! Faouzi Ghoulam (Napoli) stands over the resulting free kick from around 30 metres out and his shot goes just wide of the right post!"
        },
        {
            "gameTime": "1 - 29:56",
            "label": "",
            "description": "Gaston Brugman (Pescara) makes a rough challenge and the referee blows for a foul. Napoli earn a free kick."
        },
        {
            "gameTime": "1 - 28:39",
            "label": "y-card",
            "description": "A yellow card for a tackle by Raul Albiol (Napoli). Piero Giacomelli doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 26:40",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Valerio Verre (Pescara). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "1 - 23:38",
            "label": "",
            "description": "What a long range shot by Mirko Valdifiori (Napoli). Unfortunately for him, his shot goes just a few inches over the bar."
        },
        {
            "gameTime": "1 - 22:36",
            "label": "",
            "description": "Allan (Napoli) commits a rough challenge and Piero Giacomelli blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 21:01",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) meets a cross inside the box, but Albano Bizzarri wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "1 - 19:26",
            "label": "",
            "description": "Allan (Napoli) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 18:54",
            "label": "",
            "description": "The linesman signals that Gianluca Caprari (Pescara) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 16:00",
            "label": "",
            "description": "This shall not pass! Gianluca Caprari (Pescara) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 13:08",
            "label": "",
            "description": "Jose Callejon (Napoli) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 11:55",
            "label": "",
            "description": "That was close by Lorenzo Insigne (Napoli)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "1 - 10:19",
            "label": "corner",
            "description": "Gianluca Caprari (Pescara) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 10:07",
            "label": "",
            "description": "Ahmad Benali (Pescara) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. Pescara get a corner."
        },
        {
            "gameTime": "1 - 07:46",
            "label": "soccer-ball",
            "description": "GOAL 1:0! Valerio Verre found Ahmad Benali (Pescara) inside the box, he spotted goalkeeper Pepe Reina off his line and chipped the ball into the net. What a cheeky lob!"
        },
        {
            "gameTime": "1 - 04:57",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) loses the defending players and unloads a powerful, but inaccurate effort from long distance. The goalkeeper remains completely calm as the ball ends near the right corner flag."
        },
        {
            "gameTime": "1 - 02:37",
            "label": "",
            "description": "Marek Hamsik (Napoli) collects a pass and has an effort from 22 metres out, but it flies just wide of the left post."
        },
        {
            "gameTime": "1 - 02:25",
            "label": "",
            "description": "Napoli players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Piero Giacomelli will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli have completed a big transfer by signing ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "2.6 Average number of goals scored in the last 5 matches between these two teams."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. We witnessed the away side dominate today's game. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "21/08/2016 - 21:45",
    "gameHomeTeam": "Pescara",
    "gameScore": "2 - 2"
}