{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-03-01 - 22-45 Norwich 1 - 2 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 51:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. A very even game was seen on the pitch today. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 51:15",
            "label": "whistle",
            "description": "Lee Mason is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 49:05",
            "label": "",
            "description": "Timm Klose (Norwich) jumps for a header from the resulting corner kick and sends the ball in on goal, but the goalkeeper makes a very good save."
        },
        {
            "gameTime": "2 - 49:02",
            "label": "corner",
            "description": "The referee awards a corner and Robbie Brady (Norwich) goes over to take it."
        },
        {
            "gameTime": "2 - 48:56",
            "label": "",
            "description": "Nathan Redmond (Norwich) tries his luck from the edge of the box after a brilliant solo effort, but it is well blocked by the defender. The ball goes out of play. Norwich are awarded a corner kick."
        },
        {
            "gameTime": "2 - 48:31",
            "label": "",
            "description": "Jonathan Howson (Norwich) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "injury",
            "description": "The game is interrupted now, Jonathan Howson (Norwich) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 45:44",
            "label": "",
            "description": "CHANCE! Cesc Fabregas finds Diego Costa (Chelsea) with a sweet pass, but he can't find the target as his effort from inside the box goes just wide of the left post!"
        },
        {
            "gameTime": "2 - 45:23",
            "label": "",
            "description": "Robbie Brady (Norwich) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:20",
            "label": "attendance",
            "description": "The attendance is 27091."
        },
        {
            "gameTime": "2 - 43:06",
            "label": "",
            "description": "Nathan Redmond (Norwich) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the right post."
        },
        {
            "gameTime": "2 - 42:24",
            "label": "",
            "description": "Diego Costa (Chelsea) is adjudged offside."
        },
        {
            "gameTime": "2 - 41:54",
            "label": "",
            "description": "Nemanja Matic (Chelsea) comes close to scoring! He gets the ball inside the box from the resulting corner but his shot flies just over the crossbar. This should be a big warning for the defence."
        },
        {
            "gameTime": "2 - 41:36",
            "label": "corner",
            "description": "Willian (Chelsea) will take the corner."
        },
        {
            "gameTime": "2 - 41:14",
            "label": "corner",
            "description": "Willian (Chelsea) takes the resulting corner which is well defended. Chelsea will take a corner kick."
        },
        {
            "gameTime": "2 - 40:46",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Willian (Chelsea). Chelsea earn a corner."
        },
        {
            "gameTime": "2 - 39:37",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) produces a lovely chip pass into the box, but one of the opposition players cuts it out."
        },
        {
            "gameTime": "2 - 36:17",
            "label": "",
            "description": "Gary O'Neil (Norwich) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 36:12",
            "label": "",
            "description": "Eden Hazard (Chelsea) is caught offside!"
        },
        {
            "gameTime": "2 - 35:40",
            "label": "",
            "description": "Willian (Chelsea) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 34:56",
            "label": "",
            "description": "Robbie Brady (Norwich) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 33:30",
            "label": "injury",
            "description": "Gary O'Neil (Norwich) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 33:30",
            "label": "injury",
            "description": "Robbie Brady (Norwich) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 32:59",
            "label": "corner",
            "description": "Robbie Brady (Norwich) takes a short corner kick."
        },
        {
            "gameTime": "2 - 32:23",
            "label": "",
            "description": "Jonathan Howson (Norwich) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders. Norwich force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 31:47",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 30:32",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Timm Klose (Norwich) was quite harsh and Lee Mason didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 28:49",
            "label": "",
            "description": "Robbie Brady (Norwich) collects a rebound a long way out and doesn't hesitate to release a goal bound hammer of a shot. His attempt is precise and towards the right post. It would have probably ended in the back of the net if it wasn't for Thibaut Courtois and his brilliant save."
        },
        {
            "gameTime": "2 - 28:15",
            "label": "",
            "description": "Robbie Brady (Norwich) whips a long ball in from the free kick which is intercepted by Thibaut Courtois."
        },
        {
            "gameTime": "2 - 27:46",
            "label": "y-card",
            "description": "Cesc Fabregas (Chelsea) goes into the book for a horrible tackle. A yellow card is necessary in this case."
        },
        {
            "gameTime": "2 - 26:59",
            "label": "",
            "description": "Lee Mason blows his whistle and it's Dieumerci Mbokani (Norwich) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 24:58",
            "label": "",
            "description": "The linesman raises his flag. Nathan Redmond (Norwich) is adjudged offside."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "substitution",
            "description": "Substitution. will be replaced by Abdul Baba Rahman (Chelsea)."
        },
        {
            "gameTime": "2 - 22:53",
            "label": "soccer-ball",
            "description": "Goal! Wesley Hoolahan puts the ball on a plate for Nathan Redmond (Norwich), who scores with a simple close range finish. It's 1:2."
        },
        {
            "gameTime": "2 - 22:07",
            "label": "",
            "description": "Ivo Pinto (Norwich) swings a cross into the box, but it's far too close to Thibaut Courtois, who smothers the ball."
        },
        {
            "gameTime": "2 - 20:44",
            "label": "",
            "description": "An attempted cross from Ivo Pinto (Norwich) is cleared."
        },
        {
            "gameTime": "2 - 18:39",
            "label": "",
            "description": "Timm Klose (Norwich) is able to continue to play."
        },
        {
            "gameTime": "2 - 17:04",
            "label": "injury",
            "description": "Timm Klose (Norwich) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 16:41",
            "label": "",
            "description": "He should have done better. Cameron Jerome (Norwich) is afforded space to connect with a Robbie Brady cross, but his header from the centre of the box flies well over the crossbar."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "substitution",
            "description": "Alex Neil decides to make a substitution. Ryan Bennett will be replaced by Dieumerci Mbokani (Norwich)."
        },
        {
            "gameTime": "2 - 14:33",
            "label": "substitution",
            "description": "Oscar comes off the pitch to be replaced by John Obi Mikel (Chelsea)."
        },
        {
            "gameTime": "2 - 14:17",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Willian (Chelsea) comes onto the pitch for Bertrand Traore."
        },
        {
            "gameTime": "2 - 13:58",
            "label": "corner",
            "description": "Robbie Brady (Norwich) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 13:51",
            "label": "",
            "description": "Cameron Jerome (Norwich) races towards goal but the defender gets back well to make a challenge. The ball is out of play. A goal scoring opportunity from a corner for Norwich."
        },
        {
            "gameTime": "2 - 13:16",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) sends a cross into the box, but John Ruddy comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 12:28",
            "label": "",
            "description": "Eden Hazard (Chelsea) is all over the pitch today. He is full of energy and asking for the ball, while his ability to control the game and to be on the ball is simply fantastic. Every manager wants to have a playmaker like him."
        },
        {
            "gameTime": "2 - 09:44",
            "label": "funfact",
            "description": "Let's have a look at statistics for the fouls committed by both teams – 17:5."
        },
        {
            "gameTime": "2 - 07:54",
            "label": "",
            "description": "What a chance that is! Cameron Jerome (Norwich) wastes a huge opportunity as he receives a beautiful pass inside the box but is somehow only able to prod the ball onto the crossbar!"
        },
        {
            "gameTime": "2 - 07:32",
            "label": "corner",
            "description": "Robbie Brady (Norwich) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 07:11",
            "label": "",
            "description": "Ivo Pinto (Norwich) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The ball is out of play. Norwich win a corner kick."
        },
        {
            "gameTime": "2 - 05:53",
            "label": "",
            "description": "Dangerous play by Cameron Jerome (Norwich). Lee Mason blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 03:49",
            "label": "",
            "description": "Cameron Jerome (Norwich) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 02:29",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) attempted to pick out a free teammate inside the box, but John Ruddy comes off the line to clear the ball away."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. No side has really dominated in this first half. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 48:00",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 47:47",
            "label": "",
            "description": "Referee Lee Mason sees the trip by Cameron Jerome (Norwich) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 45:16",
            "label": "soccer-ball",
            "description": "GOAL 0:2! Bertrand Traore found Diego Costa (Chelsea) inside the box, he spotted goalkeeper John Ruddy off his line and chipped the ball into the net. What a cheeky lob!"
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:52",
            "label": "y-card",
            "description": "Oscar (Chelsea) has tested the patience of referee Lee Mason and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 42:20",
            "label": "",
            "description": "The foul by Wesley Hoolahan (Norwich) was seen by Lee Mason who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 40:16",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) stands over the free kick and opts to take it himself, sending it towards the right post only for John Ruddy to dive and make a save. Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 38:40",
            "label": "y-card",
            "description": "Ryan Bennett (Norwich) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Lee Mason ignores the protests."
        },
        {
            "gameTime": "1 - 37:58",
            "label": "",
            "description": "Bertrand Traore (Chelsea) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 36:28",
            "label": "",
            "description": "Bertrand Traore (Chelsea) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 35:47",
            "label": "substitution",
            "description": "Alex Neil is forced to make a change. Alexander Tettey is not able to carry on due to injury. He is replaced by Gary O'Neil (Norwich)."
        },
        {
            "gameTime": "1 - 35:15",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) climbs high to connect with a cross near the penalty spot but plants a header high over the bar."
        },
        {
            "gameTime": "1 - 34:53",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 34:18",
            "label": "",
            "description": "Bertrand Traore is not given a chance to finish after receiving a sweet pass by Diego Costa (Chelsea). The ball is out of play. Chelsea will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "injury",
            "description": "The game is interrupted now, Alexander Tettey (Norwich) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 31:14",
            "label": "",
            "description": "Ryan Bennett (Norwich) makes a slide tackle, but referee Lee Mason blows for a foul."
        },
        {
            "gameTime": "1 - 29:42",
            "label": "",
            "description": "Alexander Tettey (Norwich) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 28:51",
            "label": "",
            "description": "Wonderful pass from Eden Hazard (Chelsea) for Oscar, but they can't profit from it as John Ruddy comes off his line to collect."
        },
        {
            "gameTime": "1 - 26:34",
            "label": "",
            "description": "Bertrand Traore (Chelsea) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 25:18",
            "label": "",
            "description": "Ivo Pinto (Norwich) slaloms his way past challenges, but an opposing player does well to get the ball away. The linesman signals a throw in for Norwich."
        },
        {
            "gameTime": "1 - 23:14",
            "label": "",
            "description": "Bertrand Traore (Chelsea) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 22:49",
            "label": "",
            "description": "Bertrand Traore latches onto a perfect defence splitting pass from Cesc Fabregas (Chelsea) and heads towards goal."
        },
        {
            "gameTime": "1 - 19:58",
            "label": "",
            "description": "Ivo Pinto (Norwich) sends a long ball across the pitch, but it misses its target. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 18:55",
            "label": "",
            "description": "Flag up against Ivo Pinto (Norwich). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 17:51",
            "label": "",
            "description": "Oscar (Chelsea) commits a foul and Lee Mason immediately signals a free kick."
        },
        {
            "gameTime": "1 - 17:48",
            "label": "",
            "description": "Flag goes up against Ivo Pinto (Norwich) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 16:39",
            "label": "",
            "description": "Cameron Jerome (Norwich) jumps for a cross and produces a fine header from near the penalty spot, but it goes a whisker over the bar! What a huge opportunity!"
        },
        {
            "gameTime": "1 - 15:47",
            "label": "",
            "description": "Nathan Redmond (Norwich) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 14:23",
            "label": "",
            "description": "The Norwich players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 12:40",
            "label": "y-card",
            "description": "Jonathan Howson (Norwich) is shown a yellow card after a horrible tackle."
        },
        {
            "gameTime": "1 - 10:26",
            "label": "",
            "description": "Here is another series of one touch passes by Eden Hazard (Chelsea). It's obvious that these passes are their most common way to start with a new quick attack and to get rid of the opponent's defenders."
        },
        {
            "gameTime": "1 - 09:43",
            "label": "",
            "description": "Ivo Pinto (Norwich) makes an overly aggressive challenge and Lee Mason blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 07:34",
            "label": "",
            "description": "Jonathan Howson (Norwich) got the ball on the edge of the box and produced a strong shot, but one of his teammates was standing in the wrong place and unintentionally blocked the effort."
        },
        {
            "gameTime": "1 - 06:47",
            "label": "",
            "description": "Good defending. Oscar (Chelsea) tries to find Diego Costa inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 05:08",
            "label": "",
            "description": "Eden Hazard (Chelsea) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 04:38",
            "label": "",
            "description": "and Eden Hazard (Chelsea) combine well with a quick one two and their attacking move continues."
        },
        {
            "gameTime": "1 - 03:49",
            "label": "",
            "description": "Russell Martin (Norwich) makes an unfair challenge by holding his opponent to prevent him from getting the ball."
        },
        {
            "gameTime": "1 - 02:13",
            "label": "",
            "description": "Wesley Hoolahan (Norwich) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 00:55",
            "label": "soccer-ball",
            "description": "Goal! Kenedy (Chelsea) weaves his way past opponents, and he unleashes a magnificent effort from the edge of the box into the bottom right corner. John Ruddy had no chance of reaching it. The score is 0:1."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Norwich will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lee Mason is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. A very even game was seen on the pitch today. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "01/03/2016 - 22:45",
    "gameHomeTeam": "Norwich",
    "gameScore": "1 - 2"
}