{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-10-29 - 21-45 Barcelona 1 - 0 Granada CF/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The game produced by the players today wasn't one of the most inspiring. They definitely haven't shown us their best. The game was controlled by the home side. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        },
        {
            "gameTime": "2 - 48:08",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 47:30",
            "label": "",
            "description": "A pass from David Barral (Granada CF) is intercepted by Marc Andre ter Stegen and the move breaks down."
        },
        {
            "gameTime": "2 - 45:18",
            "label": "",
            "description": "A clumsy foul by Uche Agbo (Granada CF) and Juan Martinez Munuera blows his whistle."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:36",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a well played pass inside the penalty area and shoots. He sends the ball into orbit."
        },
        {
            "gameTime": "2 - 43:16",
            "label": "",
            "description": "Isaac Cuenca (Granada CF) produces a poor lofted pass into the penalty box. His attempt is easily thwarted by the defence."
        },
        {
            "gameTime": "2 - 42:55",
            "label": "",
            "description": "One of the Barcelona players tripped an opponent and conceded a foul. Granada CF are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 41:45",
            "label": "y-card",
            "description": "Ruben Vezo (Granada CF) is booked by the referee."
        },
        {
            "gameTime": "2 - 41:37",
            "label": "y-card",
            "description": "It's a yellow card for Neymar (Barcelona)."
        },
        {
            "gameTime": "2 - 37:59",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Luis Suarez trots off the pitch and is replaced by Alcacer Paco (Barcelona)."
        },
        {
            "gameTime": "2 - 36:53",
            "label": "",
            "description": "Luis Suarez (Barcelona) escapes his marker to meet a cross and heads to the middle of the goal, but the keeper pulls off an excellent reflex save to deny him."
        },
        {
            "gameTime": "2 - 34:04",
            "label": "",
            "description": "Lionel Messi (Barcelona) wasted an opportunity to score from the free kick from about 20 metres out. His attempt hit the defensive wall."
        },
        {
            "gameTime": "2 - 33:35",
            "label": "y-card",
            "description": "Juan Martinez Munuera shows a yellow card to David Lomban (Granada CF) for a tough tackle. Barcelona are awarded the free kick."
        },
        {
            "gameTime": "2 - 31:05",
            "label": "substitution",
            "description": "Sergi Samper (Granada CF) comes onto the pitch because Jon Toral simply cannot continue any longer after picking up an injury."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "injury",
            "description": "Jon Toral (Granada CF) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 27:21",
            "label": "y-card",
            "description": "A yellow card for a tackle by Jon Toral (Granada CF). Juan Martinez Munuera doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 26:35",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Artem Kravets leaves the pitch and David Barral (Granada CF) comes on."
        },
        {
            "gameTime": "2 - 25:24",
            "label": "substitution",
            "description": "Luis Enrique decides to make a substitution. Denis Suarez will be replaced by Andre Gomes (Barcelona)."
        },
        {
            "gameTime": "2 - 24:42",
            "label": "",
            "description": "Lucas Digne (Barcelona) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Juan Martinez Munuera blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "2 - 21:08",
            "label": "corner",
            "description": "The corner from Mehdi Carcela Gonzalez (Granada CF) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 20:43",
            "label": "",
            "description": "Jeremie Boga (Granada CF) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders. Granada CF force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 18:11",
            "label": "",
            "description": "Lionel Messi (Barcelona) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 17:39",
            "label": "corner",
            "description": "Neymar (Barcelona) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 17:21",
            "label": "",
            "description": "Neymar (Barcelona) meets a cross inside the penalty area and unloads a good attempt towards the left side of the goal. Guillermo Ochoa is prepared, though, and denies him with a fantastic save. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 14:31",
            "label": "substitution",
            "description": "The manager makes a subsitution with Jeremie Boga (Granada CF) coming on for Andreas Pereira."
        },
        {
            "gameTime": "2 - 14:16",
            "label": "",
            "description": "Neymar (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 13:31",
            "label": "",
            "description": "Lionel Messi (Barcelona) takes the free kick and sends the ball into the penalty area, but the opposition's defence is ready."
        },
        {
            "gameTime": "2 - 13:21",
            "label": "",
            "description": "Mehdi Carcela Gonzalez (Granada CF) should know this behaviour is beyond the rules. He was too careless with his challenge and left Juan Martinez Munuera no option but to blow his whistle. Barcelona have a free kick."
        },
        {
            "gameTime": "2 - 12:44",
            "label": "",
            "description": "Luis Suarez (Barcelona) goes on a weaving run through the defence and gets within shooting range but his effort is blocked."
        },
        {
            "gameTime": "2 - 12:07",
            "label": "",
            "description": "Juan Martinez Munuera blows his whistle after Silva Gabriel (Granada CF) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "2 - 10:33",
            "label": "attendance",
            "description": "The attendance for today's match is 82914."
        },
        {
            "gameTime": "2 - 09:26",
            "label": "",
            "description": "Javier Mascherano (Barcelona) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but it goes well wide of the left post."
        },
        {
            "gameTime": "2 - 09:05",
            "label": "corner",
            "description": "Neymar (Barcelona) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 08:54",
            "label": "",
            "description": "Lucas Digne (Barcelona) wastes a good opportunity as his pass into the box is blocked by the defence. Barcelona earn a corner."
        },
        {
            "gameTime": "2 - 07:41",
            "label": "",
            "description": "The linesman signals that Luis Suarez (Barcelona) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 06:01",
            "label": "",
            "description": "Luis Suarez (Barcelona) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "soccer-ball",
            "description": "Goal! Rafinha (Barcelona) fires the rebound into the top left corner after the ball breaks to him in the box. The score is 1:0."
        },
        {
            "gameTime": "2 - 02:50",
            "label": "",
            "description": "What a chance that is! Neymar (Barcelona) wastes a huge opportunity as he receives a beautiful pass inside the box but is somehow only able to prod the ball onto the left post!"
        },
        {
            "gameTime": "2 - 02:20",
            "label": "",
            "description": "Flag goes up against Mehdi Carcela Gonzalez (Granada CF) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "There has not been much to choose between the sides after an absorbing 45 minutes. Let's hope they can continue in the same vein in the second period. The home team were mostly in control in the first half. The home team makes a lot of passes and attempts to maintain possession, while the visitors look to counter attack."
        },
        {
            "gameTime": "1 - 45:12",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 43:16",
            "label": "",
            "description": "One of the Barcelona players unfairly tackled his opponent and conceded a foul."
        },
        {
            "gameTime": "1 - 42:28",
            "label": "",
            "description": "The linesman raises his flag. Luis Suarez (Barcelona) is adjudged offside."
        },
        {
            "gameTime": "1 - 41:02",
            "label": "corner",
            "description": "Neymar (Barcelona) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 40:40",
            "label": "",
            "description": "Rafinha (Barcelona) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee points to the corner flag and Barcelona will take a corner."
        },
        {
            "gameTime": "1 - 39:05",
            "label": "corner",
            "description": "Neymar (Barcelona) works the corner short."
        },
        {
            "gameTime": "1 - 38:49",
            "label": "",
            "description": "Luis Suarez (Barcelona) tries to slide the ball through to a teammate but it's well blocked by a defender. Corner kick. Barcelona will have an opportunity."
        },
        {
            "gameTime": "1 - 37:16",
            "label": "",
            "description": "Juan Martinez Munuera couldn't ignore the rough tackle by Neymar (Barcelona) and blew his whistle."
        },
        {
            "gameTime": "1 - 34:54",
            "label": "",
            "description": "Luis Suarez (Barcelona) fashions a shot from the edge of the box after receiving an accurate pass. Guillermo Ochoa makes a stunning save to stop the effort from flying into the right side of the goal."
        },
        {
            "gameTime": "1 - 33:59",
            "label": "corner",
            "description": "A dangerous looking corner kick from Neymar (Barcelona) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 33:29",
            "label": "",
            "description": "Rafinha (Barcelona) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away. The ball is out of play. Barcelona win a corner kick."
        },
        {
            "gameTime": "1 - 32:01",
            "label": "corner",
            "description": "The corner kick from Neymar (Barcelona) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 31:43",
            "label": "",
            "description": "A lofted cross from Sergi Roberto (Barcelona) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The referee blows his whistle, Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "1 - 30:15",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from 27 metres out by Lionel Messi (Barcelona) as his effort only hit the wall."
        },
        {
            "gameTime": "1 - 29:26",
            "label": "",
            "description": "Matthieu Saunier (Granada CF) makes a slide tackle, but referee Juan Martinez Munuera blows for a foul. A free kick to Barcelona."
        },
        {
            "gameTime": "1 - 28:07",
            "label": "",
            "description": "Mehdi Carcela Gonzalez (Granada CF) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 27:24",
            "label": "",
            "description": "Samuel Umtiti (Barcelona) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "1 - 27:13",
            "label": "corner",
            "description": "Neymar (Barcelona) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 27:06",
            "label": "",
            "description": "An attempted cross from Luis Suarez (Barcelona) is cleared. The ball goes out of play and Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 25:05",
            "label": "",
            "description": "Andreas Pereira (Granada CF) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 22:46",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) jumps for a cross and produces a fine header from near the penalty spot, but it goes narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 22:20",
            "label": "corner",
            "description": "Neymar (Barcelona) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 21:59",
            "label": "",
            "description": "Denis Suarez (Barcelona) whips a promising cross into the box, but the opposition's defence intercepts the ball. The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 20:17",
            "label": "",
            "description": "Lionel Messi (Barcelona) clips a neat ball into the box in the direction of Luis Suarez, but he can't get on the end of the pass."
        },
        {
            "gameTime": "1 - 19:14",
            "label": "",
            "description": "Neymar (Barcelona) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "1 - 18:33",
            "label": "",
            "description": "Sergi Roberto (Barcelona) pulls the jersey of one of the opposition players and Juan Martinez Munuera blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 17:17",
            "label": "",
            "description": "Lionel Messi (Barcelona) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 15:20",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Neymar (Barcelona), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "1 - 14:30",
            "label": "",
            "description": "Denis Suarez (Barcelona) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 13:44",
            "label": "",
            "description": "Rafinha (Barcelona) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 12:15",
            "label": "",
            "description": "Neymar (Barcelona) is flagged for offside."
        },
        {
            "gameTime": "1 - 10:57",
            "label": "",
            "description": "Neymar (Barcelona) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 10:18",
            "label": "y-card",
            "description": "Juan Martinez Munuera shows a yellow card to Silva Gabriel (Granada CF), who isn't surprised as the tackle was really hard and late. A free kick has been awarded to Barcelona."
        },
        {
            "gameTime": "1 - 09:43",
            "label": "",
            "description": "Artem Kravets (Granada CF) is adjudged offside."
        },
        {
            "gameTime": "1 - 08:19",
            "label": "",
            "description": "The game is interrupted as Matthieu Saunier (Granada CF) is flagged offside."
        },
        {
            "gameTime": "1 - 07:19",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "1 - 04:39",
            "label": "",
            "description": "Flag up against Silva Gabriel (Granada CF). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 03:41",
            "label": "",
            "description": "Neymar (Barcelona) tries to latch onto a through ball, but it's too long."
        },
        {
            "gameTime": "1 - 02:13",
            "label": "",
            "description": "Sergi Roberto (Barcelona) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 00:44",
            "label": "",
            "description": "A pass from Mehdi Carcela Gonzalez (Granada CF) is intercepted by Marc Andre ter Stegen and the move breaks down."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Granada CF will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Juan Martinez Munuera."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Granada CF have a poor defence this season as they have conceded 80 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona will miss a few players for this clash: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lionel Messi have rippled the net 9x and is the top scorer for Barcelona this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The game produced by the players today wasn't one of the most inspiring. They definitely haven't shown us their best. The game was controlled by the home side. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        }
    ],
    "gameAwayTeam": "Granada CF",
    "gameDate": "29/10/2016 - 21:45",
    "gameHomeTeam": "Barcelona",
    "gameScore": "1 - 0"
}