{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-12-10 - 20-30 Leicester 4 - 2 Manchester City/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The home side dominated the game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        },
        {
            "gameTime": "2 - 49:55",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 48:50",
            "label": "",
            "description": "The linesman raises his flag for offside before Pablo Zabaleta (Manchester City) heads on."
        },
        {
            "gameTime": "2 - 48:22",
            "label": "",
            "description": "The Manchester City players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "y-card",
            "description": "Michael Oliver shows the yellow card to Shinji Okazaki (Leicester) for a heavy challenge."
        },
        {
            "gameTime": "2 - 46:48",
            "label": "substitution",
            "description": "The game has come to an end for Riyad Mahrez. He has contributed as much as he could today. He will be replaced by the fresh legs of Matthew James (Leicester)."
        },
        {
            "gameTime": "2 - 45:46",
            "label": "",
            "description": "Nolito (Manchester City) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:56",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Aleksandar Kolarov, who plays a vital role in the build up. He squares it to Duran Nolito (Manchester City), who beats Ron Robert Zieler with a brilliant shot into the bottom right corner. 4:2."
        },
        {
            "gameTime": "2 - 42:45",
            "label": "substitution",
            "description": "Substitution. Demarai Gray (Leicester) has come on for Jamie Vardy."
        },
        {
            "gameTime": "2 - 41:23",
            "label": "corner",
            "description": "David Silva (Manchester City) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 41:15",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) looks to break free, but an opposing player clears the ball away. The ball is out of play. Manchester City win a corner kick."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "",
            "description": "A brilliant cross into the box finds Nolito (Manchester City), who directs his header to the middle of the goal, but the goalkeeper shows his reflexes and makes an astonishing save."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "",
            "description": "Shinji Okazaki (Leicester) commits a foul and Michael Oliver immediately signals a free kick."
        },
        {
            "gameTime": "2 - 36:35",
            "label": "soccer-ball",
            "description": "Aleksandar Kolarov (Manchester City) converts the free kick from about 24 metres out with a perfectly bent shot that ends up inside the right post. The goalkeeper had no chance. What a shot!"
        },
        {
            "gameTime": "2 - 35:43",
            "label": "",
            "description": "Christian Fuchs (Leicester) commits an ugly challenge. The referee sees it and immediately blows his whistle. Manchester City are awarded a free kick."
        },
        {
            "gameTime": "2 - 32:57",
            "label": "soccer-ball",
            "description": "GOAL! Jamie Vardy (Leicester) gets to the ball on the edge of the box after a huge mistake by an opponent and slams it into the back of the net. He makes it 4:0."
        },
        {
            "gameTime": "2 - 32:16",
            "label": "substitution",
            "description": "Claudio Ranieri has decided to substitute Islam Slimani and he is replaced by Shinji Okazaki (Leicester)."
        },
        {
            "gameTime": "2 - 31:41",
            "label": "",
            "description": "Michael Oliver blows for a foul after Andy King (Leicester) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 30:45",
            "label": "",
            "description": "The ball is cleared after Pablo Zabaleta (Manchester City) attempted to dribble past an opposing player. The ball is out of play. Manchester City will have a throw in."
        },
        {
            "gameTime": "2 - 28:59",
            "label": "",
            "description": "Yaya Toure (Manchester City) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "2 - 25:38",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "2 - 24:52",
            "label": "",
            "description": "Neat passing move from Manchester City in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 22:54",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Ilkay Gundogan leaves the pitch and Nolito (Manchester City) comes on."
        },
        {
            "gameTime": "2 - 21:58",
            "label": "y-card",
            "description": "Fernando (Manchester City) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Michael Oliver ignores the protests."
        },
        {
            "gameTime": "2 - 20:59",
            "label": "",
            "description": "Islam Slimani (Leicester) outjumps his marker inside the box and heads the resulting corner way wide of the right post."
        },
        {
            "gameTime": "2 - 20:57",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 20:43",
            "label": "",
            "description": "Jamie Vardy (Leicester) sends a pass into the box, but his attempt is thwarted and cleared. Corner kick. Leicester will have an opportunity."
        },
        {
            "gameTime": "2 - 20:23",
            "label": "funfact",
            "description": "The current number of shots on goal is 6:4."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "",
            "description": "Islam Slimani (Leicester) unleashes a shot from the edge of the box, but it goes straight at Claudio Bravo."
        },
        {
            "gameTime": "2 - 16:40",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 16:33",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) misses a good chance to score. An inch perfect cross into the box finds Pablo Zabaleta (Manchester City) who rises for a header, but sends the ball well over the bar. Manchester City force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 15:59",
            "label": "corner",
            "description": "Manchester City take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 15:46",
            "label": "",
            "description": "An attempted cross from David Silva (Manchester City) is cleared. The ball goes behind for a corner. Manchester City will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 15:28",
            "label": "corner",
            "description": "The corner kick from Kevin De Bruyne (Manchester City) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 15:14",
            "label": "",
            "description": "Raheem Sterling (Manchester City) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. Manchester City force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 12:23",
            "label": "substitution",
            "description": "The referee signals a substitution. Yaya Toure (Manchester City) is brought on as a substitute for Kelechi Iheanacho."
        },
        {
            "gameTime": "2 - 12:11",
            "label": "substitution",
            "description": "Pep Guardiola prepares a substitution. Jesus Navas is replaced by Raheem Sterling (Manchester City)."
        },
        {
            "gameTime": "2 - 11:59",
            "label": "y-card",
            "description": "Riyad Mahrez (Leicester) is the one who receives a yellow card."
        },
        {
            "gameTime": "2 - 11:54",
            "label": "",
            "description": "What a chance that is! Ilkay Gundogan (Manchester City) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 10:39",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 09:57",
            "label": "",
            "description": "A cross from Andy King (Leicester) fails to reach the box as the defence clears the ball away to safety. The linesman makes the right call and Leicester will have a corner."
        },
        {
            "gameTime": "2 - 08:48",
            "label": "",
            "description": "Kelechi Iheanacho (Manchester City) makes his forward run a little too early and is caught in an offside position after his teammate tries to play a pass to him."
        },
        {
            "gameTime": "2 - 06:37",
            "label": "funfact",
            "description": "22:78 – the ratio of ball possession."
        },
        {
            "gameTime": "2 - 04:44",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) finds himself with a great opportunity! He unleashes a shot from the edge of the box, which whizzes just wide of the right post!"
        },
        {
            "gameTime": "2 - 04:37",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him."
        },
        {
            "gameTime": "2 - 03:21",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by David Silva (Manchester City) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 01:34",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) sends a cross into the box, but Ron Robert Zieler comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. The home fans will be really pleased with what they've seen from their players so far. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 47:05",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Michael Oliver has ended it."
        },
        {
            "gameTime": "1 - 46:22",
            "label": "",
            "description": "Islam Slimani (Leicester) comes close to scoring! He meets a lovely lofted pass from Marc Albrighton, but sends his close range header way wide of the left post."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "",
            "description": "David Silva (Manchester City) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 42:42",
            "label": "corner",
            "description": "The corner from Jesus Navas (Manchester City) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 42:27",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Kevin De Bruyne (Manchester City), is intercepted by the opposition's defence. Manchester City will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "",
            "description": "Fernando (Manchester City) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "1 - 40:20",
            "label": "",
            "description": "The foul by Aleksandar Kolarov (Manchester City) was seen by Michael Oliver who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 39:52",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "1 - 38:53",
            "label": "",
            "description": "Marc Albrighton (Leicester) jumps into a tackle and Michael Oliver blows his whistle for a foul. That's a free kick to Manchester City."
        },
        {
            "gameTime": "1 - 37:34",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 37:15",
            "label": "",
            "description": "Jesus Navas (Manchester City) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. Manchester City get a corner."
        },
        {
            "gameTime": "1 - 36:22",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) creates a yard of space for himself and tries an effort from distance, but it's blocked."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) sends over a poor, overhit cross from the corner kick and the ball goes out of play. The ball goes out of play and Leicester will have a goal kick."
        },
        {
            "gameTime": "1 - 33:25",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) fails to send a pass into the box as his effort is cut out. The referee signals a corner kick to Manchester City."
        },
        {
            "gameTime": "1 - 32:44",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "1 - 32:30",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee and his assistant both point at the corner flag. Manchester City will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 30:31",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) rises above the defence to meet a cross from the corner. His timing is good, but he directs his header just a few inches wide of the right post."
        },
        {
            "gameTime": "1 - 30:11",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 29:51",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety. The ball goes out of play. Manchester City are awarded a corner kick."
        },
        {
            "gameTime": "1 - 26:18",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) unleashes a shot from 24 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 25:56",
            "label": "",
            "description": "The Manchester City players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 24:59",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 22:43",
            "label": "",
            "description": "Riyad Mahrez (Leicester) picks up the ball, dribbles to the edge of the penalty area and unleashes a brilliant shot to the left side of the goal, but is thwarted by a great save from Claudio Bravo."
        },
        {
            "gameTime": "1 - 21:50",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 21:43",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Jesus Navas (Manchester City). The ball is out of play and Manchester City manage to earn a corner."
        },
        {
            "gameTime": "1 - 19:57",
            "label": "soccer-ball",
            "description": "Riyad Mahrez provides Jamie Vardy (Leicester) with a nice pass inside the box. It allows him to finish with a low shot into the middle of the goal."
        },
        {
            "gameTime": "1 - 19:28",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "1 - 18:46",
            "label": "y-card",
            "description": "A yellow card for a tackle by Danny Simpson (Leicester). Michael Oliver doesn't hesitate at all to make this decision. Manchester City have a free kick."
        },
        {
            "gameTime": "1 - 17:10",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 15:52",
            "label": "",
            "description": "Ilkay Gundogan (Manchester City) and Kelechi Iheanacho attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 14:23",
            "label": "",
            "description": "Kelechi Iheanacho (Manchester City) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 13:23",
            "label": "corner",
            "description": "The corner from David Silva (Manchester City) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 12:53",
            "label": "",
            "description": "David Silva (Manchester City) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball is out of play and the linesman points at the corner flag. Corner to Manchester City."
        },
        {
            "gameTime": "1 - 11:56",
            "label": "",
            "description": "Islam Slimani (Leicester) receives a well played pass inside the penalty area and shoots. He sends the ball into orbit."
        },
        {
            "gameTime": "1 - 11:40",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 11:34",
            "label": "",
            "description": "One of the defenders is in the right place at the right time and makes a vital stop to deny a close range header from Robert Huth (Leicester). The ball is out of play. A goal scoring opportunity from a corner for Leicester."
        },
        {
            "gameTime": "1 - 09:48",
            "label": "",
            "description": "Fernando (Manchester City) brings his opponent down with a tackle and Michael Oliver blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 08:47",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 06:59",
            "label": "",
            "description": "The Manchester City players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 04:21",
            "label": "soccer-ball",
            "description": "Goal! Islam Slimani slips it to Andy King (Leicester) on the edge of the box and he finds the top left corner with a great effort. The score is 2:0."
        },
        {
            "gameTime": "1 - 03:50",
            "label": "",
            "description": "Leicester seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 02:29",
            "label": "soccer-ball",
            "description": "Goal! Islam Slimani displays great vision and sends a pass to Jamie Vardy (Leicester), who shows brilliant composure inside the box to bury the ball into the bottom left corner. The score is 1:0."
        },
        {
            "gameTime": "1 - 01:15",
            "label": "",
            "description": "Manchester City hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Manchester City will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Michael Oliver was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Manchester City have won 6x away this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester haven't won for 5 matches in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The home side dominated the game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        }
    ],
    "gameAwayTeam": "Manchester City",
    "gameDate": "10/12/2016 - 20:30",
    "gameHomeTeam": "Leicester",
    "gameScore": "4 - 2"
}