{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-12-09 - 22-45 D. Zagreb 0 - 2 Bayern Munich/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The Bayern Munich fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        },
        {
            "gameTime": "2 - 47:22",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 47:02",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 46:16",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) wins himself just enough space inside the box to connect with the corner. His header flies towards the middle of the goal, but the goalkeeper blocks the effort."
        },
        {
            "gameTime": "2 - 45:58",
            "label": "corner",
            "description": "Paulo Ricardo Machado (Din. Zagreb) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 45:41",
            "label": "",
            "description": "Goncalo (Din. Zagreb) shoots from outside the box, but his effort is blocked. The ball goes out of play and D. Zagreb have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "corner",
            "description": "The resulting corner from Paulo Ricardo Machado (Din. Zagreb) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 43:40",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) sends a cross into the box, but the opposition's defence clears the ball to safety. The referee points to the corner flag and D. Zagreb will take a corner."
        },
        {
            "gameTime": "2 - 41:59",
            "label": "penalty-missed",
            "description": "Thomas Muller (Bayern Munich) fails to score from the penalty as his shot only hits the right post."
        },
        {
            "gameTime": "2 - 41:55",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 41:48",
            "label": "y-card",
            "description": "Eduardo (Din. Zagreb) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 41:44",
            "label": "penalty",
            "description": "Eduardo (Din. Zagreb) was trying to get to the ball but clattered into the legs of the opponent as well. Martin Strombergsson blows his whistle for an infringement. No point in arguing there. Bayern Munich will take a penalty kick."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "corner",
            "description": "The resulting corner from Arturo Vidal (Bayern Munich) is cleared by the defence."
        },
        {
            "gameTime": "2 - 40:50",
            "label": "",
            "description": "Eduardo gets a well deserved ovation! Thomas Muller (Bayern Munich) produces a decent first time strike towards the right post, but the goalkeeper is positioned well to block it. Nice goalkeeping skills. Bayern Munich will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 40:02",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Thomas Muller (Bayern Munich) takes it short."
        },
        {
            "gameTime": "2 - 39:38",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety. Bayern Munich have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 37:36",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 35:16",
            "label": "substitution",
            "description": "That will be all from Marko Rog who is being replaced by the fresh legs of Domagoj Pavicic (Din. Zagreb)."
        },
        {
            "gameTime": "2 - 34:54",
            "label": "",
            "description": "Martin Strombergsson has a clear sight and sees a foul from Marko Pjaca (Din. Zagreb)."
        },
        {
            "gameTime": "2 - 33:55",
            "label": "",
            "description": "The linesman raises his flag. Robert Lewandowski (Bayern Munich) is adjudged offside."
        },
        {
            "gameTime": "2 - 31:36",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 30:13",
            "label": "funfact",
            "description": "We can have a look at the statistics now, shots on target are 5:12."
        },
        {
            "gameTime": "2 - 28:43",
            "label": "substitution",
            "description": "Substitution. Paulo Ricardo Machado (Din. Zagreb) receives a signal from the referee and is now allowed to enter the pitch as Junior Fernandes walks off."
        },
        {
            "gameTime": "2 - 28:09",
            "label": "y-card",
            "description": "Josip Pivaric (Din. Zagreb) has tested the patience of referee Martin Strombergsson and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 27:08",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) has a great chance inside the six yard box, shoots low to the middle of the goal, but Eduardo pulls off an exquisite save to deny him."
        },
        {
            "gameTime": "2 - 26:28",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The ball is out of play. Bayern Munich will have a throw in."
        },
        {
            "gameTime": "2 - 25:43",
            "label": "",
            "description": "Some neat passing and movement from Bayern Munich as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "2 - 24:30",
            "label": "",
            "description": "OFF THE BAR! Josip Pivaric (Din. Zagreb) drifts into the box to give his teammate support. He receives a fantastic pass and shoots from close range, but it crashes against the crossbar! It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "2 - 23:53",
            "label": "",
            "description": "Josip Pivaric (Din. Zagreb) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 22:24",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 21:51",
            "label": "",
            "description": "Rafinha (Bayern Munich) fouls an opponent. At least that's what referee Martin Strombergsson signals."
        },
        {
            "gameTime": "2 - 19:54",
            "label": "",
            "description": "Junior Fernandes (Din. Zagreb) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 18:45",
            "label": "soccer-ball",
            "description": "GOAL 0:2! Sebastian Rode found Robert Lewandowski (Bayern Munich) inside the box, he spotted goalkeeper Eduardo off his line and chipped the ball into the net. What a cheeky lob!"
        },
        {
            "gameTime": "2 - 16:59",
            "label": "substitution",
            "description": "Substitution. Julian Green is replaced by Arturo Vidal (Bayern Munich)."
        },
        {
            "gameTime": "2 - 15:54",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Thomas Muller finds Robert Lewandowski (Bayern Munich), who jumps highest and steers a close range header into the left side of the goal. His effort was both strong and precise, and Eduardo had no chance of stopping that. 0:0."
        },
        {
            "gameTime": "2 - 15:13",
            "label": "substitution",
            "description": "Zoran Mamic has decided to introduce fresh legs, with Marko Pjaca (Din. Zagreb) replacing Ante Coric."
        },
        {
            "gameTime": "2 - 14:36",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 13:26",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) covers his face with his hands after wasting a promising chance. He takes the rebound on the edge of the box but blazes the ball high over the crossbar."
        },
        {
            "gameTime": "2 - 13:22",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 12:53",
            "label": "",
            "description": "Bayern Munich players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "2 - 11:16",
            "label": "",
            "description": "Rafinha (Bayern Munich) picks up a pass, lines up a shot and strikes from 21 metres out, but Eduardo thwarts the effort which is headed low to the middle of the goal."
        },
        {
            "gameTime": "2 - 11:00",
            "label": "corner",
            "description": "Julian Green (Bayern Munich) takes a short corner kick."
        },
        {
            "gameTime": "2 - 10:37",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) races towards goal but the defender gets back well to make a challenge. The ball is out of play. Bayern Munich win a corner kick."
        },
        {
            "gameTime": "2 - 09:59",
            "label": "",
            "description": "Goncalo (Din. Zagreb) leaps highest to meet the resulting corner and attempts to head home, but the effort goes harmlessly wide of the left post."
        },
        {
            "gameTime": "2 - 09:55",
            "label": "corner",
            "description": "Ante Coric (Din. Zagreb) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 09:24",
            "label": "",
            "description": "Junior Fernandes (Din. Zagreb) receives a precise pass and is given time inside the box to send a promising strike towards the left post. Sven Ulreich guesses his intentions and denies him with a fine save. The ball is out of play and the linesman points at the corner flag. Corner to D. Zagreb."
        },
        {
            "gameTime": "2 - 08:08",
            "label": "funfact",
            "description": "32:68 – the ratio of ball possession."
        },
        {
            "gameTime": "2 - 07:59",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) picks up a pass on the edge of the box and manages to get a powerful shot away, forcing the goalkeeper to scramble to his left and palm the ball away."
        },
        {
            "gameTime": "2 - 07:11",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "2 - 06:17",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 05:20",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 04:11",
            "label": "",
            "description": "That was a poorly executed free kick from long distance. Xabi Alonso (Bayern Munich) was trying to produce a cross into the penalty area, but his effort sailed off the pitch. The ball is off of the pitch and it's a goal kick for D. Zagreb."
        },
        {
            "gameTime": "2 - 03:39",
            "label": "",
            "description": "Marko Rog (Din. Zagreb) makes a rough challenge and Martin Strombergsson blows his whistle for a foul. Bayern Munich have been awarded a free kick."
        },
        {
            "gameTime": "2 - 02:40",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) comes close to scoring! He gets the ball inside the box from the resulting corner, but his effort goes narrowly wide of the right post. This should be a big warning for the defence."
        },
        {
            "gameTime": "2 - 02:32",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 01:59",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) tries to send the ball in front of the goal, but the opposition's defence averts the threat. Bayern Munich have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:53",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 01:20",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee signals a corner kick to Bayern Munich."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Pep Guardiola has decided to make a substitution during the half time break. Thomas Muller (Bayern Munich) comes on the pitch for Franck Ribery."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here is a change after the half time break. Mehdi Benatia is replaced by Jerome Boateng (Bayern Munich)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have seen a few chances and nice movements, but the overall impression of the game is rather average and not hugely entertaining. The visitors are mostly controlling the match and making it tough for the home side to keep up. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 45:11",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 43:10",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) wasted a great chance as he climbed high to connect with a cross from the free kick inside the penalty area. He produced a header which went wide of the left by a whisker."
        },
        {
            "gameTime": "1 - 42:51",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) makes a reckless foul in order to win the ball from his opponent. Martin Strombergsson has a clear sight of it and blows his whistle. Free kick. D. Zagreb will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 40:41",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) trips an opposition player and Martin Strombergsson signals a foul."
        },
        {
            "gameTime": "1 - 40:27",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Xabi Alonso (Bayern Munich) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 38:36",
            "label": "corner",
            "description": "The corner from Franck Ribery (Bayern Munich) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 38:20",
            "label": "",
            "description": "A lofted cross from Rafinha (Bayern Munich) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Bayern Munich win a corner."
        },
        {
            "gameTime": "1 - 38:16",
            "label": "corner",
            "description": "Franck Ribery (Bayern Munich) works the corner short."
        },
        {
            "gameTime": "1 - 37:51",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. Bayern Munich force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 36:48",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Franck Ribery (Bayern Munich) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "1 - 35:42",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) serves up a nice cross, but Eduardo punches the ball away."
        },
        {
            "gameTime": "1 - 34:22",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) looks very eager to impress, does well to beat his man and force a cross into the box, where one of his teammates gets his head on the ball, but it's too easy for the keeper. (in this sentence the player crosses and heads his own cross! So I created a different scenario)."
        },
        {
            "gameTime": "1 - 33:22",
            "label": "",
            "description": "Eduardo makes a brilliant save! Sebastian Rode (Bayern Munich) easily weaves through the defence and fires the ball from mid range. His effort goes towards the middle of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "1 - 31:45",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) shoots at goal from the free kick from some 28 metres out. His attempt was quite precise and another few inches and it would have ended up inside the left post."
        },
        {
            "gameTime": "1 - 30:29",
            "label": "y-card",
            "description": "Martin Strombergsson shows a yellow card to Goncalo (Din. Zagreb) for a tough tackle. Bayern Munich have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 29:23",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "1 - 28:58",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort."
        },
        {
            "gameTime": "1 - 26:42",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "1 - 25:45",
            "label": "corner",
            "description": "A dangerous looking corner kick from Ante Coric (Din. Zagreb) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 25:12",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Sven Ulreich is alert and denies him. The ball goes out of play. D. Zagreb are awarded a corner kick."
        },
        {
            "gameTime": "1 - 23:44",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) tries his luck with a shot from 24 metres out, but his effort goes high over the bar."
        },
        {
            "gameTime": "1 - 22:57",
            "label": "",
            "description": "Julian Green (Bayern Munich) gives away a foul for a clumsy challenge. Referee Martin Strombergsson saw the whole situation."
        },
        {
            "gameTime": "1 - 22:01",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 21:36",
            "label": "",
            "description": "An attempted cross from Joshua Kimmich (Bayern Munich) is cleared. The ball is out of play. A goal scoring opportunity from a corner for Bayern Munich."
        },
        {
            "gameTime": "1 - 20:47",
            "label": "",
            "description": "Robert Lewandowski almost gets into in a promising position, but the through ball by Joshua Kimmich (Bayern Munich) from just inside the box is intercepted by one of the defending players."
        },
        {
            "gameTime": "1 - 19:36",
            "label": "",
            "description": "The linesman signals that Franck Ribery (Bayern Munich) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 18:20",
            "label": "",
            "description": "Julian Green (Bayern Munich) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 16:54",
            "label": "",
            "description": "The Bayern Munich players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 15:57",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) collects a great pass inside the box and misses a golden opportunity. His low shot was directed into the middle of the goal, but the goalkeeper does well to stop his effort."
        },
        {
            "gameTime": "1 - 15:19",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) feels very aggrieved after the referee stops play for a foul that he commits while heading towards goal with the ball."
        },
        {
            "gameTime": "1 - 15:00",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 14:11",
            "label": "",
            "description": "Junior Fernandes (Din. Zagreb) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 13:13",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "1 - 12:20",
            "label": "",
            "description": "El Arbi Soudani (Din. Zagreb) is flagged for offside."
        },
        {
            "gameTime": "1 - 10:53",
            "label": "",
            "description": "Martin Strombergsson blows his whistle and it's Junior Fernandes (Din. Zagreb) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 10:14",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 09:44",
            "label": "",
            "description": "Julian Green (Bayern Munich) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. Bayern Munich force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 08:55",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) sends in a poor cross from the corner and Eduardo has no trouble gathering it."
        },
        {
            "gameTime": "1 - 08:14",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) shoots after his astonishing individual effort from about 20 metres out to the bottom left corner, but Eduardo shows his excellent skills and saves the attempt. The referee blows his whistle, Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "1 - 06:59",
            "label": "",
            "description": "Flag up against Junior Fernandes (Din. Zagreb). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 06:45",
            "label": "",
            "description": "A rebound falls to Domagoj Antolic (Din. Zagreb) who knows what to do with it. He drills a low shot from the edge of the penalty box, but Sven Ulreich anticipates his intention and denies him with a nice quick save."
        },
        {
            "gameTime": "1 - 06:41",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Ante Coric (Din. Zagreb), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 06:03",
            "label": "",
            "description": "Josip Pivaric (Din. Zagreb) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the roof of the net, but Sven Ulreich is alert and denies him with a nice save. The ball goes out of play. D. Zagreb are awarded a corner kick."
        },
        {
            "gameTime": "1 - 05:32",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) and Julian Green combine well with a quick one two and their attacking move continues."
        },
        {
            "gameTime": "1 - 05:12",
            "label": "",
            "description": "Neat passing move from Bayern Munich in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 03:23",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) jumps for a header from the resulting set piece, but it goes way wide of the right post."
        },
        {
            "gameTime": "1 - 02:57",
            "label": "corner",
            "description": "There's an opportunity for Xabi Alonso (Bayern Munich) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 02:43",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) fails to send a pass into the box as his effort is cut out. The ball is out of play. Bayern Munich will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 01:31",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "D. Zagreb will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Martin Strombergsson will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The Bayern Munich fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        }
    ],
    "gameAwayTeam": "Bayern Munich",
    "gameDate": "09/12/2015 - 22:45",
    "gameHomeTeam": "D. Zagreb",
    "gameScore": "0 - 2"
}