{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-08-29 - 17-00 Manchester City 2 - 0 Watford/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The hosts were superior today. The tactic of the home side was slow build up play, while the away team's main priority was a flawless defence."
        },
        {
            "gameTime": "2 - 47:24",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 47:20",
            "label": "",
            "description": "Miguel Layun (Watford) hammered the ball from a long range free kick only into the defensive wall."
        },
        {
            "gameTime": "2 - 46:39",
            "label": "",
            "description": "Watford have a free kick."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "Kelechi Iheanacho (Manchester City) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 45:26",
            "label": "",
            "description": "A cross from Allan Nyom (Watford) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:21",
            "label": "attendance",
            "description": "The attendance for today's match is 53,218."
        },
        {
            "gameTime": "2 - 43:33",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Raheem Sterling departs the field of play to be replaced by Kelechi Iheanacho (Manchester City)."
        },
        {
            "gameTime": "2 - 42:53",
            "label": "",
            "description": "A precise low pass is received by Miguel Layun (Watford), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the left post."
        },
        {
            "gameTime": "2 - 41:56",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Raheem Sterling (Manchester City)."
        },
        {
            "gameTime": "2 - 41:31",
            "label": "",
            "description": "Yaya Toure (Manchester City) unleashes a missile of a shot towards goal, but his good effort is blocked by one of the defenders. Manchester City will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "",
            "description": "Ikechi Anya (Watford) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 38:27",
            "label": "",
            "description": "A perfect long pass by Samir Nasri (Manchester City) finds Aleksandar Kolarov. He latches on to the pass and continues his attacking run."
        },
        {
            "gameTime": "2 - 34:56",
            "label": "",
            "description": "Miguel Layun (Watford) sends a cross into the box, but Joe Hart comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 34:21",
            "label": "",
            "description": "Watford are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "2 - 30:53",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Etienne Capoue trots off the pitch and is replaced by Ben Watson (Watford)."
        },
        {
            "gameTime": "2 - 30:09",
            "label": "",
            "description": "Aleksandar Kolarov sends a good ball to the edge of the box and Yaya Toure (Manchester City) gets in a shot which goes narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 29:01",
            "label": "substitution",
            "description": "Manuel Pellegrini has decided to introduce fresh legs, with Fabian Delph (Manchester City) replacing David Silva."
        },
        {
            "gameTime": "2 - 27:58",
            "label": "",
            "description": "Allan Nyom (Watford) swings a cross into the box, but it's far too close to Joe Hart, who smothers the ball."
        },
        {
            "gameTime": "2 - 27:14",
            "label": "",
            "description": "Sergio Aguero (Manchester City) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 26:33",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Miguel Layun (Watford) replaces Odion Ighalo."
        },
        {
            "gameTime": "2 - 25:31",
            "label": "",
            "description": "Allan Nyom (Watford) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 24:29",
            "label": "",
            "description": "Neat link up play between Raheem Sterling (Manchester City) and Samir Nasri, but Heurelho Gomes reads the game well and the move breaks down."
        },
        {
            "gameTime": "2 - 22:35",
            "label": "",
            "description": "That's a well taken pass by Yaya Toure (Manchester City). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 21:30",
            "label": "corner",
            "description": "Jose Manuel Jurado (Watford) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 21:05",
            "label": "",
            "description": "Ikechi Anya (Watford) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. Watford have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 20:24",
            "label": "",
            "description": "David Silva (Manchester City) tries to find Sergio Aguero, but he puts too much power on the pass. The ball is off of the pitch and it's a goal kick for Watford."
        },
        {
            "gameTime": "2 - 18:45",
            "label": "",
            "description": "A superb shot by David Silva (Manchester City) after a mid range free kick! His attempt, however, flies just over the crossbar."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "y-card",
            "description": "Sebastian Prodl (Watford) has tested the patience of referee Mark Clattenburg and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "substitution",
            "description": "The substitution is prepared. Ikechi Anya (Watford) joins the action as a substitute, replacing Almen Abdi."
        },
        {
            "gameTime": "2 - 15:53",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) gets a shot away from distance, but wasn't really set to take it and fires well wide of the left post."
        },
        {
            "gameTime": "2 - 15:26",
            "label": "",
            "description": "Raheem Sterling (Manchester City) sprays a pass out to Bacary Sagna, but he can't beat his man to get to the ball."
        },
        {
            "gameTime": "2 - 14:35",
            "label": "",
            "description": "Vincent Kompany (Manchester City) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but it goes well wide of the left post."
        },
        {
            "gameTime": "2 - 14:24",
            "label": "corner",
            "description": "Aleksandar Kolarov (Manchester City) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 14:13",
            "label": "",
            "description": "The ball is cleared after Aleksandar Kolarov (Manchester City) attempted to dribble past an opposing player. Manchester City earn a corner."
        },
        {
            "gameTime": "2 - 13:24",
            "label": "",
            "description": "Sergio Aguero (Manchester City) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Heurelho Gomes to get hold of the ball."
        },
        {
            "gameTime": "2 - 12:47",
            "label": "",
            "description": "Raheem Sterling (Manchester City) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "2 - 11:00",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from David Silva, who plays a vital role in the build up. He squares it to Fernandinho (Manchester City), who beats Heurelho Gomes with a brilliant shot into the left side of the net. 2:0."
        },
        {
            "gameTime": "2 - 09:45",
            "label": "",
            "description": "Yaya Toure (Manchester City) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 09:39",
            "label": "",
            "description": "Foul! Valon Behrami (Watford) is penalised for pulling back his opponent. Manchester City get a free kick."
        },
        {
            "gameTime": "2 - 08:09",
            "label": "",
            "description": "Samir Nasri (Manchester City) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "2 - 07:47",
            "label": "",
            "description": "Sebastian Prodl (Watford) pulls the jersey of one of the opposition players and Mark Clattenburg blows his whistle for a foul. A free kick to Manchester City."
        },
        {
            "gameTime": "2 - 06:44",
            "label": "corner",
            "description": "David Silva (Manchester City) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 06:24",
            "label": "",
            "description": "Bacary Sagna (Manchester City) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. Manchester City have a corner."
        },
        {
            "gameTime": "2 - 05:27",
            "label": "",
            "description": "Samir Nasri (Manchester City) fouls an opponent. At least that's what referee Mark Clattenburg signals."
        },
        {
            "gameTime": "2 - 05:12",
            "label": "",
            "description": "Jose Manuel Jurado (Watford) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 01:45",
            "label": "soccer-ball",
            "description": "Goal! Bacary Sagna puts a cross into the box and finds Raheem Sterling (Manchester City), who latches on to it and strikes the ball inside the right post. He makes it 1:0."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Manuel Pellegrini has made a change at the break. Samir Nasri (Manchester City) has come on in place of Jesus Navas."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "It wasn't the most inspiring 45 minutes that you'll see this week. Let's hope that the second period will be more exciting. The visitors played second fiddle to the home team in the first half. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 46:25",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:51",
            "label": "",
            "description": "Heurelho Gomes (Watford) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:03",
            "label": "",
            "description": "Raheem Sterling (Manchester City) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "1 - 43:00",
            "label": "y-card",
            "description": "Allan Nyom (Watford) makes an awful challenge on his opponent and can count himself very lucky that the referee didn't issue a red card."
        },
        {
            "gameTime": "1 - 41:40",
            "label": "",
            "description": "Jose Manuel Jurado (Watford) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "1 - 40:00",
            "label": "y-card",
            "description": "Mark Clattenburg shows a yellow card to Vincent Kompany (Manchester City) for his blatant foul."
        },
        {
            "gameTime": "1 - 38:55",
            "label": "",
            "description": "What a chance that is! Sergio Aguero (Manchester City) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 38:45",
            "label": "",
            "description": "Yaya Toure (Manchester City) takes a short free kick."
        },
        {
            "gameTime": "1 - 38:06",
            "label": "",
            "description": "Valon Behrami (Watford) should know this behaviour is beyond the rules. He was too careless with his challenge and left Mark Clattenburg no option but to blow his whistle. Manchester City have a free kick."
        },
        {
            "gameTime": "1 - 34:58",
            "label": "",
            "description": "A crossfield pass from Yaya Toure (Manchester City) fails to find any of his teammates. The ball goes out of play and Watford will have a goal kick."
        },
        {
            "gameTime": "1 - 34:32",
            "label": "",
            "description": "Sergio Aguero (Manchester City) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 33:48",
            "label": "",
            "description": "Allan Nyom (Watford) sends a teasing cross into the area, but Joe Hart intercepts the ball."
        },
        {
            "gameTime": "1 - 32:35",
            "label": "",
            "description": "Yaya Toure (Manchester City) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 31:38",
            "label": "",
            "description": "Raheem Sterling (Manchester City) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 31:03",
            "label": "",
            "description": "Bacary Sagna (Manchester City) sends an accurate pass to Jesus Navas, who controls the ball with a fine first touch."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "",
            "description": "A cross from a mid range free kick, taken by Manchester City, is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 28:18",
            "label": "",
            "description": "Valon Behrami (Watford) was too fierce in his attempt to get the ball from his opponent and Mark Clattenburg blows for a foul. It's a free kick to Manchester City, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 28:01",
            "label": "corner",
            "description": "David Silva (Manchester City) takes a short corner kick."
        },
        {
            "gameTime": "1 - 27:39",
            "label": "",
            "description": "Heurelho Gomes was forced into action to thwart Raheem Sterling (Manchester City). He found himself some space after latching on to a pass and unleashed a shot to the bottom left corner but couldn't beat the keeper. Manchester City will take a corner kick."
        },
        {
            "gameTime": "1 - 27:08",
            "label": "",
            "description": "A cross following the corner kick finds its way to Bacary Sagna (Manchester City), who manages to steer it to the bottom right corner. He is about to start celebrating a goal, but Heurelho Gomes makes a save in the nick of time to maintain the current score."
        },
        {
            "gameTime": "1 - 26:40",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 26:16",
            "label": "",
            "description": "Jesus Navas (Manchester City) shoots from outside the box, but his effort is blocked. Manchester City force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 25:30",
            "label": "",
            "description": "A player from Manchester City commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "1 - 24:54",
            "label": "corner",
            "description": "David Silva (Manchester City) will take the corner."
        },
        {
            "gameTime": "1 - 23:42",
            "label": "",
            "description": "Raheem Sterling (Manchester City) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. Corner kick. Manchester City will have an opportunity."
        },
        {
            "gameTime": "1 - 22:18",
            "label": "",
            "description": "David Silva (Manchester City) plays a one two with Raheem Sterling, but the move breaks down."
        },
        {
            "gameTime": "1 - 21:46",
            "label": "",
            "description": "A superb shot by Aleksandar Kolarov (Manchester City) after a long range free kick! His attempt, however, flies just over the crossbar."
        },
        {
            "gameTime": "1 - 19:38",
            "label": "",
            "description": "Odion Ighalo (Watford) gives away a foul for a fierce tackle on an opponent. A free kick has been awarded to Manchester City."
        },
        {
            "gameTime": "1 - 18:45",
            "label": "",
            "description": "Mark Clattenburg blows his whistle and signals a foul after David Silva (Manchester City) brought his opponent down."
        },
        {
            "gameTime": "1 - 17:56",
            "label": "corner",
            "description": "David Silva (Manchester City) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 17:22",
            "label": "",
            "description": "Sergio Aguero received a clever long ball from Aleksandar Kolarov (Manchester City) which could have put him in a promising position, but the defence was alert and managed to avert the threat. The ball goes out of play. Manchester City are awarded a corner kick. Manchester City force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 16:51",
            "label": "corner",
            "description": "The resulting corner from David Silva (Manchester City) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 16:00",
            "label": "",
            "description": "Jesus Navas (Manchester City) sends a cross in and finds Raheem Sterling inside the box, but one of the defenders steps in and clears the danger. It will be a corner kick for Manchester City."
        },
        {
            "gameTime": "1 - 15:48",
            "label": "corner",
            "description": "The corner kick from Jose Manuel Jurado (Watford) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 15:03",
            "label": "",
            "description": "Jose Manuel Jurado (Watford) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort. Now Watford have a corner."
        },
        {
            "gameTime": "1 - 14:42",
            "label": "corner",
            "description": "Corner kick. Jose Manuel Jurado (Watford) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 14:16",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Valon Behrami (Watford). The ball goes out of play. Watford are awarded a corner kick."
        },
        {
            "gameTime": "1 - 13:01",
            "label": "",
            "description": "Sergio Aguero (Manchester City) is flagged for offside."
        },
        {
            "gameTime": "1 - 09:00",
            "label": "",
            "description": "David Silva (Manchester City) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 07:26",
            "label": "",
            "description": "Troy Deeney (Watford) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 07:05",
            "label": "",
            "description": "Sergio Aguero (Manchester City) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 05:45",
            "label": "",
            "description": "Jose Manuel Jurado (Watford) passes the ball onto Odion Ighalo, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 04:38",
            "label": "",
            "description": "Yaya Toure (Manchester City) commits a rough challenge and Mark Clattenburg blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 01:55",
            "label": "corner",
            "description": "David Silva (Manchester City) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "",
            "description": "David Silva (Manchester City) fails to find any of his teammates inside the box as his pass is blocked. The ball goes behind for a corner. Manchester City will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 01:23",
            "label": "",
            "description": "Vincent Kompany (Manchester City) shows his brilliant passing ability after picking out Raheem Sterling with a fine lofted pass."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Watford will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Mark Clattenburg."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The hosts were superior today. The tactic of the home side was slow build up play, while the away team's main priority was a flawless defence."
        }
    ],
    "gameAwayTeam": "Watford",
    "gameDate": "29/08/2015 - 17:00",
    "gameHomeTeam": "Manchester City",
    "gameScore": "2 - 0"
}