{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-11-06 - 22-45 AS Roma 3 - 0 Bologna/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side were superior in this game. Both teams attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 46:02",
            "label": "",
            "description": "Piero Giacomelli blows his whistle and signals a foul after Stephan El Shaarawy (AS Roma) brought his opponent down."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 42:31",
            "label": "",
            "description": "The linesman signals that Mattia Destro (Bologna) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 39:27",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to substitute Mohamed Salah and he is replaced by Stephan El Shaarawy (AS Roma)."
        },
        {
            "gameTime": "2 - 38:57",
            "label": "substitution",
            "description": "Substitution. Vassilios Torosidis (Bologna) replaces Adam Masina."
        },
        {
            "gameTime": "2 - 37:43",
            "label": "",
            "description": "Edin Dzeko (AS Roma) receives a well played pass inside the penalty area and shoots. He sends the ball into orbit."
        },
        {
            "gameTime": "2 - 36:53",
            "label": "",
            "description": "Mohamed Salah (AS Roma) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "corner",
            "description": "Ladislav Krejci (Bologna) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 34:14",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from 24 metres out by Federico Viviani (Bologna) as his effort only hit the wall. Bologna force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "",
            "description": "Juan Jesus (AS Roma) trips an opponent with a slide tackle. Piero Giacomelli stops the game and he could give him a card, but eventually decides on just a warning. Bologna win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 33:17",
            "label": "",
            "description": "Diego Perotti (AS Roma) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 31:40",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Gerson (AS Roma) will replace Bruno Peres."
        },
        {
            "gameTime": "2 - 30:27",
            "label": "corner",
            "description": "Ladislav Krejci (Bologna) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 30:19",
            "label": "",
            "description": "Erick Pulgar (Bologna) fashions a shot from the edge of the box after receiving an accurate pass. Wojciech Szczesny makes a stunning save to stop the effort from flying into the bottom right corner. The referee and his assistant both point at the corner flag. Bologna will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 27:25",
            "label": "",
            "description": "What a poor attempt! Federico Viviani (Bologna) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes miles wide to the right."
        },
        {
            "gameTime": "2 - 25:37",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Mohamed Salah (AS Roma) and he fired home from close range. The score is 3:0."
        },
        {
            "gameTime": "2 - 25:35",
            "label": "",
            "description": "Edin Dzeko (AS Roma) shoots from the edge of the penalty area. The ball travels towards the bottom right corner, but Angelo da Costa easily deals with the threat."
        },
        {
            "gameTime": "2 - 24:33",
            "label": "",
            "description": "The referee blows his whistle as Juan Jesus (AS Roma) was too aggressive in his challenge."
        },
        {
            "gameTime": "2 - 22:07",
            "label": "",
            "description": "Piero Giacomelli blows his whistle. Daniele De Rossi (AS Roma) commits a foul after dangerous play."
        },
        {
            "gameTime": "2 - 19:36",
            "label": "substitution",
            "description": "The substitution has been made. Erick Pulgar (Bologna) has replaced Saphir Taider."
        },
        {
            "gameTime": "2 - 18:25",
            "label": "y-card",
            "description": "The foul by Leandro Paredes (AS Roma) is worthy of a card and a yellow is duly shown by Piero Giacomelli."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "soccer-ball",
            "description": "Mohamed Salah (AS Roma) receives a killer pass, finds himself one on one with the goalkeeper and coolly sends the ball into the back of the net."
        },
        {
            "gameTime": "2 - 16:42",
            "label": "",
            "description": "Edin Dzeko (AS Roma) connects with the corner but his looping header goes well over."
        },
        {
            "gameTime": "2 - 16:39",
            "label": "corner",
            "description": "Mohamed Salah (AS Roma) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 16:22",
            "label": "",
            "description": "Diego Perotti (AS Roma) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. The ball is out of play. AS Roma will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 14:55",
            "label": "",
            "description": "Mohamed Salah (AS Roma) runs with the ball towards the keeper and pulls the trigger from close range, but Angelo da Costa anticipates his intention and makes an amazing save to stop the shot going into the bottom left corner."
        },
        {
            "gameTime": "2 - 13:42",
            "label": "",
            "description": "Federico Viviani (Bologna) gets a shot away from distance, but wasn't really set to take it and fires high and wide."
        },
        {
            "gameTime": "2 - 12:08",
            "label": "",
            "description": "Federico Viviani (Bologna) hammers the ball towards goal from long range, but one of the defenders reacts brilliantly to block the shot."
        },
        {
            "gameTime": "2 - 11:55",
            "label": "substitution",
            "description": "Here comes a substitution. Antonio Rudiger is given a rest as he is replaced by Leandro Paredes (AS Roma)."
        },
        {
            "gameTime": "2 - 09:29",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 09:07",
            "label": "",
            "description": "Mohamed Salah (AS Roma) misses a good chance to score. An inch perfect cross into the box finds Mohamed Salah (AS Roma) who rises for a header, but sends the ball well over the bar. The ball goes out for a corner. AS Roma can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 08:11",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Ladislav Krejci (Bologna) takes it short."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "",
            "description": "Saphir Taider (Bologna) sends a lofted cross into the box which is headed clear. The ball is out of play. A goal scoring opportunity from a corner for Bologna."
        },
        {
            "gameTime": "2 - 06:28",
            "label": "",
            "description": "Mattia Destro (Bologna) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 04:39",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Sadiq Umar departs the field of play to be replaced by Mattia Destro (Bologna)."
        },
        {
            "gameTime": "2 - 04:15",
            "label": "",
            "description": "Edin Dzeko (AS Roma) beats a few defenders in the penalty area and drives a low shot towards the right side of the goal, but the goalkeeper reacts superbly to make a wonderful save."
        },
        {
            "gameTime": "2 - 03:25",
            "label": "",
            "description": "Adam Masina (Bologna) shoots from the edge of the penalty area. The ball travels towards the crossbar, but Wojciech Szczesny easily deals with the threat."
        },
        {
            "gameTime": "2 - 02:34",
            "label": "corner",
            "description": "Mohamed Salah (AS Roma) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence. The referee blows his whistle, AS Roma are awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:53",
            "label": "",
            "description": "Edin Dzeko (AS Roma) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort. AS Roma will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 01:05",
            "label": "",
            "description": "Ladislav Krejci (Bologna) fires a powerful shot which is blocked."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Piero Giacomelli starts the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The fans in the stadium won't regret buying tickets for today's game as they have witnessed a great game so far, and nothing suggests it's going to change in the second half. We are witnessing quite a balanced game with both teams struggling to prevail. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 47:01",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:14",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Emil Krafth (Bologna)."
        },
        {
            "gameTime": "1 - 45:06",
            "label": "",
            "description": "Federico Viviani (Bologna) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 43:57",
            "label": "injury",
            "description": "Federico Viviani (Bologna) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 42:39",
            "label": "",
            "description": "Diego Perotti (AS Roma) receives a precise pass on the edge of the box and releases a promising effort. Unfortunately for him, his strike flies painfully close to the right post."
        },
        {
            "gameTime": "1 - 41:54",
            "label": "",
            "description": "Bruno Peres (AS Roma) finds space on the edge of the box, but his wild shot goes high over the bar."
        },
        {
            "gameTime": "1 - 39:29",
            "label": "",
            "description": "Sadiq Umar (Bologna) gets on the end of a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Wojciech Szczesny pulls off an easy save."
        },
        {
            "gameTime": "1 - 38:33",
            "label": "",
            "description": "Juan Jesus (AS Roma) produces a good strike that sails to the bottom left corner, but the goalkeeper shows great reflexes and dives to keep the effort from hitting the net."
        },
        {
            "gameTime": "1 - 36:54",
            "label": "",
            "description": "Blerim Dzemaili (Bologna) unleashes a shot from the edge of the box, but it goes straight at Wojciech Szczesny."
        },
        {
            "gameTime": "1 - 35:38",
            "label": "",
            "description": "Sadiq Umar (Bologna) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 33:54",
            "label": "injury",
            "description": "The game is interrupted now, Sadiq Umar (Bologna) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 33:34",
            "label": "",
            "description": "Sadiq Umar (Bologna) forces a pass into the box, but Wojciech Szczesny is alert and does a great job to rob him of the ball."
        },
        {
            "gameTime": "1 - 32:31",
            "label": "",
            "description": "Piero Giacomelli blows for a foul after Radja Nainggolan (AS Roma) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 30:44",
            "label": "",
            "description": "Saphir Taider (Bologna) receives a lofted pass from out wide and shoots from close range, but the ball flies way wide of the right hand post."
        },
        {
            "gameTime": "1 - 29:58",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) collects a pass on the edge of the box but he slips the ball just wide of the right post."
        },
        {
            "gameTime": "1 - 28:40",
            "label": "",
            "description": "Sadiq Umar (Bologna) unleashes a decent shot towards the roof of the net, but Wojciech Szczesny thwarts him with a nice save."
        },
        {
            "gameTime": "1 - 26:50",
            "label": "",
            "description": "The ball has crossed the sideline. AS Roma are taking a throw in."
        },
        {
            "gameTime": "1 - 23:18",
            "label": "",
            "description": "Ladislav Krejci (Bologna) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 23:02",
            "label": "",
            "description": "Foul! Juan Jesus (AS Roma) is penalised for pulling back his opponent."
        },
        {
            "gameTime": "1 - 21:19",
            "label": "",
            "description": "Mohamed Salah (AS Roma) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Piero Giacomelli with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 21:07",
            "label": "",
            "description": "Diego Perotti (AS Roma) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 19:46",
            "label": "",
            "description": "The AS Roma players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 16:32",
            "label": "",
            "description": "Diego Perotti (AS Roma) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the left post."
        },
        {
            "gameTime": "1 - 14:08",
            "label": "",
            "description": "Piero Giacomelli blows his whistle as Sadiq Umar (Bologna) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 13:59",
            "label": "corner",
            "description": "Ladislav Krejci (Bologna) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 13:30",
            "label": "",
            "description": "A lofted cross from Saphir Taider (Bologna) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Corner kick. Bologna will have an opportunity."
        },
        {
            "gameTime": "1 - 12:31",
            "label": "soccer-ball",
            "description": "Goal! Mohamed Salah (AS Roma) picks up the ball inside the box, finds himself in a good position and fires in a shot which is deflected past Angelo da Costa. He makes it 1:0."
        },
        {
            "gameTime": "1 - 10:31",
            "label": "",
            "description": "Edin Dzeko (AS Roma) finds himself with a great opportunity! He unleashes a shot from the edge of the box, which whizzes just wide of the right post!"
        },
        {
            "gameTime": "1 - 10:06",
            "label": "",
            "description": "Ladislav Krejci (Bologna) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "1 - 08:43",
            "label": "",
            "description": "Diego Perotti (AS Roma) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from the edge of the box by Daniele De Rossi (AS Roma) as his effort only hit the wall."
        },
        {
            "gameTime": "1 - 06:16",
            "label": "",
            "description": "Adam Nagy (Bologna) jumps into a tackle and Piero Giacomelli blows his whistle for a foul. AS Roma are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 04:57",
            "label": "corner",
            "description": "Federico Viviani (Bologna) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 04:25",
            "label": "",
            "description": "Federico Viviani (Bologna) puts a cross into the box from the free kick, but the defender gets there first. Bologna force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 04:02",
            "label": "",
            "description": "Dangerous play by Antonio Rudiger (AS Roma). Piero Giacomelli blows his whistle for a foul. A free kick is awarded to Bologna."
        },
        {
            "gameTime": "1 - 03:28",
            "label": "corner",
            "description": "Ladislav Krejci (Bologna) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 02:59",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Adam Nagy (Bologna), is intercepted by the opposition's defence. The ball goes out of play and Bologna have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 01:17",
            "label": "",
            "description": "Ladislav Krejci (Bologna) receives a precise pass inside the box and takes a shot that flies just wide of the right post."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. AS Roma will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Piero Giacomelli will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bologna haven't won for 6 matches in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko is the leading goal scorer for AS Roma with 12 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side were superior in this game. Both teams attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Bologna",
    "gameDate": "06/11/2016 - 22:45",
    "gameHomeTeam": "AS Roma",
    "gameScore": "3 - 0"
}