{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-04-26 - 20-30 Barcelona 7 - 1 Osasuna/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:00",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 45:39",
            "label": "attendance",
            "description": "The attendance for today's match is 63989."
        },
        {
            "gameTime": "2 - 45:12",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Ivan Rakitic (Barcelona) takes it short."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 40:15",
            "label": "soccer-ball",
            "description": "Goal! Denis Suarez displays great vision and sends a pass to Alcacer Paco (Barcelona), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 7:1."
        },
        {
            "gameTime": "2 - 40:10",
            "label": "",
            "description": "Carles Alena (Barcelona) got on the ball on the edge of the box and blazed a first time shot well over the bar."
        },
        {
            "gameTime": "2 - 36:03",
            "label": "corner",
            "description": "Roberto Torres (Osasuna) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 33:54",
            "label": "substitution",
            "description": "That's the end of the game for Fran Merida, who is replaced by Goran Causic (Osasuna)."
        },
        {
            "gameTime": "2 - 29:30",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Ivan Rakitic (Barcelona), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 27:35",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 27:26",
            "label": "substitution",
            "description": "Petar Vasiljevic has decided to make a change. Kenan Kodro (Osasuna) replaces Sergio Leon."
        },
        {
            "gameTime": "2 - 26:20",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Jaime Romero as he is replaced by Miguel Olavide (Osasuna)."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "soccer-ball",
            "description": "Javier Mascherano (Barcelona) steps up to take the penalty and converts it with a shot into the roof of the net."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "",
            "description": "Javier Mascherano (Barcelona) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 21:45",
            "label": "penalty",
            "description": "Fran Merida (Osasuna) trips an opponent with a slide tackle. Jose Luis Munuera Montero stops the game and he could give him a card, but eventually decides on just a warning. A penalty is awarded to Barcelona!"
        },
        {
            "gameTime": "2 - 18:58",
            "label": "soccer-ball",
            "description": "GOAL! Alcacer Paco (Barcelona) collects a pass and from inside the box he lifts the ball over Salvatore Sirigu, who was off his line. What a finish that is! 5:1."
        },
        {
            "gameTime": "2 - 18:30",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 17:13",
            "label": "substitution",
            "description": "The referee signals a substitution. Carles Alena (Barcelona) is brought on as a substitute for Lionel Messi."
        },
        {
            "gameTime": "2 - 15:06",
            "label": "soccer-ball",
            "description": "Lionel Messi (Barcelona) receives a great pass from his teammate and strikes a very powerful shot towards goal that goes inside of the right post!"
        },
        {
            "gameTime": "2 - 11:45",
            "label": "soccer-ball",
            "description": "Goal! Andre Gomes (Barcelona) fires the rebound into the bottom right corner after the ball breaks to him in the box. The score is 3:1."
        },
        {
            "gameTime": "2 - 11:40",
            "label": "",
            "description": "Corner kick falls to Gerard Pique (Barcelona), who attempts to finish. Luck is not on his side today as the ball crashes against the right post."
        },
        {
            "gameTime": "2 - 11:30",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 11:19",
            "label": "",
            "description": "Gerard Pique (Barcelona) gets himself onto the end of the corner, but his header is blocked. The ball is out of play. A goal scoring opportunity from a corner for Barcelona."
        },
        {
            "gameTime": "2 - 11:10",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) will take the corner."
        },
        {
            "gameTime": "2 - 10:36",
            "label": "",
            "description": "Lionel Messi (Barcelona) is having a lively performance. He is causing problems and wanting the ball at every opportunity."
        },
        {
            "gameTime": "2 - 04:55",
            "label": "",
            "description": "Javier Mascherano (Barcelona) meets a nice cross deep inside the 18 yard box and produces a fine header towards the right post, but the goalkeeper is well positioned and punches the ball away, deflecting it onto the post."
        },
        {
            "gameTime": "2 - 04:37",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 02:26",
            "label": "soccer-ball",
            "description": "It's a goal! Roberto Torres (Osasuna) scores a beautiful goal from the resulting free kick. The ball ends up inside the left post. Superb strike!"
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 45:03",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 44:40",
            "label": "",
            "description": "Sergio Leon (Osasuna) and Antonio Fausto attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 39:06",
            "label": "",
            "description": "Alcacer Paco (Barcelona) leaps highest around the penalty spot to meet a cross from the free kick and produces a promising goal bound header towards the right post, but Salvatore Sirigu pulls off a fine save to deny him."
        },
        {
            "gameTime": "1 - 36:38",
            "label": "",
            "description": "Salvatore Sirigu doesn't have to worry about that one. Javier Mascherano puts a cross in towards Arda Turan (Barcelona), who is unable to keep his header on target from the centre of the box. He sends the ball well wide of the left post."
        },
        {
            "gameTime": "1 - 32:56",
            "label": "",
            "description": "Andre Gomes (Barcelona) fails to beat the offside trap. The flag goes up and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 29:34",
            "label": "soccer-ball",
            "description": "Goal! Andre Gomes (Barcelona) unleashes a first time shot from inside the box and beats the goalkeeper inside the right post. 2:0."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 29:22",
            "label": "",
            "description": "Lionel Messi (Barcelona) blasts the ball from just outside the box, but his attempt is blocked by the defender. Barcelona get a corner."
        },
        {
            "gameTime": "1 - 25:31",
            "label": "",
            "description": "A promising first time strike from inside the box by Lionel Messi (Barcelona), but his attempt goes just wide of the target."
        },
        {
            "gameTime": "1 - 25:00",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) sends an accurate pass to Andre Gomes, who controls the ball with a fine first touch."
        },
        {
            "gameTime": "1 - 19:14",
            "label": "",
            "description": "The Barcelona players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 15:24",
            "label": "corner",
            "description": "The corner from Ivan Rakitic (Barcelona) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 14:08",
            "label": "corner",
            "description": "The resulting corner from Ivan Rakitic (Barcelona) comes to nothing."
        },
        {
            "gameTime": "1 - 13:52",
            "label": "",
            "description": "Lucas Digne (Barcelona) volleys the ball towards goal from the edge of the penalty box, but one of the defenders blocks his shot. Barcelona force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 12:00",
            "label": "soccer-ball",
            "description": "Goal! Lionel Messi (Barcelona) skips past challenges and from close range brilliantly chips the ball over Salvatore Sirigu. 1:0. Wonderful individual effort."
        },
        {
            "gameTime": "1 - 08:27",
            "label": "",
            "description": "Javier Mascherano (Barcelona) sends a long ball in, but Salvatore Sirigu comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 08:08",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 04:14",
            "label": "",
            "description": "Flag goes up against Sergio Leon (Osasuna) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jose Luis Munuera Montero will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sergio Leon is the biggest threat to an opponent! He has already scored 10 goals and is top scorer in this Osasuna team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 3:2 in the last game between Barcelona and Real Madrid."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The match has just finished."
        }
    ],
    "gameAwayTeam": "Osasuna",
    "gameDate": "26/04/2017 - 20:30",
    "gameHomeTeam": "Barcelona",
    "gameScore": "7 - 1"
}