{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2014-2015/2015-04-29 - 21-45 Juventus 3 - 2 Fiorentina/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The superiority of the home team was evident on the pitch today. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 49:17",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 48:38",
            "label": "",
            "description": "Luca Banti has a clear sight and sees a foul from Josip Ilicic (Fiorentina)."
        },
        {
            "gameTime": "2 - 46:21",
            "label": "",
            "description": "Alberto Gilardino (Fiorentina) gives away a foul for a clumsy challenge. Referee Luca Banti saw the whole situation."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:52",
            "label": "soccer-ball",
            "description": "Josip Ilicic (Fiorentina) can showcase his brilliant free kick ability, particularly from a distance like this. He hits the ball perfectly and it ends up inside the left post."
        },
        {
            "gameTime": "2 - 43:44",
            "label": "",
            "description": "Carlos Tevez (Juventus) brings his opponent down with a tackle and Luca Banti blows his whistle for a foul. A free kick has been awarded to Fiorentina."
        },
        {
            "gameTime": "2 - 43:21",
            "label": "",
            "description": "The linesman signals a throw in for Fiorentina."
        },
        {
            "gameTime": "2 - 43:06",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) finds some space to control the ball from the corner and shoots, but his attempt goes way wide of the right post."
        },
        {
            "gameTime": "2 - 42:54",
            "label": "corner",
            "description": "Claudio Marchisio (Juventus) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "2 - 42:20",
            "label": "",
            "description": "Carlos Tevez (Juventus) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. The ball goes out for a corner. Juventus can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 41:49",
            "label": "",
            "description": "Arturo Vidal (Juventus) threads a pass through the eye of a needle into the box for Carlos Tevez, but Neto displays great awareness to stop him."
        },
        {
            "gameTime": "2 - 40:58",
            "label": "",
            "description": "Claudio Marchisio (Juventus) attempts to find one of his teammates with a cross from the resultant free kick, but he fails to hit the ball properly and sends it off the pitch."
        },
        {
            "gameTime": "2 - 40:26",
            "label": "",
            "description": "Claudio Marchisio (Juventus) will take the free kick."
        },
        {
            "gameTime": "2 - 40:13",
            "label": "",
            "description": "Luca Banti blows his whistle. Josip Ilicic (Fiorentina) commits a foul after dangerous play."
        },
        {
            "gameTime": "2 - 39:46",
            "label": "",
            "description": "Gonzalo Rodriguez (Fiorentina) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play."
        },
        {
            "gameTime": "2 - 39:05",
            "label": "",
            "description": "Dangerous play by Alberto Gilardino (Fiorentina). Luca Banti blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 37:30",
            "label": "",
            "description": "Carlos Tevez (Juventus) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 35:57",
            "label": "substitution",
            "description": "Mohamed Salah comes off the pitch to be replaced by Josip Ilicic (Fiorentina)."
        },
        {
            "gameTime": "2 - 35:35",
            "label": "",
            "description": "The Fiorentina players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "2 - 32:51",
            "label": "",
            "description": "The ball is out of play. Fiorentina will take a throw in."
        },
        {
            "gameTime": "2 - 31:42",
            "label": "substitution",
            "description": "Here is a change. Stefano Sturaro is going off and Massimiliano Allegri gives the last tactical orders to Simone Padoin (Juventus)."
        },
        {
            "gameTime": "2 - 31:16",
            "label": "",
            "description": "Stefan Savic (Fiorentina) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "2 - 30:58",
            "label": "substitution",
            "description": "The manager makes a subsitution with Borja Valero (Fiorentina) coming on for Matias Fernandez."
        },
        {
            "gameTime": "2 - 30:23",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Alberto Aquilani (Fiorentina) was quite harsh and Luca Banti didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 28:15",
            "label": "",
            "description": "Jose Basanta (Fiorentina) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "",
            "description": "Alberto Aquilani (Fiorentina) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 25:40",
            "label": "substitution",
            "description": "Vincenzo Montella has decided to introduce fresh legs, with Alberto Gilardino (Fiorentina) replacing Mario Gomez."
        },
        {
            "gameTime": "2 - 24:56",
            "label": "substitution",
            "description": "Today's match ends for Roberto Pereyra who will be replaced by Angelo Ogbonna (Juventus)."
        },
        {
            "gameTime": "2 - 24:37",
            "label": "soccer-ball",
            "description": "Amazing piece of skill! Carlos Tevez (Juventus) picks up a cross on the edge of the 18 yard box and hammers the ball precisely into the bottom left corner. What a finish!"
        },
        {
            "gameTime": "2 - 22:54",
            "label": "",
            "description": "The ball is out of play. Juventus will have a throw in."
        },
        {
            "gameTime": "2 - 21:19",
            "label": "penalty-missed",
            "description": "Gonzalo Rodriguez (Fiorentina) can't convert the spot kick. It goes narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 21:05",
            "label": "",
            "description": "Gonzalo Rodriguez (Fiorentina) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 20:39",
            "label": "penalty",
            "description": "Giorgio Chiellini (Juventus) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Luca Banti blows for the foul but keeps his cards in his pocket on this occasion. Fiorentina are about to take a penalty!"
        },
        {
            "gameTime": "2 - 19:05",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 18:15",
            "label": "",
            "description": "Claudio Marchisio (Juventus) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 17:56",
            "label": "",
            "description": "The ball has crossed the sideline. Fiorentina are taking a throw in."
        },
        {
            "gameTime": "2 - 17:01",
            "label": "injury",
            "description": "Claudio Marchisio (Juventus) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 15:22",
            "label": "corner",
            "description": "Joaquin (Fiorentina) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 15:06",
            "label": "",
            "description": "Joaquin (Fiorentina) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. The referee blows his whistle, Fiorentina are awarded a corner kick."
        },
        {
            "gameTime": "2 - 12:30",
            "label": "",
            "description": "Stefan Savic (Fiorentina) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "2 - 11:03",
            "label": "",
            "description": "Stefan Savic (Fiorentina) sends a cross in and finds Stephan Lichtsteiner inside the box, but one of the defenders steps in and clears the danger."
        },
        {
            "gameTime": "2 - 10:28",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Andrea Pirlo will be replaced by Arturo Vidal (Juventus)."
        },
        {
            "gameTime": "2 - 09:09",
            "label": "corner",
            "description": "Fiorentina take a short corner kick."
        },
        {
            "gameTime": "2 - 08:36",
            "label": "",
            "description": "This shall not pass! Alberto Aquilani (Fiorentina) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. The ball goes behind for a corner. Fiorentina will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 06:48",
            "label": "",
            "description": "The game is interrupted as Fernando Llorente (Juventus) is flagged offside."
        },
        {
            "gameTime": "2 - 04:51",
            "label": "",
            "description": "Mohamed Salah (Fiorentina) receives a reproachful look from Mario Gomez. He latches on to his pass, but the effort from the edge of the box sails high over the crossbar."
        },
        {
            "gameTime": "2 - 03:52",
            "label": "y-card",
            "description": "The referee gives a yellow card to Patrice Evra (Juventus)."
        },
        {
            "gameTime": "2 - 03:51",
            "label": "",
            "description": "Patrice Evra (Juventus) brings his opponent down. Luca Banti has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 03:44",
            "label": "",
            "description": "Claudio Marchisio (Juventus) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 03:08",
            "label": "",
            "description": "The ball is cleared after Marcos Alonso (Fiorentina) attempted to dribble past an opposing player. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "2 - 01:24",
            "label": "",
            "description": "The ball is behind the touchline and Juventus will take a throw in."
        },
        {
            "gameTime": "2 - 01:05",
            "label": "corner",
            "description": "Matias Fernandez (Fiorentina) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 00:37",
            "label": "",
            "description": "Joaquin (Fiorentina) looks to break free, but an opposing player clears the ball away. Now Fiorentina have a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Luca Banti blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Both sides have been very active in the first half, providing the fans with an exciting show. There wasn't any evident superiority by either side during the first half. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:11",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:44",
            "label": "soccer-ball",
            "description": "Goal! Patrice Evra clips a neat ball into the box in the direction of Carlos Tevez (Juventus), who jumps highest and steers a bullet header from the centre of the box into the bottom left corner. Neto had no chance of stopping that. 2:1."
        },
        {
            "gameTime": "1 - 43:45",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 43:21",
            "label": "corner",
            "description": "Alberto Aquilani (Fiorentina) works the corner short."
        },
        {
            "gameTime": "1 - 43:11",
            "label": "",
            "description": "Matias Fernandez (Fiorentina) races towards goal but the defender gets back well to make a challenge. The linesman points to the corner flag, Fiorentina are going to take it."
        },
        {
            "gameTime": "1 - 42:39",
            "label": "corner",
            "description": "Matias Fernandez (Fiorentina) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 42:21",
            "label": "",
            "description": "Matias Fernandez (Fiorentina) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. The ball is out of play and the linesman points at the corner flag. Corner to Fiorentina."
        },
        {
            "gameTime": "1 - 42:07",
            "label": "corner",
            "description": "Fiorentina quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "1 - 41:56",
            "label": "",
            "description": "Fiorentina spell of possession comes to an end after a mistake. The linesman makes the right call and Fiorentina will have a corner."
        },
        {
            "gameTime": "1 - 40:40",
            "label": "",
            "description": "Flag up against Claudio Marchisio (Juventus). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 39:22",
            "label": "",
            "description": "Excellent touch by Mohamed Salah (Fiorentina)! He latches on to a precise pass on the edge of the box and produces a shot goalwards which goes way wide of the left post."
        },
        {
            "gameTime": "1 - 38:15",
            "label": "",
            "description": "What a great chance for Patrice Evra (Juventus). He times his jump superbly when he leaps high to meet a precise cross from the corner, directing his towering header right under the bar, but the goalkeeper denies him with a miraculous save."
        },
        {
            "gameTime": "1 - 38:04",
            "label": "corner",
            "description": "Andrea Pirlo (Juventus) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 37:49",
            "label": "y-card",
            "description": "Gonzalo Rodriguez (Fiorentina) is booked for saying more than Luca Banti was willing to tolerate."
        },
        {
            "gameTime": "1 - 37:18",
            "label": "",
            "description": "Fernando Llorente (Juventus) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball goes out of play. Juventus are awarded a corner kick."
        },
        {
            "gameTime": "1 - 36:56",
            "label": "",
            "description": "Matias Fernandez (Fiorentina) makes a rough challenge and Luca Banti blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 35:41",
            "label": "soccer-ball",
            "description": "Perfectly taken free kick! Andrea Pirlo sends a cross in and Fernando Llorente (Juventus) leaps high to connect with it on the edge of the 6 yard box. His close range header goes low inside the right post and the score changes to 1:1."
        },
        {
            "gameTime": "1 - 35:10",
            "label": "",
            "description": "Andrea Pirlo (Juventus) takes a direct free kick."
        },
        {
            "gameTime": "1 - 34:56",
            "label": "y-card",
            "description": "Luca Banti shows a yellow card to Neto (Fiorentina), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 32:54",
            "label": "soccer-ball",
            "description": "Gonzalo Rodriguez (Fiorentina) leaves the keeper helpless with his precise penalty shot into the top right corner."
        },
        {
            "gameTime": "1 - 32:50",
            "label": "",
            "description": "Gonzalo Rodriguez (Fiorentina) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 31:42",
            "label": "penalty",
            "description": "Andrea Pirlo (Juventus) fouls an opponent. At least that's what referee Luca Banti signals. Fiorentina are given a huge opportunity to score it's a penalty kick!"
        },
        {
            "gameTime": "1 - 31:30",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Matias Fernandez (Fiorentina) takes it short."
        },
        {
            "gameTime": "1 - 31:15",
            "label": "",
            "description": "Marcos Alonso (Fiorentina) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. Fiorentina force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 29:46",
            "label": "",
            "description": "Marcos Alonso (Fiorentina) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 28:39",
            "label": "",
            "description": "Half chance! Matias Fernandez (Fiorentina) plays a pass into the box, but Gianluigi Buffon reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 28:14",
            "label": "",
            "description": "Luca Banti blows his whistle and it's Giorgio Chiellini (Juventus) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 28:03",
            "label": "corner",
            "description": "Andrea Pirlo (Juventus) will take a corner kick."
        },
        {
            "gameTime": "1 - 27:50",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 25:51",
            "label": "corner",
            "description": "The resulting corner from Matias Fernandez (Fiorentina) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 25:28",
            "label": "",
            "description": "Mario Gomez (Fiorentina) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Fiorentina have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 25:15",
            "label": "",
            "description": "Luca Banti blows for a foul after Marcos Alonso (Fiorentina) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 23:57",
            "label": "",
            "description": "The linesman raises his flag. Mario Gomez (Fiorentina) is adjudged offside."
        },
        {
            "gameTime": "1 - 22:10",
            "label": "",
            "description": "Mario Gomez (Fiorentina) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 20:33",
            "label": "",
            "description": "A precise low pass is received by Matias Fernandez (Fiorentina), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the left post."
        },
        {
            "gameTime": "1 - 19:21",
            "label": "",
            "description": "Fernando Llorente (Juventus) latches on to a precise pass and finds himself one on one with the keeper, but his effort is straight at Neto, who is alert and makes an easy save to deny him."
        },
        {
            "gameTime": "1 - 18:08",
            "label": "",
            "description": "Some patient build up play from Juventus as they look to unlock the defence."
        },
        {
            "gameTime": "1 - 16:55",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Juventus was in an offside position."
        },
        {
            "gameTime": "1 - 15:29",
            "label": "corner",
            "description": "Andrea Pirlo (Juventus) takes a short corner kick."
        },
        {
            "gameTime": "1 - 15:14",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Stefano Sturaro (Juventus). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate. Juventus earn a corner."
        },
        {
            "gameTime": "1 - 13:57",
            "label": "",
            "description": "Roberto Pereyra (Juventus) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 13:05",
            "label": "",
            "description": "Mario Gomez (Fiorentina) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 12:32",
            "label": "",
            "description": "Claudio Marchisio (Juventus) was too forceful with his tackle and Luca Banti interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 11:16",
            "label": "",
            "description": "It's a throw in for Juventus."
        },
        {
            "gameTime": "1 - 09:40",
            "label": "",
            "description": "Marcos Alonso (Fiorentina) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 09:17",
            "label": "",
            "description": "Carlos Tevez (Juventus) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 08:39",
            "label": "",
            "description": "Luca Banti blows his whistle for a foul after Alberto Aquilani (Fiorentina) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 07:10",
            "label": "",
            "description": "The linesman raises his flag for offside before Fernando Llorente (Juventus) heads on."
        },
        {
            "gameTime": "1 - 06:34",
            "label": "",
            "description": "Patrice Evra (Juventus) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 06:06",
            "label": "corner",
            "description": "Andrea Pirlo (Juventus) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 05:39",
            "label": "",
            "description": "Andrea Pirlo (Juventus) tries to send a pass but it's blocked. Juventus will take a corner kick."
        },
        {
            "gameTime": "1 - 05:03",
            "label": "",
            "description": "Alberto Aquilani (Fiorentina) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "1 - 05:02",
            "label": "corner",
            "description": "Matias Fernandez (Fiorentina) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 04:12",
            "label": "",
            "description": "The ball is cleared after Mohamed Salah (Fiorentina) attempted to dribble past an opposing player. The referee points to the corner flag and Fiorentina will take a corner."
        },
        {
            "gameTime": "1 - 03:59",
            "label": "",
            "description": "The free kick is taken by Andrea Pirlo (Juventus), but ball is cleared."
        },
        {
            "gameTime": "1 - 03:34",
            "label": "",
            "description": "Andrea Pirlo (Juventus) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 02:20",
            "label": "",
            "description": "Milan Badelj (Fiorentina) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 01:01",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) passes the ball onto Carlos Tevez, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Juventus will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Luca Banti is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The superiority of the home team was evident on the pitch today. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "Fiorentina",
    "gameDate": "29/04/2015 - 21:45",
    "gameHomeTeam": "Juventus",
    "gameScore": "3 - 2"
}