{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2017-05-13 - 16-30 FC Augsburg 1 - 1 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:13",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:30",
            "label": "substitution",
            "description": "Dong Won Ji joins the action as a substitute, replacing Alfred Finnbogason (Augsburg)."
        },
        {
            "gameTime": "2 - 45:40",
            "label": "y-card",
            "description": "Dominik Kohr (Augsburg) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:29",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to substitute Matthias Ginter and he is replaced by Sebastian Rode (Dortmund)."
        },
        {
            "gameTime": "2 - 41:47",
            "label": "substitution",
            "description": "The game has come to an end for Jonathan Schmid. He has contributed as much as he could today. He will be replaced by the fresh legs of Georg Teigl (Augsburg)."
        },
        {
            "gameTime": "2 - 35:40",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "2 - 35:28",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 35:13",
            "label": "",
            "description": "That was a brilliant piece of goalkeeping! Andreas Luthe dived superbly to block a header by Shinji Kagawa (Dortmund) from around the penalty spot. His effort was directed straight towards the left post, but Andreas Luthe pulled off a remarkable save!"
        },
        {
            "gameTime": "2 - 34:17",
            "label": "substitution",
            "description": "The substitution has been made. Christian Pulisic (Dortmund) has replaced Raphael Guerreiro."
        },
        {
            "gameTime": "2 - 33:12",
            "label": "attendance",
            "description": "The attendance for today's match is 30660."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "",
            "description": "Dominik Kohr (Augsburg) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 31:21",
            "label": "corner",
            "description": "Jonathan Schmid (Augsburg) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 28:50",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) collects a pass on the edge of the box and unleashes a low drive to the middle, but Andreas Luthe makes a save."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) misses a good chance to score. An inch perfect cross into the box finds Raphael Guerreiro (Dortmund) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "",
            "description": "Alfred Finnbogason (Augsburg) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 22:50",
            "label": "injury",
            "description": "Alfred Finnbogason (Augsburg) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 22:24",
            "label": "substitution",
            "description": "The manager makes a subsitution with Francisco Caiuby (Augsburg) coming on for Konstantinos Stafylidis."
        },
        {
            "gameTime": "2 - 20:19",
            "label": "funfact",
            "description": "Here's the current ball possession statistics for both teams – 23:77."
        },
        {
            "gameTime": "2 - 16:28",
            "label": "",
            "description": "Sokratis (Dortmund) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "2 - 16:15",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 15:36",
            "label": "",
            "description": "Andreas Luthe makes a superb save to deny a header which was nodded towards the bottom left corner by Pierre Emerick Aubameyang (Dortmund). Dortmund force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 13:45",
            "label": "y-card",
            "description": "Konstantinos Stafylidis (Augsburg) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "2 - 10:16",
            "label": "",
            "description": "What a chance for Pierre Emerick Aubameyang (Dortmund) as he produced a stunning snap shot from the edge of the box! The goalkeeper was a bit lucky as the ball goes inches over the crossbar."
        },
        {
            "gameTime": "2 - 08:29",
            "label": "",
            "description": "A nice lofted cross finds Ousmane Dembele (Dortmund) unmarked and he displays an excellent touch to control the ball. Ousmane Dembele (Dortmund) drills a low shot towards the middle of the net, but doesn't give the goalkeeper anything to worry about. An easy save."
        },
        {
            "gameTime": "2 - 04:53",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Marco Reus (Dortmund) takes it short."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Sascha Stegemann blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 48:16",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:11",
            "label": "",
            "description": "Great ball in from Ousmane Dembele. Pierre Emerick Aubameyang (Dortmund) should really have done better with a close range header, but he heads it a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "1 - 41:08",
            "label": "",
            "description": "Marco Reus (Dortmund) commits a foul after bringing down his opponent with a slide tackle."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Dortmund are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 35:59",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) picks up a pass, lines up a shot and strikes from 20 metres out, but Andreas Luthe thwarts the effort which is headed low to the middle of the goal."
        },
        {
            "gameTime": "1 - 34:50",
            "label": "",
            "description": "Halil Altintop (Augsburg) brings his opponent down with a tackle and Sascha Stegemann blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 31:53",
            "label": "soccer-ball",
            "description": "Shinji Kagawa produces a sweet pass and picks out Pierre Emerick Aubameyang (Dortmund) inside the box. He quickly takes a shot which goes into the middle of the net and leaves the goalkeeper helpless. He makes it 1:1!"
        },
        {
            "gameTime": "1 - 27:45",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Alfred Finnbogason (Augsburg) and he fired home from close range. The score is 1:0."
        },
        {
            "gameTime": "1 - 27:30",
            "label": "",
            "description": "Philipp Max (Augsburg) fashions a shot from the edge of the box after receiving an accurate pass. Roman Burki makes a stunning save to stop the effort from flying into the bottom right corner."
        },
        {
            "gameTime": "1 - 21:11",
            "label": "substitution",
            "description": "The manager has been forced to make a substitution and the injured Julian Weigl leaves the pitch to be replaced by Erik Durm (Dortmund)."
        },
        {
            "gameTime": "1 - 18:45",
            "label": "injury",
            "description": "Julian Weigl (Dortmund) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 16:50",
            "label": "corner",
            "description": "Konstantinos Stafylidis (Augsburg) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 16:19",
            "label": "",
            "description": "Alfred Finnbogason (Augsburg) latches on to a precise pass and one on one with the keeper slams the ball towards the right hand post. Roman Burki is alert, though, and leaps like a salmon to deny him. FC Augsburg will take a corner kick."
        },
        {
            "gameTime": "1 - 13:45",
            "label": "",
            "description": "Jonathan Schmid (Augsburg) sends in a lofted cross from a mid range free kick, but his poor effort goes out of play."
        },
        {
            "gameTime": "1 - 12:35",
            "label": "y-card",
            "description": "Booking. Matthias Ginter (Dortmund) receives a caution from the referee."
        },
        {
            "gameTime": "1 - 06:40",
            "label": "",
            "description": "The game is interrupted as Alfred Finnbogason (Augsburg) is flagged offside."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "",
            "description": "Matthias Ginter (Dortmund) is able to continue to play."
        },
        {
            "gameTime": "1 - 00:55",
            "label": "injury",
            "description": "The game is interrupted now, Matthias Ginter (Dortmund) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and FC Augsburg will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Sascha Stegemann."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang have rippled the net 28x and is the top scorer for Dortmund this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund have not lost for 4 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "1:1 is the most common score for FC Augsburg in this competition. 5 of their all matches finished with that score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The match has just finished."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "13/05/2017 - 16:30",
    "gameHomeTeam": "FC Augsburg",
    "gameScore": "1 - 1"
}