{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-12-19 - 18-00 Chelsea 3 - 1 Sunderland/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. Chelsea were better today and displayed masterful control and movement. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:40",
            "label": "",
            "description": "Rough tackle by Cesar Azpilicueta (Chelsea). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "Jack Rodwell (Sunderland) was trying to get to the ball but clattered into the legs of the opponent as well. Roger East blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:15",
            "label": "",
            "description": "Willian (Chelsea) stands over the free kick and opts to take it himself, sending it towards the top left corner only for Costel Pantilimon to dive and make a save."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "y-card",
            "description": "It must be a yellow card. It is. John O'Shea (Sunderland) receives the caution after an awful tackle."
        },
        {
            "gameTime": "2 - 42:55",
            "label": "y-card",
            "description": "Roger East shows a yellow card to Nemanja Matic (Chelsea) for a tough tackle."
        },
        {
            "gameTime": "2 - 42:24",
            "label": "",
            "description": "Thibaut Courtois pulls off a great save to deny Jermain Defoe (Sunderland), who makes himself some space inside the box and unleashes a quick shot to the right side of the goal."
        },
        {
            "gameTime": "2 - 41:40",
            "label": "",
            "description": "Chelsea seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 39:32",
            "label": "",
            "description": "Jermain Defoe (Sunderland) makes a run beyond the last defender, but he's offside."
        },
        {
            "gameTime": "2 - 38:06",
            "label": "",
            "description": "Willian plays a lovely pass into Pedro (Chelsea), but he can't find the target. His strike from inside the box goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 36:48",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Oscar as he is replaced by Ramires (Chelsea)."
        },
        {
            "gameTime": "2 - 36:20",
            "label": "",
            "description": "John O'Shea (Sunderland) gets himself onto the end of the corner, but his header is blocked."
        },
        {
            "gameTime": "2 - 36:16",
            "label": "corner",
            "description": "Adam Johnson (Sunderland) takes the corner."
        },
        {
            "gameTime": "2 - 35:50",
            "label": "",
            "description": "Fabio Borini (Sunderland) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away. Corner kick. Sunderland will have an opportunity."
        },
        {
            "gameTime": "2 - 35:05",
            "label": "",
            "description": "Oscar (Chelsea) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 34:35",
            "label": "",
            "description": "Willian (Chelsea) picks up the ball, dribbles to the edge of the penalty area and unleashes a brilliant shot to the right side of the goal, but is thwarted by a great save from Costel Pantilimon."
        },
        {
            "gameTime": "2 - 33:50",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Danny Graham (Sunderland) comes onto the pitch for Duncan Watmore."
        },
        {
            "gameTime": "2 - 33:05",
            "label": "",
            "description": "The game is interrupted. Kurt Zouma (Chelsea) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "2 - 33:02",
            "label": "",
            "description": "Nemanja Matic (Chelsea) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 32:29",
            "label": "",
            "description": "Kurt Zouma (Chelsea) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "2 - 31:23",
            "label": "",
            "description": "Fabio Borini (Sunderland) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 30:36",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Loic Remy (Chelsea) is coming onto the pitch as Diego Costa cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 29:46",
            "label": "",
            "description": "Diego Costa receives a short pass from Willian (Chelsea), but the opposition's defence thwarts his effort."
        },
        {
            "gameTime": "2 - 29:06",
            "label": "",
            "description": "Oscar (Chelsea) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "2 - 28:39",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "2 - 27:47",
            "label": "",
            "description": "Duncan Watmore (Sunderland) brings down his opponent with a very late tackle."
        },
        {
            "gameTime": "2 - 27:16",
            "label": "",
            "description": "Diego Costa (Chelsea) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 26:56",
            "label": "",
            "description": "Sunderland players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "2 - 25:40",
            "label": "substitution",
            "description": "Substitution. Cesc Fabregas makes his way off the pitch and John Obi Mikel (Chelsea) comes on as his replacement."
        },
        {
            "gameTime": "2 - 24:48",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) makes a slide tackle, but referee Roger East blows for a foul."
        },
        {
            "gameTime": "2 - 23:03",
            "label": "",
            "description": "Willian links up with Oscar (Chelsea), who fires just wide of the left post from the edge of the box."
        },
        {
            "gameTime": "2 - 21:40",
            "label": "",
            "description": "Diego Costa (Chelsea) sends a superb lead pass into the penalty area and finds Willian, who fails to shoot."
        },
        {
            "gameTime": "2 - 20:21",
            "label": "",
            "description": "Jermain Defoe (Sunderland) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the left post."
        },
        {
            "gameTime": "2 - 19:01",
            "label": "",
            "description": "Oscar (Chelsea) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 18:09",
            "label": "",
            "description": "Flag goes up against Jermain Defoe (Sunderland) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 17:18",
            "label": "",
            "description": "Willian (Chelsea) sends over a free kick from long range but the defence is alert."
        },
        {
            "gameTime": "2 - 16:37",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Jack Rodwell (Sunderland) was quite harsh and Roger East didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 14:14",
            "label": "",
            "description": "Jack Rodwell (Sunderland) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "2 - 12:33",
            "label": "",
            "description": "A cross from Willian (Chelsea) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 10:03",
            "label": "",
            "description": "That was close by Fabio Borini (Sunderland)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the right post."
        },
        {
            "gameTime": "2 - 08:20",
            "label": "",
            "description": "Chelsea hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "2 - 07:29",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Fabio Borini (Sunderland) and he fired home from close range. The score is 3:1."
        },
        {
            "gameTime": "2 - 07:05",
            "label": "",
            "description": "Younes Kaboul (Sunderland) leaps highest around the penalty spot to meet a cross from the free kick and produces a promising goal bound header towards the bottom left corner, but Thibaut Courtois pulls off a fine save to deny him."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "",
            "description": "Oscar (Chelsea) was too fierce in his attempt to get the ball from his opponent and Roger East blows for a foul."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "soccer-ball",
            "description": "Goal! Oscar (Chelsea) slams home the penalty with a precise low shot into the bottom right corner."
        },
        {
            "gameTime": "2 - 04:29",
            "label": "",
            "description": "Oscar (Chelsea) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 02:56",
            "label": "y-card",
            "description": "Costel Pantilimon (Sunderland) is awarded a yellow card. The referee showed him no mercy."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "penalty",
            "description": "Costel Pantilimon (Sunderland) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. Chelsea are given a huge opportunity to score it's a penalty kick!"
        },
        {
            "gameTime": "2 - 01:30",
            "label": "",
            "description": "Sunderland spell of possession comes to an end after a mistake."
        },
        {
            "gameTime": "2 - 00:02",
            "label": "substitution",
            "description": "Here is a change after the half time break. Ola Toivonen (Sunderland) is replaced by Fabio Borini."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. It was a fairly one sided opening 45 minutes, with Chelsea much the better side better so far. The home team makes a lot of passes and attempts to maintain possession, while the visitors look to counter attack."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "Roger East has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:48",
            "label": "",
            "description": "Pedro (Chelsea) serves up a nice cross, but Costel Pantilimon punches the ball away."
        },
        {
            "gameTime": "1 - 43:11",
            "label": "",
            "description": "Patrick van Aanholt (Sunderland) tries his luck with a long range shot from a rebound, but it isn't precise at all and the ball flies miles over the crossbar. Very poor shot."
        },
        {
            "gameTime": "1 - 42:47",
            "label": "",
            "description": "Patrick van Aanholt (Sunderland) slams the ball from a long range free kick. He should have curled it higher to avoid hitting the wall."
        },
        {
            "gameTime": "1 - 41:50",
            "label": "",
            "description": "Nemanja Matic (Chelsea) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "1 - 40:57",
            "label": "",
            "description": "Pedro (Chelsea) sends a teasing cross into the area, but Costel Pantilimon intercepts the ball."
        },
        {
            "gameTime": "1 - 40:43",
            "label": "",
            "description": "Jack Rodwell (Sunderland) makes an overly aggressive challenge and Roger East blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 39:02",
            "label": "",
            "description": "Chelsea hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 37:52",
            "label": "",
            "description": "Pedro swings the cross over. Diego Costa (Chelsea) gets his head to it but it goes just wide of the right post."
        },
        {
            "gameTime": "1 - 36:30",
            "label": "",
            "description": "Pedro (Chelsea) tries his luck with a shot from long range, but his effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 35:59",
            "label": "",
            "description": "Close! Diego Costa (Chelsea) is a whisker away from finishing off the move he started. His close range effort flies just over the bar."
        },
        {
            "gameTime": "1 - 34:26",
            "label": "",
            "description": "Jermain Defoe (Sunderland) is penalised for a foul. Roger East had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 33:20",
            "label": "",
            "description": "Roger East blows his whistle for a foul after Diego Costa (Chelsea) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 32:34",
            "label": "",
            "description": "Excellent touch by Duncan Watmore (Sunderland)! He latches on to a precise pass on the edge of the box and produces a shot goalwards which goes way wide of the left post."
        },
        {
            "gameTime": "1 - 31:08",
            "label": "",
            "description": "A long pass, executed by Nemanja Matic (Chelsea), missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 30:59",
            "label": "",
            "description": "The ball is cleared after Oscar (Chelsea) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 29:25",
            "label": "",
            "description": "Yann M'Vila (Sunderland) threads a pass through to Jermain Defoe, but Thibaut Courtois breaks up the move."
        },
        {
            "gameTime": "1 - 28:58",
            "label": "corner",
            "description": "Patrick van Aanholt (Sunderland) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 28:31",
            "label": "",
            "description": "A cross into the box from Yann M'Vila (Sunderland) is cleared. The referee points to the corner flag and Sunderland will take a corner."
        },
        {
            "gameTime": "1 - 28:20",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) is penalised for holding. Roger East signals a set piece."
        },
        {
            "gameTime": "1 - 27:33",
            "label": "",
            "description": "Adam Johnson (Sunderland) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 26:45",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) trips an opponent with a slide tackle. Roger East stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 25:38",
            "label": "",
            "description": "Oscar (Chelsea) zig zags his way into the box and fails to direct a shot inside the left post. The goalkeeper pulls off a miraculous stop."
        },
        {
            "gameTime": "1 - 23:01",
            "label": "",
            "description": "Cesc Fabregas loses the ball after receiving a sweet pass from Oscar (Chelsea)."
        },
        {
            "gameTime": "1 - 22:43",
            "label": "substitution",
            "description": "The substitution has been made. Adam Johnson (Sunderland) has replaced Sebastian Coates."
        },
        {
            "gameTime": "1 - 22:23",
            "label": "",
            "description": "Jack Rodwell (Sunderland) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 21:37",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 20:18",
            "label": "",
            "description": "Chelsea are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "1 - 18:55",
            "label": "",
            "description": "Oscar (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 17:31",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "1 - 16:54",
            "label": "",
            "description": "Oscar is picked out by Willian (Chelsea), but one of the defenders arrives to clear."
        },
        {
            "gameTime": "1 - 15:50",
            "label": "",
            "description": "Patrick van Aanholt (Sunderland) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 15:03",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) comes close to scoring. He peels away from his marker and gets on the end of a cross from Oscar, but he hits a shot just wide of the right post."
        },
        {
            "gameTime": "1 - 14:49",
            "label": "corner",
            "description": "Willian (Chelsea) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 14:19",
            "label": "",
            "description": "Wow, what an escape. Willian (Chelsea) has an effort from inside the box but it's brilliantly blocked. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 12:43",
            "label": "soccer-ball",
            "description": "Goal! Pedro (Chelsea) is quickest to react to the rebound and stabs the ball into the back of the net. It's 2:0."
        },
        {
            "gameTime": "1 - 12:40",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Branislav Ivanovic (Chelsea), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "1 - 10:22",
            "label": "",
            "description": "Oscar (Chelsea) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 09:49",
            "label": "",
            "description": "Some neat passing and movement from Sunderland as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 08:24",
            "label": "",
            "description": "Willian (Chelsea) stands over the free kick and opts to take it himself, but it is straight at Costel Pantilimon."
        },
        {
            "gameTime": "1 - 07:16",
            "label": "",
            "description": "Poor challenge! Yann M'Vila (Sunderland) is penalised for tripping and Roger East blows his whistle. A free kick has been awarded to Chelsea."
        },
        {
            "gameTime": "1 - 06:30",
            "label": "",
            "description": "Decent spell from Sunderland here and they keep the pressure on until one of the defending players steps in."
        },
        {
            "gameTime": "1 - 04:25",
            "label": "soccer-ball",
            "description": "Willian sends in a great cross from the corner and finds Branislav Ivanovic (Chelsea), who outjumps the defence to finish into the top left corner with a header. The score is 1:0."
        },
        {
            "gameTime": "1 - 04:23",
            "label": "corner",
            "description": "Willian (Chelsea) will take a corner kick."
        },
        {
            "gameTime": "1 - 04:20",
            "label": "",
            "description": "Willian (Chelsea) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat. Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 03:19",
            "label": "",
            "description": "Good defending. Oscar (Chelsea) tries to find Willian inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 01:39",
            "label": "",
            "description": "Ola Toivonen (Sunderland) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 01:09",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Chelsea will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Roger East will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. Chelsea were better today and displayed masterful control and movement. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        }
    ],
    "gameAwayTeam": "Sunderland",
    "gameDate": "19/12/2015 - 18:00",
    "gameHomeTeam": "Chelsea",
    "gameScore": "3 - 1"
}