{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-10-04 - 21-30 Atl. Madrid 1 - 1 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Let's hope the players will show us more in future games as today's one was rather average, without many exciting moments. A very even game was seen on the pitch today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        },
        {
            "gameTime": "2 - 48:11",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Gabi (Atl. Madrid) sends it out of play."
        },
        {
            "gameTime": "2 - 46:55",
            "label": "",
            "description": "An attempted cross from Yannick Carrasco (Atl. Madrid) is cleared. Corner kick. Atl. Madrid will have an opportunity."
        },
        {
            "gameTime": "2 - 46:38",
            "label": "",
            "description": "Jan Oblak makes a good save! Cristiano Ronaldo (Real Madrid) easily weaves through the defence and fires in from long range. His shot goes towards the middle of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "2 - 46:10",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) gets himself onto the end of the corner, but his header is blocked."
        },
        {
            "gameTime": "2 - 45:53",
            "label": "corner",
            "description": "The referee points to the corner flag. It's a corner to Atl. Madrid."
        },
        {
            "gameTime": "2 - 45:39",
            "label": "",
            "description": "Jackson Martinez (Atl. Madrid) takes a shot from the edge of the box after a brilliant solo effort. The ball heads towards the right post, but the goalkeeper denies him with a fantastic save."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:23",
            "label": "",
            "description": "Atl. Madrid try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "2 - 43:54",
            "label": "y-card",
            "description": "Today's referee Alberto Undiano Mallenco rightly decides to book Alvaro Arbeloa (Real Madrid) for his harsh tackle. Atl. Madrid earn a free kick."
        },
        {
            "gameTime": "2 - 43:16",
            "label": "",
            "description": "Toni Kroos (Real Madrid) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 42:30",
            "label": "y-card",
            "description": "Diego Godin (Atl. Madrid) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Alberto Undiano Mallenco ignores the protests. Real Madrid win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a long ball in, but Jan Oblak comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 40:07",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a cross into the box, but Jan Oblak comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 38:00",
            "label": "soccer-ball",
            "description": "Goal 1:1! Luciano Vietto (Atl. Madrid) taps home from close range after the rebound fell kindly into his path."
        },
        {
            "gameTime": "2 - 37:00",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco shows the yellow card to Antoine Griezmann (Atl. Madrid) for a heavy challenge."
        },
        {
            "gameTime": "2 - 35:06",
            "label": "",
            "description": "Luciano Vietto (Atl. Madrid) jumps for a cross in the goal area and produces a fine header which goes narrowly wide of the right post! What a huge opportunity!"
        },
        {
            "gameTime": "2 - 34:43",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 33:42",
            "label": "y-card",
            "description": "The foul by Luciano Vietto (Atl. Madrid) is worthy of a card and a yellow is duly shown by Alberto Undiano Mallenco."
        },
        {
            "gameTime": "2 - 32:40",
            "label": "",
            "description": "Luka Modric (Real Madrid) unleashes a shot from 30 metres out but is unable to find the target and it goes well wide of the left post."
        },
        {
            "gameTime": "2 - 32:07",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 31:22",
            "label": "substitution",
            "description": "That's the end of the game for Karim Benzema, who is replaced by Mateo Kovacic (Real Madrid)."
        },
        {
            "gameTime": "2 - 29:18",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the right post."
        },
        {
            "gameTime": "2 - 28:49",
            "label": "",
            "description": "Jackson Martinez (Atl. Madrid) finds himself some space inside the box, collects a rebound and sends an effort in on goal. Keylor Navas pulls off a fantastic reflex save to stop the ball going low into the middle of the target."
        },
        {
            "gameTime": "2 - 28:17",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle as Jackson Martinez (Atl. Madrid) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 27:30",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 27:06",
            "label": "",
            "description": "A lofted cross from Yannick Carrasco (Atl. Madrid) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Atl. Madrid win a corner."
        },
        {
            "gameTime": "2 - 25:59",
            "label": "",
            "description": "Marcelo (Real Madrid) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 24:21",
            "label": "",
            "description": "A pass by Yannick Carrasco (Atl. Madrid) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 23:25",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) attempts a long crossfield pass, but the defence does well to intercept the ball."
        },
        {
            "gameTime": "2 - 22:01",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) did his best to latch onto a through ball, but it was too strong. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "2 - 21:17",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 20:23",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Gareth Bale (Real Madrid) for Isco."
        },
        {
            "gameTime": "2 - 18:17",
            "label": "substitution",
            "description": "Diego Simeone has decided to introduce fresh legs, with Jackson Martinez (Atl. Madrid) replacing Fernando Torres."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "",
            "description": "Marcelo (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 17:17",
            "label": "",
            "description": "Real Madrid are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "2 - 16:00",
            "label": "y-card",
            "description": "Casemiro (Real Madrid) sees a yellow card from Alberto Undiano Mallenco after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 14:58",
            "label": "y-card",
            "description": "Today's referee Alberto Undiano Mallenco rightly decides to book Juanfran (Atl. Madrid) for his harsh tackle."
        },
        {
            "gameTime": "2 - 14:19",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) receives the ball inside the box from the resulting free kick, but fails to score as his shot is blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 13:46",
            "label": "y-card",
            "description": "A yellow card for a tackle by Raphael Varane (Real Madrid). Alberto Undiano Mallenco doesn't hesitate at all to make this decision. It's a free kick to Atl. Madrid, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "2 - 12:35",
            "label": "substitution",
            "description": "Substitution. Angel Correa makes way for Luciano Vietto (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) makes a slide tackle, but referee Alberto Undiano Mallenco blows for a foul."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "attendance",
            "description": "The attendance is 53079."
        },
        {
            "gameTime": "2 - 10:23",
            "label": "",
            "description": "A player from Atl. Madrid commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "2 - 09:27",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "2 - 08:35",
            "label": "",
            "description": "Alberto Undiano Mallenco interrupts the game for a tactical foul by Alvaro Arbeloa (Real Madrid). A free kick has been awarded to Atl. Madrid."
        },
        {
            "gameTime": "2 - 07:38",
            "label": "",
            "description": "Alberto Undiano Mallenco couldn't ignore the rough tackle by Jose Maria Gimenez (Atl. Madrid) and blew his whistle."
        },
        {
            "gameTime": "2 - 07:17",
            "label": "",
            "description": "Filipe Luis (Atl. Madrid) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "2 - 06:36",
            "label": "",
            "description": "Tiago (Atl. Madrid) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 05:03",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the left post."
        },
        {
            "gameTime": "2 - 04:18",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the left post."
        },
        {
            "gameTime": "2 - 03:52",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle and it's Toni Kroos (Real Madrid) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 03:18",
            "label": "",
            "description": "Luka Modric (Real Madrid) pulls the shirt of his opponent and the referee stops play for a foul."
        },
        {
            "gameTime": "2 - 02:37",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 01:13",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "2 - 00:02",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Diego Simeone gives a chance to Yannick Carrasco (Atl. Madrid) and Oliver Torres is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. There wasn't any evident superiority by either side during the first half. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:07",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:31",
            "label": "",
            "description": "Toni Kroos (Real Madrid) sends a teasing cross into the area, but Jan Oblak intercepts the ball."
        },
        {
            "gameTime": "1 - 45:24",
            "label": "corner",
            "description": "Real Madrid take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:58",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "1 - 43:26",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "1 - 42:22",
            "label": "",
            "description": "Alberto Undiano Mallenco has a clear sight and sees a foul from Antoine Griezmann (Atl. Madrid)."
        },
        {
            "gameTime": "1 - 41:08",
            "label": "substitution",
            "description": "Rafael Benitez is forced to make a change. Daniel Carvajal is unable to continue due to injury, Alvaro Arbeloa (Real Madrid) comes on."
        },
        {
            "gameTime": "1 - 39:56",
            "label": "injury",
            "description": "Looks like Daniel Carvajal (Real Madrid) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 39:00",
            "label": "y-card",
            "description": "Angel Correa (Atl. Madrid) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Alberto Undiano Mallenco didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "1 - 37:56",
            "label": "",
            "description": "Close! Cristiano Ronaldo (Real Madrid) takes the resultant free kick from 32 metres out and his shot goes just over the crossbar. The ball is off of the pitch and it's a goal kick for Atl. Madrid."
        },
        {
            "gameTime": "1 - 37:00",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle after Oliver Torres (Atl. Madrid) kicks an opponent's legs instead of the ball. Real Madrid win a free kick."
        },
        {
            "gameTime": "1 - 36:12",
            "label": "",
            "description": "The linesman raises his flag for offside before Fernando Torres (Atl. Madrid) heads on."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "",
            "description": "Some neat passing and movement from Atl. Madrid as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 33:25",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a precise pass on the edge of the box and has an effort on goal. Unfortunately for him, his strike flies inches high over the bar."
        },
        {
            "gameTime": "1 - 31:44",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Antoine Griezmann (Atl. Madrid). Alberto Undiano Mallenco saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "1 - 29:45",
            "label": "",
            "description": "Alberto Undiano Mallenco interrupts the game. One of the players from Atl. Madrid won the ball, but his effort is adjudged unfair."
        },
        {
            "gameTime": "1 - 28:32",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) works the corner short."
        },
        {
            "gameTime": "1 - 28:00",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away. The referee and his assistant both point at the corner flag. Atl. Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 27:48",
            "label": "",
            "description": "Real Madrid are showing great team chemistry. They are passing the ball around seamlessly but finally one of the defending players makes an interception."
        },
        {
            "gameTime": "1 - 25:45",
            "label": "",
            "description": "Gabi (Atl. Madrid) attempted to send a defence splitting pass into space where Fernando Torres was lurking. It could have put him one on one with the goalkeeper, but one of the defending players somehow manages to avert the threat."
        },
        {
            "gameTime": "1 - 24:38",
            "label": "",
            "description": "Atl. Madrid keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "1 - 22:37",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 21:58",
            "label": "penalty-missed",
            "description": "Keylor Navas dives to the left side of the goal and brilliantly saves the penalty taken by Antoine Griezmann (Atl. Madrid)! Atl. Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 21:52",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 20:57",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco shows a yellow card to Sergio Ramos (Real Madrid) for a tough tackle."
        },
        {
            "gameTime": "1 - 20:55",
            "label": "penalty",
            "description": "Sergio Ramos (Real Madrid) tackles a bit over zealously and Alberto Undiano Mallenco blows for a foul. Atl. Madrid are given a penalty!"
        },
        {
            "gameTime": "1 - 18:28",
            "label": "",
            "description": "Real Madrid hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 17:00",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco shows a yellow card to Gabi (Atl. Madrid), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 16:31",
            "label": "",
            "description": "Juanfran (Atl. Madrid) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "1 - 15:25",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 14:44",
            "label": "",
            "description": "Lovely skill from Angel Correa (Atl. Madrid) as he gets away from defenders and unleashes a shot from 20 metres out, but his effort goes just wide of the right post."
        },
        {
            "gameTime": "1 - 13:45",
            "label": "",
            "description": "Karim Benzema (Real Madrid) is picked out by one of his teammates with a brilliant long range cross, but he doesn't control the ball well and the defence eliminates the danger without any problem."
        },
        {
            "gameTime": "1 - 12:24",
            "label": "",
            "description": "Keylor Navas displays his ability to read the game and clears the danger after Fernando Torres (Atl. Madrid) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "1 - 10:56",
            "label": "",
            "description": "Close! Angel Correa (Atl. Madrid) picks up the ball in space and from inside the penalty area sends a shot inches wide of the left post. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "1 - 10:23",
            "label": "",
            "description": "The Atl. Madrid players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 08:33",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Daniel Carvajal sends a superb cross into the box. Karim Benzema (Real Madrid) latches on to it and from near the penalty spot powers a header inside the left post, leaving Jan Oblak beaten. He displayed his eye for goal there excellent finish. The score is 0:1."
        },
        {
            "gameTime": "1 - 08:00",
            "label": "",
            "description": "A cross from Marcelo (Real Madrid) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 07:00",
            "label": "",
            "description": "Toni Kroos (Real Madrid) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 06:17",
            "label": "",
            "description": "Karim Benzema (Real Madrid) dribbles into the box, but Jan Oblak is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "1 - 05:19",
            "label": "",
            "description": "The foul by Karim Benzema (Real Madrid) was seen by Alberto Undiano Mallenco who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 04:39",
            "label": "",
            "description": "Angel Correa (Atl. Madrid) blows a clear opportunity! He sends a rebound from close range narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 03:55",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 02:16",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) missed a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball flies well wide of the right post!"
        },
        {
            "gameTime": "1 - 01:15",
            "label": "",
            "description": "Some great controlled play and passing from Real Madrid. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Atl. Madrid will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alberto Undiano Mallenco will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid are playing some good attacking football with some solid defence, here is their goals for and against 110:34."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "1:0 is Atl. Madrid's most common score in this competition. 10 of their all matches finished with that score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Atl. Madrid produced their best performance of the season on 2.4., when they hammered Betis 5:1."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let's hope the players will show us more in future games as today's one was rather average, without many exciting moments. A very even game was seen on the pitch today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "04/10/2015 - 21:30",
    "gameHomeTeam": "Atl. Madrid",
    "gameScore": "1 - 1"
}