{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-10-15 - 21-45 Betis 1 - 6 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:10",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. Real Madrid had more of the game and were superior. Their manager will certainly be the happier of the two managers. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 47:03",
            "label": "whistle",
            "description": "That's it for today, Jesus Gil Manzano has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 46:10",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) unleashed a promising strike from a long distance free kick, but his effort goes high over the bar so it's going to be a goal kick."
        },
        {
            "gameTime": "2 - 45:53",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows a yellow card to Petros (Betis), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:20",
            "label": "",
            "description": "Ruben Castro (Betis) attempts to score as he rises near the penalty spot and heads the ball to the middle of the goal. Keylor Navas pulls off a comfortable save to stop the ball from hitting the net."
        },
        {
            "gameTime": "2 - 43:03",
            "label": "",
            "description": "What a chance that is! Ruben Castro (Betis) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 42:30",
            "label": "attendance",
            "description": "The attendance is 41665."
        },
        {
            "gameTime": "2 - 40:15",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) connects with a pass inside the box, but his effort goes well wide of the left post."
        },
        {
            "gameTime": "2 - 39:57",
            "label": "",
            "description": "Jesus Gil Manzano blows his whistle for a foul after Alvaro Morata (Real Madrid) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 37:42",
            "label": "",
            "description": "Betis enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 33:39",
            "label": "substitution",
            "description": "Substitution. Marco Asensio (Real Madrid) on for Gareth Bale."
        },
        {
            "gameTime": "2 - 32:18",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Alvaro Morata slips the ball through to Cristiano Ronaldo (Real Madrid), and he darts into the box to unleash a magnificent shot into the bottom left corner. He makes it 1:6."
        },
        {
            "gameTime": "2 - 31:57",
            "label": "y-card",
            "description": "The foul by Roman Zozulya (Betis) is worthy of a card and a yellow is duly shown by Jesus Gil Manzano."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) decides to have a shot at goal from the free kick, but it hits the defensive wall."
        },
        {
            "gameTime": "2 - 29:40",
            "label": "",
            "description": "Lucas (Real Madrid) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "2 - 29:10",
            "label": "substitution",
            "description": "Here's the change. Karim Benzema leaves the pitch and Alvaro Morata (Real Madrid) comes on as a substitute."
        },
        {
            "gameTime": "2 - 25:18",
            "label": "",
            "description": "Superb touch by Karim Benzema (Real Madrid) as he receives a precise pass into the box, but the goalkeeper stops the ball as it heads towards the top of the net. Brilliant save!"
        },
        {
            "gameTime": "2 - 24:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempted to pick out a free teammate inside the box, but Antonio Adan comes off the line to clear the ball away."
        },
        {
            "gameTime": "2 - 21:54",
            "label": "substitution",
            "description": "Gustavo Poyet decides to make a substitution. Jonas Martin will be replaced by Daniel Ceballos (Betis)."
        },
        {
            "gameTime": "2 - 21:33",
            "label": "",
            "description": "Alvaro Cejudo (Betis) smashes the ball towards goal from the edge of the penalty box, but it goes well wide of the right post."
        },
        {
            "gameTime": "2 - 19:38",
            "label": "substitution",
            "description": "Lucas (Real Madrid) joins the action as a substitute, replacing Mateo Kovacic."
        },
        {
            "gameTime": "2 - 19:00",
            "label": "y-card",
            "description": "Alvaro Cejudo (Betis) got a yellow card."
        },
        {
            "gameTime": "2 - 18:52",
            "label": "corner",
            "description": "Riza Durmisi (Betis) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 16:16",
            "label": "soccer-ball",
            "description": "Isco (Real Madrid) receives the ball inside the box, reacts quickly and without any problems stabs the ball into the top right corner."
        },
        {
            "gameTime": "2 - 14:18",
            "label": "",
            "description": "An attempted cross from Joaquin (Betis) is cleared."
        },
        {
            "gameTime": "2 - 09:50",
            "label": "soccer-ball",
            "description": "Goal! Joaquin displays great vision and sends a pass to Alvaro Cejudo (Betis), who shows brilliant composure inside the box to bury the ball into the bottom left corner. The score is 1:4."
        },
        {
            "gameTime": "2 - 09:15",
            "label": "",
            "description": "Riza Durmisi (Betis) swings a cross into the box, but it's far too close to Keylor Navas, who smothers the ball."
        },
        {
            "gameTime": "2 - 08:02",
            "label": "",
            "description": "Gareth Bale (Real Madrid) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 06:39",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) finds himself some space to meet a beautiful cross from the free kick, and from near the penalty spot he attempts to score with a header. His effort lacks accuracy and floats high over the bar."
        },
        {
            "gameTime": "2 - 05:04",
            "label": "",
            "description": "Joaquin (Betis) connects with a cross from the side and steers a header from around the penalty spot towards the goal. The ball goes in the right direction, but it's stopped by one of the defenders."
        },
        {
            "gameTime": "2 - 03:40",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows a yellow card to German Pezzella (Betis) for a tough tackle."
        },
        {
            "gameTime": "2 - 01:21",
            "label": "",
            "description": "Karim Benzema (Real Madrid) makes room to connect with a cross, but his strike from the penalty spot isn't accurate at all and the ball goes well over the bar."
        },
        {
            "gameTime": "2 - 00:35",
            "label": "substitution",
            "description": "The need to improve in the second half has brought about a change. Alex Alegria comes off for Alvaro Cejudo (Betis)."
        },
        {
            "gameTime": "2 - 00:29",
            "label": "substitution",
            "description": "Half time substitution. Darko Brasanac is replaced by Roman Zozulya (Betis)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:30",
            "label": "",
            "description": "Up to now it has been an action packed game full of wonderful movements and opportunities. Great display from Real Madrid so far, looking at stats you have to say that they were the better side during that opening 45 minutes. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 46:09",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:54",
            "label": "soccer-ball",
            "description": "Goal! Pepe puts the ball on a plate for Isco (Real Madrid), who scores with a simple close range finish. It's 0:4."
        },
        {
            "gameTime": "1 - 44:49",
            "label": "corner",
            "description": "Joaquin (Betis) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 44:05",
            "label": "",
            "description": "Ruben Castro (Betis) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 42:55",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Isco (Real Madrid) was quite harsh and Jesus Gil Manzano didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 42:16",
            "label": "corner",
            "description": "The resulting corner from Toni Kroos (Real Madrid) is cleared by the defence."
        },
        {
            "gameTime": "1 - 41:42",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 38:22",
            "label": "soccer-ball",
            "description": "Goal! Marcelo (Real Madrid) fires the rebound inside the right post after the ball breaks to him in the box. The score is 0:3."
        },
        {
            "gameTime": "1 - 38:18",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 37:42",
            "label": "",
            "description": "Isco (Real Madrid) sends a promising through ball, but the defence is alert and cuts out the pass. Real Madrid get a corner."
        },
        {
            "gameTime": "1 - 36:30",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a teasing cross into the area, but Antonio Adan intercepts the ball."
        },
        {
            "gameTime": "1 - 35:29",
            "label": "",
            "description": "Close! Cristiano Piccini (Betis) unleashes a rocket of a shot from the edge of the box and his shot flies just a few inches over the crossbar."
        },
        {
            "gameTime": "1 - 33:15",
            "label": "",
            "description": "Antonio Adan pulls off a great save to deny Marcelo (Real Madrid), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "1 - 30:26",
            "label": "soccer-ball",
            "description": "Toni Kroos feeds the ball through to Karim Benzema (Real Madrid), who picks up the pass inside the box and quickly sends it into the bottom left corner! The goalkeeper was helpless. 0:1!"
        },
        {
            "gameTime": "1 - 29:26",
            "label": "",
            "description": "Ruben Castro (Betis) unleashes a shot, but his effort is poor and floats well wide of the right post."
        },
        {
            "gameTime": "1 - 29:02",
            "label": "",
            "description": "Cristiano Piccini (Betis) sends a cross into the box, but Keylor Navas comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 28:43",
            "label": "",
            "description": "Marcelo (Real Madrid) produces a good strike that sails to the middle of the goal, but his low effort ends up in the goalkeeper's gloves."
        },
        {
            "gameTime": "1 - 25:32",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) unleashes a shot from the edge of the box, but it goes straight at Antonio Adan."
        },
        {
            "gameTime": "1 - 24:13",
            "label": "",
            "description": "Joaquin almost found himself in a promising position after Jonas Martin (Betis) tried to send a defence splitting pass, but one of the defenders reacts well and makes a timely interception."
        },
        {
            "gameTime": "1 - 21:22",
            "label": "",
            "description": "Marcelo (Real Madrid) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 18:05",
            "label": "",
            "description": "Ruben Castro (Betis) takes a mid range shot, but the ball sails high over the bar."
        },
        {
            "gameTime": "1 - 14:52",
            "label": "",
            "description": "Gareth Bale (Real Madrid) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "1 - 14:20",
            "label": "corner",
            "description": "Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 13:49",
            "label": "",
            "description": "Antonio Adan makes a superb save to deny a header which was nodded towards the right hand post by Gareth Bale (Real Madrid) after a cross from the side."
        },
        {
            "gameTime": "1 - 12:21",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 11:54",
            "label": "",
            "description": "Karim Benzema (Real Madrid) tries to send a low pass into the box, but it's blocked and cleared. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "1 - 10:46",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 09:58",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) races towards goal but the defender gets back well to make a challenge. The referee and his assistant both point at the corner flag. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 07:30",
            "label": "",
            "description": "Toni Kroos (Real Madrid) pulls the jersey of one of the opposition players and Jesus Gil Manzano blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) misses an absolute sitter after connecting with a cross inside the penalty box."
        },
        {
            "gameTime": "1 - 03:34",
            "label": "soccer-ball",
            "description": "Perfectly taken free kick! Toni Kroos sends a cross in and Raphael Varane (Real Madrid) leaps high to connect with it on the edge of the 6 yard box. His close range header goes inside the right post and he makes it 0:1."
        },
        {
            "gameTime": "1 - 02:14",
            "label": "",
            "description": "Petros (Betis) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. Real Madrid have a free kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Betis will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Jesus Gil Manzano."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Real Madrid players have rippled the net at least once in their last 19 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Toni Kroos will look to add to his tally of 6 assists this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "A 1:6 loss was the worst match Betis have played this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. Real Madrid had more of the game and were superior. Their manager will certainly be the happier of the two managers. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "15/10/2016 - 21:45",
    "gameHomeTeam": "Betis",
    "gameScore": "1 - 6"
}