{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-11-06 - 14-00 Real Madrid 3 - 0 Leganes/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:00",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. The home side were better today. The home team tried to win the ball back as quickly as possible every time they lost possession. The away side attempted to beat the opposition's defence mainly using counter attacks."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:25",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) produces a shot from a long range free kick, but it flies well wide of the right post."
        },
        {
            "gameTime": "2 - 45:49",
            "label": "y-card",
            "description": "Victor Diaz (Leganes) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 43:53",
            "label": "",
            "description": "James Rodriguez (Real Madrid) is caught offside by the linesman and it looks like it is the right decision despite being a very close call."
        },
        {
            "gameTime": "2 - 42:07",
            "label": "",
            "description": "Close effort! James Rodriguez (Real Madrid) takes the resulting free kick from a promising distance, but he sends it narrowly wide of the right post. The ball goes out of play and Leganes will have a goal kick."
        },
        {
            "gameTime": "2 - 41:32",
            "label": "",
            "description": "Pablo Insua (Leganes) makes a rough challenge and Antonio Mateu Lahoz blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 40:21",
            "label": "",
            "description": "Real Madrid hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "2 - 38:25",
            "label": "injury",
            "description": "Omar Ramos (Leganes) is asking for medical treatment after picking up an injury."
        },
        {
            "gameTime": "2 - 38:10",
            "label": "",
            "description": "Marcelo (Real Madrid) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Antonio Mateu Lahoz with no other option than to blow for a foul."
        },
        {
            "gameTime": "2 - 37:00",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Omar Ramos (Leganes) was quite harsh and Antonio Mateu Lahoz didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 36:32",
            "label": "substitution",
            "description": "Asier Garitano has decided to make a change. Victor Diaz (Leganes) replaces Martin Mantovani."
        },
        {
            "gameTime": "2 - 36:07",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Alvaro Morata leaves the pitch and Lucas (Real Madrid) comes on."
        },
        {
            "gameTime": "2 - 32:39",
            "label": "",
            "description": "The most active player in today's match is definitely Gareth Bale (Real Madrid). He's trying to be on the ball as much as possible and you can literally see the enthusiasm in his play. He keeps exchanging some one touch passes and waits for the right moment to send a killer pass. What a player!"
        },
        {
            "gameTime": "2 - 31:00",
            "label": "soccer-ball",
            "description": "An amazing individual effort from Alvaro Morata (Real Madrid) ends with a strike from inside the penalty area. He sends the ball into the left side of the goal and makes it 3:0. Jon Serantes was helpless."
        },
        {
            "gameTime": "2 - 29:31",
            "label": "",
            "description": "Alexander Szymanowski (Leganes) is adjudged offside."
        },
        {
            "gameTime": "2 - 28:27",
            "label": "",
            "description": "Antonio Mateu Lahoz blows his whistle as Alexander Szymanowski (Leganes) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 26:36",
            "label": "corner",
            "description": "Omar Ramos (Leganes) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 26:08",
            "label": "",
            "description": "Alexander Szymanowski (Leganes) receives a low pass just outside the box and unleashes a fine strike towards the roof of the net. Keylor Navas pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "2 - 25:54",
            "label": "attendance",
            "description": "The attendance is 74269."
        },
        {
            "gameTime": "2 - 24:23",
            "label": "",
            "description": "Gareth Bale (Real Madrid) attempts to find Cristiano Ronaldo with a delicate little through ball from inside the box, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "substitution",
            "description": "Asier Garitano decides to make a substitution. Ruben Perez will be replaced by Luciano (Leganes)."
        },
        {
            "gameTime": "2 - 22:47",
            "label": "substitution",
            "description": "It is time for a substitution. James Rodriguez (Real Madrid) is on for Isco."
        },
        {
            "gameTime": "2 - 22:20",
            "label": "",
            "description": "Luka Modric (Real Madrid) attempts to find Gareth Bale, but puts far too much on the pass and the chance is gone. The ball is off of the pitch and it's a goal kick for Leganes."
        },
        {
            "gameTime": "2 - 20:23",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) hammered the ball from a long range free kick only into the defensive wall."
        },
        {
            "gameTime": "2 - 19:53",
            "label": "",
            "description": "Antonio Mateu Lahoz blows his whistle and signals a foul after Unai Bustinza (Leganes) brought his opponent down."
        },
        {
            "gameTime": "2 - 19:30",
            "label": "",
            "description": "Real Madrid are playing excellent possession football at the moment by exchanging some long passes."
        },
        {
            "gameTime": "2 - 18:05",
            "label": "",
            "description": "Daniel Carvajal receives a sweet cross inside the box from Luka Modric (Real Madrid), but one of the defenders rushes in bravely to intercept the move. The ball has crossed the sideline. Real Madrid are taking a throw in."
        },
        {
            "gameTime": "2 - 16:31",
            "label": "substitution",
            "description": "Substitution. Mateo Kovacic makes his way off the pitch and Luka Modric (Real Madrid) comes on as his replacement."
        },
        {
            "gameTime": "2 - 15:42",
            "label": "y-card",
            "description": "Martin Mantovani (Leganes) shouldn't be surprised it's a yellow from the ref, who cooled the situation down well."
        },
        {
            "gameTime": "2 - 14:15",
            "label": "",
            "description": "Gareth Bale (Real Madrid) creates himself some space around the penalty spot and connects with the free kick. His header would probably have ended up low inside the middle of the goal, but Jon Serantes pulls off a comfortable save to thwart him."
        },
        {
            "gameTime": "2 - 12:26",
            "label": "",
            "description": "Diego Rico (Leganes) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "2 - 10:56",
            "label": "",
            "description": "The linesman raises his flag. Gabriel (Leganes) is adjudged offside."
        },
        {
            "gameTime": "2 - 09:41",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Omar Ramos (Leganes) for Darwin Machis."
        },
        {
            "gameTime": "2 - 09:02",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "2 - 08:47",
            "label": "",
            "description": "Unai Lopez (Leganes) gets on the ball and beats an opponent, but his run is stopped by the referee Antonio Mateu Lahoz who sees an offensive foul."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 07:26",
            "label": "",
            "description": "Gareth Bale (Real Madrid) slams the ball from a long range free kick. He should have curled it higher to avoid hitting the wall. Real Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 06:13",
            "label": "",
            "description": "Marcelo (Real Madrid) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 04:46",
            "label": "",
            "description": "Gabriel (Leganes) makes a reckless foul in order to win the ball from his opponent. Antonio Mateu Lahoz has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 03:56",
            "label": "",
            "description": "Neat link up play between Isco (Real Madrid) and Gareth Bale, but Jon Serantes reads the game well and the move breaks down."
        },
        {
            "gameTime": "2 - 03:00",
            "label": "",
            "description": "Jon Serantes makes a superb save to deny a header which was nodded towards the right hand post by Gareth Bale (Real Madrid) after a cross from the side."
        },
        {
            "gameTime": "2 - 02:39",
            "label": "",
            "description": "Gareth Bale (Real Madrid) is caught offside!"
        },
        {
            "gameTime": "2 - 02:00",
            "label": "",
            "description": "A long ball forward to Cristiano Ronaldo (Real Madrid) is intercepted."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game. It hasn't been very exciting show so far. The visitors played second fiddle to the home team in the first half. The home players try to win the ball back as quickly as possible every time they lose possession. The away players attempt to beat the opposition's defence using mostly counter attacks."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:20",
            "label": "soccer-ball",
            "description": "Goal Gareth Bale (Real Madrid)! Gareth Bale (Real Madrid) was put through by Alvaro Morata and he showed brilliant composure to tuck it home from inside the box. 2:0."
        },
        {
            "gameTime": "1 - 43:54",
            "label": "corner",
            "description": "Leganes have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "1 - 43:28",
            "label": "",
            "description": "What a great touch by Alexander Szymanowski (Leganes) as he controls a fine pass into the box and takes a shot to the right side of the goal, but an opposing player makes a clearance. Great defending. The ball goes out for a corner. Leganes can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 41:45",
            "label": "y-card",
            "description": "Pablo Insua (Leganes) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "y-card",
            "description": "Nacho (Real Madrid) has tested the patience of referee Antonio Mateu Lahoz and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 39:54",
            "label": "y-card",
            "description": "Toni Kroos (Real Madrid) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "1 - 38:00",
            "label": "soccer-ball",
            "description": "Isco feeds the ball through to Gareth Bale (Real Madrid), who picks up the pass inside the box and quickly sends it into the bottom left corner! The goalkeeper was helpless. 0:0!"
        },
        {
            "gameTime": "1 - 36:34",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries his luck with a shot from long distance after receiving a good pass. His poorly placed effort flies miles wide of the left post."
        },
        {
            "gameTime": "1 - 34:18",
            "label": "",
            "description": "Alexander Szymanowski (Leganes) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 33:17",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) commits a foul and Antonio Mateu Lahoz immediately signals a free kick."
        },
        {
            "gameTime": "1 - 31:29",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "1 - 30:03",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 28:59",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) bursts into the box and latches on to a pin point long through ball, but one of the defenders steps in to clear the ball to safety."
        },
        {
            "gameTime": "1 - 27:12",
            "label": "",
            "description": "The ball is cleared after Gabriel (Leganes) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 26:02",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 24:48",
            "label": "",
            "description": "Antonio Mateu Lahoz has a clear sight and sees a foul from Marcelo (Real Madrid)."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "A rebound falls at the feet of Isco (Real Madrid) who unleashes a shot from long range towards the goal. However, his effort is poor and it flies high over the crossbar."
        },
        {
            "gameTime": "1 - 23:40",
            "label": "",
            "description": "Gareth Bale (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 22:16",
            "label": "",
            "description": "Daniel Carvajal picks out Cristiano Ronaldo (Real Madrid) unmarked inside the box, but he blazes the ball well over the bar."
        },
        {
            "gameTime": "1 - 20:34",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) jumps for a cross in the goal area and produces a fine header which goes just a few inches over the bar! What a huge opportunity! The ball goes out of play and Leganes will have a goal kick."
        },
        {
            "gameTime": "1 - 19:44",
            "label": "",
            "description": "Gareth Bale (Real Madrid) received a clever through ball which could have put him in a promising position, but the defence was alert to the danger. The linesman signals a throw in for Real Madrid."
        },
        {
            "gameTime": "1 - 18:01",
            "label": "",
            "description": "Marcelo (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 16:46",
            "label": "y-card",
            "description": "Cristiano Ronaldo (Real Madrid) is shown the yellow card for talking out of turn to the referee. It could have been worse!"
        },
        {
            "gameTime": "1 - 15:29",
            "label": "",
            "description": "Unai Lopez (Leganes) swings it in and Alexander Szymanowski gets on the end of it, but Keylor Navas shows good awareness and comes off his line to thwart the move."
        },
        {
            "gameTime": "1 - 13:40",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 12:17",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) did his best to latch on to a crossfield pass, but it was too long and it goes out of play. The ball goes out of play and Leganes will have a goal kick."
        },
        {
            "gameTime": "1 - 11:35",
            "label": "",
            "description": "Martin Mantovani (Leganes) gives away a foul for a clumsy challenge. Referee Antonio Mateu Lahoz saw the whole situation."
        },
        {
            "gameTime": "1 - 10:43",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) tries to play a long through ball into Gareth Bale, but the defence breaks the move down."
        },
        {
            "gameTime": "1 - 09:37",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Real Madrid."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "y-card",
            "description": "Darwin Machis (Leganes) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "1 - 06:43",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) makes a run into the box in an attempt to get onto a long through ball, but one of the opponents comes up with a vital clearance."
        },
        {
            "gameTime": "1 - 04:38",
            "label": "",
            "description": "The Real Madrid players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "",
            "description": "Gabriel (Leganes) passes the ball onto Alexander Szymanowski, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 01:45",
            "label": "",
            "description": "Pablo Insua (Leganes) gets the ball from a rebound and shoots from long range, but sends the ball miles wide of the left post. The goalkeeper doesn't have to worry about this one. Very poor attempt."
        },
        {
            "gameTime": "1 - 01:09",
            "label": "",
            "description": "Alexander Szymanowski (Leganes) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "1 - 00:17",
            "label": "",
            "description": "Darwin Machis (Leganes) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leganes will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Mateu Lahoz will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leganes have won 3 away matches this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid scored at least one goal in each of their last 22 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Real Madrid is Cristiano Ronaldo with 10 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. The home side were better today. The home team tried to win the ball back as quickly as possible every time they lost possession. The away side attempted to beat the opposition's defence mainly using counter attacks."
        }
    ],
    "gameAwayTeam": "Leganes",
    "gameDate": "06/11/2016 - 14:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "3 - 0"
}