{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-09-18 - 21-45 Fiorentina 1 - 0 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 53:59",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. We saw a very balanced game over the 90 minutes. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 53:02",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 50:52",
            "label": "injury",
            "description": "Carlos Sanchez (Fiorentina) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 49:33",
            "label": "",
            "description": "Francesco Totti (AS Roma) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post."
        },
        {
            "gameTime": "2 - 48:58",
            "label": "",
            "description": "Alessandro Florenzi (AS Roma) latches on to a precise defence splitting pass and drills a nice strike from a promising distance towards the middle of the goal. Ciprian Tatarusanu has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 46:06",
            "label": "injury",
            "description": "Hrvoje Milic (Fiorentina) is writhing in pain and can now receive medical treatment after the referee decides to stop play."
        },
        {
            "gameTime": "2 - 45:50",
            "label": "",
            "description": "Nicola Rizzoli has a clear sight and sees a foul from Kevin Strootman (AS Roma)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 42:18",
            "label": "",
            "description": "Edin Dzeko (AS Roma) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 41:59",
            "label": "corner",
            "description": "Alessandro Florenzi (AS Roma) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 41:39",
            "label": "",
            "description": "Francesco Totti (AS Roma) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. Corner kick. AS Roma will have an opportunity."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "substitution",
            "description": "Luciano Spalletti prepares a substitution. Radja Nainggolan is replaced by Juan Iturbe (AS Roma)."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "substitution",
            "description": "Today's match ends for Nikola Kalinic who will be replaced by Sebastian Cristoforo (Fiorentina)."
        },
        {
            "gameTime": "2 - 37:00",
            "label": "soccer-ball",
            "description": "Milan Badelj (Fiorentina) collects an exquisite pass and gets into a shooting position. He produces a snap shot that goes in off the left post and inside the back of the net."
        },
        {
            "gameTime": "2 - 35:28",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) wastes a promising chance as he unleashes a first time shot from mid range which hits the right post!"
        },
        {
            "gameTime": "2 - 34:45",
            "label": "",
            "description": "Nenad Tomovic (Fiorentina) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 33:30",
            "label": "injury",
            "description": "Nenad Tomovic (Fiorentina) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 32:31",
            "label": "substitution",
            "description": "Diego Perotti goes off the pitch and Francesco Totti (AS Roma) comes on."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "substitution",
            "description": "Paulo Sousa has decided to introduce fresh legs, with Khouma Babacar (Fiorentina) replacing Josip Ilicic."
        },
        {
            "gameTime": "2 - 29:58",
            "label": "",
            "description": "Diego Perotti (AS Roma) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 28:33",
            "label": "corner",
            "description": "Alessandro Florenzi (AS Roma) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "2 - 28:20",
            "label": "",
            "description": "Diego Perotti (AS Roma) serves up a nice cross, but the defence clears the danger. The ball goes behind for a corner. AS Roma will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 27:31",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) crosses the ball into the box, but one of the defending players averts the threat. The ball is out of play. AS Roma will have a throw in."
        },
        {
            "gameTime": "2 - 24:26",
            "label": "",
            "description": "Edin Dzeko (AS Roma) fails to beat the offside trap. The flag goes up and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 22:12",
            "label": "",
            "description": "Nikola Kalinic (Fiorentina) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "substitution",
            "description": "Substitution. Stephan El Shaarawy (AS Roma) on for Mohamed Salah."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "corner",
            "description": "Federico Bernardeschi (Fiorentina) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 21:36",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) fails to find any of his teammates inside the box as his pass is blocked. Fiorentina force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 20:47",
            "label": "corner",
            "description": "The resulting corner from Federico Bernardeschi (Fiorentina) only finds one of the defenders, who heads it out of danger. Fiorentina have a corner."
        },
        {
            "gameTime": "2 - 18:45",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Diego Perotti (AS Roma). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 18:35",
            "label": "substitution",
            "description": "Substitution. Federico Bernardeschi (Fiorentina) receives a signal from the referee and is now allowed to enter the pitch as Cristian Tello walks off."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "y-card",
            "description": "Alessandro Florenzi (AS Roma) got a yellow card."
        },
        {
            "gameTime": "2 - 17:58",
            "label": "",
            "description": "Diego Perotti (AS Roma) fashions a shot from the edge of the box after receiving an accurate pass. Ciprian Tatarusanu makes a stunning save to stop the effort from flying into the roof of the net. AS Roma force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 16:49",
            "label": "",
            "description": "Kevin Strootman (AS Roma) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 14:28",
            "label": "",
            "description": "Hrvoje Milic (Fiorentina) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 12:42",
            "label": "",
            "description": "Borja Valero (Fiorentina) threads a pass through the eye of a needle into the box for Nikola Kalinic, but Wojciech Szczesny displays great awareness to stop him."
        },
        {
            "gameTime": "2 - 10:06",
            "label": "corner",
            "description": "Josip Ilicic (Fiorentina) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 09:35",
            "label": "",
            "description": "Iglesias Borja Valero (Fiorentina) sends a cross into the box, but the opposition's defence clears the ball to safety. The referee and his assistant both point at the corner flag. Fiorentina will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 08:34",
            "label": "",
            "description": "Diego Perotti (AS Roma) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 07:15",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) collects a pass on the edge of the box and unleashes a low drive to the middle, but Wojciech Szczesny makes a save."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "",
            "description": "A pass from Carlos Sanchez (Fiorentina) is intercepted by Wojciech Szczesny and the move breaks down."
        },
        {
            "gameTime": "2 - 04:57",
            "label": "",
            "description": "The ball is cleared after Edin Dzeko (AS Roma) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 03:25",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Fiorentina was in an offside position."
        },
        {
            "gameTime": "2 - 02:33",
            "label": "",
            "description": "Cristian Tello (Fiorentina) latches on to a precise lofted cross inside the box, controls the ball and unleashes a fine strike towards the right post. His dangerous effort is blocked by Wojciech Szczesny, who makes a glorious save!"
        },
        {
            "gameTime": "2 - 01:56",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Fiorentina."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Let's hope the managers of both teams will be able to stir up the players as up till now the game has lacked any interesting or exciting moments. There wasn't any evident superiority by either side during the first half. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 45:15",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Nicola Rizzoli has ended it."
        },
        {
            "gameTime": "1 - 44:36",
            "label": "",
            "description": "That was close by Mohamed Salah (AS Roma)! He receives a pass on the edge of the box and shoots, but the ball goes by a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 43:36",
            "label": "",
            "description": "Borja Valero (Fiorentina) knew what to do with the ball, but was just a bit unlucky. After receiving a pass, he sent the ball goalwards from some 26 metres out, but it missed the left post by a whisker."
        },
        {
            "gameTime": "1 - 42:52",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) creates a good chance for himself and goes for goal from mid range, but the effort is well over the bar."
        },
        {
            "gameTime": "1 - 41:39",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) launches a cross from the corner, but Ciprian Tatarusanu is alert to thwart the effort."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "",
            "description": "A cross, provided by Diego Perotti (AS Roma), caused no threat to the opposition's defence as the ball was cleared out of danger. AS Roma have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 40:29",
            "label": "",
            "description": "Nicola Rizzoli interrupts the game for a tactical foul by Nenad Tomovic (Fiorentina). AS Roma are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 39:06",
            "label": "",
            "description": "Fiorentina keep the ball well and push forward with purpose, but here comes an interception from the opposition."
        },
        {
            "gameTime": "1 - 38:15",
            "label": "",
            "description": "Hrvoje Milic (Fiorentina) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 37:17",
            "label": "",
            "description": "Edin Dzeko (AS Roma) latches onto a brilliant cross and fires the ball towards goal, but his shot goes high over the crossbar."
        },
        {
            "gameTime": "1 - 36:08",
            "label": "",
            "description": "A precise low pass is received by Hrvoje Milic (Fiorentina), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well over the bar."
        },
        {
            "gameTime": "1 - 35:02",
            "label": "corner",
            "description": "Josip Ilicic (Fiorentina) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 34:31",
            "label": "corner",
            "description": "The corner from Josip Ilicic (Fiorentina) is cleared away by the defence. The referee points to the corner flag. It's a corner to Fiorentina."
        },
        {
            "gameTime": "1 - 34:14",
            "label": "",
            "description": "Iglesias Borja Valero (Fiorentina) sends a pass into the box, but his attempt is thwarted and cleared. Good work from Fiorentina as they win a corner."
        },
        {
            "gameTime": "1 - 33:24",
            "label": "",
            "description": "Carlos Sanchez (Fiorentina) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "",
            "description": "Fiorentina enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 30:51",
            "label": "y-card",
            "description": "Nicola Rizzoli shows a yellow card to Carlos Sanchez (Fiorentina) for his blatant foul."
        },
        {
            "gameTime": "1 - 29:47",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 28:14",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 25:45",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 24:49",
            "label": "",
            "description": "Edin Dzeko (AS Roma) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 23:40",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) attempts a long crossfield pass, but the defence does well to intercept the ball."
        },
        {
            "gameTime": "1 - 21:25",
            "label": "",
            "description": "Alessandro Florenzi (AS Roma) crosses the ball from the free kick, but it goes out of play."
        },
        {
            "gameTime": "1 - 20:14",
            "label": "",
            "description": "Nicola Rizzoli blows his whistle. Hrvoje Milic (Fiorentina) commits a foul after dangerous play. AS Roma are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 19:16",
            "label": "corner",
            "description": "Mohamed Salah (AS Roma) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 18:56",
            "label": "",
            "description": "Kevin Strootman (AS Roma) looks to break free, but an opposing player clears the ball away. The ball is out of play. AS Roma win a corner kick."
        },
        {
            "gameTime": "1 - 18:40",
            "label": "",
            "description": "Edin Dzeko (AS Roma) controls a nice lofted pass and shoots from the edge of the box, but his attempt is neither hard nor precise, so Ciprian Tatarusanu stops it easily."
        },
        {
            "gameTime": "1 - 17:51",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 17:38",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) delivers a crossfield pass, but the ball is cut out before it reaches its intended target. The ball goes out of play. AS Roma are awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:58",
            "label": "",
            "description": "Kevin Strootman (AS Roma) makes an overly aggressive challenge and Nicola Rizzoli blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 15:11",
            "label": "",
            "description": "Daniele De Rossi clips a neat ball into the box towards Edin Dzeko (AS Roma), whose header from the centre of the box goes a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 13:28",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "1 - 13:19",
            "label": "",
            "description": "Nicola Rizzoli interrupts the game. One of the players from AS Roma won the ball, but his effort is adjudged unfair. Fiorentina are awarded the free kick."
        },
        {
            "gameTime": "1 - 12:25",
            "label": "",
            "description": "Edin Dzeko (AS Roma) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 11:42",
            "label": "",
            "description": "Mohamed Salah (AS Roma) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 10:38",
            "label": "",
            "description": "Great teamplay by AS Roma as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 08:16",
            "label": "",
            "description": "Carlos Sanchez (Fiorentina) sprays a pass out to Nikola Kalinic, but he can't beat his man inside the box."
        },
        {
            "gameTime": "1 - 06:40",
            "label": "",
            "description": "A raking crossfield pass from Alessandro Florenzi (AS Roma) lacks accuracy and the opposition gain possession."
        },
        {
            "gameTime": "1 - 05:39",
            "label": "",
            "description": "Kevin Strootman (AS Roma) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation."
        },
        {
            "gameTime": "1 - 04:13",
            "label": "",
            "description": "Kevin Strootman (AS Roma) passes the ball and slows down the tempo so his team can continue with their combination play."
        },
        {
            "gameTime": "1 - 03:24",
            "label": "",
            "description": "Iglesias Borja Valero (Fiorentina) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 02:01",
            "label": "",
            "description": "The AS Roma players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Nicola Rizzoli."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma will miss a few players for this clash: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko looks sharp as he's the top goal scorer for AS Roma with 20 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. We saw a very balanced game over the 90 minutes. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "18/09/2016 - 21:45",
    "gameHomeTeam": "Fiorentina",
    "gameScore": "1 - 0"
}