{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-05-20 - 21-45 Napoli 4 - 1 Fiorentina/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:22",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 44:05",
            "label": "injury",
            "description": "Josip Ilicic (Fiorentina) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 42:53",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) tries to find Jose Callejon, but he puts too much power on the pass."
        },
        {
            "gameTime": "2 - 41:41",
            "label": "corner",
            "description": "A dangerous looking corner kick from Faouzi Ghoulam (Napoli) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 39:48",
            "label": "corner",
            "description": "Federico Bernardeschi (Fiorentina) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 39:33",
            "label": "",
            "description": "The ball is out of play. Fiorentina win a corner kick. Khouma Babacar (Fiorentina) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Pepe Reina guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 38:38",
            "label": "corner",
            "description": "Federico Bernardeschi (Fiorentina) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 37:37",
            "label": "",
            "description": "Napoli are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 35:34",
            "label": "substitution",
            "description": "Paulo Sousa decides to make a substitution. Nikola Kalinic will be replaced by Riccardo Saponara (Fiorentina)."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "substitution",
            "description": "Substitution. Dries Mertens makes his way off the pitch and Leonardo Pavoletti (Napoli) comes on as his replacement."
        },
        {
            "gameTime": "2 - 27:57",
            "label": "",
            "description": "Jose Callejon (Napoli) goes on a mazy run, skips past two defenders and pulls the trigger in front of the keeper. Ciprian Tatarusanu makes a great save to stop the effort going low into the middle of the goal."
        },
        {
            "gameTime": "2 - 27:15",
            "label": "",
            "description": "Khouma Babacar (Fiorentina) got on the ball on the edge of the box and blazed a first time shot well over the bar."
        },
        {
            "gameTime": "2 - 24:41",
            "label": "",
            "description": "Cristian Tello (Fiorentina) fashions a shot from the edge of the box after receiving an accurate pass. Pepe Reina makes a stunning save to stop the effort from flying into the bottom right corner."
        },
        {
            "gameTime": "2 - 23:41",
            "label": "substitution",
            "description": "Here is a change. Jorginho is going off and Maurizio Sarri gives the last tactical orders to Amadou Diawara (Napoli)."
        },
        {
            "gameTime": "2 - 19:13",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Marko Rog (Napoli) replaces Marek Hamsik."
        },
        {
            "gameTime": "2 - 18:28",
            "label": "soccer-ball",
            "description": "Goal! Dries Mertens (Napoli) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball low inside the right post. It's 4:1."
        },
        {
            "gameTime": "2 - 18:27",
            "label": "",
            "description": "Marek Hamsik (Napoli) receives a low pass just outside the box and unleashes a fine strike towards the bottom right corner. Ciprian Tatarusanu pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "2 - 14:10",
            "label": "soccer-ball",
            "description": "Josip Ilicic (Fiorentina) scores! He latches on to a pass and produces a perfect strike from the edge of the box that goes inside the left post and past the goalkeeper."
        },
        {
            "gameTime": "2 - 12:06",
            "label": "y-card",
            "description": "Nicola Rizzoli shows a yellow card to Matias Vecino (Fiorentina), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 11:22",
            "label": "corner",
            "description": "The ball goes out for a corner. Napoli can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 11:13",
            "label": "soccer-ball",
            "description": "Dries Mertens (Napoli) meets a cross from a well taken corner kick and fires home. His effort goes into the bottom left corner and hits the net."
        },
        {
            "gameTime": "2 - 11:12",
            "label": "",
            "description": "Marek Hamsik (Napoli) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "2 - 10:42",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 10:06",
            "label": "corner",
            "description": "Federico Bernardeschi (Fiorentina) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 09:36",
            "label": "",
            "description": "A pass into the penalty area from Federico Bernardeschi (Fiorentina) is intercepted by the defence. Fiorentina force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 09:01",
            "label": "substitution",
            "description": "Paulo Sousa prepares a substitution. Sebastian Cristoforo is replaced by Cristian Tello (Fiorentina)."
        },
        {
            "gameTime": "2 - 08:56",
            "label": "substitution",
            "description": "We are about to witness a substitution. Khouma Babacar (Fiorentina) is replacing Maximiliano Olivera."
        },
        {
            "gameTime": "2 - 06:08",
            "label": "",
            "description": "Nikola Kalinic (Fiorentina) collects a sweet pass on the edge of the box and in one movement smashes a shot in on goal, but it balloons high over the bar."
        },
        {
            "gameTime": "2 - 04:40",
            "label": "corner",
            "description": "Federico Bernardeschi (Fiorentina) works the corner short."
        },
        {
            "gameTime": "2 - 03:52",
            "label": "y-card",
            "description": "Kalidou Koulibaly (Napoli) has tested the patience of referee Nicola Rizzoli and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 03:17",
            "label": "",
            "description": "Nikola Kalinic (Fiorentina) receives a precise pass and threatens the keeper with a long range shot. His attempt goes miles wide of the left post."
        },
        {
            "gameTime": "2 - 01:10",
            "label": "",
            "description": "Federico Bernardeschi (Fiorentina) sends a cross into the box, but Pepe Reina comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:45",
            "label": "whistle",
            "description": "Nicola Rizzoli has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 42:19",
            "label": "y-card",
            "description": "Raul Albiol (Napoli) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "1 - 40:08",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Federico Bernardeschi (Fiorentina)."
        },
        {
            "gameTime": "1 - 35:08",
            "label": "soccer-ball",
            "description": "Lorenzo Insigne (Napoli) receives a well taken defence splitting pass inside the box and scores! He buries the ball into the bottom left corner."
        },
        {
            "gameTime": "1 - 32:29",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) receives a pass and decides to smash the ball from long range. His poor effort sails well wide of the right post."
        },
        {
            "gameTime": "1 - 30:57",
            "label": "",
            "description": "Marek Hamsik (Napoli) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Ciprian Tatarusanu was alert and the score remained the same."
        },
        {
            "gameTime": "1 - 30:23",
            "label": "corner",
            "description": "Federico Bernardeschi (Fiorentina) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 29:48",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) wasted a huge opportunity! The fans already began to celebrate as he unleashed a powerful shot from the edge of the box after a brilliant solo effort. The ball went towards the bottom left corner, but Pepe Reina made a crucial save! Now Fiorentina have a corner."
        },
        {
            "gameTime": "1 - 28:50",
            "label": "",
            "description": "Piotr Zielinski (Napoli) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 25:44",
            "label": "",
            "description": "What a great touch by Dries Mertens (Napoli)! He picks up a precise pass on the edge of the box and immediately unleashes a shot on goal. His effort, however, only rattles the right post. What an unlucky moment for him."
        },
        {
            "gameTime": "1 - 23:07",
            "label": "",
            "description": "Some neat passing and movement from Fiorentina as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 17:27",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) and his stunning dribble! He zig zags through the defence and gets in front of the keeper. He faints to shoot and then suddenly strikes goalwards, but his effort misses the target by a whisker. Very unlucky for Lorenzo Insigne (Napoli). This could have been a legendary goal."
        },
        {
            "gameTime": "1 - 15:59",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 14:32",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) received a clever through ball which could have put him in a promising position, but the defence was alert to the danger."
        },
        {
            "gameTime": "1 - 10:15",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "soccer-ball",
            "description": "Goal! Kalidou Koulibaly (Napoli) fires the rebound low into the middle of the goal after the ball breaks to him in the box. The score is 1:0."
        },
        {
            "gameTime": "1 - 07:50",
            "label": "",
            "description": "Marek Hamsik (Napoli) jumps inside the box to meet the corner and aims a header towards the right post, but the goalkeeper pulls off an astonishing save to deny him."
        },
        {
            "gameTime": "1 - 07:18",
            "label": "corner",
            "description": "The ball is out of play and the linesman points at the corner flag. Corner to Napoli."
        },
        {
            "gameTime": "1 - 07:11",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 05:30",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) holds his head in his hands after missing a big chance. He latches on to a rebound, creates some space from himself and fires the ball from the edge of the box well wide of the right post."
        },
        {
            "gameTime": "1 - 04:54",
            "label": "corner",
            "description": "The resulting corner from Faouzi Ghoulam (Napoli) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 03:49",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) tries to latch onto a through ball, but it's too long."
        },
        {
            "gameTime": "1 - 03:11",
            "label": "",
            "description": "Nicola Rizzoli blows his whistle for a foul after Milan Badelj (Fiorentina) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 02:21",
            "label": "",
            "description": "Neat passing move from Napoli in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Nicola Rizzoli."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last 5 games between these two teams have been goal rich, with an average of 3.0 goals per game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "5:0 This was the result of the last match between Napoli and Torino."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        }
    ],
    "gameAwayTeam": "Fiorentina",
    "gameDate": "20/05/2017 - 21:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "4 - 1"
}