{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-15 - 21-45 Galatasaray 0 - 2 Atl. Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. Neither of the teams could take the initiative and dominate today's game. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        },
        {
            "gameTime": "2 - 47:28",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 47:02",
            "label": "",
            "description": "Oliver Torres (Atl. Madrid) was too fierce in his attempt to get the ball from his opponent and Szymon Marciniak blows for a foul."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:56",
            "label": "",
            "description": "Burak Yilmaz (Galatasaray) finds himself in a promising position after receiving an excellent pass into the box, but one of the defenders produces a timely intervention to avert the threat."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "corner",
            "description": "Wesley Sneijder (Galatasaray) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 42:39",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) blasts the ball from just outside the box, but his attempt is blocked by the defender. Galatasaray force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 41:34",
            "label": "",
            "description": "Great touch by Antoine Griezmann (Atl. Madrid) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "2 - 39:59",
            "label": "",
            "description": "Direct free kick. Antoine Griezmann (Atl. Madrid) attempts to beat the opposition's defence with a fine lofted pass into the penalty box, but one of the defenders reacts well and averts the threat."
        },
        {
            "gameTime": "2 - 39:41",
            "label": "",
            "description": "Szymon Marciniak blows for a foul after Selcuk Inan (Galatasaray) was too aggressive in the battle for the ball. Atl. Madrid have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 38:57",
            "label": "corner",
            "description": "Sinan Gumus (Galatasaray) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 38:43",
            "label": "corner",
            "description": "The resulting corner from Wesley Sneijder (Galatasaray) only finds one of the defenders, who heads it out of danger. Galatasaray get a corner."
        },
        {
            "gameTime": "2 - 38:17",
            "label": "corner",
            "description": "Wesley Sneijder (Galatasaray) takes a short corner kick. The referee points to the corner flag. It's a corner to Galatasaray."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) takes the free kick and sends the ball into the penalty area, but the opposition's defence is ready. Galatasaray force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 37:34",
            "label": "",
            "description": "Koke (Atl. Madrid) commits a rough foul. Szymon Marciniak stops the game and makes a call. Galatasaray get a free kick."
        },
        {
            "gameTime": "2 - 37:13",
            "label": "corner",
            "description": "The corner from Koke (Atl. Madrid) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 36:59",
            "label": "",
            "description": "Atl. Madrid keep the ball well and push forward with purpose, but here comes an interception from the opposition. The referee blows his whistle, Atl. Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Saul Niguez leaves the pitch and Oliver Torres (Atl. Madrid) comes on."
        },
        {
            "gameTime": "2 - 33:07",
            "label": "",
            "description": "Burak Yilmaz (Galatasaray) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 30:09",
            "label": "",
            "description": "Selcuk Inan (Galatasaray) receives an accurate pass and finds some space for a shot. The keeper is prepared and denies his low, long range blast aimed directly at the bottom of the net."
        },
        {
            "gameTime": "2 - 28:38",
            "label": "",
            "description": "Burak Yilmaz (Galatasaray) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Jan Oblak."
        },
        {
            "gameTime": "2 - 27:54",
            "label": "y-card",
            "description": "The foul by Yasin Oztekin (Galatasaray) is worthy of a card and a yellow is duly shown by Szymon Marciniak."
        },
        {
            "gameTime": "2 - 25:25",
            "label": "substitution",
            "description": "Hamza Hamzaoglu has decided to substitute Lukas Podolski and he is replaced by Sinan Gumus (Galatasaray)."
        },
        {
            "gameTime": "2 - 25:19",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) is penalised for a foul. Szymon Marciniak had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 24:51",
            "label": "",
            "description": "Burak Yilmaz (Galatasaray) gives away a foul for a clumsy challenge. Referee Szymon Marciniak saw the whole situation."
        },
        {
            "gameTime": "2 - 23:06",
            "label": "",
            "description": "Saul Niguez (Atl. Madrid) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him."
        },
        {
            "gameTime": "2 - 22:16",
            "label": "",
            "description": "Lukas Podolski (Galatasaray) is picked out by his teammate with a brilliant short pass, but it takes him too long to control the ball inside the box and this allows one of the defending players to rob him."
        },
        {
            "gameTime": "2 - 21:42",
            "label": "",
            "description": "Koke (Atl. Madrid) handles the ball and everyone in the stadium shouts 'handball'."
        },
        {
            "gameTime": "2 - 20:41",
            "label": "",
            "description": "Umut Bulut (Galatasaray) climbs high to connect with a cross near the penalty spot but plants a header well wide of the left post."
        },
        {
            "gameTime": "2 - 20:23",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) makes a rough challenge and Szymon Marciniak blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 18:17",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Burak Yilmaz (Galatasaray) was quite harsh and Szymon Marciniak didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 18:09",
            "label": "y-card",
            "description": "Gabi (Atl. Madrid) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Szymon Marciniak didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "",
            "description": "Burak Yilmaz (Galatasaray) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 16:57",
            "label": "substitution",
            "description": "Here is a change. Luciano Vietto is going off and Diego Simeone gives the last tactical orders to Gabi (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 15:51",
            "label": "",
            "description": "Lukas Podolski (Galatasaray) should know this behaviour is beyond the rules. He was too careless with his challenge and left Szymon Marciniak no option but to blow his whistle."
        },
        {
            "gameTime": "2 - 14:32",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Jackson Martinez walks off the pitch to be replaced by Fernando Torres (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 12:59",
            "label": "",
            "description": "Excellent touch by Selcuk Inan (Galatasaray)! He latches on to a precise pass on the edge of the box and produces a shot goalwards which goes way wide of the left post."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "",
            "description": "Jackson Martinez (Atl. Madrid) receives a low pass just outside the box and drills a fine strike towards the middle of the goal. Fernando Muslera pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "2 - 10:14",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) fires the ball in from a mid range free kick, but it blazes over the bar."
        },
        {
            "gameTime": "2 - 09:28",
            "label": "",
            "description": "It looks like Saul Niguez (Atl. Madrid) saw red with that tackle. Szymon Marciniak won't tolerate such behaviour on the pitch and blows for a foul. Galatasaray win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 07:54",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) takes a mid range shot, but it lacks accuracy and it goes way over the bar."
        },
        {
            "gameTime": "2 - 07:32",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 06:36",
            "label": "injury",
            "description": "The game is interrupted now, Diego Godin (Atl. Madrid) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 06:10",
            "label": "",
            "description": "Lukas Podolski (Galatasaray) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the left post."
        },
        {
            "gameTime": "2 - 05:42",
            "label": "",
            "description": "Yasin Oztekin (Galatasaray) dribbles into space and finds himself in a shooting position, but his shot from the edge of the box is bravely blocked."
        },
        {
            "gameTime": "2 - 04:17",
            "label": "",
            "description": "Poor challenge! Yasin Oztekin (Galatasaray) is penalised for tripping and Szymon Marciniak blows his whistle."
        },
        {
            "gameTime": "2 - 03:32",
            "label": "",
            "description": "Szymon Marciniak blows his whistle. Lukas Podolski (Galatasaray) commits a foul after dangerous play."
        },
        {
            "gameTime": "2 - 02:31",
            "label": "",
            "description": "Umut Bulut (Galatasaray) receives a fine low pass and attempts to send the ball past the goalkeeper, but his shot goes wide of the goal."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "",
            "description": "Selcuk Inan (Galatasaray) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Szymon Marciniak blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "2 - 00:22",
            "label": "substitution",
            "description": "Hamza Hamzaoglu has made a change at the break. Yasin Oztekin (Galatasaray) has come on in place of Sabri Sarioglu."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Szymon Marciniak blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "There has been no time for the supporters to get bored during an eventful opening 45 minutes. Both teams provided some breathtaking moments. The visitors were more active and dominated the home side in the first half, who weren't able to keep up. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 46:15",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Szymon Marciniak has ended it."
        },
        {
            "gameTime": "1 - 46:10",
            "label": "",
            "description": "A cross into the box finds the head of Burak Yilmaz (Galatasaray) who steers it goalwards, but Jan Oblak manages to pull off a decent save to thwart him."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:05",
            "label": "",
            "description": "Jason Denayer (Galatasaray) reacts well and displays good awareness inside the box to get on the end of the resulting corner kick. He fails to direct the ball into the net as it flies narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 43:51",
            "label": "corner",
            "description": "The referee awards a corner and Wesley Sneijder (Galatasaray) goes over to take it."
        },
        {
            "gameTime": "1 - 43:26",
            "label": "",
            "description": "Wow, what an escape. Umut Bulut (Galatasaray) has an effort from inside the box but it's brilliantly blocked. Good work from Galatasaray as they win a corner."
        },
        {
            "gameTime": "1 - 41:34",
            "label": "",
            "description": "Umut Bulut (Galatasaray) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball goes well wide of the right post!"
        },
        {
            "gameTime": "1 - 40:43",
            "label": "",
            "description": "Jose Maria Gimenez (Atl. Madrid) jumps for a header from the resulting corner kick and sends the ball in on goal, but the goalkeeper makes a very good save."
        },
        {
            "gameTime": "1 - 40:06",
            "label": "corner",
            "description": "Koke (Atl. Madrid) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 39:49",
            "label": "",
            "description": "Luciano Vietto (Atl. Madrid) meets a cross inside the box, but his header is blocked by an opposing player. Atl. Madrid earn a corner."
        },
        {
            "gameTime": "1 - 38:57",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) is picked out by one of his teammates with a great cross, but his poor control allows the defence to clear and avert the threat. The referee and the linesman both signal a throw in for Atl. Madrid."
        },
        {
            "gameTime": "1 - 37:13",
            "label": "",
            "description": "Great teamplay by Atl. Madrid as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 34:33",
            "label": "",
            "description": "Burak Yilmaz (Galatasaray) was too forceful with his tackle and Szymon Marciniak interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 31:05",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Umut Bulut (Galatasaray) comes onto the pitch so that Emre Colak can be given a rest."
        },
        {
            "gameTime": "1 - 30:18",
            "label": "",
            "description": "Szymon Marciniak blows his whistle and it's Lukas Podolski (Galatasaray) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 29:06",
            "label": "corner",
            "description": "Wesley Sneijder (Galatasaray) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 28:34",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the left post is, however, superbly saved by Jan Oblak! The ball goes out of play and Galatasaray have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 24:39",
            "label": "soccer-ball",
            "description": "GOAL! Diego Godin meets a cross inside the box and heads the ball across the goal, where Antoine Griezmann (Atl. Madrid) lurks and pokes it into the back of the net. 0:2."
        },
        {
            "gameTime": "1 - 23:46",
            "label": "corner",
            "description": "The resulting corner from Koke (Atl. Madrid) is cleared by the defence."
        },
        {
            "gameTime": "1 - 23:45",
            "label": "",
            "description": "Saul Niguez (Atl. Madrid) gets on the end of a pass on the edge of the box but his shot is blocked. Atl. Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 23:44",
            "label": "corner",
            "description": "Wesley Sneijder (Galatasaray) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 23:21",
            "label": "",
            "description": "Selcuk Inan (Galatasaray) darts to the edge of the box to meet the ball from the free kick and sends a header towards the middle of the target. One of the defending players gets in its way and blocks it. The referee and his assistant both point at the corner flag. Galatasaray will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 22:31",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) takes a direct free kick."
        },
        {
            "gameTime": "1 - 21:56",
            "label": "",
            "description": "Szymon Marciniak interrupts the game for a tactical foul by Guilherme Siqueira (Atl. Madrid). Galatasaray have a free kick."
        },
        {
            "gameTime": "1 - 20:48",
            "label": "",
            "description": "Saul Niguez (Atl. Madrid) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "1 - 20:11",
            "label": "",
            "description": "Szymon Marciniak blows the whistle, Selcuk Inan (Galatasaray) is penalised for a foul."
        },
        {
            "gameTime": "1 - 17:53",
            "label": "soccer-ball",
            "description": "Juanfran passes to Antoine Griezmann (Atl. Madrid), who collects the ball and unleashes a terrific shot from the edge of the box. His effort goes into the bottom right corner. Fabulous goal! The score is 0:1."
        },
        {
            "gameTime": "1 - 15:51",
            "label": "",
            "description": "Hakan Balta (Galatasaray) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 14:16",
            "label": "",
            "description": "Luciano Vietto (Atl. Madrid) receives a low pass just outside the box and unleashes a fine strike towards the right post. Fernando Muslera pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 12:03",
            "label": "",
            "description": "Lukas Podolski (Galatasaray) commits a rough challenge and Szymon Marciniak blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 11:31",
            "label": "corner",
            "description": "A dangerous looking corner kick from Wesley Sneijder (Galatasaray) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 10:59",
            "label": "",
            "description": "What a goal scoring opportunity! Burak Yilmaz (Galatasaray) makes a good run into the box to meet a cross and fires the ball in on goal, but the shot is amazingly blocked by a defender. The linesman makes the right call and Galatasaray will have a corner."
        },
        {
            "gameTime": "1 - 09:38",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 08:49",
            "label": "",
            "description": "Jose Maria Gimenez (Atl. Madrid) makes a reckless foul in order to win the ball from his opponent. Szymon Marciniak has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 08:26",
            "label": "",
            "description": "Luciano Vietto (Atl. Madrid) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Fernando Muslera was alert and the score remained the same."
        },
        {
            "gameTime": "1 - 07:30",
            "label": "",
            "description": "Burak Yilmaz (Galatasaray) whips the ball into the box and Wesley Sneijder takes a perfect touch to control it, but one of the defenders does well to intercept."
        },
        {
            "gameTime": "1 - 06:09",
            "label": "",
            "description": "Sabri Sarioglu (Galatasaray) escapes the opposition's pressure by passing the ball on the ground."
        },
        {
            "gameTime": "1 - 05:19",
            "label": "",
            "description": "Good clearance! Wesley Sneijder (Galatasaray) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him. The ball has crossed the sideline. Atl. Madrid are taking a throw in."
        },
        {
            "gameTime": "1 - 04:15",
            "label": "",
            "description": "Atl. Madrid enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 02:23",
            "label": "",
            "description": "Tiago (Atl. Madrid) outjumps his marker and heads the resulting corner high over the bar."
        },
        {
            "gameTime": "1 - 02:09",
            "label": "corner",
            "description": "Koke (Atl. Madrid) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 01:39",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) swings in a cross, but the ball is cleared to safety by one of the defending players. Atl. Madrid will take a corner kick."
        },
        {
            "gameTime": "1 - 01:00",
            "label": "",
            "description": "Luciano Vietto (Atl. Madrid) brings his opponent down with a tackle and Szymon Marciniak blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 00:39",
            "label": "",
            "description": "Koke (Atl. Madrid) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Atl. Madrid will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Szymon Marciniak."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. Neither of the teams could take the initiative and dominate today's game. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        }
    ],
    "gameAwayTeam": "Atl. Madrid",
    "gameDate": "15/09/2015 - 21:45",
    "gameHomeTeam": "Galatasaray",
    "gameScore": "0 - 2"
}