{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2014-2015/2015-05-02 - 16-30 Hoffenheim 1 - 1 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The fans could demand a bit more entertainment for their money. This game was average. There wasn't any significant dominance by either side in this game. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 47:59",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "",
            "description": "Great touch by Ciro Immobile (Dortmund) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "2 - 47:27",
            "label": "",
            "description": "The linesman raises his flag. Kevin Volland (Hoffenheim) is adjudged offside."
        },
        {
            "gameTime": "2 - 46:48",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 45:40",
            "label": "substitution",
            "description": "Substitution. Pirmin Schwegler makes way for Sejad Salihovic (Hoffenheim)."
        },
        {
            "gameTime": "2 - 45:19",
            "label": "",
            "description": "Mats Hummels (Dortmund) gets on the ball and beats an opponent, but his run is stopped by the referee Jochen Drees who sees an offensive foul."
        },
        {
            "gameTime": "2 - 45:03",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:37",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. Now Dortmund have a corner."
        },
        {
            "gameTime": "2 - 43:45",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Henrikh Mkhitaryan (Dortmund) sends it out of play."
        },
        {
            "gameTime": "2 - 43:20",
            "label": "",
            "description": "A lofted cross from Sebastian Kehl (Dortmund) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Good work from Dortmund as they win a corner."
        },
        {
            "gameTime": "2 - 42:01",
            "label": "",
            "description": "Ciro Immobile (Dortmund) collects a great pass inside the box and misses a golden opportunity. His low shot was directed into the middle of the goal, but the goalkeeper does well to stop his effort."
        },
        {
            "gameTime": "2 - 39:15",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 39:12",
            "label": "",
            "description": "It's unbelievable, Pierre Emerick Aubameyang (Dortmund) blows a huge opportunity! He has a lot of space around him and fires a terrific daisy cutter from point blank range. His first time effort is directed towards the middle of the target, but Oliver Baumann reacts superbly to keep the ball out."
        },
        {
            "gameTime": "2 - 39:05",
            "label": "",
            "description": "Pirmin Schwegler (Hoffenheim) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 37:29",
            "label": "injury",
            "description": "The game is interrupted now, Pirmin Schwegler (Hoffenheim) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 36:43",
            "label": "",
            "description": "Hoffenheim move the ball around well as they wait for an opportunity to shoot, but the attack is halted as they lose possession."
        },
        {
            "gameTime": "2 - 35:49",
            "label": "substitution",
            "description": "Markus Gisdol is forced to make a change. David Abraham is unable to continue due to injury, Jin Su Kim (Hoffenheim) comes on."
        },
        {
            "gameTime": "2 - 34:42",
            "label": "injury",
            "description": "David Abraham (Hoffenheim) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 34:08",
            "label": "",
            "description": "Ciro Immobile (Dortmund) is adjudged offside."
        },
        {
            "gameTime": "2 - 33:54",
            "label": "corner",
            "description": "Pirmin Schwegler (Hoffenheim) sends in a poor cross from the corner and Mitchell Langerak has no trouble gathering it."
        },
        {
            "gameTime": "2 - 33:37",
            "label": "",
            "description": "Sven Schipplock (Hoffenheim) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Hoffenheim get a corner."
        },
        {
            "gameTime": "2 - 32:55",
            "label": "corner",
            "description": "Pirmin Schwegler (Hoffenheim) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 32:37",
            "label": "",
            "description": "Jeremy Toljan (Hoffenheim) creates a yard of space for himself and tries an effort from distance, but it's blocked. The ball goes out of play. Hoffenheim are awarded a corner kick."
        },
        {
            "gameTime": "2 - 32:18",
            "label": "corner",
            "description": "Pirmin Schwegler (Hoffenheim) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 31:58",
            "label": "",
            "description": "Jeremy Toljan (Hoffenheim) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. Hoffenheim have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 31:21",
            "label": "",
            "description": "Sven Schipplock (Hoffenheim) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The ball is out of play. Hoffenheim will take a throw in."
        },
        {
            "gameTime": "2 - 31:06",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) is flagged for offside."
        },
        {
            "gameTime": "2 - 30:39",
            "label": "",
            "description": "Roberto Firmino (Hoffenheim) and Sven Schipplock try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "2 - 29:40",
            "label": "",
            "description": "The referee blows his whistle after Andreas Beck (Hoffenheim) does a good impression of a basketball player and handles the ball."
        },
        {
            "gameTime": "2 - 29:17",
            "label": "substitution",
            "description": "Markus Gisdol has decided to substitute Anthony Modeste and he is replaced by Sven Schipplock (Hoffenheim)."
        },
        {
            "gameTime": "2 - 28:31",
            "label": "",
            "description": "Anthony Modeste (Hoffenheim) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box into the stands."
        },
        {
            "gameTime": "2 - 28:18",
            "label": "substitution",
            "description": "It's time for a substitution. Ciro Immobile (Dortmund) comes on in place of Shinji Kagawa."
        },
        {
            "gameTime": "2 - 27:11",
            "label": "",
            "description": "Pirmin Schwegler (Hoffenheim) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "2 - 26:31",
            "label": "y-card",
            "description": "Erik Durm (Dortmund) is awarded a yellow card. The referee showed him no mercy."
        },
        {
            "gameTime": "2 - 26:20",
            "label": "",
            "description": "Jochen Drees interrupts the game for a tactical foul by Erik Durm (Dortmund). It's a free kick to Hoffenheim in a dangerous position."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "",
            "description": "Adam Szalai (Hoffenheim) is caught offside!"
        },
        {
            "gameTime": "2 - 24:10",
            "label": "",
            "description": "Adam Szalai (Hoffenheim) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 22:53",
            "label": "",
            "description": "Kevin Volland (Hoffenheim) breaks past challenges inside the box, but puts too much pace on his pass to Jeremy Toljan."
        },
        {
            "gameTime": "2 - 21:00",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 20:17",
            "label": "",
            "description": "Anthony Modeste (Hoffenheim) sends a long ball across the pitch, but it misses its target. The ball goes out of play and Dortmund will have a goal kick."
        },
        {
            "gameTime": "2 - 18:33",
            "label": "",
            "description": "Close! Pierre Emerick Aubameyang (Dortmund) picks up the ball in space and from inside the penalty area sends a shot inches wide of the right post."
        },
        {
            "gameTime": "2 - 17:47",
            "label": "",
            "description": "A cross arrives in the goalmouth from the resulting corner kick. Ermin Bicakcic (Hoffenheim) outjumps the defence, but his promising header bounces away off the bar!"
        },
        {
            "gameTime": "2 - 17:05",
            "label": "corner",
            "description": "Pirmin Schwegler (Hoffenheim) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 16:54",
            "label": "corner",
            "description": "The resulting corner from Pirmin Schwegler (Hoffenheim) is cleared by the defence. The referee and one of his assistants signal for a corner kick to Hoffenheim."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "",
            "description": "Anthony Modeste (Hoffenheim) has a shot blocked from inside the box. The referee blows his whistle, Hoffenheim are awarded a corner kick."
        },
        {
            "gameTime": "2 - 14:16",
            "label": "",
            "description": "Adam Szalai (Hoffenheim) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Mitchell Langerak was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 12:13",
            "label": "",
            "description": "Anthony Modeste (Hoffenheim) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the right post."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "",
            "description": "Henrikh Mkhitaryan received a sweet pass from Pierre Emerick Aubameyang (Dortmund), but the advance is stopped."
        },
        {
            "gameTime": "2 - 11:08",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 10:56",
            "label": "",
            "description": "Kevin Kampl (Dortmund) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. Dortmund force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 09:36",
            "label": "y-card",
            "description": "Kevin Kampl (Dortmund) sees a yellow card. He should be more careful because one more challenge like that could result in a red card."
        },
        {
            "gameTime": "2 - 07:21",
            "label": "",
            "description": "Referee Jochen Drees sees the trip by Jeremy Toljan (Hoffenheim) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "2 - 07:01",
            "label": "",
            "description": "A pass by Adam Szalai (Hoffenheim) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 06:13",
            "label": "",
            "description": "Anthony Modeste (Hoffenheim) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 05:34",
            "label": "",
            "description": "Kevin Volland (Hoffenheim) sends a long ball in, but Mitchell Langerak comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 04:36",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 04:04",
            "label": "",
            "description": "A cross into the box from Pierre Emerick Aubameyang (Dortmund) is cleared."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 02:42",
            "label": "",
            "description": "Pirmin Schwegler (Hoffenheim) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 02:14",
            "label": "y-card",
            "description": "Jochen Drees shows the yellow card to Sebastian Kehl (Dortmund) for a heavy challenge."
        },
        {
            "gameTime": "2 - 02:10",
            "label": "",
            "description": "Sebastian Kehl (Dortmund) tackles a bit over zealously and Jochen Drees blows for a foul. Hoffenheim get a free kick."
        },
        {
            "gameTime": "2 - 01:33",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the left post."
        },
        {
            "gameTime": "2 - 01:15",
            "label": "",
            "description": "Kevin Volland (Hoffenheim) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the right post. The ball is off of the pitch and it's a goal kick for Dortmund."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Jochen Drees blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "If the players are going to continue with the trend set in the opening 45 minutes, we can expect a decline in the number of visitors to future matches. So far the game has been rather unattractive. Both teams are unsuccessfully trying to control the game and it's pretty even so far. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 45:11",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:39",
            "label": "",
            "description": "Anthony Modeste (Hoffenheim) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 44:15",
            "label": "",
            "description": "Kevin Kampl (Dortmund) pulls the jersey of one of the opposition players and Jochen Drees blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 42:05",
            "label": "",
            "description": "Anthony Modeste (Hoffenheim) goes close to scoring with a shot from inside the box, but he drags his effort wide of the right post."
        },
        {
            "gameTime": "1 - 40:58",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) is unable to feed a through ball into the path of his teammates."
        },
        {
            "gameTime": "1 - 40:40",
            "label": "substitution",
            "description": "Jakub Blaszczykowski is substituted due to injury. Jurgen Klopp gives a chance to Kevin Kampl (Dortmund)."
        },
        {
            "gameTime": "1 - 39:33",
            "label": "",
            "description": "A cross from Anthony Modeste (Hoffenheim) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 38:51",
            "label": "injury",
            "description": "Jakub Blaszczykowski (Dortmund) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 36:01",
            "label": "",
            "description": "Flag goes up against Anthony Modeste (Hoffenheim) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 34:33",
            "label": "soccer-ball",
            "description": "Mats Hummels (Dortmund) meets the corner and displays his eye for goal as he coolly plants a header from close range into the right side of the goal. The score is 1:1."
        },
        {
            "gameTime": "1 - 34:20",
            "label": "corner",
            "description": "The referee awards a corner and Henrikh Mkhitaryan (Dortmund) goes over to take it."
        },
        {
            "gameTime": "1 - 34:15",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) fails to find any of his teammates inside the box as his pass is blocked. Dortmund force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 32:17",
            "label": "soccer-ball",
            "description": "And it's a goal by Kevin Volland (Hoffenheim)! He picked the ball up inside the box and drilled a low shot inside the left post."
        },
        {
            "gameTime": "1 - 32:12",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) commits a foul after bringing down his opponent with a slide tackle."
        },
        {
            "gameTime": "1 - 31:24",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "1 - 31:05",
            "label": "",
            "description": "Eugen Polanski (Hoffenheim) didn't hesitate to knock his opponent down with a harsh sliding tackle. Jochen Drees could probably show him a yellow, but he only goes with blowing the whistle for a foul. Dortmund are awarded a free kick."
        },
        {
            "gameTime": "1 - 30:17",
            "label": "",
            "description": "Kevin Volland (Hoffenheim) received a pass and didn't think long what to do with it. He fired a powerful long range shot which went painfully close to the right post."
        },
        {
            "gameTime": "1 - 28:52",
            "label": "",
            "description": "A pass by Jakub Blaszczykowski (Dortmund) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 27:23",
            "label": "",
            "description": "Flag up against Shinji Kagawa (Dortmund). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 25:55",
            "label": "y-card",
            "description": "The foul by Roberto Firmino (Hoffenheim) is worthy of a card and a yellow is duly shown by Jochen Drees."
        },
        {
            "gameTime": "1 - 25:43",
            "label": "",
            "description": "Roberto Firmino (Hoffenheim) makes a slide tackle, but referee Jochen Drees blows for a foul."
        },
        {
            "gameTime": "1 - 24:39",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 23:26",
            "label": "",
            "description": "Eugen Polanski (Hoffenheim) has an effort from distance but it's blocked."
        },
        {
            "gameTime": "1 - 23:09",
            "label": "",
            "description": "Jochen Drees has a clear sight and sees a foul from Sebastian Kehl (Dortmund). Hoffenheim have a free kick."
        },
        {
            "gameTime": "1 - 22:42",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "1 - 22:25",
            "label": "",
            "description": "Neven Subotic (Dortmund) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "1 - 21:14",
            "label": "corner",
            "description": "Pirmin Schwegler (Hoffenheim) sends the corner into the box, but Mitchell Langerak intercepts it and averts the threat."
        },
        {
            "gameTime": "1 - 20:41",
            "label": "",
            "description": "Kevin Volland (Hoffenheim) races towards goal but the defender gets back well to make a challenge. The ball goes out of play. Hoffenheim are awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:10",
            "label": "",
            "description": "Jakub Blaszczykowski (Dortmund) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "1 - 19:48",
            "label": "",
            "description": "Jochen Drees blows his whistle for a foul after Pirmin Schwegler (Hoffenheim) hacks down one of his opponents. A free kick to Dortmund."
        },
        {
            "gameTime": "1 - 19:24",
            "label": "",
            "description": "Roberto Firmino (Hoffenheim) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 17:38",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) attempts to find one of his teammates with a ball from a free kick outside the box. The goalkeeper climbs high above all the players in the box to intercept the cross and snuff out the opportunity."
        },
        {
            "gameTime": "1 - 17:20",
            "label": "",
            "description": "Pirmin Schwegler (Hoffenheim) jumps into a tackle and Jochen Drees blows his whistle for a foul. Dortmund win a free kick."
        },
        {
            "gameTime": "1 - 15:29",
            "label": "corner",
            "description": "Pirmin Schwegler (Hoffenheim) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 14:12",
            "label": "",
            "description": "Anthony Modeste (Hoffenheim) wastes a good opportunity as his pass into the box is blocked by the defence. The ball is out of play. Hoffenheim will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 12:38",
            "label": "corner",
            "description": "The resulting corner, taken by Jakub Blaszczykowski (Dortmund), comes to nothing."
        },
        {
            "gameTime": "1 - 12:21",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee and his assistant both point at the corner flag. Dortmund will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 11:34",
            "label": "",
            "description": "Pirmin Schwegler (Hoffenheim) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "1 - 10:55",
            "label": "",
            "description": "Hoffenheim control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 08:50",
            "label": "",
            "description": "Jakub Blaszczykowski (Dortmund) is penalised for holding. Jochen Drees signals a set piece."
        },
        {
            "gameTime": "1 - 08:42",
            "label": "",
            "description": "The ball is cleared after Pierre Emerick Aubameyang (Dortmund) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 07:23",
            "label": "corner",
            "description": "A dangerous looking corner kick from Pirmin Schwegler (Hoffenheim) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 06:56",
            "label": "",
            "description": "Kevin Volland (Hoffenheim) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The ball is out of play. A goal scoring opportunity from a corner for Hoffenheim."
        },
        {
            "gameTime": "1 - 06:36",
            "label": "",
            "description": "Roberto Firmino (Hoffenheim) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 06:03",
            "label": "",
            "description": "Kevin Volland (Hoffenheim) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 04:54",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) trips an opposition player and Jochen Drees signals a foul."
        },
        {
            "gameTime": "1 - 03:24",
            "label": "",
            "description": "Anthony Modeste (Hoffenheim) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Mitchell Langerak to get hold of the ball."
        },
        {
            "gameTime": "1 - 01:02",
            "label": "",
            "description": "The Hoffenheim players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jochen Drees will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans could demand a bit more entertainment for their money. This game was average. There wasn't any significant dominance by either side in this game. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "02/05/2015 - 16:30",
    "gameHomeTeam": "Hoffenheim",
    "gameScore": "1 - 1"
}