{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2017-01-02 - 18-00 Sunderland 2 - 2 Liverpool/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The visiting team was controlling the game most of the time. The home side played long passes and crosses into the box. The tactic of the away side, on the other hand, was slow build up play."
        },
        {
            "gameTime": "2 - 50:15",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 48:25",
            "label": "",
            "description": "Roberto Firmino (Liverpool) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "2 - 48:15",
            "label": "corner",
            "description": "Corner kick. Alberto Moreno (Liverpool) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "",
            "description": "Adam Lallana (Liverpool) had a good chance to change the score. He ran towards the goal and unleashed a shot from just outside the penalty area which went towards the left side of the goal, but the goalkeeper was ready and made an amazing save. Liverpool force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 47:19",
            "label": "",
            "description": "Alberto Moreno (Liverpool) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "",
            "description": "Anthony Taylor interrupts the game for a tactical foul by Fabio Borini (Sunderland). Liverpool are awarded the free kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 41:58",
            "label": "",
            "description": "Great touch by Ragnar Klavan (Liverpool) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "2 - 38:56",
            "label": "soccer-ball",
            "description": "Jermain Defoe (Sunderland) steps up and confidently powers the spot kick into the bottom left corner."
        },
        {
            "gameTime": "2 - 38:02",
            "label": "",
            "description": "Jermain Defoe (Sunderland) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 37:59",
            "label": "y-card",
            "description": "Adam Lallana (Liverpool) is shown a deserved yellow card for saying too much to the referee."
        },
        {
            "gameTime": "2 - 37:59",
            "label": "y-card",
            "description": "Sadio Mane (Liverpool) is booked."
        },
        {
            "gameTime": "2 - 37:57",
            "label": "penalty",
            "description": "The players claim that Sadio Mane (Liverpool) handled the ball inside the box and it seems they are right. Sunderland have been awarded a penalty kick!"
        },
        {
            "gameTime": "2 - 36:42",
            "label": "",
            "description": "Emre Can (Liverpool) commits an ugly challenge. The referee sees it and immediately blows his whistle. Sunderland win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 34:42",
            "label": "substitution",
            "description": "Substitution. Daniel Sturridge will be replaced by Lucas Leiva (Liverpool)."
        },
        {
            "gameTime": "2 - 33:27",
            "label": "substitution",
            "description": "David William Moyes has decided to make a change. Wahbi Khazri (Sunderland) replaces Adnan Januzaj."
        },
        {
            "gameTime": "2 - 33:01",
            "label": "",
            "description": "Anthony Taylor blows the whistle, Papy Djilobodji (Sunderland) is penalised for a foul."
        },
        {
            "gameTime": "2 - 31:20",
            "label": "attendance",
            "description": "The attendance for today's match is 46494."
        },
        {
            "gameTime": "2 - 27:37",
            "label": "substitution",
            "description": "Substitution. Georginio Wijnaldum makes way for Divock Origi (Liverpool)."
        },
        {
            "gameTime": "2 - 26:31",
            "label": "soccer-ball",
            "description": "Sadio Mane (Liverpool) scores from the corner kick. The ball slipped through the box to Sadio Mane (Liverpool) and he slotted it past the goalkeeper."
        },
        {
            "gameTime": "2 - 26:06",
            "label": "corner",
            "description": "Alberto Moreno (Liverpool) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 25:40",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Vito Mannone guesses his intention and denies him with a fine save. The ball is out of play and Liverpool manage to earn a corner."
        },
        {
            "gameTime": "2 - 20:29",
            "label": "",
            "description": "Sadio Mane (Liverpool) collects a pass on the edge of the box and unleashes a low drive to the middle, but Vito Mannone makes a save."
        },
        {
            "gameTime": "2 - 19:20",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Jack Rodwell leaves the pitch and Javier Manquillo (Sunderland) comes on."
        },
        {
            "gameTime": "2 - 15:16",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 12:04",
            "label": "",
            "description": "Jermain Defoe (Sunderland) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 10:31",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) clips a neat ball into the box in the direction of Sadio Mane, but he can't get on the end of the pass."
        },
        {
            "gameTime": "2 - 05:13",
            "label": "y-card",
            "description": "Anthony Taylor shows a yellow card to Sebastian Larsson (Sunderland) for a tough tackle. Sebastian Larsson (Sunderland) is penalised for holding. Anthony Taylor signals a set piece."
        },
        {
            "gameTime": "2 - 02:42",
            "label": "",
            "description": "Flag up against Daniel Sturridge (Liverpool). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 02:18",
            "label": "",
            "description": "Adam Lallana (Liverpool) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "2 - 00:18",
            "label": "substitution",
            "description": "Jurgen Klopp makes a switch. Alberto Moreno (Liverpool) is coming on in place of James Milner at the start of the second period."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "This is how football should be full of action, thrilling moments and spectacular opportunities. And we have only had the first 45 minutes, so the expectations for the second half are high. The away side are dominant and dictating the tempo of the game, mainly because of their higher activity and more accurate passing. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 47:24",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 47:14",
            "label": "corner",
            "description": "Adnan Januzaj (Sunderland) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 47:04",
            "label": "",
            "description": "Adnan Januzaj (Sunderland) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The referee and his assistant both point at the corner flag. Sunderland will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 46:36",
            "label": "",
            "description": "Adam Lallana (Liverpool) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him."
        },
        {
            "gameTime": "1 - 45:03",
            "label": "corner",
            "description": "James Milner (Liverpool) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:54",
            "label": "",
            "description": "James Milner (Liverpool) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee and one of his assistants signal for a corner kick to Liverpool."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the left hand post, but Vito Mannone was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 36:48",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) has a good chance to score with a mid range attempt after collecting a pass. He aims for the bottom left corner, but he can't generate enough power to trouble Vito Mannone."
        },
        {
            "gameTime": "1 - 30:25",
            "label": "",
            "description": "The game is interrupted as Jermain Defoe (Sunderland) is flagged offside."
        },
        {
            "gameTime": "1 - 29:39",
            "label": "y-card",
            "description": "James Milner (Liverpool) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "1 - 27:16",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Sebastian Larsson (Sunderland) sends it out of play."
        },
        {
            "gameTime": "1 - 26:59",
            "label": "",
            "description": "Fabio Borini (Sunderland) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. The ball goes out of play and Sunderland have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 26:56",
            "label": "",
            "description": "Jermain Defoe (Sunderland) dribbles into the box, but Simon Mignolet is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "1 - 24:45",
            "label": "soccer-ball",
            "description": "Jermain Defoe (Sunderland) makes no mistake from the penalty spot after firing the ball into the bottom left corner of the goal to give the goalkeeper no chance!"
        },
        {
            "gameTime": "1 - 24:30",
            "label": "",
            "description": "Jermain Defoe (Sunderland) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 24:09",
            "label": "penalty",
            "description": "Ragnar Klavan (Liverpool) commits a rough foul. Anthony Taylor stops the game and makes a call. It's a penalty! Great chance to score for Sunderland!"
        },
        {
            "gameTime": "1 - 18:36",
            "label": "soccer-ball",
            "description": "Daniel Sturridge (Liverpool) finds some space inside the box and scores with a terrific header inside the left post, giving the goalkeeper no chance."
        },
        {
            "gameTime": "1 - 18:35",
            "label": "corner",
            "description": "James Milner (Liverpool) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 18:30",
            "label": "",
            "description": "An attempted cross from Adam Lallana (Liverpool) is cleared. Liverpool have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 18:02",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) decided to shoot after receiving a sweet pass. If it wasn't for Vito Mannone's superb save the ball would have probably ended up inside the left post."
        },
        {
            "gameTime": "1 - 14:38",
            "label": "",
            "description": "Roberto Firmino (Liverpool) latches on to an accurate pass on the edge of the box and immediately unleashes a shot which is wide of the mark."
        },
        {
            "gameTime": "1 - 12:06",
            "label": "y-card",
            "description": "Jack Rodwell (Sunderland) is booked after bringing down an opponent. Anthony Taylor had an easy decision to make."
        },
        {
            "gameTime": "1 - 08:18",
            "label": "corner",
            "description": "The resulting corner from James Milner (Liverpool) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) fashions a shot from the edge of the box after receiving an accurate pass. Vito Mannone makes a stunning save to stop the effort from flying into the roof of the net. The referee blows his whistle, Liverpool are awarded a corner kick."
        },
        {
            "gameTime": "1 - 07:36",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) takes a wonderful touch after collecting a pass inside the box. He steers his low drive towards the left post, but the keeper dives low to keep the ball out."
        },
        {
            "gameTime": "1 - 06:52",
            "label": "",
            "description": "Jack Rodwell (Sunderland) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 05:29",
            "label": "",
            "description": "That was a nice football moment. Jermain Defoe (Sunderland) receives an amazing defence splitting low pass on the edge of the box and blasts the ball towards the left post. Simon Mignolet guesses his intention and dives superbly to deny him with a remarkable save!"
        },
        {
            "gameTime": "1 - 04:09",
            "label": "",
            "description": "Sadio Mane (Liverpool) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 03:04",
            "label": "",
            "description": "Ragnar Klavan (Liverpool) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Liverpool will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Anthony Taylor was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool have won 10 away matches this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "0:1 That's the most common result of the season for Sunderland. Already 3 of their matches ended with that score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jermain Defoe have rippled the net 9x and is the top scorer for Sunderland this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The visiting team was controlling the game most of the time. The home side played long passes and crosses into the box. The tactic of the away side, on the other hand, was slow build up play."
        }
    ],
    "gameAwayTeam": "Liverpool",
    "gameDate": "02/01/2017 - 18:00",
    "gameHomeTeam": "Sunderland",
    "gameScore": "2 - 2"
}