{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-03-17 - 22-45 Monaco 0 - 2 Arsenal/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The away team was superior on the pitch today. The home players adopted a defensive style of play, while the away players tried to win the ball back as quickly as possible every time they lost possession."
        },
        {
            "gameTime": "2 - 49:56",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 49:28",
            "label": "",
            "description": "Flag up against Yannick Carrasco (Monaco). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 49:09",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) makes a strong challenge and Svein Moen blows for a foul."
        },
        {
            "gameTime": "2 - 48:52",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 47:31",
            "label": "",
            "description": "Santi Cazorla (Arsenal) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "2 - 45:27",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:05",
            "label": "",
            "description": "Hector Bellerin (Arsenal) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 42:48",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 42:05",
            "label": "",
            "description": "Joao Moutinho (Monaco) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 40:56",
            "label": "substitution",
            "description": "Substitution. Elderson (Monaco) has come on for Nabil Dirar."
        },
        {
            "gameTime": "2 - 40:17",
            "label": "funfact",
            "description": "Total attempts – 3:16."
        },
        {
            "gameTime": "2 - 38:25",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 37:58",
            "label": "",
            "description": "Mesut Ozil (Arsenal) will take the free kick."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "",
            "description": "Svein Moen blows his whistle after Joao Moutinho (Monaco) kicks an opponent's legs instead of the ball. A free kick has been awarded to Arsenal."
        },
        {
            "gameTime": "2 - 37:43",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) shows good awareness deep inside the box and jumps high to meet a perfect cross from the set piece. He steers a fine header goalwards, but finds the keeper prepared. No doubt about the wonderful save that he made. The ball goes out of play and Arsenal have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 37:31",
            "label": "",
            "description": "Yannick Carrasco (Monaco) makes an overly aggressive challenge and Svein Moen blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 37:29",
            "label": "substitution",
            "description": "Substitution. Kieran Gibbs (Arsenal) in, Nacho Monreal out."
        },
        {
            "gameTime": "2 - 33:37",
            "label": "soccer-ball",
            "description": "Aaron Ramsey (Arsenal) finds himself some space inside the box, lines up the ball and unleashes a shot which goes into the bottom left corner."
        },
        {
            "gameTime": "2 - 33:31",
            "label": "",
            "description": "Post! Theo Walcott (Arsenal) latches on to a sweet pass inside the box and unleashes a shot which only hits the right post. What an unlucky moment for him."
        },
        {
            "gameTime": "2 - 31:15",
            "label": "",
            "description": "Nacho Monreal (Arsenal) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 30:28",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 30:14",
            "label": "",
            "description": "The ball is cleared after Olivier Giroud (Arsenal) attempted to dribble past an opposing player. The linesman points to the corner flag, Arsenal are going to take it."
        },
        {
            "gameTime": "2 - 29:55",
            "label": "",
            "description": "Santi Cazorla (Arsenal) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 29:26",
            "label": "",
            "description": "Tavares Fabinho (Monaco) didn't hesitate to knock his opponent down with a harsh sliding tackle. Svein Moen could probably show him a yellow, but he only goes with blowing the whistle for a foul. That's a free kick to Arsenal."
        },
        {
            "gameTime": "2 - 29:02",
            "label": "",
            "description": "Yannick Carrasco (Monaco) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "2 - 27:34",
            "label": "",
            "description": "The referee blows his whistle as Santi Cazorla (Arsenal) was too aggressive in his challenge."
        },
        {
            "gameTime": "2 - 26:39",
            "label": "",
            "description": "Yannick Carrasco (Monaco) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "2 - 26:18",
            "label": "substitution",
            "description": "Arsene Wenger has decided to substitute Danny Welbeck and he is replaced by Theo Walcott (Arsenal)."
        },
        {
            "gameTime": "2 - 25:45",
            "label": "",
            "description": "Wallace (Monaco) pulls the jersey of one of the opposition players and Svein Moen blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 24:02",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Dimitar Berbatov departs the field of play to be replaced by Bernardo Silva (Monaco)."
        },
        {
            "gameTime": "2 - 23:11",
            "label": "",
            "description": "A long pass, executed by Mesut Ozil (Arsenal), missed the precision to reach his teammates."
        },
        {
            "gameTime": "2 - 21:51",
            "label": "",
            "description": "Yannick Carrasco (Monaco) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 20:41",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 19:40",
            "label": "",
            "description": "Hector Bellerin (Arsenal) sends a cross into the box, but Danijel Subasic comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 18:15",
            "label": "",
            "description": "Mesut Ozil (Arsenal) goes for goal but he directs his effort just wide of the left post."
        },
        {
            "gameTime": "2 - 17:25",
            "label": "substitution",
            "description": "Here is a change. Francis Coquelin is going off and Arsene Wenger gives the last tactical orders to Aaron Ramsey (Arsenal)."
        },
        {
            "gameTime": "2 - 16:14",
            "label": "",
            "description": "Joao Moutinho (Monaco) serves up a nice cross, but David Ospina punches the ball away."
        },
        {
            "gameTime": "2 - 14:17",
            "label": "substitution",
            "description": "The manager makes a subsitution with Yannick Carrasco (Monaco) coming on for Anthony Martial."
        },
        {
            "gameTime": "2 - 12:16",
            "label": "",
            "description": "Joao Moutinho (Monaco) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players."
        },
        {
            "gameTime": "2 - 11:37",
            "label": "",
            "description": "Santi Cazorla (Arsenal) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 10:41",
            "label": "",
            "description": "Anthony Martial (Monaco) commits an ugly challenge. The referee sees it and immediately blows his whistle. Arsenal will take a free kick."
        },
        {
            "gameTime": "2 - 10:06",
            "label": "",
            "description": "Nabil Dirar (Monaco) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 09:48",
            "label": "",
            "description": "Mesut Ozil (Arsenal) sends a teasing cross into the area, but Danijel Subasic intercepts the ball."
        },
        {
            "gameTime": "2 - 09:31",
            "label": "",
            "description": "Some patient build up play from Arsenal as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 08:08",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 07:44",
            "label": "",
            "description": "Mesut Ozil (Arsenal) stands over the free kick and opts to take it himself, sending it towards the top of net only for Danijel Subasic to dive and make a save. The referee blows his whistle, Arsenal are awarded a corner kick."
        },
        {
            "gameTime": "2 - 06:02",
            "label": "y-card",
            "description": "The foul by Geoffrey Kondogbia (Monaco) is worthy of a card and a yellow is duly shown by Svein Moen."
        },
        {
            "gameTime": "2 - 06:01",
            "label": "",
            "description": "Geoffrey Kondogbia (Monaco) brings his opponent down. Svein Moen has a clear sight of it and blows his whistle for a foul. Arsenal win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 05:39",
            "label": "",
            "description": "A raking crossfield pass from Santi Cazorla (Arsenal) lacks accuracy and the opposition gain possession."
        },
        {
            "gameTime": "2 - 03:44",
            "label": "corner",
            "description": "The corner by Mesut Ozil (Arsenal) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "2 - 03:32",
            "label": "",
            "description": "A pass into the penalty area from Mesut Ozil (Arsenal) is intercepted by the defence. Arsenal have a corner."
        },
        {
            "gameTime": "2 - 02:53",
            "label": "",
            "description": "Santi Cazorla (Arsenal) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "2 - 01:55",
            "label": "",
            "description": "Svein Moen blows his whistle and it's Danny Welbeck (Arsenal) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 00:30",
            "label": "",
            "description": "Olivier Giroud (Arsenal) goes for goal, but his effort isn't precise at all and it flies yards wide of the right post."
        },
        {
            "gameTime": "2 - 00:27",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. The visiting team dominated in most aspects of the game and the home side struggled to keep up. The home team's main priority is a flawless defence, with the away side gives them a tough time by closing them down quickly and aggressively."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "Svein Moen has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:31",
            "label": "",
            "description": "Olivier Giroud (Arsenal) was waiting for the ball on the penalty spot and produced a powerful volley goalwards, but the goalkeeper made an amazing save to deny him."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:34",
            "label": "",
            "description": "Svein Moen blows his whistle and signals a foul after Francis Coquelin (Arsenal) brought his opponent down."
        },
        {
            "gameTime": "1 - 41:52",
            "label": "y-card",
            "description": "The expression of the referee Svein Moen is crystal clear. This behaviour won't be tolerated. Alexis Sanchez (Arsenal) is shown a yellow card."
        },
        {
            "gameTime": "1 - 40:28",
            "label": "",
            "description": "An attempted cross from Joao Moutinho (Monaco) is cleared."
        },
        {
            "gameTime": "1 - 39:04",
            "label": "",
            "description": "A long pass, executed by Layvin Kurzawa (Monaco), missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 37:31",
            "label": "corner",
            "description": "The resulting corner from Santi Cazorla (Arsenal) is cleared."
        },
        {
            "gameTime": "1 - 37:12",
            "label": "",
            "description": "Danny Welbeck (Arsenal) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. Corner kick. Arsenal will have an opportunity."
        },
        {
            "gameTime": "1 - 35:01",
            "label": "soccer-ball",
            "description": "The goalkeeper makes a superb save, but the ball rebounds off him out to Olivier Giroud (Arsenal), who fires the ball into the roof of the net."
        },
        {
            "gameTime": "1 - 34:58",
            "label": "",
            "description": "Olivier Giroud (Arsenal) shows good awareness inside the box, but his attempt is stopped by the goalkeeper."
        },
        {
            "gameTime": "1 - 34:48",
            "label": "",
            "description": "Mesut Ozil (Arsenal) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 32:38",
            "label": "",
            "description": "Anthony Martial (Monaco) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 31:33",
            "label": "",
            "description": "A crossfield pass from Wallace (Monaco) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 30:32",
            "label": "",
            "description": "Olivier Giroud (Arsenal) manages a fine header towards goal, but it misses the target as the ball flies past the left post."
        },
        {
            "gameTime": "1 - 27:25",
            "label": "",
            "description": "Santi Cazorla (Arsenal) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 27:10",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "1 - 26:26",
            "label": "",
            "description": "Aymen Abdennour (Monaco) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 25:07",
            "label": "",
            "description": "A pass by ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "Hector Bellerin (Arsenal) makes a reckless foul in order to win the ball from his opponent. Svein Moen has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 22:57",
            "label": "",
            "description": "Laurent Koscielny (Arsenal) is caught offside!"
        },
        {
            "gameTime": "1 - 21:47",
            "label": "",
            "description": "Nacho Monreal (Arsenal) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 20:14",
            "label": "",
            "description": "Olivier Giroud (Arsenal) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 18:50",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) strikes a promising volley towards goal, but one of the defenders is quick enough to step in and make a crucial block."
        },
        {
            "gameTime": "1 - 17:57",
            "label": "",
            "description": "Dimitar Berbatov (Monaco) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "1 - 16:55",
            "label": "",
            "description": "Mesut Ozil (Arsenal) crosses the ball forward but it is intercepted."
        },
        {
            "gameTime": "1 - 16:16",
            "label": "",
            "description": "Danny Welbeck (Arsenal) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "1 - 15:46",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) plays a one two with Jeremy Toulalan, but the move breaks down."
        },
        {
            "gameTime": "1 - 13:46",
            "label": "",
            "description": "What a wasted chance that was! A precise cross into the box finds Olivier Giroud (Arsenal), whose header flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 13:29",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 11:46",
            "label": "",
            "description": "Arsenal are seeing far more of the ball now."
        },
        {
            "gameTime": "1 - 09:58",
            "label": "",
            "description": "A long pass, executed by , missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 08:06",
            "label": "",
            "description": "The resulting free kick from Joao Moutinho (Monaco) ends up in the gloves of the keeper."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "Francis Coquelin (Arsenal) is penalised after knocking an opponent down. A free kick has been awarded to Monaco."
        },
        {
            "gameTime": "1 - 06:41",
            "label": "",
            "description": "Jeremy Toulalan (Monaco) smashes the ball upfield and Layvin Kurzawa brings it down with a fine first touch."
        },
        {
            "gameTime": "1 - 04:59",
            "label": "",
            "description": "Olivier Giroud (Arsenal) is flagged for offside."
        },
        {
            "gameTime": "1 - 03:28",
            "label": "",
            "description": "Olivier Giroud (Arsenal) robs an opponent of the ball and explodes in anger when Svein Moen blows for a foul."
        },
        {
            "gameTime": "1 - 02:17",
            "label": "",
            "description": "Dimitar Berbatov links up with Joao Moutinho (Monaco), who fires just over the bar from the edge of the box."
        },
        {
            "gameTime": "1 - 01:40",
            "label": "",
            "description": "Dimitar Berbatov (Monaco) is deemed to be in an offside position by the linesman and it looks like it is the right decision despite being a very close call."
        },
        {
            "gameTime": "1 - 01:23",
            "label": "",
            "description": "Dimitar Berbatov (Monaco) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Monaco will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Svein Moen will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The away team was superior on the pitch today. The home players adopted a defensive style of play, while the away players tried to win the ball back as quickly as possible every time they lost possession."
        }
    ],
    "gameAwayTeam": "Arsenal",
    "gameDate": "17/03/2015 - 22:45",
    "gameHomeTeam": "Monaco",
    "gameScore": "0 - 2"
}