{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2015-2016/2015-09-26 - 21-45 Napoli 2 - 1 Juventus/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. Napoli were dominant and more threatening of the two sides. It was a fairly one sided match. The home side played possession football, while long balls and crosses were the main weapons of the away team."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:35",
            "label": "y-card",
            "description": "Alvaro Morata (Juventus) kept talking out of turn to the referee until Daniele Orsato lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:39",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) loses the defending players and unloads a powerful, but inaccurate effort from long distance. The goalkeeper remains completely calm as the ball ends near the left corner flag."
        },
        {
            "gameTime": "2 - 43:32",
            "label": "substitution",
            "description": "Massimiliano Allegri has decided to introduce fresh legs, with Alex Sandro (Juventus) replacing Simone Padoin."
        },
        {
            "gameTime": "2 - 42:11",
            "label": "",
            "description": "The free kick is taken short by Napoli."
        },
        {
            "gameTime": "2 - 41:40",
            "label": "y-card",
            "description": "The foul by Simone Padoin (Juventus) is worthy of a card and a yellow is duly shown by Daniele Orsato."
        },
        {
            "gameTime": "2 - 39:02",
            "label": "substitution",
            "description": "A substitution has been made. Gonzalo Higuain is replaced by Manolo Gabbiadini (Napoli)."
        },
        {
            "gameTime": "2 - 37:24",
            "label": "",
            "description": "Paul Pogba (Juventus) jumps for a cross and produces a fine header from near the penalty spot, but it goes narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 36:10",
            "label": "",
            "description": "Referee Daniele Orsato sees the trip by Faouzi Ghoulam (Napoli) and doesn't hesitate to blow his whistle. A free kick is awarded to Juventus."
        },
        {
            "gameTime": "2 - 34:56",
            "label": "substitution",
            "description": "Maurizio Sarri prepares a substitution. Marek Hamsik is replaced by David Lopez (Napoli)."
        },
        {
            "gameTime": "2 - 34:28",
            "label": "corner",
            "description": "Roberto Pereyra (Juventus) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 33:47",
            "label": "",
            "description": "Leonardo Bonucci (Juventus) attempts a long crossfield pass, but the defence does well to intercept the ball. The ball is out of play. Juventus win a corner kick."
        },
        {
            "gameTime": "2 - 33:05",
            "label": "",
            "description": "The Juventus players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 32:12",
            "label": "",
            "description": "Simone Zaza (Juventus) is penalised for a foul. Daniele Orsato had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 30:47",
            "label": "",
            "description": "Juan Cuadrado (Juventus) takes a direct free kick."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "",
            "description": "Raul Albiol (Napoli) makes a rough challenge and Daniele Orsato blows his whistle for a foul. A free kick to Juventus."
        },
        {
            "gameTime": "2 - 28:39",
            "label": "",
            "description": "Dries Mertens (Napoli) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "2 - 27:41",
            "label": "",
            "description": "Alvaro Morata (Juventus) collects a pass on the edge of the box but he slips the ball just wide of the right post."
        },
        {
            "gameTime": "2 - 24:58",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Paulo Dybala as he is replaced by Alvaro Morata (Juventus)."
        },
        {
            "gameTime": "2 - 24:44",
            "label": "corner",
            "description": "Jorginho (Napoli) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 24:08",
            "label": "corner",
            "description": "The corner from Jorginho (Napoli) is cleared away by the defence. Napoli will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 23:50",
            "label": "",
            "description": "The game is pretty dull as Napoli are just passing the ball from player to player. Nothing lasts forever, though, and they finally make a mistake, allowing the opposition to pick up the ball. The ball goes out for a corner. Napoli can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 21:26",
            "label": "",
            "description": "A neat pass is well received by Faouzi Ghoulam (Napoli), who is lurking on the edge of the box and strikes the ball towards the left post, but the goalkeeper makes an incredible save to block his shot."
        },
        {
            "gameTime": "2 - 18:29",
            "label": "substitution",
            "description": "It is time for a substitution. Juan Cuadrado (Juventus) is on for Hernanes."
        },
        {
            "gameTime": "2 - 17:58",
            "label": "soccer-ball",
            "description": "Mario Lemina (Juventus) meets a perfect cross from Paulo Dybala deep inside the box, and he produces an accurate strike which goes into the bottom right corner. He makes it 2:1."
        },
        {
            "gameTime": "2 - 16:43",
            "label": "soccer-ball",
            "description": "Gonzalo Higuain (Napoli) finishes his beautiful individual effort with a superb strike from inside the box. Gianluigi Buffon is just a bystander as the ball flies low into the middle of the goal. The score is 2:0."
        },
        {
            "gameTime": "2 - 14:49",
            "label": "",
            "description": "Gonzalo Higuain (Napoli) produces a ferocious strike from the edge of the box. His dangerous effort towards the middle of the goal is blocked by Gianluigi Buffon, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "2 - 13:44",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Paulo Dybala (Juventus), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 13:23",
            "label": "",
            "description": "The Juventus players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition. The referee points to the corner flag. It's a corner to Juventus."
        },
        {
            "gameTime": "2 - 12:24",
            "label": "",
            "description": "He should have done better. Raul Albiol (Napoli) is afforded space to connect with a Jorginho cross, but his header from the centre of the box flies well over the crossbar. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "2 - 12:03",
            "label": "corner",
            "description": "Jorginho (Napoli) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 11:27",
            "label": "",
            "description": "Dries Mertens (Napoli) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort. The referee blows his whistle, Napoli are awarded a corner kick."
        },
        {
            "gameTime": "2 - 10:38",
            "label": "",
            "description": "Paul Pogba (Juventus) fails to produce a decent enough free kick for a player of his ability and the only target that he finds is the wall of defenders in front of him."
        },
        {
            "gameTime": "2 - 09:47",
            "label": "",
            "description": "Paul Pogba (Juventus) sets the ball up and is ready to take the free kick from a promising distance. Many goals have been scored from this distance. Let's see what happens."
        },
        {
            "gameTime": "2 - 09:10",
            "label": "y-card",
            "description": "Jose Callejon (Napoli) sees a yellow card from Daniele Orsato after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 07:49",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Patrice Evra (Juventus) was quite harsh and Daniele Orsato didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 06:15",
            "label": "",
            "description": "Paulo Dybala (Juventus) will take a long range free kick and all of his teammates who are good in the air are already waiting on the edge of the penalty box for a cross to be sent in to them."
        },
        {
            "gameTime": "2 - 05:38",
            "label": "y-card",
            "description": "A yellow card for a tackle by Leonardo Bonucci (Juventus). Daniele Orsato doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 04:46",
            "label": "y-card",
            "description": "Faouzi Ghoulam (Napoli) has received a yellow card for his foul."
        },
        {
            "gameTime": "2 - 04:22",
            "label": "corner",
            "description": "The resulting corner from Paulo Dybala (Juventus) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 03:56",
            "label": "",
            "description": "Juventus are just stroking the ball across the park now, but the defence is doing very well breaking up their possession. Juventus force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 03:40",
            "label": "",
            "description": "Raul Albiol (Napoli) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "2 - 03:16",
            "label": "",
            "description": "One of the Juventus players commits a holding foul and the referee reaches for his whistle. It's a free kick to Napoli in a dangerous position."
        },
        {
            "gameTime": "2 - 02:45",
            "label": "",
            "description": "Leonardo Bonucci (Juventus) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "2 - 00:27",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Simone Zaza (Juventus) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "It wasn't the most inspiring 45 minutes that you'll see this week. Let's hope that the second period will be more exciting. Napoli dominated the opening period and easily created the most chances. The home side relies mostly on counter attacks for their chances, while the away side's tactic is known as kick and rush football."
        },
        {
            "gameTime": "1 - 48:02",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 47:14",
            "label": "",
            "description": "Dries Mertens (Napoli) weaves through the defence with ease and gets into a good position in front of goal. He pulls the trigger in an effort to beat the keeper, but fails as the ball zooms around the right post."
        },
        {
            "gameTime": "1 - 45:48",
            "label": "",
            "description": "Jose Callejon (Napoli) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box well wide of the left post. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:18",
            "label": "",
            "description": "Pepe Reina (Napoli) will take the free kick."
        },
        {
            "gameTime": "1 - 44:02",
            "label": "",
            "description": "Simone Zaza (Juventus) is flagged for offside."
        },
        {
            "gameTime": "1 - 43:25",
            "label": "",
            "description": "Long passes, short passes and one two passes. Juventus are showcasing great team work by keeping possession and producing pin point passes from player to player. The opposition's players are finding it very difficult to intercept at the moment."
        },
        {
            "gameTime": "1 - 42:08",
            "label": "",
            "description": "The ball goes wide of the goal and out for a goal kick. It looks like Pepe Reina (Napoli) is going to take it."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "",
            "description": "Roberto Pereyra (Juventus) sends a lovely cross into the penalty area and Simone Zaza attempts to score after getting on the end of it."
        },
        {
            "gameTime": "1 - 39:48",
            "label": "substitution",
            "description": "Lorenzo Insigne (Napoli) is leaving the pitch due to injury. Dries Mertens (Napoli) will take his place on the pitch."
        },
        {
            "gameTime": "1 - 38:46",
            "label": "injury",
            "description": "Lorenzo Insigne (Napoli) is down injured and the referee stops play so that he can receive medical treatment."
        },
        {
            "gameTime": "1 - 37:58",
            "label": "",
            "description": "Napoli string together a series of short passes."
        },
        {
            "gameTime": "1 - 34:33",
            "label": "corner",
            "description": "The resulting corner from Jorginho (Napoli) is cleared."
        },
        {
            "gameTime": "1 - 33:58",
            "label": "",
            "description": "Jose Callejon receives a sweet cross inside the box from Lorenzo Insigne (Napoli), but one of the defenders rushes in bravely to intercept the move. Napoli have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 30:49",
            "label": "",
            "description": "Great teamplay by Napoli as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 28:09",
            "label": "corner",
            "description": "Roberto Pereyra (Juventus) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 27:51",
            "label": "",
            "description": "Juventus keep the ball well and push forward with purpose, but here comes an interception from the opposition. Juventus have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 25:46",
            "label": "soccer-ball",
            "description": "Goal 1:0! Lorenzo Insigne (Napoli) gets a shot away from the edge of the box and scores into the bottom left corner. Gonzalo Higuain provided an assist for the goal."
        },
        {
            "gameTime": "1 - 24:12",
            "label": "",
            "description": "Good movement by Mario Lemina (Juventus), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "1 - 23:22",
            "label": "",
            "description": "The referee blows his whistle as Hernanes (Juventus) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 21:21",
            "label": "",
            "description": "Poor challenge! Hernanes (Juventus) is penalised for tripping and Daniele Orsato blows his whistle. Napoli are awarded the free kick."
        },
        {
            "gameTime": "1 - 18:24",
            "label": "",
            "description": "Paul Pogba (Juventus) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 14:47",
            "label": "",
            "description": "Hernanes (Juventus) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "1 - 14:08",
            "label": "",
            "description": "One of the Napoli players tripped an opponent and conceded a foul."
        },
        {
            "gameTime": "1 - 13:22",
            "label": "",
            "description": "Simone Zaza (Juventus) meets a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Pepe Reina pulls off an easy save."
        },
        {
            "gameTime": "1 - 12:53",
            "label": "",
            "description": "The Juventus players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 10:56",
            "label": "",
            "description": "Patrice Evra (Juventus) sends a cross into the box, but Pepe Reina comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 09:20",
            "label": "",
            "description": "Jose Callejon (Napoli) is penalised for holding. Daniele Orsato signals a set piece. A free kick has been awarded to Juventus."
        },
        {
            "gameTime": "1 - 06:56",
            "label": "",
            "description": "Marek Hamsik (Napoli) has a sight of goal and shoots from distance, but Gianluigi Buffon is equal to it."
        },
        {
            "gameTime": "1 - 06:40",
            "label": "",
            "description": "Simone Zaza (Juventus) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 05:54",
            "label": "",
            "description": "Gonzalo Higuain (Napoli) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "1 - 05:19",
            "label": "",
            "description": "Pepe Reina (Napoli) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 04:57",
            "label": "",
            "description": "A player from Juventus brings down an opponent and commits a foul."
        },
        {
            "gameTime": "1 - 03:30",
            "label": "",
            "description": "The linesman signals that Simone Zaza (Juventus) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 02:09",
            "label": "",
            "description": "Marek Hamsik (Napoli) gets a shot away from distance, but wasn't really set to take it and fires high and wide."
        },
        {
            "gameTime": "1 - 01:30",
            "label": "",
            "description": "Paul Pogba (Juventus) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Juventus will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Daniele Orsato was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Juventus players are not so productive as they have scored only 75 goals this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli have already 21 clean sheets in this competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Head to head clashes between these two clubs: 13.2.2016 0:1, 23.5.2015 1:3, 11.1.2015 1:3, 22.12.2014 3:2, 30.3.2014 2:0."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. Napoli were dominant and more threatening of the two sides. It was a fairly one sided match. The home side played possession football, while long balls and crosses were the main weapons of the away team."
        }
    ],
    "gameAwayTeam": "Juventus",
    "gameDate": "26/09/2015 - 21:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "2 - 1"
}