{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-04-02 - 21-30 Barcelona 1 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. Neither of the teams had any obvious superiority in this game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "whistle",
            "description": "That's it for today, Alejandro Hernandez has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 46:36",
            "label": "",
            "description": "Arda Turan (Barcelona) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender."
        },
        {
            "gameTime": "2 - 46:15",
            "label": "",
            "description": "Andres Iniesta (Barcelona) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 45:30",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Gareth Bale as he is replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 42:07",
            "label": "",
            "description": "Alejandro Hernandez blows his whistle and it's Luis Suarez (Barcelona) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "soccer-ball",
            "description": "Goal! Gareth Bale puts a cross into the box and finds Cristiano Ronaldo (Real Madrid), who latches on to it and strikes the ball into the bottom left corner. He makes it 1:2."
        },
        {
            "gameTime": "2 - 39:03",
            "label": "",
            "description": "Luis Suarez (Barcelona) latched on to an accurate pass deep into the box and attempted to fire the ball past the keeper, but the shot is way off target. What a miskick!"
        },
        {
            "gameTime": "2 - 37:57",
            "label": "yr-card",
            "description": "Sergio Ramos (Real Madrid) should have been more careful. He commits a bad foul, receives his second yellow card and is sent off!"
        },
        {
            "gameTime": "2 - 36:01",
            "label": "",
            "description": "What a great touch by Cristiano Ronaldo (Real Madrid)! He picks up a precise pass inside the box and immediately produces a shot towards the net. Unfortunately for him, his bullet only crashes against the crossbar."
        },
        {
            "gameTime": "2 - 35:58",
            "label": "",
            "description": "Goal! No, wait. It's disallowed for a foul by Gareth Bale (Real Madrid)."
        },
        {
            "gameTime": "2 - 35:35",
            "label": "",
            "description": "Luis Suarez (Barcelona) takes the chance to have an effort at goal from inside the box but misses to the left of the target."
        },
        {
            "gameTime": "2 - 34:35",
            "label": "y-card",
            "description": "Cristiano Ronaldo (Real Madrid) is literally asking for a yellow card with his behaviour. The referee agrees and books him."
        },
        {
            "gameTime": "2 - 34:03",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to substitute Karim Benzema and he is replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 29:37",
            "label": "",
            "description": "Luis Suarez (Barcelona) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "2 - 28:37",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Ivan Rakitic leaves the pitch and Arda Turan (Barcelona) comes on."
        },
        {
            "gameTime": "2 - 25:43",
            "label": "",
            "description": "The foul by Neymar (Barcelona) was seen by Alejandro Hernandez who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 24:58",
            "label": "",
            "description": "Luis Suarez (Barcelona) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the left post."
        },
        {
            "gameTime": "2 - 24:03",
            "label": "",
            "description": "One of the players from Real Madrid times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 23:16",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) shoots from the edge of the penalty area. The ball travels towards the target, but Claudio Bravo easily deals with the threat."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 21:38",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) sends a pass into the box, but his attempt is thwarted and cleared. Barcelona get a corner."
        },
        {
            "gameTime": "2 - 18:20",
            "label": "",
            "description": "Neymar (Barcelona) picks up a lofted cross inside the box and unleashes a low shot to the middle of the goal. His promising effort is kept out by Keylor Navas, who pulls off a decent save!"
        },
        {
            "gameTime": "2 - 17:00",
            "label": "soccer-ball",
            "description": "Karim Benzema (Real Madrid) receives the ball inside the box, reacts quickly and without any problems fires the ball into the back of the net."
        },
        {
            "gameTime": "2 - 16:16",
            "label": "",
            "description": "Barcelona keep the ball and are displaying some tiki taka style passing at the moment."
        },
        {
            "gameTime": "2 - 14:00",
            "label": "y-card",
            "description": "Ivan Rakitic (Barcelona) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Alejandro Hernandez didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 13:26",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 11:00",
            "label": "soccer-ball",
            "description": "GOAL! The corner is whipped in and Gerard Pique (Barcelona) is in the right place at the right time, planting his header straight into the bottom right corner. He makes it 0:0."
        },
        {
            "gameTime": "2 - 10:35",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 10:17",
            "label": "corner",
            "description": "Neymar (Barcelona) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear. The ball is out of play. Barcelona will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 09:45",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger. The referee and one of his assistants signal for a corner kick to Barcelona."
        },
        {
            "gameTime": "2 - 08:56",
            "label": "",
            "description": "What a wasted opportunity by Lionel Messi (Barcelona)! He creates himself some space inside the penalty box and unleashes a decent strike towards the top right corner, but Keylor Navas makes an astonishing save to thwart him. The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "",
            "description": "Dani Alves (Barcelona) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 06:47",
            "label": "",
            "description": "Gareth Bale (Real Madrid) wastes an opportunity. He finds himself in acres of space and fires in a terrific shot from long range low towards the middle of the target, but the goalkeeper makes a brilliant save and stops this one!"
        },
        {
            "gameTime": "2 - 06:34",
            "label": "corner",
            "description": "Real Madrid will take a corner kick."
        },
        {
            "gameTime": "2 - 06:19",
            "label": "",
            "description": "Toni Kroos (Real Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. Now Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 06:03",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "2 - 05:53",
            "label": "",
            "description": "Marcelo (Real Madrid) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition. The referee points to the corner flag. It's a corner to Real Madrid."
        },
        {
            "gameTime": "2 - 05:01",
            "label": "",
            "description": "Luis Suarez received a sweet pass from Neymar (Barcelona), but the advance is stopped."
        },
        {
            "gameTime": "2 - 02:41",
            "label": "",
            "description": "Lionel Messi (Barcelona) steps up and sends the mid range free kick miles over the bar. Strong but inaccurate shot."
        },
        {
            "gameTime": "2 - 01:50",
            "label": "",
            "description": "A player from Real Madrid pulled an opponent down, forcing the referee to blow his whistle. Barcelona are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The performance from both teams could be described as average. There have been only a few exciting situations and the fans will be expecting more in the second half. It has been a tight contest so far. The home team are playing possession football, while the away team look to find a weakness in the opposition's defence mainly with their rapid counter attacks."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 44:53",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. The ball is out of play and Real Madrid manage to earn a corner."
        },
        {
            "gameTime": "1 - 43:40",
            "label": "",
            "description": "Karim Benzema (Real Madrid) connects with a pin point cross but blazes the ball high over the bar. His shot wasn't accurate, nor powerful enough."
        },
        {
            "gameTime": "1 - 43:16",
            "label": "",
            "description": "Dani Alves (Barcelona) fires the ball towards goal from just outside the penalty area, but it goes narrowly over the crossbar after coming very close to hitting the roof of the net."
        },
        {
            "gameTime": "1 - 40:08",
            "label": "",
            "description": "Jordi Alba (Barcelona) commits a foul and Alejandro Hernandez immediately signals a free kick."
        },
        {
            "gameTime": "1 - 39:02",
            "label": "",
            "description": "Marcelo (Real Madrid) tries to find Gareth Bale, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 37:30",
            "label": "",
            "description": "Casemiro (Real Madrid) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 37:00",
            "label": "injury",
            "description": "Casemiro (Real Madrid) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 35:54",
            "label": "",
            "description": "Flag up against Luis Suarez (Barcelona). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 34:59",
            "label": "",
            "description": "Some great controlled play and passing from Barcelona. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 33:13",
            "label": "",
            "description": "Neymar (Barcelona) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 32:40",
            "label": "",
            "description": "Gareth Bale (Real Madrid) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 29:52",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to score from a mid range free kick, but he curls his effort a few inches over the crossbar."
        },
        {
            "gameTime": "1 - 28:52",
            "label": "y-card",
            "description": "Alejandro Hernandez shows a yellow card to Javier Mascherano (Barcelona) for a tough tackle."
        },
        {
            "gameTime": "1 - 26:54",
            "label": "y-card",
            "description": "Luis Suarez (Barcelona) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Alejandro Hernandez ignores the protests."
        },
        {
            "gameTime": "1 - 25:20",
            "label": "",
            "description": "Gareth Bale (Real Madrid) misses a sitter as his shot goes over the bar."
        },
        {
            "gameTime": "1 - 24:41",
            "label": "",
            "description": "Claudio Bravo can hear the fans clapping for his superb goalkeeping after he magnificently stops the close range effort from Cristiano Ronaldo (Real Madrid). The ball would have probably ended up inside the right post."
        },
        {
            "gameTime": "1 - 23:39",
            "label": "",
            "description": "Lionel Messi (Barcelona) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 21:39",
            "label": "",
            "description": "Neymar (Barcelona) has a great chance to score from deep inside the box! He creates some space for the shot, but blazes it high over the crossbar. Very bad attempt."
        },
        {
            "gameTime": "1 - 20:51",
            "label": "",
            "description": "Lionel Messi (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 19:10",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) is unlucky with a low drive from the edge of the box. A decent save by Keylor Navas stops the ball from hitting the middle of the net."
        },
        {
            "gameTime": "1 - 18:09",
            "label": "",
            "description": "Lionel Messi (Barcelona) failed to convert a mid range free kick and sends the ball narrowly over the bar."
        },
        {
            "gameTime": "1 - 17:22",
            "label": "y-card",
            "description": "Today's referee Alejandro Hernandez rightly decides to book Daniel Carvajal (Real Madrid) for his harsh tackle."
        },
        {
            "gameTime": "1 - 16:19",
            "label": "",
            "description": "Andres Iniesta (Barcelona) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "1 - 15:20",
            "label": "",
            "description": "Half chance! Gareth Bale (Real Madrid) plays a pass into the box, but Claudio Bravo reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 14:45",
            "label": "",
            "description": "The ball is cleared after Neymar (Barcelona) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 12:00",
            "label": "",
            "description": "Luka Modric (Real Madrid) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 10:52",
            "label": "",
            "description": "Dani Alves (Barcelona) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "1 - 09:49",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) was probably a bit loose with his words to Alejandro Hernandez, who decides to show him a yellow."
        },
        {
            "gameTime": "1 - 07:52",
            "label": "",
            "description": "Andres Iniesta (Barcelona) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "1 - 07:07",
            "label": "",
            "description": "The linesman raises his flag for offside before Gareth Bale (Real Madrid) heads on."
        },
        {
            "gameTime": "1 - 06:46",
            "label": "",
            "description": "Dani Alves (Barcelona) trips an opposition player and Alejandro Hernandez signals a foul."
        },
        {
            "gameTime": "1 - 05:26",
            "label": "",
            "description": "Neymar (Barcelona) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 04:44",
            "label": "",
            "description": "Referee Alejandro Hernandez sees the trip by Casemiro (Real Madrid) and doesn't hesitate to blow his whistle. Free kick. Barcelona will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 03:46",
            "label": "",
            "description": "Gareth Bale (Real Madrid) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 03:34",
            "label": "",
            "description": "Pepe (Real Madrid) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "",
            "description": "Flag goes up against Luis Suarez (Barcelona) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 02:34",
            "label": "",
            "description": "Lionel Messi (Barcelona) passes the ball onto Luis Suarez, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "injury",
            "description": "Pepe (Real Madrid) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Alejandro Hernandez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. Neither of the teams had any obvious superiority in this game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "02/04/2016 - 21:30",
    "gameHomeTeam": "Barcelona",
    "gameScore": "1 - 2"
}