{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-09-18 - 21-45 Espanyol 0 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "The game wasn't exhilarating, but it wasn't totally boring either. There were a few nice moments from both sides. The away side was dominant and dictated the tempo of the game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        },
        {
            "gameTime": "2 - 47:06",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:33",
            "label": "",
            "description": "Felipe Caicedo (Espanyol) is penalised for a foul. Alejandro Hernandez had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 45:07",
            "label": "",
            "description": "The ball is cleared after Hernan Perez (Espanyol) attempted to dribble past an opposing player. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 43:31",
            "label": "",
            "description": "The linesman raises his flag. Alvaro Morata (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "2 - 42:49",
            "label": "",
            "description": "Wonderful movement by Real Madrid. The players are holding possession, mostly exchanging one touch passes. They control the pace of the game now."
        },
        {
            "gameTime": "2 - 40:38",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) takes the resulting free kick from 21 metres out. He attempts to send his effort into the roof of the net, but Diego Lopez is alert and keeps the ball out."
        },
        {
            "gameTime": "2 - 39:41",
            "label": "",
            "description": "Rough tackle by Pape Diop (Espanyol). The referee blows his whistle for a foul. Real Madrid have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 38:47",
            "label": "y-card",
            "description": "Alejandro Hernandez shows a yellow card to Daniel Carvajal (Real Madrid) for a tough tackle."
        },
        {
            "gameTime": "2 - 37:06",
            "label": "substitution",
            "description": "Substitution. Marc Roca Junque is replaced by Diego Reyes (Espanyol)."
        },
        {
            "gameTime": "2 - 35:27",
            "label": "",
            "description": "Diego Lopez makes a brilliant save! Alvaro Morata (Real Madrid) easily weaves through the defence and fires the ball from mid range. His effort goes towards the right side of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "2 - 34:07",
            "label": "",
            "description": "Leo Baptistao (Espanyol) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the left post."
        },
        {
            "gameTime": "2 - 32:08",
            "label": "",
            "description": "Felipe Caicedo (Espanyol) commits a foul and Alejandro Hernandez immediately signals a free kick."
        },
        {
            "gameTime": "2 - 30:12",
            "label": "corner",
            "description": "Victor Sanchez (Espanyol) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 29:34",
            "label": "",
            "description": "Nice individual effort by Felipe Caicedo (Espanyol). He gets all the way to the goalkeeper, produces a strike towards the roof of the net, but Francisco Casilla does a good job to anticipate the direction of the ball and keeps it out with a save. Espanyol earn a corner."
        },
        {
            "gameTime": "2 - 28:19",
            "label": "",
            "description": "Real Madrid control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 26:42",
            "label": "substitution",
            "description": "Substitution. Alvaro Morata (Real Madrid) in, Karim Benzema out."
        },
        {
            "gameTime": "2 - 25:37",
            "label": "soccer-ball",
            "description": "Goal! Karim Benzema (Real Madrid) finds himself some space inside the box to get on the end of a pass from Lucas, then sends the ball into the bottom right corner. 0:2."
        },
        {
            "gameTime": "2 - 23:53",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 23:34",
            "label": "",
            "description": "Real Madrid have been awarded a corner kick. Karim Benzema (Real Madrid) fashions a shot from the edge of the box after receiving an accurate pass. Diego Lopez makes a stunning save to stop the effort from flying into the right side of the goal."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 22:25",
            "label": "",
            "description": "Karim Benzema (Real Madrid) looks to break free, but an opposing player clears the ball away. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 21:24",
            "label": "",
            "description": "Leo Baptistao (Espanyol) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 20:28",
            "label": "substitution",
            "description": "Quique Flores has decided to introduce fresh legs, with Felipe Caicedo (Espanyol) replacing Gerard Moreno."
        },
        {
            "gameTime": "2 - 19:25",
            "label": "",
            "description": "Toni Kroos (Real Madrid) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "2 - 18:46",
            "label": "y-card",
            "description": "Javi Lopez (Espanyol) is booked after bringing down an opponent. Alejandro Hernandez had an easy decision to make."
        },
        {
            "gameTime": "2 - 16:45",
            "label": "substitution",
            "description": "Substitution. James Rodriguez will be replaced by Isco (Real Madrid)."
        },
        {
            "gameTime": "2 - 16:38",
            "label": "",
            "description": "Hernan Perez (Espanyol) has an effort from the edge of the area, but he skies the ball over the top."
        },
        {
            "gameTime": "2 - 15:23",
            "label": "",
            "description": "James Rodriguez receives a sweet cross inside the box from Karim Benzema (Real Madrid), but one of the defenders rushes in bravely to intercept the move."
        },
        {
            "gameTime": "2 - 13:45",
            "label": "",
            "description": "Well positioned Karim Benzema (Real Madrid) was first to the rebound and fired in a shot towards the middle, but Diego Lopez reacted superbly to keep the ball out. The fans could not believe their eyes. It was a miraculous stop!"
        },
        {
            "gameTime": "2 - 11:39",
            "label": "",
            "description": "Marco Asensio (Real Madrid) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "2 - 10:32",
            "label": "",
            "description": "Marco Asensio (Real Madrid) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "y-card",
            "description": "Pape Diop (Espanyol) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 08:19",
            "label": "",
            "description": "Alejandro Hernandez blows for a foul after Alvaro Vazquez (Espanyol) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 06:46",
            "label": "",
            "description": "Nice passing game by Espanyol. They are increasing their possession with a series of long passes and waiting for the right moment to create an attacking opportunity."
        },
        {
            "gameTime": "2 - 04:50",
            "label": "",
            "description": "Alvaro Vazquez (Espanyol) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "2 - 03:42",
            "label": "",
            "description": "Hernan Perez (Espanyol) commits a foul after unfairly pressing his opponent during an attacking move."
        },
        {
            "gameTime": "2 - 03:00",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Real Madrid."
        },
        {
            "gameTime": "2 - 00:55",
            "label": "",
            "description": "Javi Lopez (Espanyol) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. It has been a tight contest so far. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 48:08",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 46:36",
            "label": "soccer-ball",
            "description": "Goal! James Rodriguez (Real Madrid) weaves his way past opponents, and he unleashes a magnificent effort from the edge of the box into the bottom right corner. Diego Lopez had no chance of reaching it. The score is 0:1."
        },
        {
            "gameTime": "1 - 45:44",
            "label": "",
            "description": "Alejandro Hernandez blows his whistle as Victor Sanchez (Espanyol) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "1 - 43:39",
            "label": "y-card",
            "description": "Oscar Duarte (Espanyol) takes his opponent down and receives a yellow card from the referee."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "",
            "description": "Chance! Javi Lopez sends a brilliant curling cross into the heart of the defence and into the path of Leo Baptistao (Espanyol), whose header from the centre of the box goes a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 39:01",
            "label": "",
            "description": "Karim Benzema (Real Madrid) has a goal ruled out for offside!"
        },
        {
            "gameTime": "1 - 37:09",
            "label": "",
            "description": "Toni Kroos (Real Madrid) creates a good chance for himself and goes for goal from mid range, but the effort is well wide of the left post. The ball is off of the pitch and it's a goal kick for Espanyol."
        },
        {
            "gameTime": "1 - 36:45",
            "label": "",
            "description": "The linesman signals that Hernan Perez (Espanyol) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 36:43",
            "label": "",
            "description": "Toni Kroos (Real Madrid) has proven his good peripheral vision as he picks out Daniel Carvajal with a lovely through ball."
        },
        {
            "gameTime": "1 - 35:20",
            "label": "",
            "description": "Marcelo (Real Madrid) and Karim Benzema combine well with a quick one two to trick their opponent."
        },
        {
            "gameTime": "1 - 34:14",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Toni Kroos (Real Madrid). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 34:05",
            "label": "",
            "description": "Karim Benzema (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away. Real Madrid win a corner."
        },
        {
            "gameTime": "1 - 33:22",
            "label": "",
            "description": "Luka Modric (Real Madrid) sends an accurate short pass. Karim Benzema controls the ball with a fine first touch and is able to come up with a new attacking effort."
        },
        {
            "gameTime": "1 - 31:34",
            "label": "",
            "description": "James Rodriguez (Real Madrid) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 31:11",
            "label": "corner",
            "description": "The corner from Victor Sanchez (Espanyol) is intercepted by Francisco Casilla."
        },
        {
            "gameTime": "1 - 30:54",
            "label": "corner",
            "description": "Victor Sanchez (Espanyol) takes the corner, but it's intercepted by the defender. Good work from Espanyol as they win a corner."
        },
        {
            "gameTime": "1 - 30:06",
            "label": "",
            "description": "The ball is cleared after Marc Roca Junque (Espanyol) attempted to dribble past an opposing player. The ball goes out of play. Espanyol are awarded a corner kick."
        },
        {
            "gameTime": "1 - 27:54",
            "label": "",
            "description": "A cross into the box from Lucas (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 26:37",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 26:08",
            "label": "",
            "description": "Real Madrid move the ball around well as they wait for an opportunity to shoot, but the attack is halted as they lose possession."
        },
        {
            "gameTime": "1 - 25:30",
            "label": "injury",
            "description": "Sergio Ramos (Real Madrid) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 24:24",
            "label": "",
            "description": "Hernan Perez (Espanyol) strikes a powerful volley towards goal, but one of the defenders blocks his attempt."
        },
        {
            "gameTime": "1 - 22:58",
            "label": "",
            "description": "Marco Asensio (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 20:35",
            "label": "y-card",
            "description": "Alejandro Hernandez shows a yellow card to Hernan Perez (Espanyol) for his blatant foul."
        },
        {
            "gameTime": "1 - 18:40",
            "label": "substitution",
            "description": "Casemiro is being substituted because of an injury. Zinedine Zidane sends Toni Kroos (Real Madrid) on the pitch."
        },
        {
            "gameTime": "1 - 17:47",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 15:19",
            "label": "",
            "description": "Casemiro (Real Madrid) is able to continue to play."
        },
        {
            "gameTime": "1 - 14:41",
            "label": "",
            "description": "Alvaro Vazquez (Espanyol) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "1 - 14:17",
            "label": "",
            "description": "Victor Sanchez (Espanyol) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 13:27",
            "label": "injury",
            "description": "Casemiro (Real Madrid) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 12:30",
            "label": "",
            "description": "Casemiro (Real Madrid) gives away a foul for a fierce tackle on an opponent. Espanyol will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 11:51",
            "label": "corner",
            "description": "Victor Sanchez (Espanyol) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 11:18",
            "label": "",
            "description": "Francisco Casilla makes a brilliant save! Leo Baptistao (Espanyol) met a rebound outside the box and attempted to beat the keeper into the middle of the goal. Espanyol force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 09:59",
            "label": "substitution",
            "description": "Pablo Piatti is substituted due to injury. Quique Flores gives a chance to Alvaro Vazquez (Espanyol)."
        },
        {
            "gameTime": "1 - 09:46",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) attempts to release Lucas with a through ball, but his effort is thwarted by one of the defending players."
        },
        {
            "gameTime": "1 - 07:42",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) rises above the defence to meet the corner. His timing is good, but he arrows his header just a few inches wide of the right post."
        },
        {
            "gameTime": "1 - 07:41",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 06:45",
            "label": "injury",
            "description": "The game is interrupted now, Pablo Piatti (Espanyol) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 06:14",
            "label": "",
            "description": "Lucas (Real Madrid) wastes a good opportunity as his pass into the box is blocked by the defence. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "1 - 05:09",
            "label": "",
            "description": "Leo Baptistao (Espanyol) looks to break free, but an opposing player clears the ball away. The ball is behind the touchline and Espanyol will take a throw in."
        },
        {
            "gameTime": "1 - 04:12",
            "label": "",
            "description": "The Real Madrid players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 02:42",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) has tested the patience of referee Alejandro Hernandez and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 01:53",
            "label": "",
            "description": "Marc Roca Junque (Espanyol) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "1 - 01:08",
            "label": "",
            "description": "James Rodriguez (Real Madrid) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 00:33",
            "label": "",
            "description": "Karim Benzema (Real Madrid) races towards goal but the defender gets back well to make a challenge. Real Madrid will take a corner kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Alejandro Hernandez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gerard Moreno looks sharp as he's the top goal scorer for Espanyol with 11 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid have already won 87 points from 36 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "15 the number of consecutive matches that Real Madrid scored at least one goal."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The game wasn't exhilarating, but it wasn't totally boring either. There were a few nice moments from both sides. The away side was dominant and dictated the tempo of the game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "18/09/2016 - 21:45",
    "gameHomeTeam": "Espanyol",
    "gameScore": "0 - 2"
}