{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2017-04-15 - 16-30 Dortmund 3 - 1 Eintracht Frankfurt/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:01",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:35",
            "label": "",
            "description": "Mijat Gacinovic (Eintracht Frankfurt) goes for goal, but his effort isn't precise at all and it flies yards wide of the right post."
        },
        {
            "gameTime": "2 - 46:05",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) aims for the middle of the goal, but that's an easy job for the goalkeeper. It will take more than that to test him!"
        },
        {
            "gameTime": "2 - 45:44",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 45:26",
            "label": "",
            "description": "What a wasted opportunity by Shinji Kagawa (Dortmund)! He creates some space for himself inside the penalty box and unleashes a decent strike towards the bottom left corner, but Lukas Hradecky makes an astonishing save to thwart him. Good work from Dortmund as they win a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 40:27",
            "label": "soccer-ball",
            "description": "GOAL! Pierre Emerick Aubameyang (Dortmund) collects a pass and from inside the box he lifts the ball over Lukas Hradecky, who was off his line. What a finish that is! 3:1."
        },
        {
            "gameTime": "2 - 38:37",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) brings down his opponent with a very late tackle."
        },
        {
            "gameTime": "2 - 37:53",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) takes the free kick and hits the target, but Lukas Hradecky is alert and denies him with ease."
        },
        {
            "gameTime": "2 - 37:33",
            "label": "",
            "description": "David Abraham (Eintracht Frankfurt) commits a rough foul. Robert Hartmann stops the game and makes a call. Dortmund have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 36:58",
            "label": "",
            "description": "Timothy Chandler (Eintracht Frankfurt) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "2 - 35:31",
            "label": "substitution",
            "description": "Substitution. Branimir Hrgota makes way for Aymen Barkok (Eintracht Frankfurt)."
        },
        {
            "gameTime": "2 - 35:08",
            "label": "",
            "description": "Robert Hartmann blows his whistle after Bastian Oczipka (Eintracht Frankfurt) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "2 - 33:37",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) has a big opportunity to score! He climbs highest deep inside the penalty box and strikes a powerful header towards the goal. Next time he should aim better as his effort flies narrowly over the bar."
        },
        {
            "gameTime": "2 - 31:09",
            "label": "substitution",
            "description": "Thomas Tuchel prepares a substitution. Julian Weigl is replaced by Gonzalo Castro (Dortmund)."
        },
        {
            "gameTime": "2 - 29:43",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Shinji Kagawa (Dortmund). Robert Hartmann saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "2 - 28:17",
            "label": "",
            "description": "That's a well played offside trap. Branimir Hrgota (Eintracht Frankfurt) is flagged for offside, ending the attack."
        },
        {
            "gameTime": "2 - 25:53",
            "label": "substitution",
            "description": "The referee signals a substitution. Danny Blum (Eintracht Frankfurt) is brought on as a substitute for Marius Wolf."
        },
        {
            "gameTime": "2 - 24:08",
            "label": "attendance",
            "description": "The attendance for today's match is 81360."
        },
        {
            "gameTime": "2 - 23:23",
            "label": "",
            "description": "Marco Fabian (Eintracht Frankfurt) creates a yard of space for himself and tries an effort from the edge of the box, but it goes just wide of the left post."
        },
        {
            "gameTime": "2 - 18:46",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 18:24",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) looks to break free, but an opposing player clears the ball away. Now Dortmund have a corner."
        },
        {
            "gameTime": "2 - 15:16",
            "label": "",
            "description": "Flag up against Branimir Hrgota (Eintracht Frankfurt). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 12:09",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) comes close to scoring. He peels away from his marker and gets on the end of a cross from Ousmane Dembele, but he hits a shot just over the crossbar."
        },
        {
            "gameTime": "2 - 11:50",
            "label": "",
            "description": "Branimir Hrgota (Eintracht Frankfurt) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) has a shot blocked from inside the box."
        },
        {
            "gameTime": "2 - 10:18",
            "label": "substitution",
            "description": "Today's match ends for Anderson Rafael Ordonez Valdez who will be replaced by Ante Rebic (Eintracht Frankfurt)."
        },
        {
            "gameTime": "2 - 08:35",
            "label": "",
            "description": "Branimir Hrgota (Eintracht Frankfurt) is in a clear offside position and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 06:20",
            "label": "",
            "description": "Omar Mascarell (Eintracht Frankfurt) brings his opponent down with a tackle and Robert Hartmann blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "",
            "description": "Branimir Hrgota (Eintracht Frankfurt) almost finds himself in a very promising position, but he is flagged offside by the linesman."
        },
        {
            "gameTime": "2 - 00:43",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to make a change. Ousmane Dembele (Dortmund) replaces Marco Reus."
        },
        {
            "gameTime": "2 - 00:32",
            "label": "substitution",
            "description": "Sven Bender goes off the pitch and Matthias Ginter (Dortmund) comes on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Robert Hartmann blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 46:21",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "corner",
            "description": "Marco Reus (Dortmund) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 45:52",
            "label": "",
            "description": "The ball is cleared after Marco Reus (Dortmund) attempted to dribble past an opposing player. The referee and his assistant both point at the corner flag. Dortmund will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 41:24",
            "label": "",
            "description": "Sven Bender (Dortmund) tackles a bit over zealously and Robert Hartmann blows for a foul."
        },
        {
            "gameTime": "1 - 39:57",
            "label": "",
            "description": "The linesman raises his flag for offside before Marco Reus (Dortmund) heads on."
        },
        {
            "gameTime": "1 - 33:56",
            "label": "soccer-ball",
            "description": "Sokratis (Dortmund) scores an absolute screamer from outside the penalty area, with the ball flying into the top left corner!"
        },
        {
            "gameTime": "1 - 30:38",
            "label": "",
            "description": "Poor challenge! Jesus Vallejo (Eintracht Frankfurt) is penalised for tripping and Robert Hartmann blows his whistle."
        },
        {
            "gameTime": "1 - 28:26",
            "label": "soccer-ball",
            "description": "Marco Fabian (Eintracht Frankfurt) finds some space on the edge of the penalty box and smashes the ball into the top right corner! What a beauty!"
        },
        {
            "gameTime": "1 - 25:04",
            "label": "injury",
            "description": "Mijat Gacinovic (Eintracht Frankfurt) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 24:35",
            "label": "injury",
            "description": "The game is interrupted now, Jesus Vallejo (Eintracht Frankfurt) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 22:59",
            "label": "corner",
            "description": "Bastian Oczipka (Eintracht Frankfurt) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 22:32",
            "label": "",
            "description": "Mijat Gacinovic (Eintracht Frankfurt) was waiting for the ball on the penalty spot and produced a powerful volley towards the crossbar, but the goalkeeper made an amazing save to deny him. Eintracht Frankfurt will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 19:24",
            "label": "",
            "description": "Julian Weigl (Dortmund) makes a slide tackle, but referee Robert Hartmann blows for a foul."
        },
        {
            "gameTime": "1 - 18:24",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) gets to a rebound in front of goal and sends the ball towards the bottom left corner. However, but he couldn't beat Lukas Hradecky, who shows off his superb goalkeeping ability by pulling off a great save."
        },
        {
            "gameTime": "1 - 14:30",
            "label": "",
            "description": "The cross into the penalty area from Timothy Chandler (Eintracht Frankfurt) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "1 - 13:58",
            "label": "",
            "description": "Jesus Vallejo (Eintracht Frankfurt) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "1 - 12:16",
            "label": "",
            "description": "Jesus Vallejo (Eintracht Frankfurt) makes a reckless foul in order to win the ball from his opponent. Robert Hartmann has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 11:03",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "1 - 10:39",
            "label": "",
            "description": "Dortmund are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "1 - 08:12",
            "label": "",
            "description": "Marco Fabian (Eintracht Frankfurt) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 07:38",
            "label": "",
            "description": "Nuri Sahin (Dortmund) unleashes a decent effort from just outside the box which goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 06:23",
            "label": "corner",
            "description": "Marco Reus (Dortmund) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 06:12",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) blasts the ball from just outside the box, but his attempt is blocked by the defender. Corner kick. Dortmund will have an opportunity."
        },
        {
            "gameTime": "1 - 01:57",
            "label": "soccer-ball",
            "description": "Goal! Marco Reus (Dortmund) with a wonderful piece of finishing. He makes a yard for himself after a well taken pass inside the box and strikes the ball into the bottom left corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Eintracht Frankfurt will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Robert Hartmann will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Eintracht Frankfurt have not tasted victory over their past 9 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund scored at least one goal in each of their last 19 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund are still unbeaten at home this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        }
    ],
    "gameAwayTeam": "Eintracht Frankfurt",
    "gameDate": "15/04/2017 - 16:30",
    "gameHomeTeam": "Dortmund",
    "gameScore": "3 - 1"
}