{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-11-06 - 19-30 Leicester 1 - 2 West Brom/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. We witnessed a quite balanced game. Both sides played a lot of long passes and crosses into the box."
        },
        {
            "gameTime": "2 - 50:26",
            "label": "whistle",
            "description": "That's it for today, Craig Pawson has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "",
            "description": "Leonardo Ulloa (Leicester) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 46:35",
            "label": "substitution",
            "description": "Hal Robson Kanu (West Brom) joins the action as a substitute, replacing James Morrison."
        },
        {
            "gameTime": "2 - 45:19",
            "label": "",
            "description": "Demarai Gray (Leicester) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:54",
            "label": "y-card",
            "description": "Chris Brunt (West Brom) is cautioned by the referee."
        },
        {
            "gameTime": "2 - 43:38",
            "label": "",
            "description": "One of the players from Leicester times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 41:56",
            "label": "y-card",
            "description": "The referee demonstrates he won't tolerate this behaviour. Craig Gardner (West Brom) is given a yellow card."
        },
        {
            "gameTime": "2 - 41:25",
            "label": "substitution",
            "description": "Claudio Ranieri has decided to substitute Robert Huth and he is replaced by Leonardo Ulloa (Leicester)."
        },
        {
            "gameTime": "2 - 40:30",
            "label": "",
            "description": "Islam Slimani (Leicester) sends a chip pass into the box, but Ben Foster is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 39:06",
            "label": "",
            "description": "Riyad Mahrez (Leicester) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 37:07",
            "label": "substitution",
            "description": "The substitution is prepared. Craig Gardner (West Brom) joins the action as a substitute, replacing Matt Phillips."
        },
        {
            "gameTime": "2 - 36:49",
            "label": "corner",
            "description": "Christian Fuchs (Leicester) swings in the corner, but the goalkeeper does a brilliant job to intercept the effort."
        },
        {
            "gameTime": "2 - 36:19",
            "label": "",
            "description": "A cross from Christian Fuchs (Leicester) fails to reach the box as the defence clears the ball away to safety. The ball goes out of play and Leicester have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 35:30",
            "label": "",
            "description": "Ben Foster makes a superb save to deny a header which was nodded by Andy King (Leicester) after a cross from the side."
        },
        {
            "gameTime": "2 - 33:33",
            "label": "",
            "description": "Riyad Mahrez (Leicester) sends a low pass from outside the box to Demarai Gray. He lines up a shot, but the defence intercepts at the last moment."
        },
        {
            "gameTime": "2 - 29:43",
            "label": "",
            "description": "Jamie Vardy (Leicester) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball goes well wide of the right post!"
        },
        {
            "gameTime": "2 - 29:19",
            "label": "funfact",
            "description": "5:11 – the total goal attempt statistics."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "soccer-ball",
            "description": "What a goal that is! Matt Phillips (West Brom) gets to the ball inside the box and brilliantly lifts the ball over Ron Robert Zieler and into the net. 1:2."
        },
        {
            "gameTime": "2 - 26:12",
            "label": "",
            "description": "Chris Brunt (West Brom) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "2 - 24:44",
            "label": "corner",
            "description": "The resulting set piece from West Brom is comfortably intercepted by one of the defending players."
        },
        {
            "gameTime": "2 - 24:14",
            "label": "",
            "description": "Gareth McAuley (West Brom) rises highest from the corner to head at goal, but his effort towards the right side of the goal is brilliantly kept out by the goalkeeper. The ball goes out for a corner. West Brom can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 23:34",
            "label": "corner",
            "description": "West Brom force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 23:19",
            "label": "",
            "description": "Matt Phillips (West Brom) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 21:20",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Ahmed Musa trots off the pitch and is replaced by Demarai Gray (Leicester)."
        },
        {
            "gameTime": "2 - 18:30",
            "label": "corner",
            "description": "Riyad Mahrez (Leicester) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 18:20",
            "label": "",
            "description": "Riyad Mahrez (Leicester) fails to send a pass into the box as his effort is cut out. Leicester earn a corner."
        },
        {
            "gameTime": "2 - 16:07",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) gets a shot away from distance, but wasn't really set to take it and fires high and wide."
        },
        {
            "gameTime": "2 - 14:48",
            "label": "",
            "description": "Robert Huth (Leicester) gives away a foul for a clumsy challenge. Referee Craig Pawson saw the whole situation."
        },
        {
            "gameTime": "2 - 13:56",
            "label": "corner",
            "description": "The referee points to the corner flag and Leicester will take a corner."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "",
            "description": "Ahmed Musa (Leicester) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 09:10",
            "label": "soccer-ball",
            "description": "Islam Slimani (Leicester) finds his way to the ball and finishes with a bullet header. Ben Foster couldn't do anything to stop his effort which was directed into the right side of the target and bounced in off the post. The score is 0:0."
        },
        {
            "gameTime": "2 - 08:42",
            "label": "corner",
            "description": "Matt Phillips (West Brom) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 08:31",
            "label": "",
            "description": "Chris Brunt (West Brom) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. West Brom have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 06:22",
            "label": "soccer-ball",
            "description": "Goal – 0:1! Matt Phillips sends a precise lofted pass into the box, James Morrison (West Brom) rises above the defenders to meet the ball near the penalty spot and heads it straight into the left side of the goal."
        },
        {
            "gameTime": "2 - 06:19",
            "label": "",
            "description": "Matt Phillips (West Brom) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 05:48",
            "label": "",
            "description": "Craig Pawson has a clear sight and sees a foul from Ahmed Musa (Leicester). West Brom are awarded the free kick."
        },
        {
            "gameTime": "2 - 04:18",
            "label": "corner",
            "description": "West Brom didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 03:55",
            "label": "",
            "description": "Craig Dawson (West Brom) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. The ball is out of play. West Brom win a corner kick."
        },
        {
            "gameTime": "2 - 03:10",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Riyad Mahrez (Leicester) takes it short."
        },
        {
            "gameTime": "2 - 02:58",
            "label": "",
            "description": "The ball is cleared after Jamie Vardy (Leicester) attempted to dribble past an opposing player. Leicester have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 01:55",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Chris Brunt (West Brom) sends it out of play."
        },
        {
            "gameTime": "2 - 01:33",
            "label": "",
            "description": "Allan Nyom (West Brom) tries to send a pass but it's blocked. The ball is out of play and the linesman points at the corner flag. Corner to West Brom."
        },
        {
            "gameTime": "2 - 01:19",
            "label": "",
            "description": "A cross by James Morrison (West Brom) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Claudio Ranieri gives a chance to Jamie Vardy (Leicester) and Shinji Okazaki is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The players are likely to put the fans to sleep with this performance rather than receiving any vociferous support. Let's hope we are about to see an improvement in the second half. The game is quite balanced. Long balls and crosses are the strongest weapons of both teams."
        },
        {
            "gameTime": "1 - 46:22",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 41:14",
            "label": "",
            "description": "Riyad Mahrez (Leicester) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 40:07",
            "label": "",
            "description": "Ahmed Musa (Leicester) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball is off of the pitch and it's a goal kick for West Brom."
        },
        {
            "gameTime": "1 - 37:57",
            "label": "funfact",
            "description": "Total attempts – 5:11."
        },
        {
            "gameTime": "1 - 36:23",
            "label": "",
            "description": "Ahmed Musa (Leicester) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 34:54",
            "label": "",
            "description": "The foul by Jose Rondon (West Brom) was seen by Craig Pawson who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 33:19",
            "label": "",
            "description": "Ahmed Musa (Leicester) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 32:06",
            "label": "",
            "description": "What a poor attempt! Chris Brunt (West Brom) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "1 - 30:49",
            "label": "",
            "description": "The ball spins up and hits the hand of Ahmed Musa (Leicester) after he fails to control it and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 28:08",
            "label": "",
            "description": "Riyad Mahrez (Leicester) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 26:21",
            "label": "",
            "description": "Leicester are just stroking the ball across the park now, but the defence is doing very well breaking up their possession."
        },
        {
            "gameTime": "1 - 22:29",
            "label": "",
            "description": "Shinji Okazaki (Leicester) gets on the ball and beats an opponent, but his run is stopped by the referee Craig Pawson who sees an offensive foul."
        },
        {
            "gameTime": "1 - 21:08",
            "label": "",
            "description": "The cross into the penalty area from Christian Fuchs (Leicester) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "1 - 19:17",
            "label": "",
            "description": "Danny Simpson (Leicester) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 18:17",
            "label": "",
            "description": "James Morrison (West Brom) attempted to pick out a free teammate inside the box, but Ron Robert Zieler comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 17:51",
            "label": "",
            "description": "Riyad Mahrez (Leicester) robs an opponent of the ball and explodes in anger when Craig Pawson blows for a foul."
        },
        {
            "gameTime": "1 - 14:29",
            "label": "",
            "description": "What a chance that is! Jose Rondon (West Brom) squanders a huge opportunity as he latches on to a perfect cross from the wing. He and produces a bullet header from around the penalty spot which goes well wide of the left post!"
        },
        {
            "gameTime": "1 - 13:41",
            "label": "",
            "description": "Matt Phillips (West Brom) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 10:28",
            "label": "",
            "description": "Riyad Mahrez (Leicester) fizzes over a cross which doesn't cause any problems. The ball goes out of play and West Brom will have a goal kick."
        },
        {
            "gameTime": "1 - 08:15",
            "label": "",
            "description": "Handball by Riyad Mahrez (Leicester)."
        },
        {
            "gameTime": "1 - 06:31",
            "label": "",
            "description": "Darren Fletcher (West Brom) unleashes a missile of a shot towards goal, but his good effort is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 05:33",
            "label": "",
            "description": "Matt Phillips (West Brom) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "1 - 03:32",
            "label": "",
            "description": "Claudio Yacob (West Brom) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "1 - 03:15",
            "label": "corner",
            "description": "West Brom quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "1 - 02:57",
            "label": "",
            "description": "Matt Phillips (West Brom) strikes a first time shot towards the bottom left corner, but the goalkeeper denies him with an excellent save. The referee and one of his assistants signal for a corner kick to West Brom."
        },
        {
            "gameTime": "1 - 01:08",
            "label": "corner",
            "description": "Leicester have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Craig Pawson is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Nacer Chadli from West Brom will look to add to his goal tally, he has netted 4 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester have already won at home 3x this season, while from away matches they have managed to win 0x."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. We witnessed a quite balanced game. Both sides played a lot of long passes and crosses into the box."
        }
    ],
    "gameAwayTeam": "West Brom",
    "gameDate": "06/11/2016 - 19:30",
    "gameHomeTeam": "Leicester",
    "gameScore": "1 - 2"
}