{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-11-05 - 22-45 Bayern Munich 2 - 0 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home team had more of the game. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        },
        {
            "gameTime": "2 - 48:00",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 47:09",
            "label": "",
            "description": "Bayern Munich seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 46:17",
            "label": "",
            "description": "Gervinho passes to Seydou Keita (AS Roma), but he produces a wild shot from the edge of the box which goes high over the bar. The ball goes out of play and Bayern Munich will have a goal kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:58",
            "label": "",
            "description": "Mattia Destro (AS Roma) is flagged for offside."
        },
        {
            "gameTime": "2 - 43:55",
            "label": "corner",
            "description": "Xherdan Shaqiri (Bayern Munich) takes a short corner kick."
        },
        {
            "gameTime": "2 - 43:38",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) swings in a cross, but the ball is cleared to safety by one of the defending players. Bayern Munich win a corner."
        },
        {
            "gameTime": "2 - 42:59",
            "label": "substitution",
            "description": "The referee signals a substitution. Pierre Emile Hojbjerg (Bayern Munich) is brought on as a substitute for Philipp Lahm."
        },
        {
            "gameTime": "2 - 39:27",
            "label": "",
            "description": "Xherdan Shaqiri (Bayern Munich) makes a good run with the ball, but his shot from the edge of the penalty area goes just wide of the left post. Terrific solo effort, though. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "2 - 38:20",
            "label": "corner",
            "description": "Miralem Pjanic (AS Roma) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 38:06",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) collects a rebound and produces a mid range attempt. The ball goes towards the roof of the net, but Manuel Neuer keeps it out with an amazing save. The ball is out of play and the linesman points at the corner flag. Corner to AS Roma."
        },
        {
            "gameTime": "2 - 38:01",
            "label": "",
            "description": "Manuel Neuer pulls off a great save to deny Gervinho (AS Roma), who makes himself some space inside the box and unleashes a quick low drive to the bottom right corner."
        },
        {
            "gameTime": "2 - 37:16",
            "label": "",
            "description": "Lovely cross from Rafinha to find Robert Lewandowski (Bayern Munich) deep in the box, but he steers his header well wide of the left post. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "2 - 36:32",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 35:19",
            "label": "substitution",
            "description": "Substitution. David Alaba walks off the pitch and Sebastian Rode (Bayern Munich) comes on as a substitute."
        },
        {
            "gameTime": "2 - 33:01",
            "label": "funfact",
            "description": "The current number of shots on goal is 6:2."
        },
        {
            "gameTime": "2 - 31:51",
            "label": "",
            "description": "Close! David Alaba (Bayern Munich) takes the resultant free kick from 25 metres out and his shot goes just wide of the right post. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "2 - 30:48",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) is penalised after knocking an opponent down. A free kick is awarded to Bayern Munich."
        },
        {
            "gameTime": "2 - 30:18",
            "label": "",
            "description": "Juan Bernat is able to continue with the attacking effort as he latches on to a beautiful defence splitting lofted pass, which was supplied by Mario Gotze (Bayern Munich)."
        },
        {
            "gameTime": "2 - 28:52",
            "label": "substitution",
            "description": "A substitution has been made. Juan Iturbe is replaced by Gervinho (AS Roma)."
        },
        {
            "gameTime": "2 - 28:30",
            "label": "",
            "description": "Xherdan Shaqiri (Bayern Munich) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 27:30",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes, and they control the game at the moment, but one of the defending players steps in and intercepts the effort."
        },
        {
            "gameTime": "2 - 26:37",
            "label": "substitution",
            "description": "Today's match ends for Xabi Alonso who will be replaced by Xherdan Shaqiri (Bayern Munich)."
        },
        {
            "gameTime": "2 - 25:48",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) receives a reproachful look from David Alaba. He latches on to his pass, but the effort from the edge of the box sails high over the crossbar. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "2 - 24:40",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) launches into a thunderous tackle on his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 23:22",
            "label": "",
            "description": "Seydou Keita (AS Roma) displays his superb passing ability after picking out Ashley Cole with a fine lofted pass to continue their attacking move."
        },
        {
            "gameTime": "2 - 21:33",
            "label": "",
            "description": "Philipp Lahm swings the cross over. Robert Lewandowski (Bayern Munich) gets his head to it but it goes just over the crossbar. The ball is off of the pitch and it's a goal kick for AS Roma."
        },
        {
            "gameTime": "2 - 20:27",
            "label": "",
            "description": "What a big chance! Philipp Lahm (Bayern Munich) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "2 - 20:11",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 18:37",
            "label": "soccer-ball",
            "description": "Goal! Robert Lewandowski plays a pass to the feet of Mario Gotze (Bayern Munich), and he shoots inside the right post from inside the box. It's 2:0."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "",
            "description": "Bayern Munich keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "2 - 16:15",
            "label": "funfact",
            "description": "Here's the current ball possession statistics for both teams – 66:34."
        },
        {
            "gameTime": "2 - 15:40",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) makes an overly aggressive challenge and Cuneyt Cakir blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 12:59",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) receives a fine cross inside the box and attempts to score a goal, but his shot flies just wide of the right post. The ball is off of the pitch and it's a goal kick for AS Roma."
        },
        {
            "gameTime": "2 - 12:58",
            "label": "corner",
            "description": "Franck Ribery (Bayern Munich) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 12:49",
            "label": "substitution",
            "description": "The manager has been forced to make a substitution and the injured Alessandro Florenzi leaves the pitch to be replaced by Miralem Pjanic (AS Roma)."
        },
        {
            "gameTime": "2 - 11:56",
            "label": "injury",
            "description": "Alessandro Florenzi (AS Roma) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 11:29",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) whips a promising cross into the box, but the opposition's defence intercepts the ball. Bayern Munich force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 09:24",
            "label": "",
            "description": "What a poor attempt! Jerome Boateng (Bayern Munich) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "2 - 08:56",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Philipp Lahm (Bayern Munich) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 08:17",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 07:57",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) finds himself in a promising position after receiving an excellent pass into the box, but one of the defenders produces a timely intervention to avert the threat. Bayern Munich force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 06:31",
            "label": "",
            "description": "Great ball in from Rafinha. David Alaba (Bayern Munich) should really have done better with a close range header, but he heads it a whisker over the crossbar. The ball is off of the pitch and it's a goal kick for AS Roma."
        },
        {
            "gameTime": "2 - 06:15",
            "label": "",
            "description": "Bayern Munich enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 04:53",
            "label": "",
            "description": "The linesman raises his flag. Robert Lewandowski (Bayern Munich) is adjudged offside."
        },
        {
            "gameTime": "2 - 03:53",
            "label": "",
            "description": "The foul by Mehdi Benatia (Bayern Munich) was seen by Cuneyt Cakir who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 03:20",
            "label": "",
            "description": "David Alaba (Bayern Munich) sprays a pass out to Franck Ribery, but he can't beat his man inside the box."
        },
        {
            "gameTime": "2 - 02:38",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the left post. Lukasz Skorupski is alert and denies him with a nice save."
        },
        {
            "gameTime": "2 - 02:23",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "2 - 01:55",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) commits an ugly challenge. The referee sees it and immediately blows his whistle. It's a free kick to Bayern Munich, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 00:58",
            "label": "",
            "description": "David Alaba (Bayern Munich) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here is a change after the half time break. Jose Holebas is replaced by Ashley Cole (AS Roma)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Cuneyt Cakir starts the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "It wasn't the most inspiring 45 minutes that you'll see this week. Let's hope that the second period will be more exciting. The hosts are mostly controlling the match and making it pretty tough for the opposition to keep up. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Cuneyt Cakir has ended it."
        },
        {
            "gameTime": "1 - 45:22",
            "label": "y-card",
            "description": "The foul by Xabi Alonso (Bayern Munich) is worthy of a card and a yellow is duly shown by Cuneyt Cakir."
        },
        {
            "gameTime": "1 - 44:56",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) has proven his good peripheral vision as he picks out David Alaba with a lovely through ball."
        },
        {
            "gameTime": "1 - 43:02",
            "label": "corner",
            "description": "Alessandro Florenzi (AS Roma) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 42:37",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) tries to slide the ball through to a teammate but it's well blocked by a defender. Corner kick. AS Roma will have an opportunity."
        },
        {
            "gameTime": "1 - 41:39",
            "label": "",
            "description": "AS Roma hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "1 - 40:03",
            "label": "corner",
            "description": "Franck Ribery (Bayern Munich) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 39:40",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Philipp Lahm (Bayern Munich). Bayern Munich will take a corner kick."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) was trying to get to the ball but clattered into the legs of the opponent as well. Cuneyt Cakir blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 37:31",
            "label": "soccer-ball",
            "description": "Franck Ribery (Bayern Munich) scores an easy goal. He receives a precise pass inside the box and sends the ball past the goalkeeper, glancing in off the downside of the right post."
        },
        {
            "gameTime": "1 - 36:42",
            "label": "",
            "description": "David Alaba (Bayern Munich) shoots after his astonishing individual effortt from about 20 metres out to the middle of the target, but Lukasz Skorupski shows his excellent skills and saves the attempt."
        },
        {
            "gameTime": "1 - 36:06",
            "label": "",
            "description": "Cuneyt Cakir has a clear sight and sees a foul from Mapou Yanga Mbiwa (AS Roma)."
        },
        {
            "gameTime": "1 - 34:41",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) sends a chip pass into the box, but Lukasz Skorupski is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 32:52",
            "label": "",
            "description": "David Alaba (Bayern Munich) sends in a lofted cross from a long range free kick, but his poor effort goes out of play."
        },
        {
            "gameTime": "1 - 31:10",
            "label": "",
            "description": "Referee Cuneyt Cakir sees the trip by Seydou Keita (AS Roma) and doesn't hesitate to blow his whistle. That's a free kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 30:35",
            "label": "",
            "description": "Neat passing move from Bayern Munich in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 29:53",
            "label": "",
            "description": "Mattia Destro (AS Roma) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 27:29",
            "label": "",
            "description": "Alessandro Florenzi (AS Roma) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 26:12",
            "label": "injury",
            "description": "Alessandro Florenzi (AS Roma) picks up an injury."
        },
        {
            "gameTime": "1 - 24:14",
            "label": "",
            "description": "Cuneyt Cakir blows his whistle for a foul after Xabi Alonso (Bayern Munich) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 23:40",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 23:13",
            "label": "",
            "description": "An attempted cross from Juan Bernat (Bayern Munich) is cleared. Bayern Munich earn a corner."
        },
        {
            "gameTime": "1 - 21:47",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) receives a pass and tries his luck with a low shot from 20 metres out. Lukasz Skorupski pulls off a comfortable save to stop the effort going into the middle of the net."
        },
        {
            "gameTime": "1 - 21:09",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 21:05",
            "label": "",
            "description": "Lukasz Skorupski pulls off a great save to deny Mario Gotze (Bayern Munich), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "1 - 20:09",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 17:58",
            "label": "corner",
            "description": "The corner by Xabi Alonso (Bayern Munich) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 17:28",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) misses a good chance to score. An inch perfect cross into the box finds Juan Bernat (Bayern Munich) who rises for a header, but sends the ball well over the bar. Good work from Bayern Munich as they win a corner."
        },
        {
            "gameTime": "1 - 16:42",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 15:45",
            "label": "",
            "description": "Seydou Keita (AS Roma) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 14:50",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) trips an opponent with a slide tackle. Cuneyt Cakir stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 13:47",
            "label": "",
            "description": "David Alaba (Bayern Munich) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 13:15",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 12:53",
            "label": "",
            "description": "A raking crossfield pass from Rafinha (Bayern Munich) lacks accuracy and the opposition gain possession."
        },
        {
            "gameTime": "1 - 11:42",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) commits a rough foul. Cuneyt Cakir stops the game and makes a call."
        },
        {
            "gameTime": "1 - 11:13",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 10:39",
            "label": "",
            "description": "Bayern Munich are playing excellent possession football at the moment by exchanging some long passes."
        },
        {
            "gameTime": "1 - 09:13",
            "label": "",
            "description": "The free kick into the penalty area from Alessandro Florenzi (AS Roma) is cleared."
        },
        {
            "gameTime": "1 - 08:39",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) brings his opponent down. Cuneyt Cakir has a clear sight of it and blows his whistle for a foul. There is a free kick near the sideline to AS Roma."
        },
        {
            "gameTime": "1 - 07:34",
            "label": "",
            "description": "Juan Iturbe (AS Roma) pulls the jersey of one of the opposition players and Cuneyt Cakir blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 07:22",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "1 - 05:31",
            "label": "corner",
            "description": "Franck Ribery (Bayern Munich) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 05:14",
            "label": "",
            "description": "Rafinha (Bayern Munich) crosses the ball into the box, but one of the defending players averts the threat. Bayern Munich have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 04:17",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 03:36",
            "label": "",
            "description": "A pass by Alessandro Florenzi (AS Roma) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 02:29",
            "label": "",
            "description": "Rafinha (Bayern Munich) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. The ball is out of play. Bayern Munich will have a throw in."
        },
        {
            "gameTime": "1 - 01:55",
            "label": "corner",
            "description": "Alessandro Florenzi (AS Roma) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 01:32",
            "label": "",
            "description": "Alessandro Florenzi (AS Roma) fails to send a pass into the box as his effort is cut out. The ball is out of play. AS Roma will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 01:06",
            "label": "",
            "description": "Vassilios Torosidis (AS Roma) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Cuneyt Cakir will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home team had more of the game. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "05/11/2014 - 22:45",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "2 - 0"
}