{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-12-13 - 22-30 Villarreal 1 - 0 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. The away side dominated this game. It's obvious that defence had the highest priority for the home side. The away team made a lot of passes and attempted to maintain possession."
        },
        {
            "gameTime": "2 - 49:02",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 48:16",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) makes some space to meet a perfect cross inside the box, but he blazes his shot over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "2 - 47:30",
            "label": "",
            "description": "One of the players from Real Madrid times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "substitution",
            "description": "Marcelino Garcia Toral decides to make a substitution. Manuel Trigueros will be replaced by Tomas Pina (Villarreal)."
        },
        {
            "gameTime": "2 - 46:27",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco shows a yellow card to Denis Suarez (Villarreal), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "corner",
            "description": "Gareth Bale (Real Madrid) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 44:40",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 44:04",
            "label": "",
            "description": "Villarreal are happy showing off their ball keeping skills and that is only interrupted when the defender steps in."
        },
        {
            "gameTime": "2 - 43:40",
            "label": "substitution",
            "description": "Jese (Real Madrid) comes onto the pitch because Marcelo simply cannot continue any longer after picking up an injury."
        },
        {
            "gameTime": "2 - 42:30",
            "label": "injury",
            "description": "Marcelo (Real Madrid) picks up an injury."
        },
        {
            "gameTime": "2 - 41:41",
            "label": "",
            "description": "Cedric Bakambu (Villarreal) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post."
        },
        {
            "gameTime": "2 - 40:10",
            "label": "",
            "description": "Nahuel Leiva (Villarreal) feels very aggrieved after the referee stops play for a foul that he commits while in possession of the ball."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "substitution",
            "description": "Eric Bertrand Bailly is not able to continue due to his injury and will be replaced by Antonio Rukavina (Villarreal)."
        },
        {
            "gameTime": "2 - 37:30",
            "label": "substitution",
            "description": "That will be all from Roberto Soldado who is being replaced by the fresh legs of Nahuel Leiva (Villarreal)."
        },
        {
            "gameTime": "2 - 36:19",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Manuel Trigueros (Villarreal)."
        },
        {
            "gameTime": "2 - 34:21",
            "label": "",
            "description": "James Rodriguez (Real Madrid) gets a shot away from around 18 metres out after his fine solo run. The ball went just wide of the right post!"
        },
        {
            "gameTime": "2 - 33:25",
            "label": "corner",
            "description": "Real Madrid take a short corner kick."
        },
        {
            "gameTime": "2 - 33:25",
            "label": "substitution",
            "description": "The referee signals a substitution. Mateo Kovacic (Real Madrid) is brought on as a substitute for Casemiro."
        },
        {
            "gameTime": "2 - 33:00",
            "label": "substitution",
            "description": "Substitution. Isco (Real Madrid) replaces Luka Modric."
        },
        {
            "gameTime": "2 - 32:41",
            "label": "",
            "description": "A cross into the box from Pepe (Real Madrid) is cleared. Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 31:08",
            "label": "",
            "description": "Real Madrid hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 29:43",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 7:20."
        },
        {
            "gameTime": "2 - 28:33",
            "label": "",
            "description": "Roberto Soldado (Villarreal) is penalised for holding. Alberto Undiano Mallenco signals a set piece."
        },
        {
            "gameTime": "2 - 28:00",
            "label": "",
            "description": "Eric Bertrand Bailly (Villarreal) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 27:15",
            "label": "",
            "description": "Karim Benzema (Real Madrid) receives a lofted pass in the goal area and unleashes a dangerous header which sails narrowly wide of the left post!"
        },
        {
            "gameTime": "2 - 26:51",
            "label": "injury",
            "description": "Looks like Eric Bertrand Bailly (Villarreal) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 26:49",
            "label": "y-card",
            "description": "The foul by Eric Bertrand Bailly (Villarreal) is worthy of a card and a yellow is duly shown by Alberto Undiano Mallenco."
        },
        {
            "gameTime": "2 - 24:48",
            "label": "",
            "description": "Decent spell from Real Madrid here and they keep the pressure on until one of the defending players steps in."
        },
        {
            "gameTime": "2 - 22:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) latches on to a lofted pass and strikes the ball! His attempt flies narrowly over the bar. The goalkeeper was lucky!"
        },
        {
            "gameTime": "2 - 21:46",
            "label": "",
            "description": "Gareth Bale (Real Madrid) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 21:21",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 21:07",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The ball is out of play and Real Madrid manage to earn a corner."
        },
        {
            "gameTime": "2 - 20:53",
            "label": "",
            "description": "Gareth Bale (Real Madrid) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "2 - 20:13",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Alberto Undiano Mallenco didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 18:39",
            "label": "",
            "description": "Keylor Navas makes a good save! Roberto Soldado (Villarreal) easily weaves through the defence and unleashes a low shot from long range. His effort is directed towards the middle of the goal, but the goalkeeper is alert and stops it."
        },
        {
            "gameTime": "2 - 18:08",
            "label": "attendance",
            "description": "The attendance is 20468."
        },
        {
            "gameTime": "2 - 17:27",
            "label": "",
            "description": "Real Madrid keep hold of the ball with numerous one two passes, but one error and they surrender possession."
        },
        {
            "gameTime": "2 - 16:05",
            "label": "corner",
            "description": "The resulting corner from Denis Suarez (Villarreal) is cleared."
        },
        {
            "gameTime": "2 - 15:28",
            "label": "",
            "description": "Denis Suarez (Villarreal) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The referee points to the corner flag and Villarreal will take a corner."
        },
        {
            "gameTime": "2 - 13:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) expertly controls a neat clever pass inside the box, but his effort crashes against the left post! What an opportunity that was!"
        },
        {
            "gameTime": "2 - 12:58",
            "label": "",
            "description": "Gareth Bale (Real Madrid) collects a pass and strikes from about 22 metres out. It's a poor attempt which flies well over the bar."
        },
        {
            "gameTime": "2 - 12:48",
            "label": "",
            "description": "Marcelo (Real Madrid) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 11:21",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a cross into the box, but Alphonse Areola comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 10:40",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 10:12",
            "label": "",
            "description": "Gareth Bale (Real Madrid) receives a precise pass and is given time inside the box to send a promising strike towards the bottom left corner. Alphonse Areola guesses his intention and denies him with a fine save. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "2 - 09:26",
            "label": "",
            "description": "Alberto Undiano Mallenco blows for a foul after Pepe (Real Madrid) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 08:40",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) tries his luck from the edge of the box after a brilliant solo effort, but it is well blocked by the defender."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) swings in the corner, but it's comfortably cleared away. Real Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 07:22",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "",
            "description": "A cross from James Rodriguez (Real Madrid) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 04:56",
            "label": "",
            "description": "Roberto Soldado (Villarreal) picks up a pass, lines up a shot and strikes from 20 metres out, but Keylor Navas thwarts the effort which is headed to the bottom right corner."
        },
        {
            "gameTime": "2 - 03:59",
            "label": "",
            "description": "CHANCE! Gareth Bale finds Karim Benzema (Real Madrid) with a sweet pass, but he can't find the target as his effort from inside the box goes just over the bar!"
        },
        {
            "gameTime": "2 - 03:42",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 03:18",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. The referee blows his whistle, Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 02:31",
            "label": "",
            "description": "Close! Karim Benzema (Real Madrid) picks up the ball in space and from inside the penalty area sends a shot inches wide of the left post. The ball goes out of play and Villarreal will have a goal kick."
        },
        {
            "gameTime": "2 - 01:49",
            "label": "",
            "description": "Dangerous play by Cedric Bakambu (Villarreal). Alberto Undiano Mallenco blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 00:43",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a well played pass inside the penalty area and shoots. He sends the ball into orbit."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The game produced by the players until now hasn't been particularly attractive, but there is still 45 minutes left so let's hope they will come out with renewed vigour and provide better entertainment this half. The away team controlled the game for most of the first half. The home team's main weapon is fast counter attacks, while the away side attempts to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 45:06",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "",
            "description": "Jonathan dos Santos (Villarreal) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 43:17",
            "label": "",
            "description": "Denis Suarez (Villarreal) dribbles into the box, but Keylor Navas is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "1 - 41:23",
            "label": "",
            "description": "Real Madrid keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 39:43",
            "label": "corner",
            "description": "Real Madrid work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "1 - 39:28",
            "label": "",
            "description": "Marcelo (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 37:17",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is penalised for a foul. Alberto Undiano Mallenco had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 35:42",
            "label": "",
            "description": "Cedric Bakambu (Villarreal) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just over the crossbar."
        },
        {
            "gameTime": "1 - 34:53",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Karim Benzema (Real Madrid), but the defence gets it clear."
        },
        {
            "gameTime": "1 - 33:30",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Jonathan dos Santos (Villarreal), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 33:05",
            "label": "",
            "description": "A beautiful low pass from the side is received by Cedric Bakambu (Villarreal), who was waiting for his chance. However, the defence is alert and spanks the ball away. The ball goes out for a corner. Villarreal can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 32:14",
            "label": "",
            "description": "Marcelo (Real Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 30:23",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco rightly pulls out a yellow card and shows it to Marcelo (Real Madrid)."
        },
        {
            "gameTime": "1 - 30:19",
            "label": "",
            "description": "Luka Modric (Real Madrid) wriggles into space and fires the ball from the edge of the area, but one of the defenders is there to block the effort."
        },
        {
            "gameTime": "1 - 28:30",
            "label": "",
            "description": "Real Madrid take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 27:55",
            "label": "",
            "description": "It looks like Manuel Trigueros (Villarreal) saw red with that tackle. Alberto Undiano Mallenco won't tolerate such behaviour on the pitch and blows for a foul. Real Madrid earn a free kick."
        },
        {
            "gameTime": "1 - 27:10",
            "label": "",
            "description": "Gareth Bale (Real Madrid) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 26:26",
            "label": "",
            "description": "Cedric Bakambu (Villarreal) amazingly found his way through the defence, but lacked a precise finish as his effort from close range went slightly wide of the left post."
        },
        {
            "gameTime": "1 - 25:46",
            "label": "",
            "description": "Roberto Soldado (Villarreal) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 23:56",
            "label": "",
            "description": "Gareth Bale swings in an inviting cross that finds Karim Benzema (Real Madrid). He doesn't take advantage as his effort goes harmlessly over the crossbar. The ball is off of the pitch and it's a goal kick for Villarreal."
        },
        {
            "gameTime": "1 - 22:57",
            "label": "",
            "description": "Pepe (Real Madrid) fails to find a teammate across the pitch with a long ball. The referee and the linesman both signal a throw in for Villarreal."
        },
        {
            "gameTime": "1 - 21:08",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle and it's Cristiano Ronaldo (Real Madrid) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 19:10",
            "label": "",
            "description": "James Rodriguez (Real Madrid) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 18:20",
            "label": "",
            "description": "Roberto Soldado (Villarreal) tries to latch onto a defence splitting pass, but one of the defending players intercepts the effort and the danger passes."
        },
        {
            "gameTime": "1 - 17:25",
            "label": "",
            "description": "Danilo (Real Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 15:38",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) reacts well and displays good awareness inside the box to get on the end of the corner kick. He fails to direct the ball into the net as it flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 15:21",
            "label": "corner",
            "description": "The ball is out of play. Real Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 15:11",
            "label": "",
            "description": "Marcelo (Real Madrid) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 14:49",
            "label": "",
            "description": "The Real Madrid players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 13:22",
            "label": "",
            "description": "Cedric Bakambu (Villarreal) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 12:15",
            "label": "",
            "description": "Wonderful pass from Cristiano Ronaldo (Real Madrid) for Gareth Bale, but they can't profit from it as Alphonse Areola comes off his line to collect."
        },
        {
            "gameTime": "1 - 10:28",
            "label": "",
            "description": "Roberto Soldado (Villarreal) gets on the ball and beats an opponent, but his run is stopped by the referee Alberto Undiano Mallenco who sees an offensive foul."
        },
        {
            "gameTime": "1 - 10:12",
            "label": "",
            "description": "Eric Bertrand Bailly (Villarreal) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 09:59",
            "label": "injury",
            "description": "Eric Bertrand Bailly (Villarreal) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 08:00",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Roberto Soldado (Villarreal) was set free in the area by Cedric Bakambu and fired low past Keylor Navas. 1:0."
        },
        {
            "gameTime": "1 - 07:11",
            "label": "",
            "description": "Marcelo clips a neat ball into the box towards Gareth Bale (Real Madrid), whose header from the centre of the box goes narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 06:19",
            "label": "",
            "description": "Flag up against Gareth Bale (Real Madrid). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 05:35",
            "label": "",
            "description": "Gareth Bale (Real Madrid) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "1 - 04:48",
            "label": "",
            "description": "Eric Bertrand Bailly (Villarreal) commits a foul and Alberto Undiano Mallenco immediately signals a free kick."
        },
        {
            "gameTime": "1 - 04:23",
            "label": "",
            "description": "Jonathan dos Santos (Villarreal) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "",
            "description": "Jonathan dos Santos (Villarreal) accepts a sweet pass on the edge of the box and unleashes a shot towards the goal, but he only hits the left post! What an unlucky moment for him."
        },
        {
            "gameTime": "1 - 01:30",
            "label": "",
            "description": "A precise low pass is received by Bruno (Villarreal), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the left post."
        },
        {
            "gameTime": "1 - 00:57",
            "label": "corner",
            "description": "The corner from Jonathan dos Santos (Villarreal) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 00:40",
            "label": "",
            "description": "Jonathan dos Santos (Villarreal) tries to send a pass but it's blocked. Villarreal force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alberto Undiano Mallenco will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. The away side dominated this game. It's obvious that defence had the highest priority for the home side. The away team made a lot of passes and attempted to maintain possession."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "13/12/2015 - 22:30",
    "gameHomeTeam": "Villarreal",
    "gameScore": "1 - 0"
}