{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-01-08 - 22-45 Villarreal 1 - 1 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The away side dominated the game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        },
        {
            "gameTime": "2 - 49:34",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 48:49",
            "label": "yr-card",
            "description": "Jaume Costa (Villarreal) sees a yellow card in the hand of Ignacio Iglesias Villanueva. And as it's a second one this game, a red follows and Jaume Costa (Villarreal) is sent from the pitch."
        },
        {
            "gameTime": "2 - 47:42",
            "label": "",
            "description": "Denis Suarez (Barcelona) swings a cross into the box, but it's far too close to Sergio Asenjo, who smothers the ball."
        },
        {
            "gameTime": "2 - 46:25",
            "label": "",
            "description": "Denis Suarez (Barcelona) gets on the ball and beats an opponent, but his run is stopped by the referee Ignacio Iglesias Villanueva who sees an offensive foul."
        },
        {
            "gameTime": "2 - 45:55",
            "label": "corner",
            "description": "The resulting corner from Manuel Trigueros (Villarreal) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 45:42",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Jonathan dos Santos (Villarreal). The ball is out of play and Villarreal manage to earn a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "soccer-ball",
            "description": "Lionel Messi (Barcelona) struck with a 18 metre free kick into the top left corner and changes the score of the match. Wonderful goal!"
        },
        {
            "gameTime": "2 - 43:39",
            "label": "",
            "description": "Samu Castillejo (Villarreal) fouls an opponent. At least that's what referee Ignacio Iglesias Villanueva signals. Barcelona have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 42:42",
            "label": "funfact",
            "description": "The ball possession at the moment is 30:70."
        },
        {
            "gameTime": "2 - 42:10",
            "label": "",
            "description": "Andres Iniesta (Barcelona) tries to create a chance, but puts too much weight on his pass. The ball is off of the pitch and it's a goal kick for Villarreal."
        },
        {
            "gameTime": "2 - 41:38",
            "label": "substitution",
            "description": "Francisco Escriba is forced to make a change. Mateo Musacchio is not able to carry on due to injury. He is replaced by Gonzalez Soberon Alvaro (Villarreal)."
        },
        {
            "gameTime": "2 - 40:11",
            "label": "injury",
            "description": "The game is interrupted now, Mateo Musacchio (Villarreal) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 39:36",
            "label": "",
            "description": "Neymar (Barcelona) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 39:26",
            "label": "attendance",
            "description": "The attendance for today's match is 22893."
        },
        {
            "gameTime": "2 - 38:45",
            "label": "",
            "description": "Arda Turan (Barcelona) spurns a big chance! He makes himself some space to meet a cross and from near the penalty spot sends a header well wide of the left post!"
        },
        {
            "gameTime": "2 - 37:56",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Rodrigo Hernandez (Villarreal) comes onto the pitch for Roberto Soriano."
        },
        {
            "gameTime": "2 - 37:15",
            "label": "y-card",
            "description": "The referee has issued a yellow card to Gerard Pique (Barcelona)."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "",
            "description": "Neymar (Barcelona) sends a teasing cross into the area, but Sergio Asenjo intercepts the ball."
        },
        {
            "gameTime": "2 - 35:02",
            "label": "",
            "description": "Neymar (Barcelona) makes a rough challenge and Ignacio Iglesias Villanueva blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 34:41",
            "label": "corner",
            "description": "Denis Suarez (Barcelona) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 34:24",
            "label": "",
            "description": "Sergi Roberto (Barcelona) tries to send a pass but it's blocked. The ball is out of play. Barcelona will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 33:45",
            "label": "",
            "description": "A pass into the penalty area from Neymar (Barcelona) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "y-card",
            "description": "Nicola Sansone (Villarreal) is awarded a yellow card for his behaviour."
        },
        {
            "gameTime": "2 - 32:41",
            "label": "y-card",
            "description": "Sergi Roberto (Barcelona) receives a yellow card for infringement."
        },
        {
            "gameTime": "2 - 30:24",
            "label": "substitution",
            "description": "That's the end of the game for Pato, who is replaced by Samu Castillejo (Villarreal)."
        },
        {
            "gameTime": "2 - 29:48",
            "label": "",
            "description": "Close! Neymar (Barcelona) is a whisker away from finishing off the move he started. His close range effort flies just over the bar."
        },
        {
            "gameTime": "2 - 29:23",
            "label": "",
            "description": "Luis Suarez (Barcelona) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Sergio Asenjo guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 28:20",
            "label": "",
            "description": "Roberto Soriano (Villarreal) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 27:57",
            "label": "",
            "description": "Lionel Messi (Barcelona) decided to surprise the goalkeeper with a quick shot from the edge of the box, but his effort came back off the left post!"
        },
        {
            "gameTime": "2 - 27:34",
            "label": "corner",
            "description": "The corner from Denis Suarez (Barcelona) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 26:56",
            "label": "",
            "description": "Lionel Messi (Barcelona) blasts the ball from just outside the box, but his attempt is blocked by the defender. Corner kick. Barcelona will have an opportunity."
        },
        {
            "gameTime": "2 - 25:50",
            "label": "substitution",
            "description": "It will be a substitution. Arda Turan (Barcelona) is ready to enter the pitch as Lucas Digne walks off."
        },
        {
            "gameTime": "2 - 25:10",
            "label": "",
            "description": "What an opportunity! Javier Mascherano (Barcelona) leaps high to meet a beautiful cross into the box from the free kick, and he plants a header from near the penalty spot which goes a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 24:24",
            "label": "y-card",
            "description": "Ignacio Iglesias Villanueva shows a yellow card to Jaume Costa (Villarreal) for a tough tackle."
        },
        {
            "gameTime": "2 - 22:57",
            "label": "",
            "description": "Andres Iniesta (Barcelona) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the right post."
        },
        {
            "gameTime": "2 - 22:28",
            "label": "substitution",
            "description": "Substitution. Denis Suarez (Barcelona) in, Andre Gomes out."
        },
        {
            "gameTime": "2 - 21:11",
            "label": "",
            "description": "Lionel Messi (Barcelona) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "",
            "description": "Lionel Messi (Barcelona) collects an inch perfect pass and strikes the ball from far out, but his shot is blocked."
        },
        {
            "gameTime": "2 - 12:45",
            "label": "",
            "description": "Neymar (Barcelona) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "",
            "description": "Ignacio Iglesias Villanueva blows his whistle and it's Neymar (Barcelona) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 07:22",
            "label": "",
            "description": "Neymar (Barcelona) receives a great pass inside the box and misses a golden chance. The goalkeeper pulls off a stunning save."
        },
        {
            "gameTime": "2 - 07:20",
            "label": "",
            "description": "Lionel Messi (Barcelona) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "2 - 06:50",
            "label": "",
            "description": "Manuel Trigueros (Villarreal) brings an opponent down and Ignacio Iglesias Villanueva interrupts the game. Barcelona are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 06:04",
            "label": "",
            "description": "Andres Iniesta (Barcelona) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 03:55",
            "label": "soccer-ball",
            "description": "Goal! Pato plays in Nicola Sansone (Villarreal), who shows great determination to get to the ball before a couple of defenders and from inside the box slots it into the bottom left corner 1:0."
        },
        {
            "gameTime": "2 - 02:47",
            "label": "",
            "description": "Sergi Roberto (Barcelona) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they continue playing this attractive football, the fans will surely be satisfied. The visitors were more active and dominated the home side in the first half, who weren't able to keep up. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 45:07",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 44:40",
            "label": "",
            "description": "Luis Suarez (Barcelona) produces a ferocious strike from the edge of the box. His dangerous low effort towards the middle of the goal is blocked by Sergio Asenjo, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 43:27",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 42:59",
            "label": "",
            "description": "Lionel Messi (Barcelona) jumps inside the box to meet the resulting corner and steers his header into the roof of the net, but the goalkeeper pulls off an astonishing save to deny him. Barcelona have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 42:43",
            "label": "corner",
            "description": "Corner kick. Neymar (Barcelona) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 42:27",
            "label": "",
            "description": "Neymar (Barcelona) sends a pass into the penalty area, but the opponent manages to cut it out. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 38:01",
            "label": "",
            "description": "Luis Suarez (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 36:33",
            "label": "",
            "description": "Nicola Sansone (Villarreal) is penalised for a foul. Ignacio Iglesias Villanueva had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 35:56",
            "label": "",
            "description": "Luis Suarez (Barcelona) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 32:22",
            "label": "",
            "description": "Luis Suarez (Barcelona) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 30:19",
            "label": "",
            "description": "Andres Iniesta (Barcelona) produces a long range cannon of a shot after a nice pass. The ball heads towards the middle of the goal, but is easily stopped by a save from Sergio Asenjo and the score remains the same."
        },
        {
            "gameTime": "1 - 29:03",
            "label": "",
            "description": "It looks like Javier Mascherano (Barcelona) saw red with that tackle. Ignacio Iglesias Villanueva won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 27:59",
            "label": "",
            "description": "Roberto Soriano (Villarreal) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 26:47",
            "label": "",
            "description": "Barcelona are happy showing off their ball keeping skills and that is only interrupted when the defender steps in."
        },
        {
            "gameTime": "1 - 23:39",
            "label": "",
            "description": "Good team movement sets up Neymar (Barcelona) on the edge of the box, but he slices the ball narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 21:52",
            "label": "",
            "description": "Sergio Busquets (Barcelona) jumps into a tackle and Ignacio Iglesias Villanueva blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 20:55",
            "label": "",
            "description": "A neat pass is well received by Nicola Sansone (Villarreal), who is lurking on the edge of the box and strikes the ball towards the middle of the target. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "1 - 20:19",
            "label": "",
            "description": "Luis Suarez (Barcelona) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 18:57",
            "label": "",
            "description": "Nicola Sansone (Villarreal) jinks his way past multiple challenges and fires a low shot from the edge of the box to the middle of the goal, but Marc Andre ter Stegen is equal to it."
        },
        {
            "gameTime": "1 - 18:12",
            "label": "",
            "description": "Andre Gomes (Barcelona) gets the ball from a rebound before trying his luck with a good long range shot which threatens the goalkeeper! The ball sails just over the crossbar!"
        },
        {
            "gameTime": "1 - 14:26",
            "label": "",
            "description": "Mario Gaspar (Villarreal) trips an opposition player and Ignacio Iglesias Villanueva signals a foul."
        },
        {
            "gameTime": "1 - 13:41",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Barcelona."
        },
        {
            "gameTime": "1 - 12:35",
            "label": "",
            "description": "Jonathan dos Santos (Villarreal) misses a good chance to score. An inch perfect cross into the box finds Jonathan dos Santos (Villarreal) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 10:37",
            "label": "",
            "description": "Flag goes up against Nicola Sansone (Villarreal) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 08:59",
            "label": "",
            "description": "Jonathan dos Santos (Villarreal) squandered a big chance from inside the box, firing his volley narrowly over the bar. What a waste."
        },
        {
            "gameTime": "1 - 07:42",
            "label": "",
            "description": "Neymar (Barcelona) makes a good run inside the box to meet a precise cross. He latches on to it and shoots, but the goalkeeper pulls off an excellent save."
        },
        {
            "gameTime": "1 - 07:35",
            "label": "",
            "description": "Quick reactions by Lionel Messi (Barcelona) and Neymar, tricking their opponents with a cheeky chip pass. A beautiful football moment and great skill, which caused the noise in the stadium to go up a notch."
        },
        {
            "gameTime": "1 - 07:11",
            "label": "",
            "description": "Lionel Messi (Barcelona) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "1 - 06:39",
            "label": "",
            "description": "Andres Iniesta (Barcelona) sends a chip pass into the box, but Sergio Asenjo is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 05:12",
            "label": "",
            "description": "The foul by Luis Suarez (Barcelona) was seen by Ignacio Iglesias Villanueva who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "Andre Gomes (Barcelona) sends a cross into the box, but Sergio Asenjo comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 02:57",
            "label": "",
            "description": "Andres Iniesta (Barcelona) dribbled past his opponents before finding himself in a great position to strike. His attempt from just outside of the box went towards the roof of the net, but it wasn't dangerous and Sergio Asenjo gathered easily."
        },
        {
            "gameTime": "1 - 02:03",
            "label": "",
            "description": "Jonathan dos Santos (Villarreal) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 02:00",
            "label": "corner",
            "description": "Manuel Trigueros (Villarreal) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 01:17",
            "label": "",
            "description": "Pato (Villarreal) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The ball goes out of play and Villarreal have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Villarreal will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ignacio Iglesias Villanueva will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Barcelona players take pride in their goals for and against 41:16."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Villarreal have not lost for 3 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The away side dominated the game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "08/01/2017 - 22:45",
    "gameHomeTeam": "Villarreal",
    "gameScore": "1 - 1"
}