{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-04 - 22-45 Barcelona 3 - 0 BATE/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Barcelona were dominant and more threatening of the two sides. It was a fairly one sided match. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        },
        {
            "gameTime": "2 - 48:12",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 48:04",
            "label": "",
            "description": "Neymar (Barcelona) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 45:35",
            "label": "",
            "description": "Adriano (Barcelona) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 41:32",
            "label": "",
            "description": "Sergi Roberto (Barcelona) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the left post. The ball goes out of play and BATE will have a goal kick."
        },
        {
            "gameTime": "2 - 40:27",
            "label": "",
            "description": "Istvan Vad blows his whistle as Luis Suarez (Barcelona) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Neymar (Barcelona)."
        },
        {
            "gameTime": "2 - 37:38",
            "label": "soccer-ball",
            "description": "Goal! Luis Suarez puts the ball across the area and Neymar (Barcelona) has the easiest task in the world to tuck the ball into an empty net. 3:0."
        },
        {
            "gameTime": "2 - 36:59",
            "label": "",
            "description": "Nemanja Nikolic (BATE) wins some space for himself around the penalty spot and manages to produce a promising header. One of the defenders stops his effort before it gets to the goalkeeper, making him redundant."
        },
        {
            "gameTime": "2 - 36:15",
            "label": "",
            "description": "Marc Bartra (Barcelona) gets on the end of a pass on the edge of the area, but he drags his shot just wide of the right post. The ball goes out of play and BATE will have a goal kick."
        },
        {
            "gameTime": "2 - 36:03",
            "label": "corner",
            "description": "Sergi Roberto (Barcelona) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 35:45",
            "label": "",
            "description": "Dani Alves (Barcelona) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. Barcelona have a corner."
        },
        {
            "gameTime": "2 - 35:25",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 35:11",
            "label": "",
            "description": "Munir El Haddadi (Barcelona) sends a sweet pass into the penalty area, but one of the defenders averts the danger. Barcelona have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 34:18",
            "label": "y-card",
            "description": "What was Nemanja Nikolic (BATE) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "2 - 32:33",
            "label": "substitution",
            "description": "Aleksandr Yermakovich has decided to substitute Maksim Volodjko and he is replaced by Aleksey Rios (BATE)."
        },
        {
            "gameTime": "2 - 32:02",
            "label": "",
            "description": "Munir El Haddadi (Barcelona) is forced to stop his forward run after being caught in an offside position by the linesman."
        },
        {
            "gameTime": "2 - 30:10",
            "label": "substitution",
            "description": "Today's match ends for Sergio Busquets who will be replaced by Gerard Gumbau (Barcelona)."
        },
        {
            "gameTime": "2 - 29:34",
            "label": "",
            "description": "Adriano (Barcelona) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 28:27",
            "label": "",
            "description": "Evgeni Yablonski (BATE) pulls the jersey of one of the opposition players and Istvan Vad blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "corner",
            "description": "Igor Stasevich (BATE) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 27:38",
            "label": "",
            "description": "Filip Mladenovic (BATE) looks to break free, but an opposing player clears the ball away. BATE earn a corner."
        },
        {
            "gameTime": "2 - 26:34",
            "label": "",
            "description": "Marc Bartra (Barcelona) creates himself some space around the penalty spot and connects with the free kick. His header is so wild it sails way past the right post and behind for a goal kick. The ball goes out of play and BATE will have a goal kick."
        },
        {
            "gameTime": "2 - 25:38",
            "label": "",
            "description": "Dangerous play by Evgeni Yablonski (BATE). Istvan Vad blows his whistle for a foul. It's a free kick to Barcelona, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 23:02",
            "label": "",
            "description": "Neymar (Barcelona) latches on to a lofted pass and strikes the ball! His attempt flies narrowly wide of the left post. The ball goes out of play and BATE will have a goal kick."
        },
        {
            "gameTime": "2 - 22:46",
            "label": "corner",
            "description": "Sergey Chernik comes off his line to intercept the corner from Neymar (Barcelona)."
        },
        {
            "gameTime": "2 - 22:23",
            "label": "substitution",
            "description": "Luis Enrique prepares a substitution. Andres Iniesta is replaced by Marc Bartra (Barcelona)."
        },
        {
            "gameTime": "2 - 22:05",
            "label": "substitution",
            "description": "It is time for a substitution. Nemanja Nikolic (BATE) is on for Aleksandr Volodjko."
        },
        {
            "gameTime": "2 - 21:20",
            "label": "",
            "description": "Neymar (Barcelona) controls a cross inside the box and sends a shot towards the middle of the goal, but one of the defenders reacts superbly to block his effort. The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "2 - 19:54",
            "label": "",
            "description": "Sergi Roberto (Barcelona) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 17:15",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 17:04",
            "label": "",
            "description": "Neymar (Barcelona) slaloms his way past challenges, but an opposing player does well to get the ball away. Good work from Barcelona as they win a corner."
        },
        {
            "gameTime": "2 - 16:37",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Luis Suarez (Barcelona)."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "",
            "description": "A long ball forward to Luis Suarez (Barcelona) is intercepted. Barcelona get a corner."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "substitution",
            "description": "Substitution. Dmitri Mozolevski will be replaced by Aljaksandr Hleb (BATE)."
        },
        {
            "gameTime": "2 - 14:40",
            "label": "soccer-ball",
            "description": "Goal 2:0! Neymar laid the ball off to Luis Suarez (Barcelona), who shot from close range into the bottom left corner, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 14:05",
            "label": "",
            "description": "A lofted cross from Denis Polyakov (BATE) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 12:47",
            "label": "",
            "description": "Munir El Haddadi (Barcelona) fashions a shot from the edge of the box after receiving an accurate pass. Sergey Chernik makes a comfortable save to stop the effort from flying into the middle of the goal."
        },
        {
            "gameTime": "2 - 12:32",
            "label": "",
            "description": "Dani Alves (Barcelona) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 10:49",
            "label": "",
            "description": "Denis Polyakov (BATE) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 09:14",
            "label": "injury",
            "description": "Denis Polyakov (BATE) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "2 - 08:54",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Adriano (Barcelona)."
        },
        {
            "gameTime": "2 - 08:26",
            "label": "",
            "description": "Some neat passing and movement from Barcelona as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "2 - 05:34",
            "label": "y-card",
            "description": "Dani Alves (Barcelona) is booked after bringing down an opponent. Istvan Vad had an easy decision to make."
        },
        {
            "gameTime": "2 - 05:10",
            "label": "",
            "description": "Luis Suarez (Barcelona) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Sergey Chernik."
        },
        {
            "gameTime": "2 - 05:02",
            "label": "corner",
            "description": "Neymar (Barcelona) will take a corner kick."
        },
        {
            "gameTime": "2 - 04:48",
            "label": "",
            "description": "Andres Iniesta (Barcelona) misses a good chance to score. An inch perfect cross into the box finds Andres Iniesta (Barcelona) who rises for a header, but sends the ball well over the bar. Now Barcelona have a corner."
        },
        {
            "gameTime": "2 - 02:34",
            "label": "funfact",
            "description": "The number of shots on goal at present is 7:3."
        },
        {
            "gameTime": "2 - 00:40",
            "label": "",
            "description": "Aleksandr Volodjko (BATE) rises above the defenders and places a towering header towards the left post, but Marc Andre ter Stegen is prepared and dives to thwart him."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Not a lot happening in the first half, it hasn't been the best game so far in terms of quality. It was a fairly one sided opening 45 minutes, with Barcelona much the better side better so far. The home side display their usual fluent passing, while the visitors use their organization to stop the build up and launch counter attacks."
        },
        {
            "gameTime": "1 - 47:17",
            "label": "whistle",
            "description": "Istvan Vad has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 46:56",
            "label": "",
            "description": "What an opportunity! Neymar (Barcelona) latches on to a perfect cross from the wing and produces a bullet header from around the penalty spot which goes narrowly over the crossbar! The ball is off of the pitch and it's a goal kick for BATE."
        },
        {
            "gameTime": "1 - 46:01",
            "label": "",
            "description": "Andres Iniesta (Barcelona) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 45:39",
            "label": "",
            "description": "Dani Alves (Barcelona) collects a pass and has an effort from 20 metres out, but it flies just wide of the left post."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:32",
            "label": "",
            "description": "Dani Alves (Barcelona) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 43:35",
            "label": "y-card",
            "description": "Dmitri Mozolevski (BATE) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "1 - 41:44",
            "label": "",
            "description": "Luis Suarez (Barcelona) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "1 - 41:44",
            "label": "",
            "description": "Luis Suarez (Barcelona) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Nice individual effort by Igor Stasevich (BATE). He gets all the way through to the keeper and hits a low drive to the bottom right corner, but Marc Andre ter Stegen does a good job to anticipate the direction of the ball and keeps it out."
        },
        {
            "gameTime": "1 - 39:20",
            "label": "",
            "description": "Luis Suarez (Barcelona) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "1 - 38:09",
            "label": "",
            "description": "The cross into the penalty area from Adriano (Barcelona) needed to be more accurate in order to create a goal scoring opportunity for his team. The ball is off of the pitch and it's a goal kick for BATE."
        },
        {
            "gameTime": "1 - 36:12",
            "label": "",
            "description": "Sergio Busquets (Barcelona) fouls an opponent. At least that's what referee Istvan Vad signals."
        },
        {
            "gameTime": "1 - 35:19",
            "label": "",
            "description": "Dani Alves (Barcelona) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 34:26",
            "label": "",
            "description": "Adriano (Barcelona) takes a nice first touch to control a cross and fires at goal from near the penalty spot, but his effort only hits the left hand post! The ball goes out of play and BATE will have a goal kick."
        },
        {
            "gameTime": "1 - 33:25",
            "label": "injury",
            "description": "Dani Alves (Barcelona) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "1 - 32:31",
            "label": "",
            "description": "Sergi Roberto (Barcelona) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 29:59",
            "label": "soccer-ball",
            "description": "Neymar (Barcelona) makes no mistake from the penalty spot after waiting for Sergey Chernik to move before slotting the ball low into the middle of the goal!"
        },
        {
            "gameTime": "1 - 29:59",
            "label": "",
            "description": "Neymar (Barcelona) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 29:23",
            "label": "y-card",
            "description": "Filip Mladenovic (BATE) goes into the book and receives a yellow card."
        },
        {
            "gameTime": "1 - 29:22",
            "label": "penalty",
            "description": "Foul! Filip Mladenovic (BATE) is penalised for pulling back his opponent. The referee points to the penalty spot. Barcelona are awarded a penalty kick!"
        },
        {
            "gameTime": "1 - 28:45",
            "label": "",
            "description": "Munir El Haddadi (Barcelona) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 25:39",
            "label": "",
            "description": "Istvan Vad blows his whistle and it's Sergio Busquets (Barcelona) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 25:30",
            "label": "corner",
            "description": "Neymar (Barcelona) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 25:10",
            "label": "",
            "description": "Luis Suarez (Barcelona) tries to send a low pass into the box, but it's blocked and cleared. The ball is out of play and Barcelona manage to earn a corner."
        },
        {
            "gameTime": "1 - 23:56",
            "label": "",
            "description": "Filip Mladenovic (BATE) is in a clear offside position and the referee blows his whistle after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 23:14",
            "label": "",
            "description": "Luis Suarez (Barcelona) is picked out by one of his teammates with a great cross, but his poor control allows the defence to clear and avert the threat."
        },
        {
            "gameTime": "1 - 22:58",
            "label": "",
            "description": "Neymar (Barcelona) produces a long range cannon of a shot after a nice pass. The ball heads towards the middle of the goal, but is easily stopped by a save from Sergey Chernik and the score remains the same."
        },
        {
            "gameTime": "1 - 20:03",
            "label": "",
            "description": "Neymar (Barcelona) sends a teasing cross into the area, but Sergey Chernik intercepts the ball."
        },
        {
            "gameTime": "1 - 19:18",
            "label": "substitution",
            "description": "Luis Enrique is forced to make a change. Ivan Rakitic is not able to carry on due to injury. He is replaced by Munir El Haddadi (Barcelona)."
        },
        {
            "gameTime": "1 - 18:09",
            "label": "injury",
            "description": "Ivan Rakitic (Barcelona) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "1 - 16:07",
            "label": "",
            "description": "Igor Stasevich (BATE) releases a promising shot from the free kick from around 19 metres out. The ball goes towards the left side of the goal, but the goalkeeper makes a save and denies him."
        },
        {
            "gameTime": "1 - 15:45",
            "label": "",
            "description": "Thomas Vermaelen (Barcelona) makes a slide tackle, but referee Istvan Vad blows for a foul. BATE are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 15:15",
            "label": "",
            "description": "Neymar (Barcelona) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 13:56",
            "label": "",
            "description": "Luis Suarez (Barcelona) is deemed to be in an offside position by the linesman and it looks like it is the right decision despite being a very close call."
        },
        {
            "gameTime": "1 - 12:20",
            "label": "",
            "description": "Dani Alves (Barcelona) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 11:33",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) fails to pick a body out in the box with an over hit chip pass. The ball goes out of play and BATE will have a goal kick."
        },
        {
            "gameTime": "1 - 10:57",
            "label": "",
            "description": "Barcelona hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 07:21",
            "label": "",
            "description": "Neymar (Barcelona) lashes the free kick from the edge of the box but it flies high over the bar, somewhere into the stands. The ball is off of the pitch and it's a goal kick for BATE."
        },
        {
            "gameTime": "1 - 06:59",
            "label": "",
            "description": "Nemanja Milunovic (BATE) commits an ugly challenge. The referee sees it and immediately blows his whistle. Barcelona have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 04:37",
            "label": "",
            "description": "Igor Stasevich (BATE) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 03:58",
            "label": "",
            "description": "Neymar sends a lofted pass into the box, Luis Suarez (Barcelona) shows good awareness to connect with it but drags his shot well wide of the right post."
        },
        {
            "gameTime": "1 - 03:07",
            "label": "",
            "description": "Evgeni Yablonski (BATE) trips an opposition player and Istvan Vad signals a foul."
        },
        {
            "gameTime": "1 - 02:50",
            "label": "",
            "description": "Dani Alves (Barcelona) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 00:34",
            "label": "",
            "description": "Aleksandr Volodjko (BATE) is clearly in an offside position after the ball is played through to him and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Barcelona will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Istvan Vad is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Barcelona were dominant and more threatening of the two sides. It was a fairly one sided match. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        }
    ],
    "gameAwayTeam": "BATE",
    "gameDate": "04/11/2015 - 22:45",
    "gameHomeTeam": "Barcelona",
    "gameScore": "3 - 0"
}