{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-12-26 - 18-00 Chelsea 2 - 2 Watford/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. It was a very tight match, with not much between the two teams. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 48:50",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 48:41",
            "label": "",
            "description": "John Obi Mikel (Chelsea) receives a quality pass and releases a rocket of a shot from distance, but his amazing effort goes just wide of the right post. The goalkeeper probably wouldn't have saved this one."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Adlene Guedioura (Watford) will replace Troy Deeney."
        },
        {
            "gameTime": "2 - 46:36",
            "label": "",
            "description": "Half chance! Oscar (Chelsea) plays a pass into the box, but Heurelho Gomes reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:02",
            "label": "",
            "description": "A cross into the box from Branislav Ivanovic (Chelsea) is cleared."
        },
        {
            "gameTime": "2 - 42:54",
            "label": "y-card",
            "description": "The foul by Diego Costa (Chelsea) is worthy of a card and a yellow is duly shown by Andre Marriner."
        },
        {
            "gameTime": "2 - 42:53",
            "label": "",
            "description": "Troy Deeney (Watford) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "2 - 42:52",
            "label": "",
            "description": "Odion Ighalo (Watford) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "attendance",
            "description": "The attendance for today's match is 41630."
        },
        {
            "gameTime": "2 - 39:46",
            "label": "",
            "description": "Eden Hazard (Chelsea) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "2 - 37:37",
            "label": "y-card",
            "description": "Valon Behrami (Watford) is booked."
        },
        {
            "gameTime": "2 - 35:32",
            "label": "y-card",
            "description": "Jose Holebas (Watford) earns the yellow card."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "penalty-missed",
            "description": "Oscar (Chelsea) misses the penalty! His poor effort goes well over the crossbar."
        },
        {
            "gameTime": "2 - 34:58",
            "label": "",
            "description": "Oscar (Chelsea) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 34:21",
            "label": "penalty",
            "description": "Andre Marriner blows his whistle for a foul after Valon Behrami (Watford) hacks down one of his opponents. Chelsea are given a penalty!"
        },
        {
            "gameTime": "2 - 32:45",
            "label": "",
            "description": "Eden Hazard (Chelsea) finds his teammate inside the box with a sweet pass. However, Diego Costa wasn't able to finish and lost the ball."
        },
        {
            "gameTime": "2 - 31:51",
            "label": "",
            "description": "Willian (Chelsea) takes a mid range free kick, but his miskick only goes into the stands. Poor shot!"
        },
        {
            "gameTime": "2 - 31:05",
            "label": "",
            "description": "Ben Watson (Watford) commits a foul after making a slide tackle on his opponent. There is a free kick near the sideline to Chelsea."
        },
        {
            "gameTime": "2 - 29:20",
            "label": "substitution",
            "description": "Here comes a substitution. Eden Hazard (Chelsea) is brought on as a substitute for Pedro."
        },
        {
            "gameTime": "2 - 28:00",
            "label": "substitution",
            "description": "Quique Flores decides to make a substitution. Jose Manuel Jurado will be replaced by Ikechi Anya (Watford)."
        },
        {
            "gameTime": "2 - 27:31",
            "label": "",
            "description": "Willian (Chelsea) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "2 - 27:08",
            "label": "",
            "description": "An attempted cross from Nemanja Matic (Chelsea) is cleared. The ball is out of play. Chelsea will have a throw in."
        },
        {
            "gameTime": "2 - 25:52",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) sends a long ball in, but Heurelho Gomes comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Valon Behrami (Watford) for Almen Abdi."
        },
        {
            "gameTime": "2 - 22:03",
            "label": "",
            "description": "Diego Costa (Chelsea) misses a good chance to score. An inch perfect cross into the box finds Diego Costa (Chelsea) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 19:25",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Diego Costa (Chelsea) was set free in the area by Willian and he made no mistake with a lovely finish into the bottom left corner. 2:2."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "",
            "description": "Willian (Chelsea) sends a cross into the box, but Heurelho Gomes comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 17:10",
            "label": "",
            "description": "Pedro (Chelsea) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 16:40",
            "label": "",
            "description": "Oscar (Chelsea) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The referee and the linesman both signal a throw in for Chelsea."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "",
            "description": "Pedro (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 10:50",
            "label": "soccer-ball-own",
            "description": "OWN GOAL! Gary Cahill (Chelsea) scores an unlucky own goal after he deflected a shot which went into his own net! 1:2."
        },
        {
            "gameTime": "2 - 10:07",
            "label": "",
            "description": "John Obi Mikel (Chelsea) pulls the jersey of one of the opposition players and Andre Marriner blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 08:50",
            "label": "",
            "description": "Some patient build up play from Watford as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 05:37",
            "label": "",
            "description": "Oscar (Chelsea) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 04:39",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 04:20",
            "label": "corner",
            "description": "Willian (Chelsea) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence. Chelsea have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 04:08",
            "label": "",
            "description": "Willian (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away. The referee signals a corner kick to Chelsea."
        },
        {
            "gameTime": "2 - 02:58",
            "label": "y-card",
            "description": "Craig Cathcart (Watford) receives a yellow card for infringement."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "corner",
            "description": "Ben Watson (Watford) swings in the corner, but the goalkeeper does a brilliant job to intercept the effort."
        },
        {
            "gameTime": "2 - 02:28",
            "label": "",
            "description": "Jose Holebas (Watford) flights in the cross, but the defender is alert and clears to safety. Watford will take a corner kick."
        },
        {
            "gameTime": "2 - 01:48",
            "label": "",
            "description": "Willian (Chelsea) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Guus Hiddink gives a chance to John Obi Mikel (Chelsea) and Cesc Fabregas is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The game produced by the players until now hasn't been particularly attractive, but there is still 45 minutes left so let's hope they will come out with renewed vigour and provide better entertainment this half. It has been a tight contest so far. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "Andre Marriner has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:25",
            "label": "",
            "description": "Willian (Chelsea) misses a great opportunity to convert the free kick from the edge of the penalty box after firing the ball high over the crossbar of the goal."
        },
        {
            "gameTime": "1 - 43:57",
            "label": "y-card",
            "description": "Miguel Angel Britos Cabrera (Watford) is yellow carded for breaking the rules of the game."
        },
        {
            "gameTime": "1 - 41:41",
            "label": "soccer-ball",
            "description": "Troy Deeney (Watford) makes no mistake from the penalty spot after waiting for Thibaut Courtois to move before slotting the ball low into the middle of the goal!"
        },
        {
            "gameTime": "1 - 41:40",
            "label": "",
            "description": "Troy Deeney (Watford) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 41:35",
            "label": "penalty",
            "description": "The referee blows his whistle, a clear handball by Nemanja Matic (Chelsea). Penalty awarded! Watford will take a penalty kick."
        },
        {
            "gameTime": "1 - 41:00",
            "label": "corner",
            "description": "Ben Watson (Watford) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "1 - 40:59",
            "label": "",
            "description": "The free kick from Jose Manuel Jurado (Watford) failed to provide any scoring opportunity, as one of the defenders did a good job and knocked it out. The referee and his assistant both point at the corner flag. Watford will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 39:47",
            "label": "",
            "description": "Gary Cahill (Chelsea) is penalised for holding. Andre Marriner signals a set piece. A free kick is awarded to Watford."
        },
        {
            "gameTime": "1 - 38:45",
            "label": "",
            "description": "CHANCE! Branislav Ivanovic finds Oscar (Chelsea) with a sweet pass, but he can't find the target as his effort from inside the box goes just over the bar!"
        },
        {
            "gameTime": "1 - 38:16",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 37:46",
            "label": "",
            "description": "Willian (Chelsea) races towards goal but the defender gets back well to make a challenge. Chelsea will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 36:00",
            "label": "",
            "description": "The Chelsea players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 31:50",
            "label": "soccer-ball",
            "description": "Goal! The resulting corner is whipped into the box and Diego Costa (Chelsea) buries the ball into the back of the net from a Gary Cahill knock down. 1:0."
        },
        {
            "gameTime": "1 - 31:48",
            "label": "corner",
            "description": "Willian (Chelsea) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 31:47",
            "label": "",
            "description": "Diego Costa (Chelsea) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Chelsea force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 31:19",
            "label": "",
            "description": "Jose Manuel Jurado (Watford) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 30:17",
            "label": "",
            "description": "Pedro (Chelsea) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 28:04",
            "label": "",
            "description": "Almen Abdi (Watford) attempts to surprise the keeper with a shot from distance, but it lacks accuracy and goes high over the crossbar."
        },
        {
            "gameTime": "1 - 26:45",
            "label": "",
            "description": "Odion Ighalo (Watford) latches on to an accurate cross inside the box and quickly shoots, but unluckily for him one of his own teammates gets in the way of the ball and blocks the shot."
        },
        {
            "gameTime": "1 - 24:42",
            "label": "",
            "description": "Allan Nyom (Watford) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 23:44",
            "label": "",
            "description": "Odion Ighalo (Watford) finds enough space to climb high and plants a header well wide of the left post. What a poor effort."
        },
        {
            "gameTime": "1 - 22:51",
            "label": "corner",
            "description": "Ben Watson (Watford) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 22:34",
            "label": "",
            "description": "Jose Holebas (Watford) crosses the ball into the box, but one of the defending players averts the threat. Corner kick. Watford will have an opportunity."
        },
        {
            "gameTime": "1 - 21:07",
            "label": "",
            "description": "Jose Holebas (Watford) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "1 - 20:29",
            "label": "",
            "description": "Troy Deeney (Watford) tries to find Odion Ighalo, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 19:22",
            "label": "",
            "description": "Diego Costa (Chelsea) dribbles into the box, but Heurelho Gomes is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "1 - 18:38",
            "label": "",
            "description": "What a big chance! Odion Ighalo (Watford) picks up an inch perfect pass inside the box and fires the ball just over the crossbar."
        },
        {
            "gameTime": "1 - 17:52",
            "label": "corner",
            "description": "Ben Watson (Watford) launches a cross from the corner, but Thibaut Courtois is alert to thwart the effort."
        },
        {
            "gameTime": "1 - 17:32",
            "label": "",
            "description": "Jose Holebas (Watford) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The ball goes behind for a corner. Watford will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 16:21",
            "label": "",
            "description": "Almen Abdi (Watford) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 14:20",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) produces a poor pass. He attempts to get the ball into the box but it's hacked away."
        },
        {
            "gameTime": "1 - 13:57",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 13:43",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) sends the ball into the box from the side of the pitch, but his cross is blocked. Good work from Chelsea as they win a corner."
        },
        {
            "gameTime": "1 - 13:00",
            "label": "",
            "description": "Jose Manuel Jurado (Watford) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 10:56",
            "label": "",
            "description": "Oscar (Chelsea) brings an opponent down and Andre Marriner interrupts the game."
        },
        {
            "gameTime": "1 - 10:34",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 10:12",
            "label": "corner",
            "description": "Willian (Chelsea) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear. The ball is out of play. Chelsea will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 09:59",
            "label": "",
            "description": "Willian (Chelsea) takes the resultant free kick from the edge of the box and tries to find one of his teammates with a cross, but the keeper climbs high and gets to it first, collecting the ball with ease. The referee points to the corner flag. It's a corner to Chelsea."
        },
        {
            "gameTime": "1 - 08:39",
            "label": "corner",
            "description": "Willian (Chelsea) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 08:19",
            "label": "corner",
            "description": "Willian (Chelsea) swings in the corner kick, but one of the defenders leaps highest to head the ball away. The referee blows his whistle, Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 08:04",
            "label": "",
            "description": "Willian (Chelsea) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender. Now Chelsea have a corner."
        },
        {
            "gameTime": "1 - 06:22",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 05:25",
            "label": "",
            "description": "Andre Marriner blows his whistle and signals a foul after Almen Abdi (Watford) brought his opponent down."
        },
        {
            "gameTime": "1 - 03:46",
            "label": "",
            "description": "What a wasted chance that is! A precise cross into the box found Diego Costa (Chelsea), whose header floated just over the bar."
        },
        {
            "gameTime": "1 - 03:31",
            "label": "",
            "description": "Etienne Capoue (Watford) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "",
            "description": "Watford will kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Andre Marriner."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. It was a very tight match, with not much between the two teams. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "Watford",
    "gameDate": "26/12/2015 - 18:00",
    "gameHomeTeam": "Chelsea",
    "gameScore": "2 - 2"
}