{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2014-2015/2015-02-21 - 18-00 Chelsea 1 - 1 Burnley/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. The hosts were largely in control of the game today. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 49:29",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 48:31",
            "label": "",
            "description": "CLOSE! Danny Ings (Burnley) shows off his amazing skills with a solo run to the edge of the box before fashioning a shot that goes inches wide of the left post!"
        },
        {
            "gameTime": "2 - 47:52",
            "label": "",
            "description": "Ben Mee (Burnley) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 47:05",
            "label": "injury",
            "description": "Ben Mee (Burnley) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "2 - 46:23",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 43:41",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) volleys the ball from just outside the box, but his effort goes narrowly over the bar."
        },
        {
            "gameTime": "2 - 40:11",
            "label": "corner",
            "description": "David Jones (Burnley) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 40:11",
            "label": "substitution",
            "description": "Jose Mourinho decides to make a substitution. Filipe Luis will be replaced by Didier Drogba (Chelsea)."
        },
        {
            "gameTime": "2 - 39:47",
            "label": "",
            "description": "George Boyd (Burnley) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. The linesman makes the right call and Burnley will have a corner."
        },
        {
            "gameTime": "2 - 39:17",
            "label": "",
            "description": "Ben Mee (Burnley) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 35:55",
            "label": "soccer-ball",
            "description": "Ben Mee (Burnley) jumped highest inside the box to meet a perfectly executed corner kick by Kieran Trippier. His header was precise and ended up inside the left post, leaving the goalkeeper flapping in the wind. The score is 1:1."
        },
        {
            "gameTime": "2 - 35:11",
            "label": "corner",
            "description": "Kieran Trippier (Burnley) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 34:46",
            "label": "",
            "description": "Ashley Barnes (Burnley) is unlucky with a goal bound effort from the edge of the box. A brilliant save by Thibaut Courtois stops the ball from hitting the bottom left corner. It will be a corner kick for Burnley."
        },
        {
            "gameTime": "2 - 34:22",
            "label": "corner",
            "description": "Kieran Trippier (Burnley) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 34:13",
            "label": "",
            "description": "Ben Mee (Burnley) delivers a promising cross into the box, but it's cleared. Burnley have a corner."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "substitution",
            "description": "Sean Dyche has decided to introduce fresh legs, with Sam Vokes (Burnley) replacing Michael Kightly."
        },
        {
            "gameTime": "2 - 33:02",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Ramires (Chelsea), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "2 - 30:45",
            "label": "",
            "description": "Ashley Barnes (Burnley) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the left post."
        },
        {
            "gameTime": "2 - 29:45",
            "label": "funfact",
            "description": "The total number of attempts is 14:10."
        },
        {
            "gameTime": "2 - 26:03",
            "label": "substitution",
            "description": "Substitution. Ramires (Chelsea) on for Oscar."
        },
        {
            "gameTime": "2 - 25:18",
            "label": "y-card",
            "description": "Branislav Ivanovic (Chelsea) was probably a bit loose with his words to Martin Atkinson, who decides to show him a yellow."
        },
        {
            "gameTime": "2 - 24:33",
            "label": "r-card",
            "description": "Nemanja Matic (Chelsea) receives a red card after his awful challenge. He completely lost his temper and referee Martin Atkinson sends him off the pitch."
        },
        {
            "gameTime": "2 - 23:04",
            "label": "",
            "description": "Eden Hazard (Chelsea) plays a through ball but overhits it."
        },
        {
            "gameTime": "2 - 22:04",
            "label": "",
            "description": "Nemanja Matic (Chelsea) picks up a pass, lines up a shot and strikes from 30 metres out, but Tom Heaton thwarts the effort which is headed to the bottom left corner."
        },
        {
            "gameTime": "2 - 21:03",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 20:41",
            "label": "",
            "description": "Eden Hazard (Chelsea) swings in a cross, but the ball is cleared to safety by one of the defending players. The referee signals a corner kick to Chelsea."
        },
        {
            "gameTime": "2 - 17:33",
            "label": "substitution",
            "description": "The substitution has been made. Willian (Chelsea) has replaced Juan Cuadrado."
        },
        {
            "gameTime": "2 - 16:50",
            "label": "y-card",
            "description": "The foul by Michael Kightly (Burnley) is worthy of a card and a yellow is duly shown by Martin Atkinson."
        },
        {
            "gameTime": "2 - 16:44",
            "label": "",
            "description": "The Chelsea players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition."
        },
        {
            "gameTime": "2 - 15:46",
            "label": "attendance",
            "description": "The attendance is 41629."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "",
            "description": "The free kick is taken by Kieran Trippier (Burnley), but ball is cleared."
        },
        {
            "gameTime": "2 - 13:23",
            "label": "",
            "description": "Martin Atkinson blows his whistle and signals a foul after John Terry (Chelsea) brought his opponent down. Burnley are awarded the free kick."
        },
        {
            "gameTime": "2 - 12:32",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) plays in a hopeful cross, but it doesn't find its way to any of the attacking players. The ball is off of the pitch and it's a goal kick for Burnley."
        },
        {
            "gameTime": "2 - 10:28",
            "label": "",
            "description": "Kieran Trippier (Burnley) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 10:09",
            "label": "",
            "description": "John Terry (Chelsea) didn't hesitate to knock his opponent down with a harsh sliding tackle. Martin Atkinson could probably show him a yellow, but he only goes with blowing the whistle for a foul. A free kick to Burnley. They can move closer towards the goal."
        },
        {
            "gameTime": "2 - 09:20",
            "label": "",
            "description": "Diego Costa (Chelsea) receives a precise low pass inside the box, controls it and sends it straight at Tom Heaton, who makes a comfortable save."
        },
        {
            "gameTime": "2 - 07:57",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 07:46",
            "label": "",
            "description": "Eden Hazard (Chelsea) sends a cross into the box, but the opposition's defence clears the ball to safety. Chelsea force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 05:53",
            "label": "corner",
            "description": "The resulting corner, taken by Kieran Trippier (Burnley), comes to nothing."
        },
        {
            "gameTime": "2 - 05:13",
            "label": "",
            "description": "Danny Ings (Burnley) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 04:57",
            "label": "",
            "description": "Ashley Barnes (Burnley) finds his way to a rebound on the edge of the box, shoots to the top right corner, but the keeper dives and denies him. Burnley have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 04:06",
            "label": "injury",
            "description": "Danny Ings (Burnley) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "2 - 01:41",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "2 - 00:23",
            "label": "",
            "description": "Diego Costa (Chelsea) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The game produced by the players until now hasn't been particularly attractive, but there is still 45 minutes left so let's hope they will come out with renewed vigour and provide better entertainment this half. The host team has dominated the game in almost all aspects so far and their opponents have struggled to keep up. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 47:22",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 46:51",
            "label": "",
            "description": "Juan Cuadrado (Chelsea) strikes from the edge of the box, but hits it really poorly and sends the ball way over the bar."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 42:32",
            "label": "corner",
            "description": "Eden Hazard (Chelsea) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 42:19",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee points to the corner flag. It's a corner to Chelsea."
        },
        {
            "gameTime": "1 - 41:57",
            "label": "",
            "description": "Juan Cuadrado (Chelsea) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "y-card",
            "description": "George Boyd (Burnley) sees a yellow card from Martin Atkinson after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 39:05",
            "label": "",
            "description": "Kurt Zouma (Chelsea) is able to continue to play."
        },
        {
            "gameTime": "1 - 37:01",
            "label": "injury",
            "description": "Kurt Zouma (Chelsea) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "1 - 35:55",
            "label": "",
            "description": "Diego Costa (Chelsea) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "corner",
            "description": "Thibaut Courtois leaps to collect the ball from the corner which was sent over by Kieran Trippier (Burnley)."
        },
        {
            "gameTime": "1 - 33:17",
            "label": "",
            "description": "Michael Kightly (Burnley) sends a lofted cross into the box which is headed clear. Burnley force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 31:32",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) takes a first time shot from the edge of the box, but his effort is well blocked by the defender."
        },
        {
            "gameTime": "1 - 29:42",
            "label": "",
            "description": "Oscar (Chelsea) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 28:58",
            "label": "",
            "description": "Diego Costa (Chelsea) gets on the ball and beats an opponent, but his run is stopped by the referee Martin Atkinson who sees an offensive foul."
        },
        {
            "gameTime": "1 - 25:23",
            "label": "",
            "description": "A cross is clipped into the penalty area by George Boyd (Burnley) but poses no threat."
        },
        {
            "gameTime": "1 - 24:06",
            "label": "",
            "description": "A cross by Branislav Ivanovic (Chelsea) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "1 - 22:10",
            "label": "",
            "description": "Ashley Barnes (Burnley) shoots from the edge of the penalty area. The ball travels towards the bottom left corner, but Thibaut Courtois easily deals with the threat."
        },
        {
            "gameTime": "1 - 19:54",
            "label": "",
            "description": "A crossfield pass from John Terry (Chelsea) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 17:51",
            "label": "",
            "description": "Jason Shackell (Burnley) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but he sent it well over the bar."
        },
        {
            "gameTime": "1 - 17:22",
            "label": "corner",
            "description": "Corner kick. Kieran Trippier (Burnley) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 17:07",
            "label": "",
            "description": "George Boyd (Burnley) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The ball goes out of play. Burnley are awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:15",
            "label": "corner",
            "description": "Tom Heaton leaps to intercept the corner kick from Cesc Fabregas (Chelsea)."
        },
        {
            "gameTime": "1 - 15:57",
            "label": "",
            "description": "The ball is cleared after Diego Costa (Chelsea) attempted to dribble past an opposing player. Chelsea earn a corner."
        },
        {
            "gameTime": "1 - 14:52",
            "label": "corner",
            "description": "The resulting corner from Eden Hazard (Chelsea) is cleared by the defence."
        },
        {
            "gameTime": "1 - 14:38",
            "label": "",
            "description": "Tom Heaton hears the fans clapping his superb goalkeeping. Oscar (Chelsea) shoots from the edge of the box towards the bottom left corner, but the goalkeeper makes a magnificent save. The ball is out of play. A goal scoring opportunity from a corner for Chelsea."
        },
        {
            "gameTime": "1 - 13:36",
            "label": "soccer-ball",
            "description": "Goal! Eden Hazard provides Branislav Ivanovic (Chelsea) with a nice pass inside the box. It allows him to finish with a precise effort into the bottom right corner. 1:0."
        },
        {
            "gameTime": "1 - 11:34",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 11:19",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) works the corner short."
        },
        {
            "gameTime": "1 - 11:01",
            "label": "",
            "description": "Diego Costa (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball goes behind for a corner. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 08:49",
            "label": "",
            "description": "Diego Costa (Chelsea) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 06:53",
            "label": "",
            "description": "Ashley Barnes (Burnley) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 06:37",
            "label": "",
            "description": "Ashley Barnes (Burnley) attempts to score with a first time shot from the edge of the box. His effort towards the middle of the goal is saved by Thibaut Courtois."
        },
        {
            "gameTime": "1 - 05:21",
            "label": "",
            "description": "The linesman signals that George Boyd (Burnley) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 04:56",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Cesc Fabregas (Chelsea). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 04:34",
            "label": "",
            "description": "Juan Cuadrado (Chelsea) latched on to a cross into the box and headed the ball under the crossbar. A decent header but it lacked power, allowing the goalkeeper to make a comfortable save. Chelsea will take a corner kick."
        },
        {
            "gameTime": "1 - 03:02",
            "label": "corner",
            "description": "The corner from Kieran Trippier (Burnley) is intercepted by Thibaut Courtois."
        },
        {
            "gameTime": "1 - 02:40",
            "label": "",
            "description": "George Boyd (Burnley) flights in the cross, but the defender is alert and clears to safety. Good work from Burnley as they win a corner."
        },
        {
            "gameTime": "1 - 01:41",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 01:08",
            "label": "",
            "description": "Neat passing move from Chelsea in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Burnley will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Martin Atkinson was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. The hosts were largely in control of the game today. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Burnley",
    "gameDate": "21/02/2015 - 18:00",
    "gameHomeTeam": "Chelsea",
    "gameScore": "1 - 1"
}