{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-16 - 21-45 Olympiakos Piraeus 0 - 3 Bayern Munich/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The Bayern Munich fans must be pleased with the performance of their team. They were absolutely the better of the two sides. It's obvious that defence had the highest priority for the home side. The away team made a lot of passes and attempted to maintain possession."
        },
        {
            "gameTime": "2 - 49:18",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) volleys the ball from just outside the box, but his effort goes narrowly over the bar."
        },
        {
            "gameTime": "2 - 48:31",
            "label": "",
            "description": "Carlos Velasco has a clear sight and sees a foul from Douglas Costa (Bayern Munich)."
        },
        {
            "gameTime": "2 - 46:02",
            "label": "soccer-ball",
            "description": "Thomas Muller (Bayern Munich) makes no mistake from the penalty spot after waiting for Roberto Jimenez to move before slotting the ball low into the middle of the goal!"
        },
        {
            "gameTime": "2 - 45:08",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 45:05",
            "label": "penalty",
            "description": "Arthur Masuaku (Olympiakos Piraeus) robs an opponent of the ball and explodes in anger when Carlos Velasco blows for a foul. The referee points to the penalty spot. It's a penalty for Bayern Munich!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:07",
            "label": "",
            "description": "Arthur Masuaku (Olympiakos Piraeus) sends a cross into the box, but Manuel Neuer comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 43:38",
            "label": "soccer-ball",
            "description": "Goal 0:2! Kingsley Coman tees up Mario Gotze (Bayern Munich) inside the box and he rolls the ball into the bottom left corner and past Roberto Jimenez."
        },
        {
            "gameTime": "2 - 42:05",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Leandro Salino (Olympiakos Piraeus)."
        },
        {
            "gameTime": "2 - 41:49",
            "label": "",
            "description": "Hernani (Olympiakos Piraeus) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 40:03",
            "label": "y-card",
            "description": "Carlos Velasco shows a yellow card to Joshua Kimmich (Bayern Munich) for his blatant foul."
        },
        {
            "gameTime": "2 - 39:19",
            "label": "attendance",
            "description": "The attendance for today's match is 31688."
        },
        {
            "gameTime": "2 - 37:41",
            "label": "",
            "description": "Leandro Salino (Olympiakos Piraeus) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 35:30",
            "label": "substitution",
            "description": "Substitution. Seba (Olympiakos Piraeus) in, Felipe Pardo out."
        },
        {
            "gameTime": "2 - 35:20",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 9:22."
        },
        {
            "gameTime": "2 - 34:49",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) commits a foul and Carlos Velasco immediately signals a free kick."
        },
        {
            "gameTime": "2 - 33:32",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 33:26",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Mario Gotze (Bayern Munich) replaces Arturo Vidal."
        },
        {
            "gameTime": "2 - 32:48",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players. Bayern Munich get a corner."
        },
        {
            "gameTime": "2 - 30:02",
            "label": "substitution",
            "description": "Pep Guardiola is forced to make a change. Xabi Alonso is not able to carry on due to injury. He is replaced by Joshua Kimmich (Bayern Munich)."
        },
        {
            "gameTime": "2 - 28:13",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) makes a reckless foul in order to win the ball from his opponent. Carlos Velasco has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 26:21",
            "label": "injury",
            "description": "Xabi Alonso (Bayern Munich) is asking for medical treatment after picking up an injury."
        },
        {
            "gameTime": "2 - 26:11",
            "label": "",
            "description": "Pajtim Kasami (Olympiakos Piraeus) was trying to get to the ball but clattered into the legs of the opponent as well. Carlos Velasco blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 25:44",
            "label": "",
            "description": "The ball is cleared after Douglas Costa (Bayern Munich) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 23:21",
            "label": "",
            "description": "Flag goes up against Philipp Lahm (Bayern Munich) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 22:47",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) gets to the rebound inside the box and shoots to the top right corner, but his sidefooter is blocked by an alert Roberto Jimenez. What a save!"
        },
        {
            "gameTime": "2 - 22:11",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 21:00",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) got on the ball on the edge of the box and blazed a first time shot well over the bar."
        },
        {
            "gameTime": "2 - 20:23",
            "label": "substitution",
            "description": "It is time for a substitution. Konstantinos Fortounis (Olympiakos Piraeus) is on for Esteban Cambiasso."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Xabi Alonso (Bayern Munich) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 17:49",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) takes a first time shot from the edge of the box, but his own player gets in the way and blocks it. The game is interrupted as Thomas Muller (Bayern Munich) is flagged offside."
        },
        {
            "gameTime": "2 - 17:19",
            "label": "",
            "description": "Bayern Munich seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "2 - 16:23",
            "label": "",
            "description": "Referee Carlos Velasco sees the trip by Omar Elabdellaoui (Olympiakos Piraeus) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "2 - 15:25",
            "label": "substitution",
            "description": "Marco da Silva has decided to substitute Alejandro Dominguez and he is replaced by Hernani (Olympiakos Piraeus)."
        },
        {
            "gameTime": "2 - 14:54",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the left post."
        },
        {
            "gameTime": "2 - 13:32",
            "label": "substitution",
            "description": "Substitution. Robert Lewandowski makes way for Kingsley Coman (Bayern Munich)."
        },
        {
            "gameTime": "2 - 12:41",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) plays a through ball inside the box, but it's too strong and Roberto Jimenez comes off his line to intercept."
        },
        {
            "gameTime": "2 - 11:29",
            "label": "",
            "description": "Alejandro Dominguez (Olympiakos Piraeus) sends a teasing cross into the area, but Manuel Neuer intercepts the ball."
        },
        {
            "gameTime": "2 - 11:03",
            "label": "corner",
            "description": "Alejandro Dominguez (Olympiakos Piraeus) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 10:31",
            "label": "",
            "description": "Brown Ideye (Olympiakos Piraeus) receives a low pass just outside the box and unleashes a fine strike towards the roof of the net. Manuel Neuer pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed. The ball is out of play. A goal scoring opportunity from a corner for Olympiakos Piraeus."
        },
        {
            "gameTime": "2 - 08:12",
            "label": "",
            "description": "Half chance! Leandro Salino (Olympiakos Piraeus) plays a pass into the box, but Manuel Neuer reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 06:33",
            "label": "soccer-ball",
            "description": "Thomas Muller (Bayern Munich) scores a stunning goal! With perfect technique he sends a shot from 30 metres exactly into the top left corner. Superb strike!"
        },
        {
            "gameTime": "2 - 04:37",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) attempts a volley from the edge of the box that goes a couple of yards wide of the left post."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "",
            "description": "Felipe Pardo (Olympiakos Piraeus) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "2 - 02:17",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "2 - 01:13",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) collects a pass and has an effort from 30 metres out, but it flies just wide of the left post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Carlos Velasco starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. The away side is controlling this game. The home team's main priority is a flawless defence, while the away side's style is slow build up play."
        },
        {
            "gameTime": "1 - 45:41",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "y-card",
            "description": "Thomas Muller (Bayern Munich) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 44:54",
            "label": "",
            "description": "Carlos Velasco interrupts the game for a tactical foul by Thomas Muller (Bayern Munich)."
        },
        {
            "gameTime": "1 - 44:14",
            "label": "",
            "description": "That's a well played offside trap. Brown Ideye (Olympiakos Piraeus) is flagged for offside, ending the attack."
        },
        {
            "gameTime": "1 - 43:39",
            "label": "corner",
            "description": "The corner by Alejandro Dominguez (Olympiakos Piraeus) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 43:21",
            "label": "",
            "description": "Alejandro Dominguez (Olympiakos Piraeus) tries to pass the ball into the penalty area but it's blocked. Olympiakos Piraeus will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 42:38",
            "label": "",
            "description": "What a chance for Xabi Alonso (Bayern Munich) as he produced a stunning snap shot from the edge of the box! The goalkeeper was a bit lucky as the ball went just wide of the right post."
        },
        {
            "gameTime": "1 - 41:14",
            "label": "",
            "description": "Carlos Velasco blows his whistle and it's Felipe Pardo (Olympiakos Piraeus) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 40:36",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 40:19",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) fails to find any of his teammates inside the box as his pass is blocked. The ball goes behind for a corner. Bayern Munich will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 39:57",
            "label": "",
            "description": "Manuel da Costa (Olympiakos Piraeus) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "1 - 39:45",
            "label": "corner",
            "description": "There's an opportunity for Alejandro Dominguez (Olympiakos Piraeus) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 39:19",
            "label": "",
            "description": "Felipe Pardo (Olympiakos Piraeus) sends a pass into the box, but his attempt is thwarted and cleared. The ball is out of play. Olympiakos Piraeus will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 38:18",
            "label": "",
            "description": "The free kick into the penalty area from Leandro Salino (Olympiakos Piraeus) is cleared."
        },
        {
            "gameTime": "1 - 38:06",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) was too forceful with his tackle and Carlos Velasco interrupted the game to signal a free kick. Olympiakos Piraeus are awarded a free kick."
        },
        {
            "gameTime": "1 - 36:47",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) collects a pass and has an effort from 22 metres out, but it flies just over the crossbar."
        },
        {
            "gameTime": "1 - 36:15",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 35:53",
            "label": "",
            "description": "Carlos Velasco couldn't ignore the rough tackle by Leandro Salino (Olympiakos Piraeus) and blew his whistle."
        },
        {
            "gameTime": "1 - 34:41",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) is well placed to meet a cross and sends a difficult header directed into the roof of the net, but the goalkeeper reacts well to stop his effort."
        },
        {
            "gameTime": "1 - 34:05",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Roberto Jimenez is alert and denies him."
        },
        {
            "gameTime": "1 - 33:27",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) latches on to a precise pass and one on one with the keeper slams the ball towards the middle of the goal. Roberto Jimenez is alert, though, and makes an easy save to deny him."
        },
        {
            "gameTime": "1 - 31:09",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "1 - 29:49",
            "label": "",
            "description": "Alejandro Dominguez (Olympiakos Piraeus) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "1 - 28:20",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) commits a rough foul. Carlos Velasco stops the game and makes a call."
        },
        {
            "gameTime": "1 - 26:54",
            "label": "",
            "description": "The linesman raises his flag for offside before Leandro Salino (Olympiakos Piraeus) heads on."
        },
        {
            "gameTime": "1 - 26:09",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post."
        },
        {
            "gameTime": "1 - 25:27",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) meets a cross from the resulting free kick and aims a low header towards the middle of the goal, but one of the defenders makes a vital goal line clearance."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 24:37",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Omar Elabdellaoui (Olympiakos Piraeus) was quite harsh and Carlos Velasco didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "Omar Elabdellaoui (Olympiakos Piraeus) with a slide tackle, but referee Carlos Velasco calls for a foul. A free kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 22:20",
            "label": "y-card",
            "description": "Esteban Cambiasso (Olympiakos Piraeus) attempts to discuss the decision with Carlos Velasco, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "1 - 21:09",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 20:49",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) is flagged for offside."
        },
        {
            "gameTime": "1 - 20:31",
            "label": "",
            "description": "An accurate cross finds its way to Brown Ideye (Olympiakos Piraeus) who sends in a bullet header towards the inside of the right post from just outside the box, but the goalkeeper makes the save."
        },
        {
            "gameTime": "1 - 18:49",
            "label": "",
            "description": "Roberto Jimenez is alert and has a clear sight of a long through ball from Philipp Lahm (Bayern Munich). Easy save!"
        },
        {
            "gameTime": "1 - 18:25",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 18:06",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. Bayern Munich will take a corner kick."
        },
        {
            "gameTime": "1 - 15:26",
            "label": "",
            "description": "Arthur Masuaku (Olympiakos Piraeus) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 13:12",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "1 - 12:12",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "1 - 11:18",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 10:19",
            "label": "",
            "description": "Manuel Neuer makes a save to deny the long range effort from Alejandro Dominguez (Olympiakos Piraeus) towards the middle of the goal."
        },
        {
            "gameTime": "1 - 09:20",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition. The ball goes out of play and Olympiakos Piraeus will have a goal kick."
        },
        {
            "gameTime": "1 - 08:45",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 08:20",
            "label": "",
            "description": "Esteban Cambiasso (Olympiakos Piraeus) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Carlos Velasco with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 07:23",
            "label": "",
            "description": "Pajtim Kasami (Olympiakos Piraeus) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "1 - 07:03",
            "label": "corner",
            "description": "Alejandro Dominguez (Olympiakos Piraeus) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 06:38",
            "label": "",
            "description": "Brown Ideye (Olympiakos Piraeus) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Olympiakos Piraeus force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 05:34",
            "label": "",
            "description": "David Alaba (Bayern Munich) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 04:29",
            "label": "y-card",
            "description": "Pajtim Kasami (Olympiakos Piraeus) makes a bad challenge and receives a yellow card. The referee had no doubt. A free kick has been awarded to Bayern Munich."
        },
        {
            "gameTime": "1 - 03:17",
            "label": "",
            "description": "Omar Elabdellaoui (Olympiakos Piraeus) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "",
            "description": "The foul by Brown Ideye (Olympiakos Piraeus) was seen by Carlos Velasco who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 01:38",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Olympiakos Piraeus will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Velasco is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The Bayern Munich fans must be pleased with the performance of their team. They were absolutely the better of the two sides. It's obvious that defence had the highest priority for the home side. The away team made a lot of passes and attempted to maintain possession."
        }
    ],
    "gameAwayTeam": "Bayern Munich",
    "gameDate": "16/09/2015 - 21:45",
    "gameHomeTeam": "Olympiakos Piraeus",
    "gameScore": "0 - 3"
}