{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-11-26 - 18-15 Real Madrid 2 - 1 Gijon/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "We have seen a great game today, let's hope the players will be able to maintain these high levels of play in order to keep fans entertained in future games. The hosts were largely in control of the game today. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        },
        {
            "gameTime": "2 - 47:09",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 46:35",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 46:23",
            "label": "",
            "description": "Isco (Real Madrid) weaves his way through opponents and strikes the ball from the edge of the area, but it's blocked by a defender. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:09",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 19:9."
        },
        {
            "gameTime": "2 - 41:19",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) jinks his way past multiple challenges and fires the ball from the edge of the box to the bottom right corner, but Diego Marino shows his agility and makes a save."
        },
        {
            "gameTime": "2 - 40:57",
            "label": "corner",
            "description": "Douglas Pereira (Gijon) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 40:39",
            "label": "",
            "description": "Borja Viguera (Gijon) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball goes out of play. Gijon are awarded a corner kick."
        },
        {
            "gameTime": "2 - 39:19",
            "label": "",
            "description": "Karim Benzema (Real Madrid) tries to find Lucas, but he puts too much power on the pass."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "",
            "description": "Marco Asensio (Real Madrid) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 37:00",
            "label": "",
            "description": "Excellent touch by Nacho Cases (Gijon)! He latches on to an inch perfect pass deep into the box and unleashes a low drive towards the middle of the goal. The goalkeeper reacts superbly and makes a save."
        },
        {
            "gameTime": "2 - 36:00",
            "label": "substitution",
            "description": "Abelardo prepares a substitution. Rachid Ait Atmane is replaced by Nacho Cases (Gijon)."
        },
        {
            "gameTime": "2 - 35:35",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Mateo Kovacic as he is replaced by Isco (Real Madrid)."
        },
        {
            "gameTime": "2 - 32:53",
            "label": "penalty-missed",
            "description": "Duje Cop (Gijon) fails to score from the penalty kick. His shot goes just a few inches over the crossbar."
        },
        {
            "gameTime": "2 - 32:15",
            "label": "",
            "description": "Duje Cop (Gijon) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 32:00",
            "label": "y-card",
            "description": "The whistle is blown for an infringement and Nacho (Real Madrid) receives a yellow card!"
        },
        {
            "gameTime": "2 - 31:40",
            "label": "penalty",
            "description": "Nacho (Real Madrid) brings his opponent down with a tackle and Alejandro Hernandez blows his whistle for a foul. PENALTY to Gijon! Great chance to score."
        },
        {
            "gameTime": "2 - 30:57",
            "label": "substitution",
            "description": "Substitution. Moi Gomez leaves the pitch and is replaced by Victor Rodriguez (Gijon)."
        },
        {
            "gameTime": "2 - 30:51",
            "label": "substitution",
            "description": "Abelardo has decided to substitute Carlos Carmona and he is replaced by Borja Viguera (Gijon)."
        },
        {
            "gameTime": "2 - 27:32",
            "label": "",
            "description": "What an opportunity! Lucas (Real Madrid) wins the ball from the resulting set piece and unleashes a precise shot from inside the goal area which sails narrowly wide of the right post!"
        },
        {
            "gameTime": "2 - 27:21",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes a direct free kick."
        },
        {
            "gameTime": "2 - 26:44",
            "label": "substitution",
            "description": "Here comes a substitution. Sergio Ramos is given a rest as he is replaced by Marcelo (Real Madrid)."
        },
        {
            "gameTime": "2 - 26:28",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to make a change. Marco Asensio (Real Madrid) replaces James Rodriguez."
        },
        {
            "gameTime": "2 - 25:58",
            "label": "",
            "description": "One of the Gijon players tripped an opponent and conceded a foul. Real Madrid win a free kick."
        },
        {
            "gameTime": "2 - 25:23",
            "label": "",
            "description": "Luka Modric (Real Madrid) latches on to an accurate pass on the edge of the box and immediately unleashes a shot which is wide of the mark."
        },
        {
            "gameTime": "2 - 24:49",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Cristiano Ronaldo (Real Madrid)."
        },
        {
            "gameTime": "2 - 22:45",
            "label": "",
            "description": "Lucas (Real Madrid) sends a cross in and finds Cristiano Ronaldo inside the box, but one of the defenders steps in and clears the danger."
        },
        {
            "gameTime": "2 - 20:28",
            "label": "y-card",
            "description": "Carlos Carmona (Gijon) is booked after bringing down an opponent. Alejandro Hernandez had an easy decision to make."
        },
        {
            "gameTime": "2 - 19:18",
            "label": "corner",
            "description": "Lucas (Real Madrid) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 18:58",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) gets on the end of a pass on the edge of the box but his shot is blocked. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 17:08",
            "label": "",
            "description": "Douglas Pereira (Gijon) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "2 - 16:02",
            "label": "",
            "description": "Nice individual effort by Nacho (Real Madrid). He gets all the way through to the keeper and hits a shot to the left side of the goal, but Diego Marino does a good job to anticipate the direction of the ball and keeps it out."
        },
        {
            "gameTime": "2 - 15:44",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Rachid Ait Atmane (Gijon) was quite harsh and Alejandro Hernandez didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 13:58",
            "label": "attendance",
            "description": "The attendance for today's match is 67118."
        },
        {
            "gameTime": "2 - 12:28",
            "label": "",
            "description": "What a save from Diego Marino! Karim Benzema (Real Madrid) jumps high to meet a cross and glances a promising header from close range, but the goalkeeper pulls off a brilliant stop to keep it out."
        },
        {
            "gameTime": "2 - 11:15",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) switches the play to Karim Benzema and their attacking move continues."
        },
        {
            "gameTime": "2 - 10:33",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) meets a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Diego Marino pulls off an easy save."
        },
        {
            "gameTime": "2 - 09:38",
            "label": "",
            "description": "Lillo Castellano (Gijon) brings an opponent down and Alejandro Hernandez interrupts the game."
        },
        {
            "gameTime": "2 - 07:48",
            "label": "",
            "description": "Moi Gomez (Gijon) clips a neat ball into the box in the direction of Carlos Carmona, but he can't get on the end of the pass."
        },
        {
            "gameTime": "2 - 06:43",
            "label": "",
            "description": "Carlos Carmona (Gijon) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 04:31",
            "label": "",
            "description": "Karim Benzema (Real Madrid) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 02:35",
            "label": "injury",
            "description": "Karim Benzema (Real Madrid) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 01:56",
            "label": "",
            "description": "James Rodriguez (Real Madrid) breaks past challenges inside the box, but puts too much pace on his pass to Karim Benzema."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they continue playing this attractive football, the fans will surely be satisfied. The hosts dominated much of the first period. The home team makes a lot of passes and attempts to maintain possession, while the visitors look to counter attack."
        },
        {
            "gameTime": "1 - 46:13",
            "label": "whistle",
            "description": "Alejandro Hernandez has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:56",
            "label": "corner",
            "description": "Keylor Navas leaps to intercept the corner kick from Carlos Carmona (Gijon)."
        },
        {
            "gameTime": "1 - 45:25",
            "label": "",
            "description": "Fernando Amorebieta (Gijon) wastes a good opportunity as his pass into the box is blocked by the defence. Gijon have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "The linesman makes the right call and Gijon will have a corner. Rachid Ait Atmane (Gijon) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 44:08",
            "label": "",
            "description": "Luka Modric (Real Madrid) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "1 - 43:30",
            "label": "",
            "description": "Jorge Mere (Gijon) pulls the jersey of one of the opposition players and Alejandro Hernandez blows his whistle for a foul. Real Madrid have a free kick."
        },
        {
            "gameTime": "1 - 42:11",
            "label": "",
            "description": "Diego Marino makes a brilliant save! Cristiano Ronaldo (Real Madrid) easily weaves through the defence and fires the ball from mid range. His low shot goes towards the middle of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "1 - 40:00",
            "label": "y-card",
            "description": "Fernando Amorebieta (Gijon) sees a yellow card. He should be more careful because one more challenge like that could result in a red card."
        },
        {
            "gameTime": "1 - 38:58",
            "label": "",
            "description": "CHANCE! Cristiano Ronaldo finds Lucas (Real Madrid) with a sweet pass, but he can't find the target as his effort from inside the box goes just wide of the right post!"
        },
        {
            "gameTime": "1 - 37:12",
            "label": "",
            "description": "Real Madrid are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "1 - 35:12",
            "label": "",
            "description": "Pepe (Real Madrid) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "soccer-ball",
            "description": "Goal! Ismael Lopez Blanco sends a precise cross into the box, Carlos Carmona (Gijon) latches on to it and puts the ball into the bottom right corner. He makes it 2:1."
        },
        {
            "gameTime": "1 - 33:56",
            "label": "corner",
            "description": "Carlos Carmona (Gijon) sends in a poor cross from the corner and Keylor Navas has no trouble gathering it."
        },
        {
            "gameTime": "1 - 33:26",
            "label": "",
            "description": "Lillo Castellano (Gijon) races towards goal but the defender gets back well to make a challenge. The ball goes out of play. Gijon are awarded a corner kick."
        },
        {
            "gameTime": "1 - 32:58",
            "label": "injury",
            "description": "Looks like Pepe (Real Madrid) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 31:43",
            "label": "corner",
            "description": "The resulting corner from Luka Modric (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 31:26",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) flights in the cross, but the defender is alert and clears to safety. The ball goes out for a corner. Real Madrid can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 29:39",
            "label": "corner",
            "description": "Douglas Pereira (Gijon) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 28:58",
            "label": "",
            "description": "Keylor Navas hears the fans clapping his superb goalkeeping. Moi Gomez (Gijon) shoots from the edge of the box towards the bottom right corner, but the goalkeeper makes a magnificent save. The ball goes behind for a corner. Gijon will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 28:28",
            "label": "corner",
            "description": "Carlos Carmona (Gijon) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 28:19",
            "label": "",
            "description": "Moi Gomez (Gijon) sends a teasing cross into the area, but Keylor Navas intercepts the ball. Gijon earn a corner."
        },
        {
            "gameTime": "1 - 27:12",
            "label": "",
            "description": "Moi Gomez (Gijon) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 25:27",
            "label": "",
            "description": "Moi Gomez (Gijon) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 24:24",
            "label": "",
            "description": "Luka Modric (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 22:49",
            "label": "",
            "description": "Lucas (Real Madrid) gets on the ball and beats an opponent, but his run is stopped by the referee Alejandro Hernandez who sees an offensive foul."
        },
        {
            "gameTime": "1 - 21:09",
            "label": "",
            "description": "Real Madrid have a goal ruled out for offside!"
        },
        {
            "gameTime": "1 - 20:09",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 19:52",
            "label": "",
            "description": "A cross from James Rodriguez (Real Madrid) fails to reach the box as the defence clears the ball away to safety. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "1 - 18:00",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Nacho finds Cristiano Ronaldo (Real Madrid), who jumps highest and steers a close range header straight into the bottom left corner. His effort was both strong and precise, and Diego Marino had no chance of stopping that. 2:0."
        },
        {
            "gameTime": "1 - 16:55",
            "label": "",
            "description": "A cross from a mid range free kick, taken by Gijon, is overhit and the ball goes out of play."
        },
        {
            "gameTime": "1 - 16:34",
            "label": "",
            "description": "Gijon are awarded a free kick. Let's see what they create from this. Alejandro Hernandez blows his whistle and signals a foul after Danilo (Real Madrid) brought his opponent down."
        },
        {
            "gameTime": "1 - 15:20",
            "label": "",
            "description": "The ball is cleared after Lucas (Real Madrid) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 13:01",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) leaps highest to meet the resulting set piece and sends his header way off target."
        },
        {
            "gameTime": "1 - 12:21",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 12:01",
            "label": "",
            "description": "James Rodriguez (Real Madrid) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked. The referee points to the corner flag and Real Madrid will take a corner."
        },
        {
            "gameTime": "1 - 11:29",
            "label": "corner",
            "description": "Carlos Carmona (Gijon) fails to deliver a decent cross from the corner and the ball goes out of play."
        },
        {
            "gameTime": "1 - 11:12",
            "label": "",
            "description": "This shall not pass! Diego Marino (Gijon) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. Gijon have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 10:49",
            "label": "",
            "description": "Carlos Carmona (Gijon) serves up a nice cross, but Keylor Navas punches the ball away."
        },
        {
            "gameTime": "1 - 09:45",
            "label": "",
            "description": "Pepe (Real Madrid) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 09:28",
            "label": "",
            "description": "Sergio Alvarez (Gijon) trips an opponent with a slide tackle. Alejandro Hernandez stops the game and he could give him a card, but eventually decides on just a warning. Real Madrid have a free kick."
        },
        {
            "gameTime": "1 - 07:25",
            "label": "",
            "description": "Gijon keep the ball well and push forward with purpose, but here comes an interception from the opposition."
        },
        {
            "gameTime": "1 - 06:13",
            "label": "",
            "description": "Nacho (Real Madrid) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 04:22",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) steps up to take the penalty and leaves the keeper helpless with a shot into the bottom right corner."
        },
        {
            "gameTime": "1 - 04:12",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 03:50",
            "label": "penalty",
            "description": "Alejandro Hernandez blows for a foul after Sergio Alvarez (Gijon) was too aggressive in the battle for the ball. The referee points to the penalty spot. PENALTY to Real Madrid!"
        },
        {
            "gameTime": "1 - 02:27",
            "label": "",
            "description": "Carlos Carmona (Gijon) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the left post."
        },
        {
            "gameTime": "1 - 01:48",
            "label": "",
            "description": "Duje Cop (Gijon) latches on to an accurate pass on the edge of the box and immediately unleashes a shot which is wide of the mark."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gijon will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Alejandro Hernandez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gijon have conceded 27 goals this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid have won 5 matches in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Toni Kroos has the most assists (12) for Real Madrid this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have seen a great game today, let's hope the players will be able to maintain these high levels of play in order to keep fans entertained in future games. The hosts were largely in control of the game today. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        }
    ],
    "gameAwayTeam": "Gijon",
    "gameDate": "26/11/2016 - 18:15",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "2 - 1"
}