{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2017-01-14 - 20-30 Leicester 0 - 3 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "The game produced by the players today wasn't one of the most inspiring. They definitely haven't shown us their best. An impressive display from the visitors, they had the better of it. It's obvious that defence had the highest priority for the home side. The away team made a lot of passes and attempted to maintain possession."
        },
        {
            "gameTime": "2 - 47:11",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 45:56",
            "label": "attendance",
            "description": "The attendance is 32066."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:53",
            "label": "",
            "description": "Christian Fuchs (Leicester) receives a pass and fires a shot in from long range, but it's blocked."
        },
        {
            "gameTime": "2 - 43:35",
            "label": "",
            "description": "Andre Marriner blows for a foul after Michy Batshuayi (Chelsea) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 42:23",
            "label": "",
            "description": "Thibaut Courtois makes a brilliant save! Christian Fuchs (Leicester) met a rebound outside the box and attempted to beat the keeper into the top of the net."
        },
        {
            "gameTime": "2 - 42:02",
            "label": "corner",
            "description": "Demarai Gray (Leicester) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 41:33",
            "label": "",
            "description": "Demarai Gray (Leicester) whips a promising cross into the box, but the opposition's defence intercepts the ball. The referee blows his whistle, Leicester are awarded a corner kick."
        },
        {
            "gameTime": "2 - 40:56",
            "label": "",
            "description": "N'Golo Kante (Chelsea) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "2 - 38:59",
            "label": "substitution",
            "description": "The manager makes a subsitution with Ruben Loftus Cheek (Chelsea) coming on for Pedro."
        },
        {
            "gameTime": "2 - 38:56",
            "label": "substitution",
            "description": "Antonio Conte has decided to introduce fresh legs, with Michy Batshuayi (Chelsea) replacing Willian."
        },
        {
            "gameTime": "2 - 35:30",
            "label": "",
            "description": "A pass from Demarai Gray (Leicester) is intercepted by Thibaut Courtois and the move breaks down."
        },
        {
            "gameTime": "2 - 33:37",
            "label": "substitution",
            "description": "Substitution. Cesc Fabregas (Chelsea) on for Eden Hazard."
        },
        {
            "gameTime": "2 - 33:19",
            "label": "",
            "description": "Benjamin Chilwell (Leicester) unleashes a shot from 18 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 31:20",
            "label": "substitution",
            "description": "Here is a change. Marc Albrighton is going off and Claudio Ranieri gives the last tactical orders to Danny Simpson (Leicester)."
        },
        {
            "gameTime": "2 - 30:46",
            "label": "",
            "description": "Willian (Chelsea) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 30:23",
            "label": "corner",
            "description": "The corner from Christian Fuchs (Leicester) is intercepted by Thibaut Courtois."
        },
        {
            "gameTime": "2 - 29:09",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) tries to send a pass but it's blocked. It will be a corner kick for Leicester."
        },
        {
            "gameTime": "2 - 28:20",
            "label": "",
            "description": "The free kick is taken by Marc Albrighton (Leicester), but ball is cleared."
        },
        {
            "gameTime": "2 - 28:17",
            "label": "",
            "description": "Nemanja Matic (Chelsea) brings his opponent down. Andre Marriner has a clear sight of it and blows his whistle for a foul. Leicester are awarded a free kick."
        },
        {
            "gameTime": "2 - 25:56",
            "label": "substitution",
            "description": "Ahmed Musa goes off the pitch and Demarai Gray (Leicester) comes on."
        },
        {
            "gameTime": "2 - 25:40",
            "label": "soccer-ball",
            "description": "Pedro (Chelsea) leaps high to plant a header towards the left side of the goal. Kasper Schmeichel is unable to keep the ball out and the score is 0:3."
        },
        {
            "gameTime": "2 - 24:03",
            "label": "",
            "description": "Jamie Vardy (Leicester) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 20:48",
            "label": "",
            "description": "Shinji Okazaki (Leicester) trips an opponent with a slide tackle. Andre Marriner stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "2 - 19:48",
            "label": "",
            "description": "Eden Hazard (Chelsea) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety."
        },
        {
            "gameTime": "2 - 18:47",
            "label": "",
            "description": "What a chance for Marcos Alonso (Chelsea) as he produced a stunning snap shot from the edge of the box! The goalkeeper was a bit lucky as the ball went just wide of the right post."
        },
        {
            "gameTime": "2 - 18:10",
            "label": "",
            "description": "A lofted cross from Marcos Alonso (Chelsea) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 17:36",
            "label": "corner",
            "description": "Willian (Chelsea) launches a cross from the corner, but Kasper Schmeichel is alert to thwart the effort."
        },
        {
            "gameTime": "2 - 17:13",
            "label": "",
            "description": "Gary Cahill (Chelsea) gets to the rebound and shoots, but the effort is blocked. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 16:46",
            "label": "corner",
            "description": "Willian (Chelsea) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 16:08",
            "label": "",
            "description": "Marcos Alonso (Chelsea) races towards goal but the defender gets back well to make a challenge. The referee and one of his assistants signal for a corner kick to Chelsea."
        },
        {
            "gameTime": "2 - 14:47",
            "label": "substitution",
            "description": "It will be a substitution. Shinji Okazaki (Leicester) is ready to enter the pitch as Robert Huth walks off."
        },
        {
            "gameTime": "2 - 12:26",
            "label": "",
            "description": "Eden Hazard (Chelsea) dribbles into the box, but Kasper Schmeichel is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "",
            "description": "Willian (Chelsea) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "2 - 05:55",
            "label": "soccer-ball",
            "description": "Marcos Alonso (Chelsea) picks it up in space and from the edge of the box lashes in a shot that is deflected past the helpless Kasper Schmeichel. 0:2."
        },
        {
            "gameTime": "2 - 05:50",
            "label": "",
            "description": "Willian (Chelsea) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "2 - 05:19",
            "label": "y-card",
            "description": "The whistle blows and Christian Fuchs (Leicester) is booked for an infringement."
        },
        {
            "gameTime": "2 - 03:05",
            "label": "",
            "description": "Willian (Chelsea) collects an inch perfect pass and strikes the ball from far out, but his shot is blocked."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We can hope that the managers will be able to motivate the players and stir them to improve their performance for after the half time break. We haven't seen really exciting football in the previous 45 minutes. In terms of the overall play, the match has been fairly even so far. The home side are playing long passes and crosses into the box. The away side's tactic, on the other hand, is slow build up play."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 42:33",
            "label": "",
            "description": "Eden Hazard picks out Pedro (Chelsea) unmarked inside the box, but he blazes the ball well over the bar."
        },
        {
            "gameTime": "1 - 41:44",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) jumps into a tackle and Andre Marriner blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Willian (Chelsea) sends it out of play."
        },
        {
            "gameTime": "1 - 39:11",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 39:00",
            "label": "",
            "description": "Marcos Alonso (Chelsea) wastes a good opportunity as his pass into the box is blocked by the defence. Good work from Chelsea as they win a corner."
        },
        {
            "gameTime": "1 - 37:54",
            "label": "",
            "description": "Eden Hazard (Chelsea) commits a rough challenge and Andre Marriner blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 35:54",
            "label": "",
            "description": "A pass from Jamie Vardy (Leicester) is intercepted by Thibaut Courtois and the move breaks down."
        },
        {
            "gameTime": "1 - 34:57",
            "label": "",
            "description": "Nemanja Matic (Chelsea) tackles a bit over zealously and Andre Marriner blows for a foul."
        },
        {
            "gameTime": "1 - 34:31",
            "label": "",
            "description": "Christian Fuchs (Leicester) sends the ball into the penalty area from a throw in as if it's a corner kick."
        },
        {
            "gameTime": "1 - 32:35",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "1 - 32:02",
            "label": "",
            "description": "Marcos Alonso (Chelsea) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 31:19",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game. It hasn't been very exciting show so far."
        },
        {
            "gameTime": "1 - 30:53",
            "label": "",
            "description": "Nemanja Matic (Chelsea) creates a yard of space for himself and tries an effort from distance, but it's blocked."
        },
        {
            "gameTime": "1 - 28:51",
            "label": "",
            "description": "Wilfred Ndidi (Leicester) has a go from a long way out but it sails way over."
        },
        {
            "gameTime": "1 - 24:34",
            "label": "",
            "description": "Wes Morgan (Leicester) commits a rough challenge and Andre Marriner blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 23:27",
            "label": "",
            "description": "N'Golo Kante (Chelsea) was too fierce in his attempt to get the ball from his opponent and Andre Marriner blows for a foul."
        },
        {
            "gameTime": "1 - 22:15",
            "label": "corner",
            "description": "Christian Fuchs (Leicester) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 21:38",
            "label": "",
            "description": "A cross, provided by Marc Albrighton (Leicester), caused no threat to the opposition's defence as the ball was cleared out of danger. Leicester have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 21:05",
            "label": "",
            "description": "Dangerous play by N'Golo Kante (Chelsea). Andre Marriner blows his whistle for a foul. Leicester have a free kick."
        },
        {
            "gameTime": "1 - 20:10",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 19:48",
            "label": "",
            "description": "The linesman raises his flag for offside before Ahmed Musa (Leicester) heads on."
        },
        {
            "gameTime": "1 - 16:53",
            "label": "",
            "description": "What a chance that is! Benjamin Chilwell (Leicester) squanders a huge opportunity as he latches on to a perfect cross from the wing. He and produces a bullet header from around the penalty spot which goes well wide of the left post!"
        },
        {
            "gameTime": "1 - 11:35",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 11:19",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Marcos Alonso (Chelsea). The ball is out of play and Chelsea manage to earn a corner."
        },
        {
            "gameTime": "1 - 08:40",
            "label": "",
            "description": "Willian (Chelsea) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 08:23",
            "label": "",
            "description": "Andre Marriner blows the whistle, Robert Huth (Leicester) is penalised for a foul. A free kick to Chelsea."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Eden Hazard, who plays a vital role in the build up. He squares it to Marcos Alonso (Chelsea), who beats Kasper Schmeichel with a brilliant shot into the bottom right corner. 0:1."
        },
        {
            "gameTime": "1 - 04:06",
            "label": "",
            "description": "Robert Huth (Leicester) makes a reckless foul in order to win the ball from his opponent. Andre Marriner has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 02:44",
            "label": "",
            "description": "Jamie Vardy (Leicester) commits a foul during an attacking move."
        },
        {
            "gameTime": "1 - 01:22",
            "label": "",
            "description": "Ahmed Musa (Leicester) produces a promising shot towards the left side of the goal after his wonderful solo run, but Thibaut Courtois thwarts him and the score remains the same."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Leicester will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Andre Marriner got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Diego Costa has already scored 14 goals and he is the top goal scorer for Chelsea in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester will miss a few players for this clash: Kasper Schmeichel (Thigh Injury), Nampalys Mendy (Knee Injury), Andy King (Thigh Injury), Jamie Vardy (Thigh Injury), Robert Huth (Yellow Cards), Iborra (Yellow Cards), Wes Morgan (Thigh Injury), Riyad Mahrez (National selection), Daniel Amartey (National selection)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The game produced by the players today wasn't one of the most inspiring. They definitely haven't shown us their best. An impressive display from the visitors, they had the better of it. It's obvious that defence had the highest priority for the home side. The away team made a lot of passes and attempted to maintain possession."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "14/01/2017 - 20:30",
    "gameHomeTeam": "Leicester",
    "gameScore": "0 - 3"
}