{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-01-29 - 17-00 Sampdoria 3 - 2 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. There wasn't any significant dominance by either side in this game. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 50:30",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 50:01",
            "label": "",
            "description": "Edin Dzeko (AS Roma) is flagged for offside."
        },
        {
            "gameTime": "2 - 47:41",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "Francesco Totti (AS Roma) stands over the free kick and opts to take it himself, but it is straight at Christian Puggioni."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "Paolo Mazzoleni blows his whistle for a foul after Lucas Torreira (Sampdoria) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 46:33",
            "label": "",
            "description": "Francesco Totti (AS Roma) steps up and sends the free kick straight into the defensive wall."
        },
        {
            "gameTime": "2 - 45:30",
            "label": "y-card",
            "description": "Francesco Totti (AS Roma) protests to the referee and receives a yellow card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:58",
            "label": "corner",
            "description": "Lucas Torreira (Sampdoria) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 44:56",
            "label": "",
            "description": "Filip Djuricic (Sampdoria) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Wojciech Szczesny."
        },
        {
            "gameTime": "2 - 41:35",
            "label": "substitution",
            "description": "The substitution has been made. Leandro Paredes (AS Roma) has replaced Thomas Vermaelen."
        },
        {
            "gameTime": "2 - 41:19",
            "label": "",
            "description": "The linesman raises his flag for offside before Thomas Vermaelen (AS Roma) heads on."
        },
        {
            "gameTime": "2 - 40:30",
            "label": "",
            "description": "Francesco Totti (AS Roma) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 40:03",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Christian Puggioni."
        },
        {
            "gameTime": "2 - 39:20",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Edin Dzeko (AS Roma) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "2 - 38:38",
            "label": "substitution",
            "description": "It is time for a substitution. Filip Djuricic (Sampdoria) is on for Luis Muriel."
        },
        {
            "gameTime": "2 - 36:43",
            "label": "",
            "description": "Edin Dzeko (AS Roma) receives a lofted pass and is given time inside the box to unleash a low shot goalwards. The ball is directed towards the middle of the goal, but it lacks power and Christian Puggioni pulls off a comfortable save to thwart the effort."
        },
        {
            "gameTime": "2 - 34:53",
            "label": "corner",
            "description": "Lucas Torreira (Sampdoria) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 34:35",
            "label": "",
            "description": "The ball is cleared after Vasco Regini (Sampdoria) attempted to dribble past an opposing player. The ball goes out of play and Sampdoria have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 32:25",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 32:23",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to introduce fresh legs, with Francesco Totti (AS Roma) replacing Daniele De Rossi."
        },
        {
            "gameTime": "2 - 31:52",
            "label": "substitution",
            "description": "It's time for a substitution. Stephan El Shaarawy (AS Roma) comes on in place of Bruno Peres."
        },
        {
            "gameTime": "2 - 31:34",
            "label": "",
            "description": "Diego Perotti (AS Roma) serves up a nice cross, but the defence clears the danger. AS Roma force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 27:54",
            "label": "soccer-ball",
            "description": "Luis Muriel (Sampdoria) scores a goal from the resulting free kick, sending it into the top right corner. What a strike that is, absolutely fantastic!"
        },
        {
            "gameTime": "2 - 26:58",
            "label": "y-card",
            "description": "A yellow card for a tackle by Antonio Rudiger (AS Roma). Paolo Mazzoleni doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 26:30",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Bruno Peres (AS Roma). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 25:23",
            "label": "soccer-ball",
            "description": "Goal! Patrik Schick (Sampdoria) pounced on a loose ball inside the box and beats the goalkeeper with a shot into the bottom left corner. He makes it 2:2."
        },
        {
            "gameTime": "2 - 23:21",
            "label": "substitution",
            "description": "Here comes a substitution. Patrik Schick (Sampdoria) is brought on as a substitute for Bruno Fernandes."
        },
        {
            "gameTime": "2 - 20:48",
            "label": "soccer-ball",
            "description": "Edin Dzeko (AS Roma) latches on to a precise pass deep inside the box from Emerson, and he beats the goalkeeper with a low accurate shot into the bottom left corner. He makes it 1:2."
        },
        {
            "gameTime": "2 - 19:31",
            "label": "corner",
            "description": "Christian Puggioni comes off his line to intercept the corner from Diego Perotti (AS Roma)."
        },
        {
            "gameTime": "2 - 17:30",
            "label": "",
            "description": "Christian Puggioni makes a brilliant save! Radja Nainggolan (AS Roma) met a rebound outside the box and attempted to beat the keeper low into the middle of the goal."
        },
        {
            "gameTime": "2 - 16:46",
            "label": "substitution",
            "description": "Marco Giampaolo prepares a substitution. Dennis Praet is replaced by Karol Linetty (Sampdoria)."
        },
        {
            "gameTime": "2 - 14:44",
            "label": "y-card",
            "description": "Is that a yellow card in the referee's hand? It is! Christian Puggioni (Sampdoria) gets booked."
        },
        {
            "gameTime": "2 - 13:48",
            "label": "",
            "description": "Paolo Mazzoleni has a clear sight and sees a foul from Radja Nainggolan (AS Roma)."
        },
        {
            "gameTime": "2 - 12:54",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 11:47",
            "label": "",
            "description": "Neat passing move from AS Roma in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 06:42",
            "label": "",
            "description": "Edin Dzeko (AS Roma) misses a great chance! He latches on to a fine cross into the box, but his effort misses the right post by a whisker."
        },
        {
            "gameTime": "2 - 05:55",
            "label": "",
            "description": "Bruno Fernandes (Sampdoria) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 05:26",
            "label": "y-card",
            "description": "Thomas Vermaelen (AS Roma) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Paolo Mazzoleni didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 03:36",
            "label": "",
            "description": "Bruno Peres (AS Roma) covers his face with his hands after wasting a promising chance. He takes the rebound on the edge of the box but blazes the ball high over the crossbar."
        },
        {
            "gameTime": "2 - 02:52",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "",
            "description": "Emerson (AS Roma) brings his opponent down with a tackle and Paolo Mazzoleni blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Paolo Mazzoleni blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, that wasn't the best of halves. Both sides struggled to produce anything of merit. We are witnessing quite a balanced game with both teams struggling to prevail. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 45:11",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:15",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 43:24",
            "label": "",
            "description": "Matias Silvestre (Sampdoria) gives away a foul for a clumsy challenge. Referee Paolo Mazzoleni saw the whole situation."
        },
        {
            "gameTime": "1 - 42:04",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) sends in a shot from a promising distance after a precise pass. His effort goes inches over the crossbar."
        },
        {
            "gameTime": "1 - 41:04",
            "label": "corner",
            "description": "Sampdoria take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 40:53",
            "label": "",
            "description": "Bruno Fernandes (Sampdoria) fails to send a pass into the box as his effort is cut out. The ball goes out of play. Sampdoria are awarded a corner kick."
        },
        {
            "gameTime": "1 - 38:55",
            "label": "corner",
            "description": "Lucas Torreira (Sampdoria) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 38:37",
            "label": "",
            "description": "Luis Muriel (Sampdoria) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him. Sampdoria will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 38:04",
            "label": "corner",
            "description": "Lucas Torreira (Sampdoria) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 34:11",
            "label": "",
            "description": "It looks like Daniele De Rossi (AS Roma) saw red with that tackle. Paolo Mazzoleni won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 31:53",
            "label": "",
            "description": "Diego Perotti (AS Roma) makes a slide tackle, but referee Paolo Mazzoleni blows for a foul."
        },
        {
            "gameTime": "1 - 30:14",
            "label": "corner",
            "description": "Emerson (AS Roma) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 28:55",
            "label": "y-card",
            "description": "Lucas Torreira (Sampdoria) sees a yellow card from Paolo Mazzoleni after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 28:05",
            "label": "",
            "description": "What a chance that is! Radja Nainggolan (AS Roma) finds himself in a promising position after receiving a pass on the edge of the box. His attempt goes just over the bar."
        },
        {
            "gameTime": "1 - 27:10",
            "label": "",
            "description": "Luis Muriel (Sampdoria) receives a lofted pass from the flank and shoots from close range, but the ball flies slightly wide, almost brushing the left hand post."
        },
        {
            "gameTime": "1 - 23:39",
            "label": "",
            "description": "Kevin Strootman (AS Roma) commits a rough foul. Paolo Mazzoleni stops the game and makes a call."
        },
        {
            "gameTime": "1 - 22:22",
            "label": "",
            "description": "The linesman signals that Luis Muriel (Sampdoria) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 20:48",
            "label": "soccer-ball",
            "description": "Dennis Praet (Sampdoria) with a wonderful piece of finishing. He makes a yard for himself after a well taken pass inside the box and nets inside the right post."
        },
        {
            "gameTime": "1 - 18:39",
            "label": "",
            "description": "Bartosz Bereszynski (Sampdoria) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it."
        },
        {
            "gameTime": "1 - 17:54",
            "label": "corner",
            "description": "Lucas Torreira (Sampdoria) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 17:29",
            "label": "",
            "description": "A lofted cross from Fabio Quagliarella (Sampdoria) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The referee and the linesman both signal a throw in for Sampdoria."
        },
        {
            "gameTime": "1 - 15:21",
            "label": "",
            "description": "Bruno Fernandes (Sampdoria) should know this behaviour is beyond the rules. He was too careless with his challenge and left Paolo Mazzoleni no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 13:37",
            "label": "corner",
            "description": "Wojciech Szczesny leaps to collect the ball from the corner which was sent over by Lucas Torreira (Sampdoria)."
        },
        {
            "gameTime": "1 - 13:15",
            "label": "",
            "description": "Bruno Fernandes (Sampdoria) makes contact with a cross and strikes a shot that lacks the power to find the back of the net, but the goalkeeper still has to make a good save to keep his effort out. The referee points to the corner flag. It's a corner to Sampdoria."
        },
        {
            "gameTime": "1 - 12:20",
            "label": "",
            "description": "Bruno Fernandes (Sampdoria) gets a shot away from distance, but wasn't really set to take it and fires high and wide."
        },
        {
            "gameTime": "1 - 11:42",
            "label": "",
            "description": "The linesman raises his flag as one of the players from AS Roma was in an offside position."
        },
        {
            "gameTime": "1 - 10:47",
            "label": "",
            "description": "Luis Muriel (Sampdoria) forces a pass into the box, but Wojciech Szczesny is alert and does a great job to rob him of the ball."
        },
        {
            "gameTime": "1 - 09:06",
            "label": "",
            "description": "Edin Dzeko (AS Roma) rises above the defenders and places a towering header towards the middle of the goal, but Christian Puggioni is prepared to thwart his effort."
        },
        {
            "gameTime": "1 - 08:26",
            "label": "",
            "description": "Paolo Mazzoleni blows his whistle. Federico Fazio (AS Roma) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 04:55",
            "label": "soccer-ball",
            "description": "Goal! Bruno Peres (AS Roma) is quickest to react to the rebound and stabs the ball into the back of the net. It's 0:1."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "Emerson (AS Roma) wastes an opportunity. He finds himself in acres of space and fires in a terrific shot from long range straight towards the right side of the target, but the goalkeeper makes a brilliant save and stops this one!"
        },
        {
            "gameTime": "1 - 03:43",
            "label": "",
            "description": "Emerson (AS Roma) sends a cross into the box, but Christian Puggioni comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and AS Roma will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Paolo Mazzoleni."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma are playing some good attacking football with some solid defence. Here is their goals for and against record 42:18."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sampdoria haven't won for 6 matches in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. There wasn't any significant dominance by either side in this game. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "29/01/2017 - 17:00",
    "gameHomeTeam": "Sampdoria",
    "gameScore": "3 - 2"
}