{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-11-05 - 22-45 Ajax 0 - 2 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The away team was superior on the pitch today. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "Lionel Messi (Barcelona) can bury his head in the sand! He misses the rebound from inside the penalty box as he plants a header high over the bar! A typical school boy’s error!"
        },
        {
            "gameTime": "2 - 46:41",
            "label": "",
            "description": "Adriano (Barcelona) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:43",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Lionel Messi (Barcelona)."
        },
        {
            "gameTime": "2 - 44:20",
            "label": "",
            "description": "Lionel Messi (Barcelona) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. The ball is out of play. A goal scoring opportunity from a corner for Barcelona."
        },
        {
            "gameTime": "2 - 41:02",
            "label": "",
            "description": "Lionel Messi (Barcelona) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Jasper Cillessen is alert and denies him."
        },
        {
            "gameTime": "2 - 40:21",
            "label": "",
            "description": "Anwar El Ghazi (Ajax) makes a rough challenge and Pedro Proenca blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 37:41",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Dani Alves departs the field of play to be replaced by Adriano (Barcelona)."
        },
        {
            "gameTime": "2 - 36:59",
            "label": "",
            "description": "Pedro (Barcelona) missed a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball flies well wide of the right post! The ball is off of the pitch and it's a goal kick for Ajax."
        },
        {
            "gameTime": "2 - 36:31",
            "label": "",
            "description": "A long pass, executed by Rafinha (Barcelona), missed the precision to reach his teammates."
        },
        {
            "gameTime": "2 - 35:07",
            "label": "funfact",
            "description": "The current number of shots on goal is 1:8."
        },
        {
            "gameTime": "2 - 34:41",
            "label": "corner",
            "description": "Xavi (Barcelona) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 34:39",
            "label": "substitution",
            "description": "That's the end of the game for Ivan Rakitic, who is replaced by Rafinha (Barcelona)."
        },
        {
            "gameTime": "2 - 34:19",
            "label": "substitution",
            "description": "The substitution is prepared. Stefano Denswil (Ajax) joins the action as a substitute, replacing Thulani Serero."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "",
            "description": "A dangerous attempt from Ivan Rakitic (Barcelona) was aimed towards the roof of the net, but Jasper Cillessen pulls off a superb save and stops this one. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 31:41",
            "label": "",
            "description": "Dani Alves (Barcelona) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 30:26",
            "label": "soccer-ball",
            "description": "Goal! Pedro feeds Lionel Messi (Barcelona), who taps the ball into an empty net. He makes it 0:2."
        },
        {
            "gameTime": "2 - 29:20",
            "label": "substitution",
            "description": "The manager makes a subsitution with Pedro (Barcelona) coming on for Neymar."
        },
        {
            "gameTime": "2 - 28:33",
            "label": "",
            "description": "The linesman raises his flag. Dani Alves (Barcelona) is adjudged offside."
        },
        {
            "gameTime": "2 - 26:53",
            "label": "substitution",
            "description": "Substitution. Jairo Riedewald (Ajax) in, Lucas Andersen out."
        },
        {
            "gameTime": "2 - 26:18",
            "label": "",
            "description": "Lionel Messi (Barcelona) strikes the ball harmlessly from a long range free kick and it goes high over the bar. It's not easy to score from a distance like that. The ball goes out of play and Ajax will have a goal kick."
        },
        {
            "gameTime": "2 - 25:27",
            "label": "yr-card",
            "description": "An infringement by Joel Veltman (Ajax) results in a yellow card and as it's the second time today, he also sees a red and is dismissed by Pedro Proenca."
        },
        {
            "gameTime": "2 - 23:43",
            "label": "",
            "description": "A cross from Ricardo van Rhijn (Ajax) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 21:48",
            "label": "",
            "description": "Great ball in from Thulani Serero. Arkadiusz Milik (Ajax) should really have done better with a close range header, but he heads it a whisker wide of the right post. The ball is off of the pitch and it's a goal kick for Barcelona."
        },
        {
            "gameTime": "2 - 21:23",
            "label": "corner",
            "description": "Lasse Schone (Ajax) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 21:03",
            "label": "",
            "description": "Anwar El Ghazi (Ajax) fails to find any of his teammates inside the box as his pass is blocked. Ajax force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 20:35",
            "label": "",
            "description": "A cross into the box from Anwar El Ghazi (Ajax) is cleared. The ball is out of play. Ajax will have a throw in."
        },
        {
            "gameTime": "2 - 18:46",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 16:54",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Arkadiusz Milik (Ajax) for Kolbeinn Sigthorsson."
        },
        {
            "gameTime": "2 - 15:55",
            "label": "",
            "description": "Xavi (Barcelona) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Jasper Cillessen was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 15:29",
            "label": "",
            "description": "Ricardo van Rhijn (Ajax) gives away a foul for a clumsy challenge. Referee Pedro Proenca saw the whole situation. It's a free kick to Barcelona in a dangerous position."
        },
        {
            "gameTime": "2 - 13:40",
            "label": "",
            "description": "The game is interrupted, a clear handball by Anwar El Ghazi (Ajax)."
        },
        {
            "gameTime": "2 - 13:15",
            "label": "",
            "description": "Lionel Messi (Barcelona) blows an opportunity as he sends a rebound from just outside of the box narrowly wide of the left post. The ball goes out of play and Ajax will have a goal kick."
        },
        {
            "gameTime": "2 - 13:10",
            "label": "",
            "description": "Luis Suarez (Barcelona) goes on a mazy run and neatly slips through the defence. However, he fails in the final task beating the goalkeeper, as Jasper Cillessen is alert enough to deny him."
        },
        {
            "gameTime": "2 - 12:27",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes, and they control the game at the moment, but one of the defending players steps in and intercepts the effort."
        },
        {
            "gameTime": "2 - 11:21",
            "label": "",
            "description": "Xavi (Barcelona) tries to play a through ball from just inside the box to Neymar, but one of the defending players is alert to the danger and makes a timely interception."
        },
        {
            "gameTime": "2 - 09:16",
            "label": "",
            "description": "Pedro Proenca blows for a foul after Ricardo van Rhijn (Ajax) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 08:56",
            "label": "",
            "description": "Ricardo van Rhijn (Ajax) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 07:23",
            "label": "",
            "description": "An attempted cross from Dani Alves (Barcelona) is cleared. The ball has crossed the sideline. Barcelona are taking a throw in."
        },
        {
            "gameTime": "2 - 06:10",
            "label": "",
            "description": "Jasper Cillessen is alert and has a clear sight of a long through ball from Marc Bartra (Barcelona). Easy save!"
        },
        {
            "gameTime": "2 - 05:29",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) wastes a good opportunity as his pass into the box is blocked by the defence. The ball is behind the touchline and Barcelona will take a throw in."
        },
        {
            "gameTime": "2 - 04:10",
            "label": "",
            "description": "The foul by Neymar (Barcelona) was seen by Pedro Proenca who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 03:20",
            "label": "corner",
            "description": "Xavi (Barcelona) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 03:12",
            "label": "",
            "description": "A raking crossfield pass from Javier Mascherano (Barcelona) lacks accuracy and the opposition gain possession. Barcelona have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The performance from both teams could be described as average. There have been only a few exciting situations and the fans will be expecting more in the second half. It has been a tight contest so far. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 46:04",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:56",
            "label": "y-card",
            "description": "Dani Alves (Barcelona) makes a bad challenge on his opponent and is booked by the referee."
        },
        {
            "gameTime": "1 - 41:32",
            "label": "y-card",
            "description": "Jordi Alba (Barcelona) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 40:39",
            "label": "",
            "description": "Pedro Proenca couldn't ignore the rough tackle by Ricardo van Rhijn (Ajax) and blew his whistle."
        },
        {
            "gameTime": "1 - 39:22",
            "label": "y-card",
            "description": "Nikolas Moisander (Ajax) violates the laws of the game and is shown a yellow card by the referee, but it could have been a straight red as well."
        },
        {
            "gameTime": "1 - 38:52",
            "label": "",
            "description": "Anwar El Ghazi (Ajax) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 37:48",
            "label": "injury",
            "description": "Anwar El Ghazi (Ajax) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 37:18",
            "label": "",
            "description": "Kolbeinn Sigthorsson (Ajax) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 35:40",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Marc Bartra puts the ball on a plate for Lionel Messi (Barcelona), who has an easy finish with a header into an empty net. The score is 0:1."
        },
        {
            "gameTime": "1 - 35:03",
            "label": "",
            "description": "Lionel Messi (Barcelona) stands over the free kick and opts to take it himself, sending it towards the top left corner only for Jasper Cillessen to dive and make a save."
        },
        {
            "gameTime": "1 - 34:36",
            "label": "",
            "description": "The sound of the whistle has almost been drowned out in the deafening atmosphere of this match. Lionel Messi (Barcelona) is setting the ball up for a free kick from mid range."
        },
        {
            "gameTime": "1 - 33:25",
            "label": "y-card",
            "description": "Joel Veltman (Ajax) is shown a yellow card after a horrible tackle."
        },
        {
            "gameTime": "1 - 32:46",
            "label": "",
            "description": "A poorly executed mid range free kick by Davy Klaassen (Ajax) as he fails to deliver a decent cross."
        },
        {
            "gameTime": "1 - 31:43",
            "label": "",
            "description": "Jordi Alba (Barcelona) should know this behaviour is beyond the rules. He was too careless with his challenge and left Pedro Proenca no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 30:01",
            "label": "",
            "description": "Jordi Alba (Barcelona) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Jasper Cillessen to get hold of the ball."
        },
        {
            "gameTime": "1 - 29:26",
            "label": "",
            "description": "Dani Alves (Barcelona) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 29:07",
            "label": "corner",
            "description": "Xavi (Barcelona) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 28:54",
            "label": "",
            "description": "Luis Suarez (Barcelona) shoots from outside the box, but his effort is blocked. Barcelona force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 28:35",
            "label": "funfact",
            "description": "7:13 – this is the total number of shots produced by both teams."
        },
        {
            "gameTime": "1 - 26:42",
            "label": "",
            "description": "Ricardo van Rhijn (Ajax) tries to send a low pass into the box, but it's blocked and cleared."
        },
        {
            "gameTime": "1 - 25:40",
            "label": "",
            "description": "Marc Andre ter Stegen pulls off a great save to deny Davy Klaassen (Ajax) after receiving a precise defence splitting pass. The effort is headed for the bottom right corner, but the goalkeeper dives superbly to stop it. Definitely the best save of this match so far!"
        },
        {
            "gameTime": "1 - 25:30",
            "label": "",
            "description": "Lucas Andersen (Ajax) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 25:23",
            "label": "",
            "description": "Nikolas Moisander (Ajax) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 25:03",
            "label": "",
            "description": "Ricardo van Rhijn (Ajax) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 22:44",
            "label": "",
            "description": "Lasse Schone (Ajax) has a go from distance but he can't find the target as it goes well wide of the left post. The ball is off of the pitch and it's a goal kick for Barcelona."
        },
        {
            "gameTime": "1 - 21:21",
            "label": "",
            "description": "Neymar (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 20:25",
            "label": "",
            "description": "A lofted cross from Ivan Rakitic (Barcelona) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 19:58",
            "label": "",
            "description": "Jordi Alba (Barcelona) crosses the ball forward but it is intercepted. The linesman signals a throw in for Barcelona."
        },
        {
            "gameTime": "1 - 19:10",
            "label": "",
            "description": "Barcelona are happy showing off their ball keeping skills and that is only interrupted when the defender steps in."
        },
        {
            "gameTime": "1 - 17:47",
            "label": "",
            "description": "Ricardo van Rhijn (Ajax) commits a rough foul. Pedro Proenca stops the game and makes a call."
        },
        {
            "gameTime": "1 - 17:20",
            "label": "",
            "description": "Lucas Andersen (Ajax) misses the left post by a whisker with a mid range rebound. What a chance that was!"
        },
        {
            "gameTime": "1 - 17:06",
            "label": "",
            "description": "Davy Klaassen (Ajax) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 15:52",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Ivan Rakitic (Barcelona)."
        },
        {
            "gameTime": "1 - 14:00",
            "label": "",
            "description": "Nikolas Moisander (Ajax) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 13:07",
            "label": "",
            "description": "Jordi Alba (Barcelona) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 12:28",
            "label": "",
            "description": "Javier Mascherano (Barcelona) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 11:36",
            "label": "",
            "description": "Pedro Proenca interrupts the game for a tactical foul by Davy Klaassen (Ajax)."
        },
        {
            "gameTime": "1 - 10:28",
            "label": "",
            "description": "Sergio Busquets (Barcelona) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 09:56",
            "label": "injury",
            "description": "The game is interrupted now, Sergio Busquets (Barcelona) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 08:55",
            "label": "y-card",
            "description": "Anwar El Ghazi (Ajax) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "1 - 07:39",
            "label": "y-card",
            "description": "Javier Mascherano (Barcelona) makes a really bad tackle on his opponent and is relieved when the referee only shows him a yellow card."
        },
        {
            "gameTime": "1 - 07:04",
            "label": "",
            "description": "Davy Klaassen (Ajax) sends a cross into the box, but Marc Andre ter Stegen comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 06:48",
            "label": "",
            "description": "Davy Klaassen (Ajax) sends the ball into the penalty area from a throw in as if it's a corner kick."
        },
        {
            "gameTime": "1 - 04:31",
            "label": "",
            "description": "Lionel Messi (Barcelona) makes a reckless foul in order to win the ball from his opponent. Pedro Proenca has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 03:27",
            "label": "",
            "description": "A goal, which was scored by Neymar (Barcelona), was disallowed due to offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Barcelona will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Pedro Proenca."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The away team was superior on the pitch today. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "05/11/2014 - 22:45",
    "gameHomeTeam": "Ajax",
    "gameScore": "0 - 2"
}