{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2014-2015/2015-05-17 - 20-00 Espanyol 1 - 4 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The superiority of the away team was evident on the pitch today. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 47:35",
            "label": "",
            "description": "Gareth Bale (Real Madrid) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just over the crossbar."
        },
        {
            "gameTime": "2 - 47:02",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Christian Stuani (Espanyol) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "2 - 45:42",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from James Rodriguez finds Cristiano Ronaldo (Real Madrid), who jumps highest and steers a close range header into the right side of the goal. His effort was both strong and precise, and Francisco Casilla had no chance of stopping that. 1:1."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:26",
            "label": "attendance",
            "description": "The attendance for today's match is 30180."
        },
        {
            "gameTime": "2 - 44:00",
            "label": "",
            "description": "Nacho (Real Madrid) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 43:04",
            "label": "",
            "description": "Felipe Mattioni (Espanyol) receives a precise pass on the edge of the box and bends his effort inches wide of the left post."
        },
        {
            "gameTime": "2 - 42:37",
            "label": "",
            "description": "Paco Montanes (Espanyol) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 39:46",
            "label": "",
            "description": "Cristiano Ronaldo floats in a cross for Marcelo (Real Madrid), whose header from near the penalty spot is really poor and goes well wide of the left post."
        },
        {
            "gameTime": "2 - 38:45",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Abraham walks off the pitch to be replaced by Felipe Mattioni (Espanyol)."
        },
        {
            "gameTime": "2 - 38:42",
            "label": "substitution",
            "description": "Sergio prepares a substitution. Diego Colotto is replaced by Paco Montanes (Espanyol)."
        },
        {
            "gameTime": "2 - 37:44",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) picks up the ball in the penalty area and finds the back of the net with a superb strike that goes inside the left post!"
        },
        {
            "gameTime": "2 - 36:36",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 35:54",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Daniel Carvajal trots off the pitch and is replaced by Nacho (Real Madrid)."
        },
        {
            "gameTime": "2 - 35:44",
            "label": "",
            "description": "Gareth Bale (Real Madrid) hammers the ball goalwards from about 20 metres. The shot is directed to the right side of the target but is thwarted by a save from Francisco Casilla. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 35:01",
            "label": "",
            "description": "Chicharito (Real Madrid) is unlucky with a low drive from the edge of the box. A decent save by Francisco Casilla stops the ball from hitting the middle of the net."
        },
        {
            "gameTime": "2 - 33:41",
            "label": "soccer-ball",
            "description": "Goal! Marcelo (Real Madrid) shows good awareness inside the box as he latches on to a brilliant pass and fires a first time shot into the top right corner. Cristiano Ronaldo assisted in the goal. 0:1."
        },
        {
            "gameTime": "2 - 30:57",
            "label": "",
            "description": "What an opportunity! Diego Colotto (Espanyol) leaps high to meet a beautiful cross into the box from the free kick, and he plants a header from near the penalty spot which goes a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 29:30",
            "label": "",
            "description": "Pepe (Real Madrid) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Juan Martinez Munuera with no other option than to blow for a foul. Espanyol win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 28:50",
            "label": "",
            "description": "The game is interrupted as Chicharito (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "2 - 28:35",
            "label": "y-card",
            "description": "Keylor Navas (Real Madrid) disagrees with the decision of the referee and is given a yellow card."
        },
        {
            "gameTime": "2 - 28:34",
            "label": "y-card",
            "description": "Marcelo (Real Madrid) kept talking out of turn to the referee until Juan Martinez Munuera lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "2 - 27:54",
            "label": "soccer-ball",
            "description": "Goal! It's a catastrophic error from the opponent which has gifted a chance to Christian Stuani (Espanyol), who rolls the ball into the back of the net from close range. 1:1."
        },
        {
            "gameTime": "2 - 27:14",
            "label": "substitution",
            "description": "That's the end of the game for Isco, who is replaced by Asier Illarramendi (Real Madrid)."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 26:05",
            "label": "",
            "description": "A cross following the corner kick finds its way to Gonzalez Soberon Alvaro (Espanyol) inside the box and he manages to steer it to the right side of the target. He is about to start celebrating a goal, but Keylor Navas makes a save in the nick of time and maintains the current score."
        },
        {
            "gameTime": "2 - 25:44",
            "label": "corner",
            "description": "Abraham (Espanyol) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 25:28",
            "label": "injury",
            "description": "Daniel Carvajal (Real Madrid) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 24:39",
            "label": "",
            "description": "Keylor Navas pulls off a great save to deny Victor Sanchez (Espanyol) after receiving a precise defence splitting pass. The effort is headed for the bottom left corner, but the goalkeeper dives superbly to stop it. Definitely the best save of this match so far! Espanyol win a corner."
        },
        {
            "gameTime": "2 - 23:34",
            "label": "",
            "description": "Christian Stuani (Espanyol) creates himself some space around the penalty spot and connects with the free kick. His header is badly mistimed and sails high over the bar."
        },
        {
            "gameTime": "2 - 23:30",
            "label": "",
            "description": "Victor Alvarez (Espanyol) takes a direct free kick."
        },
        {
            "gameTime": "2 - 22:42",
            "label": "y-card",
            "description": "The yellow card goes to Daniel Carvajal (Real Madrid)."
        },
        {
            "gameTime": "2 - 22:40",
            "label": "",
            "description": "The game is interrupted, a clear handball by Daniel Carvajal (Real Madrid). A free kick to Espanyol."
        },
        {
            "gameTime": "2 - 21:01",
            "label": "",
            "description": "That's a well taken pass by Victor Sanchez (Espanyol). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 20:03",
            "label": "",
            "description": "A cross following the corner kick finds its way to Raphael Varane (Real Madrid) inside the box and he manages to steer it to the bottom left corner. He is about to start celebrating a goal, but Francisco Casilla makes a save in the nick of time to maintain the current score."
        },
        {
            "gameTime": "2 - 19:38",
            "label": "corner",
            "description": "The referee awards a corner and James Rodriguez (Real Madrid) goes over to take it."
        },
        {
            "gameTime": "2 - 19:24",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Marcelo (Real Madrid). The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 18:24",
            "label": "substitution",
            "description": "Here is a change. Felipe Caicedo is going off and Sergio gives the last tactical orders to Christian Stuani (Espanyol)."
        },
        {
            "gameTime": "2 - 17:53",
            "label": "substitution",
            "description": "The referee signals a substitution. Chicharito (Real Madrid) is brought on as a substitute for Karim Benzema."
        },
        {
            "gameTime": "2 - 15:35",
            "label": "",
            "description": "Francisco Casilla is alert and has a clear sight of a long through ball from Marcelo (Real Madrid). Easy save!"
        },
        {
            "gameTime": "2 - 13:56",
            "label": "soccer-ball",
            "description": "Goal! Cristiano Ronaldo (Real Madrid) finds himself some space inside the box to get on the end of a pass from Karim Benzema, then sends the ball low into the middle of the net. 0:1."
        },
        {
            "gameTime": "2 - 12:14",
            "label": "",
            "description": "James Rodriguez (Real Madrid) finds himself unmarked on the edge of the box, but he drags his shot just wide of the right post."
        },
        {
            "gameTime": "2 - 11:05",
            "label": "",
            "description": "Felipe Caicedo (Espanyol) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 10:29",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) produces a shot from a long range free kick, but it flies high over the crossbar."
        },
        {
            "gameTime": "2 - 09:48",
            "label": "y-card",
            "description": "The foul by Victor Sanchez (Espanyol) is worthy of a card and a yellow is duly shown by Juan Martinez Munuera. Real Madrid are awarded a free kick."
        },
        {
            "gameTime": "2 - 09:40",
            "label": "",
            "description": "Juan Martinez Munuera interrupts the game for a tactical foul by Victor Sanchez (Espanyol)."
        },
        {
            "gameTime": "2 - 08:51",
            "label": "",
            "description": "The linesman signals that Karim Benzema (Real Madrid) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 07:34",
            "label": "",
            "description": "Referee Juan Martinez Munuera sees the trip by Javi Lopez (Espanyol) and doesn't hesitate to blow his whistle. Real Madrid are awarded the free kick."
        },
        {
            "gameTime": "2 - 05:56",
            "label": "",
            "description": "A pass from Marcelo (Real Madrid) is intercepted by Francisco Casilla and the move breaks down."
        },
        {
            "gameTime": "2 - 05:13",
            "label": "",
            "description": "Karim Benzema (Real Madrid) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety."
        },
        {
            "gameTime": "2 - 04:30",
            "label": "",
            "description": "Gareth Bale (Real Madrid) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "2 - 03:16",
            "label": "corner",
            "description": "The corner from James Rodriguez (Real Madrid) is intercepted by Francisco Casilla."
        },
        {
            "gameTime": "2 - 02:54",
            "label": "",
            "description": "It could have been a good chance to score! Daniel Carvajal (Real Madrid) fails to release Gareth Bale with a through ball as the defence is alert and clears. Real Madrid force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 01:53",
            "label": "",
            "description": "Flag up against Abraham (Espanyol). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 00:35",
            "label": "",
            "description": "Close! Sergio Garcia (Espanyol) picks up the ball in space and from inside the penalty area sends a shot inches wide of the right post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Juan Martinez Munuera blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The fans have so far witnessed an unattractive game, with barely any exciting moments to stir interest. There wasn't any evident superiority by either side during the first half. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 45:06",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Juan Martinez Munuera has ended it."
        },
        {
            "gameTime": "1 - 44:13",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is flagged for offside."
        },
        {
            "gameTime": "1 - 42:42",
            "label": "",
            "description": "Juan Martinez Munuera blows for a foul after Javi Lopez (Espanyol) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 41:42",
            "label": "",
            "description": "James Rodriguez (Real Madrid) whips a long ball in from the free kick which is intercepted by Francisco Casilla."
        },
        {
            "gameTime": "1 - 41:15",
            "label": "",
            "description": "Javi Lopez (Espanyol) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul. Real Madrid will take a free kick."
        },
        {
            "gameTime": "1 - 40:18",
            "label": "",
            "description": "Anaitz Arbilla (Espanyol) makes a yard for himself and unleashes a stunning shot from 25 metres out. His great effort, however, goes painfully over the crossbar."
        },
        {
            "gameTime": "1 - 38:07",
            "label": "",
            "description": "Felipe Caicedo (Espanyol) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger."
        },
        {
            "gameTime": "1 - 37:26",
            "label": "",
            "description": "Juan Martinez Munuera blows his whistle and signals a foul after Victor Sanchez (Espanyol) brought his opponent down."
        },
        {
            "gameTime": "1 - 36:37",
            "label": "",
            "description": "A cross by Marcelo (Real Madrid) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "1 - 34:14",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Francisco Casilla is alert and denies him."
        },
        {
            "gameTime": "1 - 32:53",
            "label": "",
            "description": "Abraham (Espanyol) takes the ball on and fires in a low shot from 20 metres. Keylor Navas stops the effort which is headed to the middle of the target."
        },
        {
            "gameTime": "1 - 30:33",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "",
            "description": "The cross into the penalty area from Isco (Real Madrid) needed to be more accurate in order to create a goal scoring opportunity for his team. The ball goes out of play and Espanyol will have a goal kick."
        },
        {
            "gameTime": "1 - 28:14",
            "label": "",
            "description": "Karim Benzema (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 27:32",
            "label": "",
            "description": "The foul by Raphael Varane (Real Madrid) was seen by Juan Martinez Munuera who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 27:28",
            "label": "corner",
            "description": "Corner kick. James Rodriguez (Real Madrid) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 26:47",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 26:11",
            "label": "",
            "description": "Anaitz Arbilla (Espanyol) steps up and sends the mid range free kick miles over the bar. Strong but inaccurate shot."
        },
        {
            "gameTime": "1 - 25:20",
            "label": "",
            "description": "Gareth Bale (Real Madrid) is penalised for holding. Juan Martinez Munuera signals a set piece. Espanyol are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 24:03",
            "label": "",
            "description": "Excellent touch by Sergio Garcia (Espanyol)! He latches on to a precise pass on the edge of the box and produces a shot goalwards which goes way wide of the left post."
        },
        {
            "gameTime": "1 - 23:25",
            "label": "",
            "description": "Hector Moreno (Espanyol) is caught offside, but it was a really close call."
        },
        {
            "gameTime": "1 - 22:46",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Pepe (Real Madrid) was quite harsh and Juan Martinez Munuera didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 22:25",
            "label": "",
            "description": "Real Madrid quickly take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 22:04",
            "label": "",
            "description": "It looks like Victor Sanchez (Espanyol) saw red with that tackle. Juan Martinez Munuera won't tolerate such behaviour on the pitch and blows for a foul. Real Madrid get a free kick."
        },
        {
            "gameTime": "1 - 21:10",
            "label": "",
            "description": "Isco (Real Madrid) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "1 - 19:36",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) unleashes a shot from 22 metres out but is unable to find the target and it goes well wide of the left post."
        },
        {
            "gameTime": "1 - 17:50",
            "label": "y-card",
            "description": "Felipe Caicedo (Espanyol) gives the referee no choice but to show him a yellow card."
        },
        {
            "gameTime": "1 - 17:18",
            "label": "corner",
            "description": "Keylor Navas comes off his line to intercept the corner from Abraham (Espanyol)."
        },
        {
            "gameTime": "1 - 16:37",
            "label": "",
            "description": "Wow, what an escape. Victor Sanchez (Espanyol) has an effort from inside the box but it's brilliantly blocked. The ball is out of play. Espanyol will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 14:33",
            "label": "",
            "description": "Toni Kroos (Real Madrid) commits a rough challenge and Juan Martinez Munuera blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 13:09",
            "label": "",
            "description": "Anaitz Arbilla (Espanyol) makes an unfair challenge by holding his opponent to prevent him from getting the ball."
        },
        {
            "gameTime": "1 - 12:20",
            "label": "",
            "description": "Daniel Carvajal swings the cross over. Cristiano Ronaldo (Real Madrid) gets his head to it but it goes just wide of the left post."
        },
        {
            "gameTime": "1 - 11:40",
            "label": "",
            "description": "Victor Sanchez (Espanyol) tackles a bit over zealously and Juan Martinez Munuera blows for a foul."
        },
        {
            "gameTime": "1 - 10:19",
            "label": "",
            "description": "Gareth Bale (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 08:07",
            "label": "",
            "description": "Isco (Real Madrid) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 07:42",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Toni Kroos (Real Madrid) takes it short."
        },
        {
            "gameTime": "1 - 07:15",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. The referee and his assistant both point at the corner flag. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 05:59",
            "label": "",
            "description": "Hector Moreno (Espanyol) threads a pass through the eye of a needle into the box for Felipe Caicedo, but Keylor Navas displays great awareness to stop him."
        },
        {
            "gameTime": "1 - 03:42",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) makes a strong challenge and Juan Martinez Munuera blows for a foul."
        },
        {
            "gameTime": "1 - 03:03",
            "label": "",
            "description": "Real Madrid seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "1 - 01:02",
            "label": "",
            "description": "The linesman raises his flag. Gareth Bale (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "1 - 00:37",
            "label": "",
            "description": "Felipe Caicedo (Espanyol) feels very aggrieved after the referee stops play for a foul that he commits while heading towards goal with the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Real Madrid will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Juan Martinez Munuera got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The superiority of the away team was evident on the pitch today. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "17/05/2015 - 20:00",
    "gameHomeTeam": "Espanyol",
    "gameScore": "1 - 4"
}