{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2014-2015/2015-05-10 - 21-45 Lazio 1 - 2 Inter/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The away team was superior today. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        },
        {
            "gameTime": "2 - 49:55",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 49:52",
            "label": "",
            "description": "Etrit Berisha pulls off a great save to deny Marcelo Brozovic (Inter), who makes himself some space inside the box and unleashes a quick low drive to the bottom right corner."
        },
        {
            "gameTime": "2 - 48:42",
            "label": "",
            "description": "Stefan Radu (Lazio) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "",
            "description": "Lucas Biglia (Lazio) crosses the ball from the free kick, but it goes out of play."
        },
        {
            "gameTime": "2 - 47:36",
            "label": "",
            "description": "Gary Medel (Inter) makes an overly aggressive challenge and Davide Massa blows his whistle for a foul. That's a free kick to Lazio."
        },
        {
            "gameTime": "2 - 47:07",
            "label": "",
            "description": "Lucas Biglia (Lazio) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 46:53",
            "label": "y-card",
            "description": "Davide Massa shows the yellow card to Yuto Nagatomo (Inter) for a heavy challenge."
        },
        {
            "gameTime": "2 - 46:21",
            "label": "",
            "description": "Nemanja Vidic (Inter) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 45:53",
            "label": "substitution",
            "description": "The substitution is prepared. Marcelo Brozovic (Inter) joins the action as a substitute, replacing Rodrigo Palacio."
        },
        {
            "gameTime": "2 - 45:20",
            "label": "injury",
            "description": "Nemanja Vidic (Inter) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 43:36",
            "label": "",
            "description": "Marco Parolo (Lazio) commits a foul during an attacking move."
        },
        {
            "gameTime": "2 - 41:53",
            "label": "",
            "description": "Davide Massa couldn't ignore the rough tackle by Edson Braafheid (Lazio) and blew his whistle."
        },
        {
            "gameTime": "2 - 41:11",
            "label": "corner",
            "description": "Samir Handanovic leaps to intercept the corner kick from Lucas Biglia (Lazio)."
        },
        {
            "gameTime": "2 - 40:51",
            "label": "",
            "description": "Dusan Basta (Lazio) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Lazio win a corner."
        },
        {
            "gameTime": "2 - 39:28",
            "label": "",
            "description": "Mauro Icardi (Inter) is penalised for a foul. Davide Massa had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 38:27",
            "label": "soccer-ball",
            "description": "Stunning strike! Hernanes (Inter) latches on to a precise through ball from Mateo Kovacic before unleashing an unstoppable shot into the bottom right corner from the edge of the area. Fantastic goal. The score is now 1:2."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "",
            "description": "Lukas Podolski (Inter) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "",
            "description": "Juan Jesus (Inter) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 36:19",
            "label": "",
            "description": "Hernanes (Inter) makes his forward run a little too early and is caught in an offside position after his teammate tries to play a pass to him."
        },
        {
            "gameTime": "2 - 35:17",
            "label": "",
            "description": "Yuto Nagatomo races towards the box before laying off to Hernanes (Inter), who picks it up but blazes a shot well over the bar from the edge of the box. The ball goes out of play and Lazio will have a goal kick."
        },
        {
            "gameTime": "2 - 34:01",
            "label": "",
            "description": "The cross into the penalty area from Marco Parolo (Lazio) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "2 - 33:32",
            "label": "",
            "description": "Dusan Basta (Lazio) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 32:26",
            "label": "",
            "description": "What a sweet touch by Lukas Podolski (Inter) as he collects a pass deep inside the box and decides to go for goal. It's on target but easy for Etrit Berisha to hold."
        },
        {
            "gameTime": "2 - 32:16",
            "label": "",
            "description": "Good movement by Yuto Nagatomo (Inter), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "2 - 31:13",
            "label": "substitution",
            "description": "Balde Keita (Lazio) joins the action as a substitute, replacing Antonio Candreva."
        },
        {
            "gameTime": "2 - 30:47",
            "label": "funfact",
            "description": "The ball possession at the moment is 36:64."
        },
        {
            "gameTime": "2 - 30:26",
            "label": "",
            "description": "Antonio Candreva (Lazio) is deemed to be in an offside position by the linesman and it looks like it is the right decision despite being a very close call."
        },
        {
            "gameTime": "2 - 30:18",
            "label": "",
            "description": "A cross is whipped into the box by Yuto Nagatomo (Inter) and Mauro Icardi controls it well. He lines up the ball, but one of the defenders produces a timely intervention."
        },
        {
            "gameTime": "2 - 28:48",
            "label": "",
            "description": "Mateo Kovacic (Inter) sends a cross into the box, but Etrit Berisha comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 28:00",
            "label": "",
            "description": "Mauro Icardi (Inter) commits a foul and Davide Massa immediately signals a free kick."
        },
        {
            "gameTime": "2 - 26:10",
            "label": "",
            "description": "A lofted cross from Yuto Nagatomo (Inter) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 25:51",
            "label": "",
            "description": "Gary Medel (Inter) takes a short free kick."
        },
        {
            "gameTime": "2 - 25:31",
            "label": "y-card",
            "description": "Lucas Biglia (Lazio) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 25:10",
            "label": "",
            "description": "Referee Davide Massa sees the trip by Lucas Biglia (Lazio) and doesn't hesitate to blow his whistle. A free kick is awarded to Inter."
        },
        {
            "gameTime": "2 - 24:53",
            "label": "",
            "description": "Lukas Podolski (Inter) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 24:19",
            "label": "",
            "description": "A spell of possession for Inter in an attempt to control the game."
        },
        {
            "gameTime": "2 - 23:17",
            "label": "corner",
            "description": "Antonio Candreva (Lazio) swings in the corner, but the goalkeeper does a brilliant job to intercept the effort."
        },
        {
            "gameTime": "2 - 22:58",
            "label": "",
            "description": "Felipe Anderson (Lazio) races towards goal but the defender gets back well to make a challenge. The referee points to the corner flag and Lazio will take a corner."
        },
        {
            "gameTime": "2 - 22:36",
            "label": "substitution",
            "description": "Roberto Mancini prepares a substitution. Danilo D'Ambrosio is replaced by Yuto Nagatomo (Inter)."
        },
        {
            "gameTime": "2 - 21:56",
            "label": "y-card",
            "description": "Hernanes (Inter) was probably a bit loose with his words to Davide Massa, who decides to show him a yellow."
        },
        {
            "gameTime": "2 - 20:24",
            "label": "corner",
            "description": "Lucas Biglia (Lazio) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 20:07",
            "label": "",
            "description": "The ball is cleared after Antonio Candreva (Lazio) attempted to dribble past an opposing player. Lazio earn a corner."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "penalty-missed",
            "description": "Mauro Icardi (Inter) places the ball on the penalty spot and sends it towards the bottom right corner. His effort isn't powerful enough, though, allowing Etrit Berisha to dive and keep the ball out with an excellent save."
        },
        {
            "gameTime": "2 - 17:45",
            "label": "",
            "description": "Mauro Icardi (Inter) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 17:01",
            "label": "substitution",
            "description": "The manager is forced to make a substitution due to a red card. Stefano Pioli issues instructions to Etrit Berisha (Lazio), who will replace Miroslav Klose."
        },
        {
            "gameTime": "2 - 15:48",
            "label": "r-card",
            "description": "Federico Marchetti (Lazio) makes a horror tackle on his opponent and receives a red card from the referee! A penalty is given to Inter!"
        },
        {
            "gameTime": "2 - 13:43",
            "label": "",
            "description": "Miroslav Klose (Lazio) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Samir Handanovic is alert and denies him."
        },
        {
            "gameTime": "2 - 11:36",
            "label": "",
            "description": "Davide Massa blows his whistle and it's Felipe Anderson (Lazio) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 10:38",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Hernanes (Inter). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "2 - 10:11",
            "label": "",
            "description": "Rodrigo Palacio (Inter) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "2 - 08:53",
            "label": "",
            "description": "Lucas Biglia (Lazio) was standing in a clear offside position, making it an easy call for the linesman."
        },
        {
            "gameTime": "2 - 08:29",
            "label": "",
            "description": "Antonio Candreva (Lazio) wins the ball after the corner kick and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 08:22",
            "label": "corner",
            "description": "Lucas Biglia (Lazio) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 07:46",
            "label": "",
            "description": "Antonio Candreva (Lazio) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. It will be a corner kick for Lazio."
        },
        {
            "gameTime": "2 - 07:03",
            "label": "",
            "description": "Hernanes (Inter) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The referee and the linesman both signal a throw in for Inter."
        },
        {
            "gameTime": "2 - 06:51",
            "label": "corner",
            "description": "Lukas Podolski (Inter) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 06:21",
            "label": "",
            "description": "Hernanes (Inter) takes the resultant free kick from the edge of the box and tries to find one of his teammates with a cross, but the keeper climbs high and gets to it first, collecting the ball with ease. The ball goes out of play. Inter are awarded a corner kick."
        },
        {
            "gameTime": "2 - 06:02",
            "label": "",
            "description": "Antonio Candreva (Lazio) fouls an opponent. At least that's what referee Davide Massa signals. Inter are awarded the free kick."
        },
        {
            "gameTime": "2 - 05:20",
            "label": "",
            "description": "Miroslav Klose (Lazio) outjumps the defence to meet the resulting corner and heads the ball towards the top of the net. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "2 - 05:04",
            "label": "corner",
            "description": "There's an opportunity for Lucas Biglia (Lazio) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 04:41",
            "label": "",
            "description": "The free kick is delivered by Lucas Biglia (Lazio) but it's not one of his best and is easily cleared. The referee and one of his assistants signal for a corner kick to Lazio."
        },
        {
            "gameTime": "2 - 04:18",
            "label": "",
            "description": "Davide Massa has a clear sight and sees a foul from Lukas Podolski (Inter). It's a free kick to Lazio, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "2 - 03:10",
            "label": "corner",
            "description": "Lucas Biglia (Lazio) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 02:54",
            "label": "",
            "description": "Antonio Candreva (Lazio) sends the ball into the box from the side of the pitch, but his cross is blocked. The ball is out of play and Lazio manage to earn a corner."
        },
        {
            "gameTime": "2 - 02:14",
            "label": "",
            "description": "Rodrigo Palacio (Inter) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball has crossed the sideline. Inter are taking a throw in."
        },
        {
            "gameTime": "2 - 01:53",
            "label": "",
            "description": "Inter keep the ball and are displaying some tiki taka style passing at the moment."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Fredy Guarin will not participate anymore and Lukas Podolski (Inter) is coming on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. No side has really dominated in this first half. Both sides rely mostly on counter attacks for their chances."
        },
        {
            "gameTime": "1 - 47:54",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 47:39",
            "label": "corner",
            "description": "The resulting corner from Lucas Biglia (Lazio) is cleared."
        },
        {
            "gameTime": "1 - 47:06",
            "label": "",
            "description": "Lucas Biglia (Lazio) stands over the free kick and opts to take it himself, sending it towards the top of net only for Samir Handanovic to dive and make a save. Lazio will take a corner kick."
        },
        {
            "gameTime": "1 - 46:58",
            "label": "",
            "description": "Fredy Guarin (Inter) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 46:16",
            "label": "",
            "description": "Lazio win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 46:06",
            "label": "",
            "description": "The referee blows his whistle as Danilo D'Ambrosio (Inter) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 45:53",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 45:20",
            "label": "injury",
            "description": "Fredy Guarin (Inter) is writhing in pain and can now receive medical treatment after the referee decides to stop play."
        },
        {
            "gameTime": "1 - 44:51",
            "label": "",
            "description": "A dangerous towering header by Nemanja Vidic (Inter) from around the penalty spot goes just wide of the right post. This corner kick didn't change the score."
        },
        {
            "gameTime": "1 - 44:06",
            "label": "corner",
            "description": "Corner kick. Hernanes (Inter) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 43:42",
            "label": "",
            "description": "Fredy Guarin (Inter) stands over the free kick and opts to take it himself, sending it towards the right post only for Etrit Berisha to dive and make a save."
        },
        {
            "gameTime": "1 - 42:47",
            "label": "",
            "description": "Edson Braafheid (Lazio) didn't hesitate to knock his opponent down with a harsh sliding tackle. Davide Massa could probably show him a yellow, but he only goes with blowing the whistle for a foul. Inter are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 41:16",
            "label": "",
            "description": "Juan Jesus (Inter) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "1 - 40:35",
            "label": "",
            "description": "Mauro Icardi (Inter) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "1 - 38:58",
            "label": "",
            "description": "Davide Massa blows his whistle and signals a foul after Miroslav Klose (Lazio) brought his opponent down."
        },
        {
            "gameTime": "1 - 38:21",
            "label": "",
            "description": "Davide Massa blows the whistle, Juan Jesus (Inter) is penalised for a foul."
        },
        {
            "gameTime": "1 - 37:50",
            "label": "",
            "description": "Inter hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 34:23",
            "label": "",
            "description": "Rodrigo Palacio (Inter) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 31:37",
            "label": "",
            "description": "Rodrigo Palacio (Inter) gets to the rebound on the edge of the penalty area and fires a shot towards the left side of the goal, but Etrit Berisha gets a hand to it and keeps it out."
        },
        {
            "gameTime": "1 - 31:02",
            "label": "",
            "description": "Marco Parolo (Lazio) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "1 - 29:07",
            "label": "",
            "description": "Mauro Icardi (Inter) knew what to do with the ball, but was just a bit unlucky. After receiving a pass, he sent the ball goalwards from some 22 metres out, but it flew just over the bar. The ball is off of the pitch and it's a goal kick for Lazio."
        },
        {
            "gameTime": "1 - 27:41",
            "label": "substitution",
            "description": "Here is the reaction to a red card. Stefano Pioli makes a tactical substitution, Stefano Mauri leaves the pitch and Edson Braafheid (Lazio) comes on."
        },
        {
            "gameTime": "1 - 26:54",
            "label": "y-card",
            "description": "Federico Marchetti (Lazio) is the one who receives a yellow card."
        },
        {
            "gameTime": "1 - 25:36",
            "label": "soccer-ball",
            "description": "Hernanes (Inter) shows what an intelligent of a player he is after hitting a low shot from a free kick that goes under the defensive wall and into the bottom left corner!"
        },
        {
            "gameTime": "1 - 23:58",
            "label": "y-card",
            "description": "The main referee, Davide Massa, is apparently not going to tolerate any discussions. Stefano Mauri (Lazio) is given a yellow card for dissent."
        },
        {
            "gameTime": "1 - 23:35",
            "label": "r-card",
            "description": "Mauricio (Lazio) makes an awful challenge on his opponent and the referee shows him a deserved red card! Another situation results in a direct free kick for Inter."
        },
        {
            "gameTime": "1 - 23:21",
            "label": "",
            "description": "Lucas Biglia (Lazio) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 22:08",
            "label": "injury",
            "description": "Lucas Biglia (Lazio) is down injured and the referee stops play so that he can receive medical treatment."
        },
        {
            "gameTime": "1 - 21:31",
            "label": "",
            "description": "Michael Ciani (Lazio) makes a slide tackle, but referee Davide Massa blows for a foul."
        },
        {
            "gameTime": "1 - 21:15",
            "label": "",
            "description": "Antonio Candreva (Lazio) swings a cross into the box, but it's far too close to Samir Handanovic, who smothers the ball."
        },
        {
            "gameTime": "1 - 19:45",
            "label": "",
            "description": "Antonio Candreva (Lazio) unleashes a shot from 20 metres out but is unable to find the target and it goes well wide of the right post."
        },
        {
            "gameTime": "1 - 19:17",
            "label": "",
            "description": "Hernanes (Inter) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 18:18",
            "label": "",
            "description": "The foul by Felipe Anderson (Lazio) was seen by Davide Massa who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 17:47",
            "label": "corner",
            "description": "The corner by Antonio Candreva (Lazio) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 17:25",
            "label": "",
            "description": "The ball rebounds to Marco Parolo (Lazio) around the penalty spot and he produces a header towards the goal. Unfortunately for him, one of the defenders prevents the ball from ending in the net. The referee blows his whistle, Lazio are awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:52",
            "label": "",
            "description": "Marco Parolo (Lazio) is quickest to the rebound and shoots towards the middle of the net, but the goalkeeper pulls off a comfortable save to deny him."
        },
        {
            "gameTime": "1 - 16:35",
            "label": "",
            "description": "Miroslav Klose (Lazio) tries to find Antonio Candreva with a clever through ball from the corner of the box, but the defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "1 - 15:13",
            "label": "",
            "description": "Lazio are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 14:26",
            "label": "",
            "description": "Hernanes plays a lovely pass into Mauro Icardi (Inter), but he can't find the target. His strike from inside the box goes narrowly over the crossbar. The ball is off of the pitch and it's a goal kick for Lazio."
        },
        {
            "gameTime": "1 - 11:31",
            "label": "y-card",
            "description": "Danilo D'Ambrosio (Inter) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 10:53",
            "label": "",
            "description": "An attempted cross from Juan Jesus (Inter) is cleared."
        },
        {
            "gameTime": "1 - 07:58",
            "label": "soccer-ball",
            "description": "Goal! Felipe Anderson displays great vision and sends a pass to Antonio Candreva (Lazio), who shows brilliant composure inside the box to bury the ball into the back of the net. The score is 1:0."
        },
        {
            "gameTime": "1 - 06:53",
            "label": "",
            "description": "Mauricio (Lazio) commits a rough challenge and Davide Massa blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 06:07",
            "label": "",
            "description": "Inter players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "1 - 04:51",
            "label": "",
            "description": "Fredy Guarin (Inter) does his best to latch onto a cross into the box, but he can't get to the ball. The ball goes out of play and Lazio will have a goal kick."
        },
        {
            "gameTime": "1 - 03:05",
            "label": "",
            "description": "Dusan Basta (Lazio) can't believe his eyes as he blows an opportunity from close range. It looked really simple and he only needed to tap the ball in, but he failed. The ball goes well wide of the right post. Hang your head in shame son."
        },
        {
            "gameTime": "1 - 02:15",
            "label": "",
            "description": "Antonio Candreva (Lazio) picks up the ball, dribbles to the edge of the penalty area and unleashes a brilliant shot to the bottom right corner, but is thwarted by a great save from Samir Handanovic."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Lazio will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Davide Massa will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The away team was superior today. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        }
    ],
    "gameAwayTeam": "Inter",
    "gameDate": "10/05/2015 - 21:45",
    "gameHomeTeam": "Lazio",
    "gameScore": "1 - 2"
}