{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-04-16 - 17-00 Getafe 1 - 5 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. Real Madrid had more of the game and were superior. Their manager will certainly be the happier of the two managers. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:53",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Jese is the provider as he slips the ball to Cristiano Ronaldo (Real Madrid) who simply steers it home from close range. It's 1:5."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:52",
            "label": "y-card",
            "description": "Nacho (Real Madrid) sees a yellow card from Jose Luis Gonzalez after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 42:55",
            "label": "soccer-ball",
            "description": "Goal! Lucas plays in James Rodriguez (Real Madrid), who shows great determination to get to the ball before a couple of defenders. He shoots from inside the box into the right side of the net! Great finish 1:4."
        },
        {
            "gameTime": "2 - 39:42",
            "label": "y-card",
            "description": "Moi Gomez (Getafe) receives a yellow card."
        },
        {
            "gameTime": "2 - 37:39",
            "label": "soccer-ball",
            "description": "Goal! Moi Gomez passes the ball to Pablo Sarabia (Getafe) and he fires in a shot from the edge of the box which is deflected. Keylor Navas couldn't do anything about it. 1:3."
        },
        {
            "gameTime": "2 - 35:18",
            "label": "",
            "description": "Juan Rodriguez (Getafe) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity!"
        },
        {
            "gameTime": "2 - 32:05",
            "label": "y-card",
            "description": "The foul by Pedro Leon (Getafe) is worthy of a card and a yellow is duly shown by Jose Luis Gonzalez."
        },
        {
            "gameTime": "2 - 31:33",
            "label": "corner",
            "description": "Pedro Leon (Getafe) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 31:10",
            "label": "",
            "description": "Pablo Sarabia (Getafe) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition. The ball goes out for a corner. Getafe can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 30:56",
            "label": "",
            "description": "What a wasted opportunity by Stefan Scepovic (Getafe)! He creates some space for himself inside the penalty box and unleashes a decent strike towards the middle of the net, but Keylor Navas makes a comfortable save to thwart him."
        },
        {
            "gameTime": "2 - 29:53",
            "label": "",
            "description": "Stefan Scepovic (Getafe) will take an indirect free kick from inside the box."
        },
        {
            "gameTime": "2 - 29:00",
            "label": "",
            "description": "Getafe will have an indirect free kick from inside the box!"
        },
        {
            "gameTime": "2 - 27:51",
            "label": "",
            "description": "Golden chance! Cristiano Ronaldo (Real Madrid) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the left post."
        },
        {
            "gameTime": "2 - 27:21",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Moi Gomez (Getafe) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 25:13",
            "label": "",
            "description": "Damian Suarez (Getafe) tries to send a low pass into the box, but it's blocked and cleared."
        },
        {
            "gameTime": "2 - 23:02",
            "label": "",
            "description": "Marcelo (Real Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to substitute Karim Benzema and he is replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 20:28",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Karim Benzema (Real Madrid), whose instinctive shot towards goal flashes inches wide of the right post."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "",
            "description": "Pablo Sarabia (Getafe) cracked a first time shot, but the goalkeeper pulled off an amazing save."
        },
        {
            "gameTime": "2 - 18:50",
            "label": "",
            "description": "Karim Benzema (Real Madrid) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 16:26",
            "label": "substitution",
            "description": "That's the end of the game for Alvaro Vazquez, who is replaced by Moi Gomez (Getafe)."
        },
        {
            "gameTime": "2 - 15:40",
            "label": "y-card",
            "description": "Jose Luis Gonzalez shows a yellow card to Alvaro Vazquez (Getafe) for a tough tackle."
        },
        {
            "gameTime": "2 - 15:05",
            "label": "",
            "description": "James Rodriguez (Real Madrid) receives a pass and tries his luck with a shot from 18 metres out. Guaita pulls off a comfortable save to stop the effort going into the middle of the goal."
        },
        {
            "gameTime": "2 - 12:02",
            "label": "",
            "description": "Pedro Leon (Getafe) has a shot blocked from inside the box."
        },
        {
            "gameTime": "2 - 11:48",
            "label": "substitution",
            "description": "Gareth Bale will be replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 10:58",
            "label": "",
            "description": "Half chance! Gareth Bale (Real Madrid) plays a pass into the box, but Guaita reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "corner",
            "description": "Pablo Sarabia (Getafe) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "2 - 07:46",
            "label": "",
            "description": "Pedro Leon (Getafe) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Getafe have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 06:55",
            "label": "substitution",
            "description": "Juan Eduardo Esnaider has decided to make a change. Emiliano Buendia (Getafe) replaces Mehdi Lacen."
        },
        {
            "gameTime": "2 - 06:53",
            "label": "substitution",
            "description": "A substitution has been made. Daniel Carvajal goes off and Nacho (Real Madrid) comes on."
        },
        {
            "gameTime": "2 - 06:02",
            "label": "",
            "description": "James Rodriguez (Real Madrid) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "2 - 04:42",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Karim Benzema slips the ball through to Gareth Bale (Real Madrid), and he darts into the box to unleash a magnificent shot inside the left post. He makes it 0:3."
        },
        {
            "gameTime": "2 - 02:43",
            "label": "corner",
            "description": "The resulting corner comes to nothing as James Rodriguez (Real Madrid) sends it out of play."
        },
        {
            "gameTime": "2 - 02:22",
            "label": "",
            "description": "James Rodriguez (Real Madrid) sends a lofted cross into the box which is headed clear. The referee points to the corner flag and Real Madrid will take a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "There was plenty of entertainment during the first 45 minutes. Hopefully more of the same in the second half. The visitors dominated that half and looked more dangerous in attack. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 46:54",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:07",
            "label": "",
            "description": "Isco (Real Madrid) receives a low pass just outside the box and unleashes a fine strike towards the middle of the goal. Guaita pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 43:57",
            "label": "injury",
            "description": "Toni Kroos (Real Madrid) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 42:59",
            "label": "y-card",
            "description": "Damian Suarez (Getafe) kept talking out of turn to the referee until Jose Luis Gonzalez lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "1 - 42:45",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 12:21."
        },
        {
            "gameTime": "1 - 39:51",
            "label": "soccer-ball",
            "description": "Goal! Isco (Real Madrid) finishes from close range with an easy finish and he makes it 0:2. He was ably assisted there by Karim Benzema."
        },
        {
            "gameTime": "1 - 39:47",
            "label": "",
            "description": "Karim Benzema (Real Madrid) and Isco combine well with a quick one two and their attacking move continues."
        },
        {
            "gameTime": "1 - 37:57",
            "label": "",
            "description": "The ball is cleared after Karim Benzema (Real Madrid) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 35:58",
            "label": "corner",
            "description": "Pablo Sarabia (Getafe) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "1 - 35:49",
            "label": "",
            "description": "Pablo Sarabia (Getafe) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger. Getafe will take a corner kick."
        },
        {
            "gameTime": "1 - 34:38",
            "label": "",
            "description": "Pablo Sarabia (Getafe) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "1 - 31:30",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 31:10",
            "label": "",
            "description": "This was a piece of cake for Guaita. Cristiano Ronaldo (Real Madrid) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper. Real Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 28:57",
            "label": "soccer-ball",
            "description": "It's in the back of the net! James Rodriguez plays it into the box, and Karim Benzema (Real Madrid) gets on the end of the cross to put it into the back of the net. 0:1."
        },
        {
            "gameTime": "1 - 28:36",
            "label": "",
            "description": "Gareth Bale (Real Madrid) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety."
        },
        {
            "gameTime": "1 - 28:10",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a teasing cross into the area, but Guaita intercepts the ball."
        },
        {
            "gameTime": "1 - 27:01",
            "label": "",
            "description": "Isco (Real Madrid) collects a pass and has an effort from 18 metres out, but it flies just wide of the left post."
        },
        {
            "gameTime": "1 - 25:07",
            "label": "",
            "description": "Half chance! Stefan Scepovic (Getafe) plays a pass into the box, but Keylor Navas reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 24:27",
            "label": "corner",
            "description": "The corner by James Rodriguez (Real Madrid) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 23:46",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) looks to break free, but an opposing player clears the ball away. Real Madrid get a corner."
        },
        {
            "gameTime": "1 - 23:32",
            "label": "",
            "description": "Alvaro Vazquez (Getafe) is penalised for a foul. Jose Luis Gonzalez had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 22:25",
            "label": "corner",
            "description": "Pablo Sarabia (Getafe) sends over a poor, overhit cross from the corner kick and the ball goes out of play."
        },
        {
            "gameTime": "1 - 22:13",
            "label": "",
            "description": "Pablo Sarabia (Getafe) unleashes a bullet of a shot that is blocked by a defender. The referee blows his whistle, Getafe are awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:05",
            "label": "",
            "description": "Pedro Leon (Getafe) pulls the jersey of one of the opposition players and Jose Luis Gonzalez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 19:03",
            "label": "",
            "description": "Pedro Leon (Getafe) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 17:57",
            "label": "",
            "description": "Isco (Real Madrid) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 17:02",
            "label": "corner",
            "description": "There's an opportunity for Pedro Leon (Getafe) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 16:47",
            "label": "",
            "description": "The Getafe players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball. The linesman makes the right call and Getafe will have a corner."
        },
        {
            "gameTime": "1 - 15:44",
            "label": "",
            "description": "What a chance that is! Cristiano Ronaldo (Real Madrid) wastes a huge opportunity as he receives a beautiful pass on the edge of the box and fires towards the net. Unfortunately for him, he only hits the left post!"
        },
        {
            "gameTime": "1 - 14:23",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 14:09",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a sweet pass into the penalty area, but one of the defenders averts the danger. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 13:05",
            "label": "",
            "description": "Gareth Bale (Real Madrid) receives a lofted pass and is given time inside the box to unleash a shot goalwards. The ball is directed towards the middle of the goal, but it lacks power and Guaita pulls off a comfortable save to thwart the effort."
        },
        {
            "gameTime": "1 - 10:46",
            "label": "",
            "description": "Pablo Sarabia (Getafe) unleashes a bullet of a shot that is blocked by a defender."
        },
        {
            "gameTime": "1 - 08:40",
            "label": "substitution",
            "description": "Juan Eduardo Esnaider is forced to make an unplanned substitution as Alvaro Pereira suffers an injury and Abdoul Karim Yoda (Getafe) comes on."
        },
        {
            "gameTime": "1 - 07:35",
            "label": "",
            "description": "Alvaro Pereira (Getafe) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 05:45",
            "label": "injury",
            "description": "Alvaro Pereira (Getafe) picks up an injury."
        },
        {
            "gameTime": "1 - 04:10",
            "label": "corner",
            "description": "The resulting corner from Gareth Bale (Real Madrid) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 03:46",
            "label": "",
            "description": "James Rodriguez (Real Madrid) shoots from the edge of the penalty area. The ball travels towards the right side of the target, but Guaita easily deals with the threat. The ball is out of play and Real Madrid manage to earn a corner."
        },
        {
            "gameTime": "1 - 02:48",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "1 - 02:41",
            "label": "",
            "description": "Isco (Real Madrid) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "1 - 02:06",
            "label": "",
            "description": "Gareth Bale (Real Madrid) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "1 - 01:11",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a low pass into the box, towards James Rodriguez. However, he takes one touch too many and loses it to one of the defenders."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Real Madrid will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jose Luis Gonzalez will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. Real Madrid had more of the game and were superior. Their manager will certainly be the happier of the two managers. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "16/04/2016 - 17:00",
    "gameHomeTeam": "Getafe",
    "gameScore": "1 - 5"
}