{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-10-29 - 19-30 Crystal Palace 2 - 4 Liverpool/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "What a terrific football game that was, with everything included. The away team was superior on the pitch today. The home players attempted to beat the opposition's defence using mostly counter attacks. The away team tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 49:23",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 48:37",
            "label": "",
            "description": "Emre Can (Liverpool) sends a cross into the box, but Steve Mandanda comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 46:52",
            "label": "substitution",
            "description": "Jurgen Klopp decides to make a substitution. Sadio Mane will be replaced by Ragnar Klavan (Liverpool)."
        },
        {
            "gameTime": "2 - 45:05",
            "label": "attendance",
            "description": "The attendance is 25628."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:49",
            "label": "substitution",
            "description": "Substitution. Divock Origi (Liverpool) in, Philippe Coutinho out."
        },
        {
            "gameTime": "2 - 43:11",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 42:47",
            "label": "",
            "description": "This was a piece of cake for Steve Mandanda. Philippe Coutinho (Liverpool) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 41:06",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) receives a quality pass and unleashes a rocket of a shot from distance, but his amazing effort goes just over the crossbar. The goalkeeper probably wouldn't have saved this one."
        },
        {
            "gameTime": "2 - 40:23",
            "label": "",
            "description": "Yohan Cabaye (Crystal Palace) attempts to find one of his teammates with a ball from a free kick outside the box. The goalkeeper climbs high above all the players in the box to intercept the cross and snuff out the opportunity."
        },
        {
            "gameTime": "2 - 40:20",
            "label": "substitution",
            "description": "A substitution has been made. James McArthur is replaced by Fraizer Campbell (Crystal Palace)."
        },
        {
            "gameTime": "2 - 39:42",
            "label": "",
            "description": "Roberto Firmino (Liverpool) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again. Crystal Palace will take a free kick."
        },
        {
            "gameTime": "2 - 37:51",
            "label": "",
            "description": "Andre Marriner blows for a foul after Christian Benteke (Crystal Palace) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 36:05",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 34:06",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) goes on a mazy run through the defence and gets within shooting range inside the box, but his effort to the left post is thwarted by Steve Mandanda."
        },
        {
            "gameTime": "2 - 33:21",
            "label": "",
            "description": "Roberto Firmino (Liverpool) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 30:13",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to substitute Adam Lallana and he is replaced by Georginio Wijnaldum (Liverpool)."
        },
        {
            "gameTime": "2 - 28:42",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Jason Puncheon (Crystal Palace) comes onto the pitch so that Joe Ledley can be given a rest."
        },
        {
            "gameTime": "2 - 28:04",
            "label": "",
            "description": "A neat pass is well received by Wilfried Zaha (Crystal Palace), who is lurking on the edge of the box and strikes the ball on goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "2 - 26:05",
            "label": "y-card",
            "description": "Roberto Firmino (Liverpool) picks up a yellow card for an infringement."
        },
        {
            "gameTime": "2 - 25:40",
            "label": "soccer-ball",
            "description": "Goal! Jordan Henderson finds Roberto Firmino (Liverpool) on the edge of the area, he times his run to perfection and beautifully chips the ball over the goalkeeper. 2:4."
        },
        {
            "gameTime": "2 - 23:19",
            "label": "",
            "description": "Flag up against James McArthur (Crystal Palace). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 22:22",
            "label": "",
            "description": "Joel Ward (Crystal Palace) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 20:55",
            "label": "substitution",
            "description": "Andros Townsend (Crystal Palace) joins the action as a substitute, replacing Chung Yong Lee."
        },
        {
            "gameTime": "2 - 19:24",
            "label": "",
            "description": "Roberto Firmino (Liverpool) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "2 - 16:54",
            "label": "y-card",
            "description": "Andre Marriner shows the yellow card to Yohan Cabaye (Crystal Palace) for a heavy challenge."
        },
        {
            "gameTime": "2 - 16:26",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) strikes a promising volley towards goal, but one of the defenders is quick enough to step in and make a crucial block."
        },
        {
            "gameTime": "2 - 14:24",
            "label": "corner",
            "description": "Yohan Cabaye (Crystal Palace) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 14:02",
            "label": "",
            "description": "Yohan Cabaye (Crystal Palace) dribbles into the box, but Loris Karius is quick enough to come off his line and stop him. The ball is out of play. Crystal Palace will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 12:36",
            "label": "",
            "description": "Roberto Firmino (Liverpool) commits a rough challenge and Andre Marriner blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "",
            "description": "Christian Benteke (Crystal Palace) receives a precise low pass inside the box, controls it and sends it straight at Loris Karius, who makes a comfortable save."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "",
            "description": "Great touch by Sadio Mane (Liverpool) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "2 - 06:50",
            "label": "corner",
            "description": "Yohan Cabaye (Crystal Palace) takes a short corner kick."
        },
        {
            "gameTime": "2 - 06:29",
            "label": "",
            "description": "Joel Ward (Crystal Palace) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. Crystal Palace have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 06:10",
            "label": "",
            "description": "Martin Kelly (Crystal Palace) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 04:33",
            "label": "",
            "description": "Christian Benteke (Crystal Palace) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "2 - 04:30",
            "label": "corner",
            "description": "Yohan Cabaye (Crystal Palace) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 03:42",
            "label": "",
            "description": "Christian Benteke (Crystal Palace) latches on to a precise pass and one on one with the keeper slams the ball towards the right hand post. Loris Karius is alert, though, and leaps like a salmon to deny him. Corner kick. Crystal Palace will have an opportunity."
        },
        {
            "gameTime": "2 - 03:17",
            "label": "y-card",
            "description": "Booking. Emre Can (Liverpool) receives a caution from the referee."
        },
        {
            "gameTime": "2 - 02:29",
            "label": "",
            "description": "Chung Yong Lee (Crystal Palace) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "2 - 00:46",
            "label": "",
            "description": "James McArthur (Crystal Palace) should know this behaviour is beyond the rules. He was too careless with his challenge and left Andre Marriner no option but to blow his whistle."
        },
        {
            "gameTime": "2 - 00:34",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "There was plenty of entertainment during the first 45 minutes. Hopefully more of the same in the second half. The visitors are mostly controlling the match and making it tough for the home side to keep up. The home players attempt to beat the opposition's defence using mostly counter attacks. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 48:30",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 48:00",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) takes the resultant free kick from the edge of the box and tries to find one of his teammates with a cross, but the keeper climbs high and gets to it first, collecting the ball with ease."
        },
        {
            "gameTime": "1 - 47:55",
            "label": "",
            "description": "Andre Marriner interrupts the game. One of the players from Crystal Palace won the ball, but his effort is adjudged unfair. Liverpool win a free kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "1 - 43:33",
            "label": "soccer-ball",
            "description": "The score has changed – 2:3. Philippe Coutinho sends a fantastic cross into the box from the corner. Joel Matip (Liverpool) jumps highest and plants a header into the top of the net."
        },
        {
            "gameTime": "1 - 42:54",
            "label": "corner",
            "description": "Philippe Coutinho (Liverpool) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 42:43",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. It will be a corner kick for Liverpool."
        },
        {
            "gameTime": "1 - 42:04",
            "label": "",
            "description": "Yohan Cabaye (Crystal Palace) swings a cross into the box, but it's far too close to Loris Karius, who smothers the ball."
        },
        {
            "gameTime": "1 - 40:01",
            "label": "",
            "description": "Adam Lallana (Liverpool) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 39:27",
            "label": "",
            "description": "Yohan Cabaye (Crystal Palace) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 38:49",
            "label": "",
            "description": "Roberto Firmino (Liverpool) receives a pass and tries his luck with a shot from 20 metres out. Steve Mandanda pulls off a comfortable save to stop the effort going into the middle of the goal."
        },
        {
            "gameTime": "1 - 37:23",
            "label": "",
            "description": "Sadio Mane (Liverpool) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies just over the crossbar."
        },
        {
            "gameTime": "1 - 36:58",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) meets a nice cross deep inside the 18 yard box and produces a fine header towards the left post, but the goalkeeper is well positioned and punches the ball away, deflecting it onto the post."
        },
        {
            "gameTime": "1 - 36:10",
            "label": "",
            "description": "Christian Benteke (Crystal Palace) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 35:45",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from James McArthur (Crystal Palace)."
        },
        {
            "gameTime": "1 - 34:52",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "1 - 34:04",
            "label": "",
            "description": "Wilfried Zaha (Crystal Palace) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 32:29",
            "label": "soccer-ball",
            "description": "Wilfried Zaha sends a superb cross into the box. James McArthur (Crystal Palace) latches on to it and from near the penalty spot powers a header inside the right post, leaving Loris Karius beaten. He displayed his eye for goal there excellent finish. The score is 2:2."
        },
        {
            "gameTime": "1 - 31:47",
            "label": "",
            "description": "Roberto Firmino (Liverpool) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 31:00",
            "label": "",
            "description": "Chung Yong Lee (Crystal Palace) trips an opposition player and Andre Marriner signals a foul."
        },
        {
            "gameTime": "1 - 29:06",
            "label": "",
            "description": "Alberto Moreno (Liverpool) expertly controls a neat clever pass inside the box, but his effort crashes against the left post! What an opportunity that was!"
        },
        {
            "gameTime": "1 - 27:12",
            "label": "",
            "description": "Adam Lallana (Liverpool) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net."
        },
        {
            "gameTime": "1 - 26:25",
            "label": "",
            "description": "Sadio Mane (Liverpool) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the right post."
        },
        {
            "gameTime": "1 - 24:46",
            "label": "",
            "description": "Alberto Moreno (Liverpool) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "1 - 23:33",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Roberto Firmino (Liverpool). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "1 - 20:55",
            "label": "soccer-ball",
            "description": "Gooal! Philippe Coutinho takes over corner duties. Dejan Lovren (Liverpool) gets his head on the ball from the corner and puts it low into the middle of the net. 1:2."
        },
        {
            "gameTime": "1 - 20:51",
            "label": "corner",
            "description": "Philippe Coutinho (Liverpool) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 20:45",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The referee and one of his assistants signal for a corner kick to Liverpool."
        },
        {
            "gameTime": "1 - 20:23",
            "label": "corner",
            "description": "The corner kick from Philippe Coutinho (Liverpool) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 20:09",
            "label": "",
            "description": "Sadio Mane (Liverpool) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Liverpool force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 17:58",
            "label": "soccer-ball",
            "description": "Goal! A defensive error presents James McArthur (Crystal Palace) with a great chance and he takes advantage of it by heading the ball into the back of the net. 1:1."
        },
        {
            "gameTime": "1 - 17:10",
            "label": "",
            "description": "Sadio Mane (Liverpool) dribbles into the box, but Steve Mandanda is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "1 - 15:55",
            "label": "soccer-ball",
            "description": "Goal Emre Can (Liverpool)! Emre Can (Liverpool) was put through by Alberto Moreno and he showed brilliant composure inside the box to bury the ball into the back of the net. 0:1."
        },
        {
            "gameTime": "1 - 12:38",
            "label": "",
            "description": "Joe Ledley (Crystal Palace) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 10:57",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 07:53",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "1 - 07:15",
            "label": "",
            "description": "One of the Crystal Palace players commits a holding foul and the referee reaches for his whistle."
        },
        {
            "gameTime": "1 - 05:26",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) is flagged for offside."
        },
        {
            "gameTime": "1 - 03:23",
            "label": "",
            "description": "Sadio Mane (Liverpool) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 00:54",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 00:30",
            "label": "",
            "description": "The players are out at last! Liverpool will take the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Andre Marriner will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool have not tasted defeat in their last 7 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Crystal Palace players were unable to win in their last 3 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Already 5 Liverpool matches finished 2:1, it's their most frequent result this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a terrific football game that was, with everything included. The away team was superior on the pitch today. The home players attempted to beat the opposition's defence using mostly counter attacks. The away team tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Liverpool",
    "gameDate": "29/10/2016 - 19:30",
    "gameHomeTeam": "Crystal Palace",
    "gameScore": "2 - 4"
}