{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-11-04 - 22-45 Arsenal 3 - 3 Anderlecht/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. The superiority of the away team was evident on the pitch today. The home side attempted to hold onto the ball for as long as possible. The away team was pressing and leaving the opponents little space for combination play."
        },
        {
            "gameTime": "2 - 49:09",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 49:02",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Santi Cazorla (Arsenal), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "2 - 48:22",
            "label": "",
            "description": "Dennis Praet (Anderlecht) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Clement Turpin with no other option than to blow for a foul. Arsenal earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 47:41",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Anthony Vanden Borre (Anderlecht) was quite harsh and Clement Turpin didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 46:31",
            "label": "",
            "description": "Lukas Podolski (Arsenal) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the right post."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:41",
            "label": "soccer-ball",
            "description": "Goal! Andy Najar clips a neat ball into the box in the direction of Aleksandar Mitrovic (Anderlecht), who jumps highest and steers a bullet header from the centre of the box into the bottom right corner. Wojciech Szczesny had no chance of stopping that. 3:2."
        },
        {
            "gameTime": "2 - 43:34",
            "label": "y-card",
            "description": "Aleksandar Mitrovic (Anderlecht) receives a yellow card for talking out of turn to the referee."
        },
        {
            "gameTime": "2 - 42:47",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) unleashes a shot from a mid range free kick that goes high over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "2 - 41:40",
            "label": "y-card",
            "description": "Sacha Kljestan (Anderlecht) is booked after bringing down an opponent. Clement Turpin had an easy decision to make. Free kick. Arsenal will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 41:11",
            "label": "",
            "description": "Santi Cazorla (Arsenal) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 40:28",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Anthony Vanden Borre (Anderlecht). Clement Turpin saw the sliding tackle and blows for a foul. Arsenal win a free kick."
        },
        {
            "gameTime": "2 - 38:40",
            "label": "",
            "description": "Close! Frank Acheampong (Anderlecht) picks up the ball in space and from inside the penalty area sends a shot narrowly over the bar."
        },
        {
            "gameTime": "2 - 36:23",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Danny Welbeck walks off the pitch to be replaced by Lukas Podolski (Arsenal)."
        },
        {
            "gameTime": "2 - 35:52",
            "label": "substitution",
            "description": "Substitution. Alex Oxlade Chamberlain leaves the pitch and is replaced by Tomas Rosicky (Arsenal)."
        },
        {
            "gameTime": "2 - 34:07",
            "label": "corner",
            "description": "The corner from Youri Tielemans (Anderlecht) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 33:54",
            "label": "",
            "description": "Aleksandar Mitrovic (Anderlecht) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The ball goes out of play. Anderlecht are awarded a corner kick."
        },
        {
            "gameTime": "2 - 32:58",
            "label": "",
            "description": "Youri Tielemans (Anderlecht) produces a mid range free kick and sends a daisy cutter towards the left post, but the goalkeeper makes a good save and stops his effort."
        },
        {
            "gameTime": "2 - 31:47",
            "label": "",
            "description": "Clement Turpin blows his whistle after Alex Oxlade Chamberlain (Arsenal) brings one of his opponents down with a strong tackle. Anderlecht get a free kick."
        },
        {
            "gameTime": "2 - 30:46",
            "label": "",
            "description": "Santi Cazorla (Arsenal) wasted a huge opportunity! The fans already began to celebrate as he produced a shot from the edge of the box after a brilliant solo effort. The ball went towards the bottom right corner, but Silvio Proto made an astonishing save!"
        },
        {
            "gameTime": "2 - 30:06",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 29:43",
            "label": "",
            "description": "Calum Chambers (Arsenal) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. The referee and one of his assistants signal for a corner kick to Arsenal."
        },
        {
            "gameTime": "2 - 27:03",
            "label": "soccer-ball",
            "description": "Anthony Vanden Borre (Anderlecht) slots home the penalty after firing the ball in the opposite direction to which the goalkeeper dives!"
        },
        {
            "gameTime": "2 - 26:15",
            "label": "y-card",
            "description": "Clement Turpin shows a yellow card to Nacho Monreal (Arsenal) for his blatant foul. A penalty is awarded to Anderlecht!"
        },
        {
            "gameTime": "2 - 24:16",
            "label": "",
            "description": "Danny Welbeck (Arsenal) rises highest from the corner to head at goal, but his low effort towards the middle of the goal is comfortably saved by the goalkeeper."
        },
        {
            "gameTime": "2 - 24:02",
            "label": "corner",
            "description": "The referee awards a corner and Santi Cazorla (Arsenal) goes over to take it."
        },
        {
            "gameTime": "2 - 23:03",
            "label": "",
            "description": "The Arsenal players find open spaces, and they are able to move the ball from one to another. But now comes an error, and they involuntarily pass the ball to their opponent."
        },
        {
            "gameTime": "2 - 21:10",
            "label": "corner",
            "description": "Youri Tielemans (Anderlecht) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "2 - 20:41",
            "label": "",
            "description": "Frank Acheampong (Anderlecht) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The linesman makes the right call and Anderlecht will have a corner."
        },
        {
            "gameTime": "2 - 19:20",
            "label": "corner",
            "description": "Youri Tielemans (Anderlecht) launches a cross from the corner, but Wojciech Szczesny is alert to thwart the effort."
        },
        {
            "gameTime": "2 - 19:09",
            "label": "",
            "description": "Andy Kawaya (Anderlecht) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee points to the corner flag. It's a corner to Anderlecht."
        },
        {
            "gameTime": "2 - 17:03",
            "label": "",
            "description": "Clement Turpin blows for a foul after Aleksandar Mitrovic (Anderlecht) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 16:31",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Mathieu Flamini (Arsenal) is coming onto the pitch as Mikel Arteta cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 16:17",
            "label": "substitution",
            "description": "We are about to witness a substitution. Aleksandar Mitrovic (Anderlecht) is replacing Cyriac Gohi Bi."
        },
        {
            "gameTime": "2 - 15:37",
            "label": "soccer-ball",
            "description": "Goal! Anthony Vanden Borre (Anderlecht) finishes from close range with an easy finish and he makes it 3:1. He was ably assisted there by Andy Kawaya."
        },
        {
            "gameTime": "2 - 12:49",
            "label": "soccer-ball",
            "description": "Alex Oxlade Chamberlain (Arsenal) makes a great solo run and pulls the trigger from inside the box, beating Silvio Proto with a strike into the bottom right corner. He makes it 3:0."
        },
        {
            "gameTime": "2 - 12:21",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 11:47",
            "label": "",
            "description": "Arsenal slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "2 - 09:40",
            "label": "",
            "description": "What a wasted chance that was! An inch perfect cross into the box finds Danny Welbeck (Arsenal) who sends his header well wide of the right post."
        },
        {
            "gameTime": "2 - 07:59",
            "label": "substitution",
            "description": "Chancel Mbemba is not able to continue due to his injury and will be replaced by Leander Dendoncker (Anderlecht)."
        },
        {
            "gameTime": "2 - 05:41",
            "label": "injury",
            "description": "Chancel Mbemba (Anderlecht) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 03:04",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 02:35",
            "label": "",
            "description": "Arsenal keep the ball well and push forward with purpose, but here comes an interception from the opposition. The ball leaves the pitch. Arsenal have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:46",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The need to improve in the second half has brought about a change. Ibrahima Conte comes off for Andy Kawaya (Anderlecht)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Clement Turpin blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. The home side is dominant and dictating the tempo of the game, mainly because of their work rate and accurate passing. The home side display their usual fluent passing, while the visitors use their organization to stop the build up and launch counter attacks."
        },
        {
            "gameTime": "1 - 46:24",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Clement Turpin has ended it."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "",
            "description": "Santi Cazorla (Arsenal) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:31",
            "label": "injury",
            "description": "Aaron Ramsey (Arsenal) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 44:07",
            "label": "",
            "description": "Sacha Kljestan (Anderlecht) was trying to get to the ball but clattered into the legs of the opponent as well. Clement Turpin blows his whistle for an infringement. Arsenal will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 42:57",
            "label": "",
            "description": "Clement Turpin interrupts the game for a tactical foul by Mikel Arteta (Arsenal)."
        },
        {
            "gameTime": "1 - 42:37",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 42:20",
            "label": "corner",
            "description": "Arsenal's players are in a nice combination. They show their ability to keep the ball possession, sending it precisely from one to another. But now the final pass is intercepted. Arsenal earn a corner."
        },
        {
            "gameTime": "1 - 41:04",
            "label": "corner",
            "description": "The resulting corner from Santi Cazorla (Arsenal) comes to nothing."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "",
            "description": "CHANCE! Danny Welbeck (Arsenal) goes very close! He gathers a cross inside the box and fires a low shot to the bottom left corner, but Silvio Proto produces an excellent save. Arsenal have a corner."
        },
        {
            "gameTime": "1 - 40:20",
            "label": "",
            "description": "A pass from Cyriac Gohi Bi (Anderlecht) is intercepted by Wojciech Szczesny and the move breaks down."
        },
        {
            "gameTime": "1 - 38:30",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the right post."
        },
        {
            "gameTime": "1 - 36:50",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "1 - 35:44",
            "label": "",
            "description": "Long passes, short passes and one two passes. Arsenal are showcasing great team work by keeping possession and producing pin point passes from player to player. The opposition's players are finding it very difficult to intercept at the moment."
        },
        {
            "gameTime": "1 - 34:15",
            "label": "corner",
            "description": "A dangerous looking corner kick from Youri Tielemans (Anderlecht) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 33:49",
            "label": "corner",
            "description": "The corner from Youri Tielemans (Anderlecht) is intercepted by the defence. The ball is out of play. A goal scoring opportunity from a corner for Anderlecht."
        },
        {
            "gameTime": "1 - 33:23",
            "label": "",
            "description": "Dennis Praet (Anderlecht) gets on the end of a pass on the edge of the box but his shot is blocked. Anderlecht have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 32:27",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Santi Cazorla (Arsenal), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 32:02",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) takes the corner which is cleared. The referee signals a corner kick to Arsenal."
        },
        {
            "gameTime": "1 - 31:38",
            "label": "",
            "description": "Arsenal display good ball movement. They are waiting for some opportunity to get in a chance, but now the attack is averted. It will be a corner kick for Arsenal."
        },
        {
            "gameTime": "1 - 30:24",
            "label": "",
            "description": "Youri Tielemans (Anderlecht) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 29:41",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) brings an opponent down and Clément Turpin interrupts the game. A free kick to Anderlecht."
        },
        {
            "gameTime": "1 - 28:27",
            "label": "soccer-ball",
            "description": "Goal! Alexis Sanchez (Arsenal) picks up the ball from a rebound and from the edge of the box he unleashes a low shot into the bottom right corner. Silvio Proto is unable to keep the ball out of the net. It's 2:0."
        },
        {
            "gameTime": "1 - 28:20",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) takes the free kick from the edge of the box, but the goalkeeper perfectly sets up the defensive wall and his effort is thwarted."
        },
        {
            "gameTime": "1 - 27:17",
            "label": "",
            "description": "Clement Turpin blows his whistle and signals a foul after Anthony Vanden Borre (Anderlecht) brought his opponent down. Arsenal win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 25:51",
            "label": "",
            "description": "Anderlecht seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 24:03",
            "label": "soccer-ball",
            "description": "Mikel Arteta (Arsenal) sends Silvio Proto the wrong way and fires the penalty into the middle of the goal!"
        },
        {
            "gameTime": "1 - 23:41",
            "label": "penalty",
            "description": "Clement Turpin couldn't ignore the rough tackle by Chancel Mbemba (Anderlecht) and blew his whistle. The referee points to the penalty spot. It's a penalty for Arsenal!"
        },
        {
            "gameTime": "1 - 23:17",
            "label": "",
            "description": "Dennis Praet (Anderlecht) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 22:38",
            "label": "",
            "description": "Calum Chambers (Arsenal) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 21:00",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) expertly controls a neat clever pass inside the box, but his effort crashes against the right post! What an opportunity that was!"
        },
        {
            "gameTime": "1 - 20:04",
            "label": "",
            "description": "Cyriac Gohi Bi (Anderlecht) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 17:54",
            "label": "",
            "description": "Great teamplay by Arsenal as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 16:10",
            "label": "",
            "description": "Sacha Kljestan (Anderlecht) produced a promising shot towards the middle of the goal after his wonderful solo run, but Wojciech Szczesny thwarted him with a fabulous save and the score remains the same."
        },
        {
            "gameTime": "1 - 14:25",
            "label": "",
            "description": "Good movement by Kieran Gibbs (Arsenal), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "1 - 12:12",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 11:41",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. The ball is out of play and Arsenal manage to earn a corner."
        },
        {
            "gameTime": "1 - 09:34",
            "label": "",
            "description": "Calum Chambers (Arsenal) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 08:49",
            "label": "corner",
            "description": "Youri Tielemans (Anderlecht) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 08:27",
            "label": "",
            "description": "Dennis Praet (Anderlecht) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. Good work from Anderlecht as they win a corner."
        },
        {
            "gameTime": "1 - 07:01",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the left post."
        },
        {
            "gameTime": "1 - 06:47",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 05:22",
            "label": "corner",
            "description": "Wojciech Szczesny comes off his line to intercept the corner from Youri Tielemans (Anderlecht)."
        },
        {
            "gameTime": "1 - 05:04",
            "label": "",
            "description": "Ibrahima Conte (Anderlecht) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Anderlecht will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 03:51",
            "label": "",
            "description": "Calum Chambers (Arsenal) robs an opponent of the ball and explodes in anger when Clement Turpin blows for a foul."
        },
        {
            "gameTime": "1 - 03:24",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Kieran Gibbs (Arsenal)."
        },
        {
            "gameTime": "1 - 02:28",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 01:46",
            "label": "",
            "description": "The players are on the pitch and Arsenal will have the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Clement Turpin will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. The superiority of the away team was evident on the pitch today. The home side attempted to hold onto the ball for as long as possible. The away team was pressing and leaving the opponents little space for combination play."
        }
    ],
    "gameAwayTeam": "Anderlecht",
    "gameDate": "04/11/2014 - 22:45",
    "gameHomeTeam": "Arsenal",
    "gameScore": "3 - 3"
}