{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2017-04-26 - 21-45 Arsenal 1 - 0 Leicester/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 51:10",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 50:00",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Robert Huth (Leicester). Mike Jones saw the sliding tackle and blows for a foul. Arsenal will take a free kick near the side line."
        },
        {
            "gameTime": "2 - 49:00",
            "label": "y-card",
            "description": "Robert Huth (Leicester) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 48:23",
            "label": "",
            "description": "Riyad Mahrez (Leicester) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 47:57",
            "label": "y-card",
            "description": "A yellow card is awarded to Alexis Sanchez (Arsenal)."
        },
        {
            "gameTime": "2 - 45:19",
            "label": "",
            "description": "Olivier Giroud (Arsenal) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:54",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Yohan Benalouane departs the field of play to be replaced by Demarai Gray (Leicester)."
        },
        {
            "gameTime": "2 - 43:45",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Mesut Ozil (Arsenal) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "soccer-ball-own",
            "description": "Robert Huth (Leicester) scores an unfortunate own goal after deflecting the ball into his own net!"
        },
        {
            "gameTime": "2 - 40:55",
            "label": "",
            "description": "Nacho Monreal (Arsenal) receives a good pass and from just outside the box he unleashes a promising strike, but the shot is blocked by the defender."
        },
        {
            "gameTime": "2 - 39:14",
            "label": "",
            "description": "The foul by Olivier Giroud (Arsenal) was seen by Mike Jones who didn't hesitate to blow the whistle. Leicester are awarded the free kick."
        },
        {
            "gameTime": "2 - 39:05",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 38:42",
            "label": "",
            "description": "Mesut Ozil (Arsenal) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee points to the corner flag and Arsenal will take a corner."
        },
        {
            "gameTime": "2 - 36:34",
            "label": "y-card",
            "description": "The foul by Granit Xhaka (Arsenal) is worthy of a card and a yellow is duly shown by Mike Jones."
        },
        {
            "gameTime": "2 - 34:46",
            "label": "y-card",
            "description": "A yellow card for a tackle by Yohan Benalouane (Leicester). Mike Jones doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 34:26",
            "label": "",
            "description": "Laurent Koscielny (Arsenal) is able to continue to play."
        },
        {
            "gameTime": "2 - 33:22",
            "label": "injury",
            "description": "Laurent Koscielny (Arsenal) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 32:43",
            "label": "",
            "description": "Shinji Okazaki (Leicester) breaks into the penalty area but his shot is blocked."
        },
        {
            "gameTime": "2 - 30:11",
            "label": "",
            "description": "This was a piece of cake for Petr Cech. Jamie Vardy (Leicester) found himself some space after latching on to a pass, but his strike only went low to the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 29:38",
            "label": "substitution",
            "description": "Arsene Wenger has decided to make a change. Olivier Giroud (Arsenal) replaces Theo Walcott."
        },
        {
            "gameTime": "2 - 29:22",
            "label": "substitution",
            "description": "Substitution. Aaron Ramsey (Arsenal) on for Francis Coquelin."
        },
        {
            "gameTime": "2 - 27:41",
            "label": "attendance",
            "description": "The attendance for today's match is 59829."
        },
        {
            "gameTime": "2 - 26:33",
            "label": "",
            "description": "Granit Xhaka (Arsenal) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "2 - 26:15",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 25:52",
            "label": "",
            "description": "Danny Welbeck (Arsenal) produces a poor pass. He attempts to get the ball into the box but it's hacked away. It will be a corner kick for Arsenal."
        },
        {
            "gameTime": "2 - 24:18",
            "label": "substitution",
            "description": "Here is a change. Leonardo Ulloa is going off and Craig Shakespeare gives the last tactical orders to Shinji Okazaki (Leicester)."
        },
        {
            "gameTime": "2 - 22:52",
            "label": "substitution",
            "description": "A substitution has been made. Kieran Gibbs goes off and Danny Welbeck (Arsenal) comes on."
        },
        {
            "gameTime": "2 - 21:34",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 21:08",
            "label": "",
            "description": "Jamie Vardy (Leicester) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 20:39",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the left post. Kasper Schmeichel has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 20:25",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 20:11",
            "label": "",
            "description": "Hector Bellerin (Arsenal) looks to break free, but an opposing player clears the ball away. Arsenal will take a corner kick."
        },
        {
            "gameTime": "2 - 19:26",
            "label": "",
            "description": "Laurent Koscielny (Arsenal) attempts to convert a cross into a goal, but his promising header from near the penalty spot low towards the middle of the net is denied by Kasper Schmeichel. This effort didn't really trouble him."
        },
        {
            "gameTime": "2 - 19:17",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 18:59",
            "label": "",
            "description": "Mesut Ozil (Arsenal) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort. Arsenal have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 16:25",
            "label": "corner",
            "description": "A dangerous looking corner kick from Mesut Ozil (Arsenal) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 16:10",
            "label": "",
            "description": "A cross into the box from Theo Walcott (Arsenal) is cleared. Arsenal will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 15:03",
            "label": "",
            "description": "The linesman raises his flag for offside before Leonardo Ulloa (Leicester) heads on."
        },
        {
            "gameTime": "2 - 13:35",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 13:10",
            "label": "",
            "description": "Granit Xhaka (Arsenal) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the right post. Kasper Schmeichel has a clear sight of it and makes a comfortable save. The linesman makes the right call and Arsenal will have a corner."
        },
        {
            "gameTime": "2 - 10:39",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 08:51",
            "label": "",
            "description": "Wilfred Ndidi (Leicester) creates himself some space around the penalty spot and connects with the free kick. His header would probably have ended up low inside the middle of the goal, but Petr Cech pulls off a comfortable save to thwart him."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "y-card",
            "description": "Christian Fuchs (Leicester) sees a yellow card from Mike Jones after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 03:46",
            "label": "",
            "description": "Mike Jones blows his whistle and it's Theo Walcott (Arsenal) who is penalised for an offensive foul. Good decision by the referee. Leicester get a free kick."
        },
        {
            "gameTime": "2 - 01:01",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 00:44",
            "label": "",
            "description": "Hector Bellerin (Arsenal) produces a lovely chip pass into the box, but one of the opposition players cuts it out. The ball is out of play and the linesman points at the corner flag. Corner to Arsenal."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Mike Jones blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 46:07",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:15",
            "label": "",
            "description": "OFF THE CROSSBAR! Alexis Sanchez (Arsenal) runs towards the goal to give his teammate support. He receives a fantastic pass and shoots from the edge of the box, but it crashes against the crossbar. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 42:07",
            "label": "",
            "description": "Flag up against Nacho Monreal (Arsenal). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 41:31",
            "label": "",
            "description": "Theo Walcott (Arsenal) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 39:05",
            "label": "",
            "description": "Riyad Mahrez (Leicester) and his stunning dribble! He zig zags through the defence and gets in front of the keeper. He faints to shoot and then suddenly strikes goalwards, but his effort misses the target by a whisker. Very unlucky for Riyad Mahrez (Leicester). This could have been a legendary goal."
        },
        {
            "gameTime": "1 - 37:30",
            "label": "y-card",
            "description": "Mike Jones shows the yellow card to Danny Simpson (Leicester) for a heavy challenge."
        },
        {
            "gameTime": "1 - 35:44",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) is caught offside!"
        },
        {
            "gameTime": "1 - 34:28",
            "label": "",
            "description": "Mesut Ozil (Arsenal) whips a long ball in from the free kick which is intercepted by Kasper Schmeichel."
        },
        {
            "gameTime": "1 - 34:03",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) pulls the jersey of one of the opposition players and Mike Jones blows his whistle for a foul. A free kick has been awarded to Arsenal."
        },
        {
            "gameTime": "1 - 31:17",
            "label": "",
            "description": "The linesman signals that Francis Coquelin (Arsenal) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 30:59",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 30:35",
            "label": "",
            "description": "Hector Bellerin (Arsenal) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. The ball goes out of play. Arsenal are awarded a corner kick."
        },
        {
            "gameTime": "1 - 28:05",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 27:53",
            "label": "",
            "description": "Hector Bellerin (Arsenal) tries to pass the ball into the penalty area but it's blocked. The referee and his assistant both point at the corner flag. Arsenal will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 27:27",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 27:05",
            "label": "",
            "description": "Theo Walcott (Arsenal) unleashes a promising shot towards the right side of the goal after his wonderful solo run, but Kasper Schmeichel thwarts the effort with a fabulous save. The score remains the same. Corner kick. Arsenal will have an opportunity."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "",
            "description": "Gabriel (Arsenal) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 25:24",
            "label": "injury",
            "description": "Gabriel (Arsenal) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 24:16",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 22:24",
            "label": "corner",
            "description": "The corner from Riyad Mahrez (Leicester) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 21:56",
            "label": "",
            "description": "Well positioned Riyad Mahrez (Leicester) was first to the rebound and fired in a shot towards the top of the net, but Petr Cech reacted superbly to keep the ball out. The fans could not believe their eyes. It was a miraculous stop! Leicester force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 20:48",
            "label": "",
            "description": "The Arsenal players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball. The ball is out of play. Leicester will take a throw in."
        },
        {
            "gameTime": "1 - 18:12",
            "label": "",
            "description": "Granit Xhaka (Arsenal) attempts to put the ball in from a rebound with his long range shot, but it isn't accurate enough, and the ball goes high over the crossbar."
        },
        {
            "gameTime": "1 - 16:27",
            "label": "corner",
            "description": "Theo Walcott (Arsenal) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 15:51",
            "label": "",
            "description": "Kasper Schmeichel blocks a long range effort from Francis Coquelin (Arsenal) towards the bottom left corner. Arsenal have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 10:58",
            "label": "",
            "description": "Hector Bellerin (Arsenal) whips a promising cross into the box, but the opposition's defence intercepts the ball. The referee and the linesman both signal a throw in for Arsenal."
        },
        {
            "gameTime": "1 - 08:08",
            "label": "",
            "description": "Theo Walcott (Arsenal) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 06:29",
            "label": "",
            "description": "What a chance! The ball is inside the box and Jamie Vardy (Leicester) takes a first time shot on goal, but his volley goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 05:45",
            "label": "",
            "description": "Marc Albrighton (Leicester) takes a short free kick."
        },
        {
            "gameTime": "1 - 03:33",
            "label": "",
            "description": "Riyad Mahrez (Leicester) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Hector Bellerin (Arsenal), but the defence gets it clear. The ball is out of play. Leicester will have a throw in."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Leicester will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Mike Jones."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There has been under 2.5 goals in 13 out of the 36 games that Leicester have played this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "In the 36 games that Arsenal have played so far this season, 24 have had over 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Arsenal players have been gifted 6 penalties this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        }
    ],
    "gameAwayTeam": "Leicester",
    "gameDate": "26/04/2017 - 21:45",
    "gameHomeTeam": "Arsenal",
    "gameScore": "1 - 0"
}