{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-09-19 - 17-00 Real Madrid 1 - 0 Granada CF/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. Real Madrid were better today and displayed masterful control and movement. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 49:04",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 46:34",
            "label": "attendance",
            "description": "The attendance for today's match is 71786."
        },
        {
            "gameTime": "2 - 45:52",
            "label": "corner",
            "description": "The resulting corner, taken by Luka Modric (Real Madrid), comes to nothing."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "",
            "description": "A lofted cross from is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Real Madrid get a corner."
        },
        {
            "gameTime": "2 - 44:59",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:06",
            "label": "",
            "description": "Javier Marquez (Granada CF) decides to have a shot at goal from the free kick, but it hits the defensive wall."
        },
        {
            "gameTime": "2 - 43:29",
            "label": "",
            "description": "Poor challenge! Pepe (Real Madrid) is penalised for tripping and Juan Martinez Munuera blows his whistle. Granada CF win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 41:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) picks up a long through ball, but Andres Fernandez deserves praise for a brilliant reaction and interception."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "substitution",
            "description": "Rafael Benitez has decided to substitute Isco and he is replaced by Casemiro (Real Madrid)."
        },
        {
            "gameTime": "2 - 38:36",
            "label": "",
            "description": "What a chance! The ball rebounds out to Denis Cheryshev (Real Madrid) and his strike from the edge of the box goes narrowly wide of the right post. The ball is off of the pitch and it's a goal kick for Granada CF."
        },
        {
            "gameTime": "2 - 37:23",
            "label": "",
            "description": "Javier Marquez (Granada CF) brings an opponent down and Juan Martinez Munuera interrupts the game. Real Madrid are awarded a free kick."
        },
        {
            "gameTime": "2 - 35:31",
            "label": "",
            "description": "Real Madrid keep possession of the ball by producing one two passes, but an opponent steps in and wins the ball."
        },
        {
            "gameTime": "2 - 34:34",
            "label": "y-card",
            "description": "A yellow card for a tackle by Rene Krhin (Granada CF). Juan Martinez Munuera doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 31:59",
            "label": "substitution",
            "description": "Here is a change. Karim Benzema is going off and Rafael Benitez gives the last tactical orders to Denis Cheryshev (Real Madrid)."
        },
        {
            "gameTime": "2 - 31:48",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Nicolas Lopez (Granada CF) for Edgar Mendez."
        },
        {
            "gameTime": "2 - 29:22",
            "label": "",
            "description": "Rene Krhin (Granada CF) wins the ball after the corner kick and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 28:24",
            "label": "corner",
            "description": "Fran Rico (Granada CF) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 28:05",
            "label": "",
            "description": "Youseff El Arabi (Granada CF) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play. Granada CF are awarded a corner kick."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to produce a decent enough free kick for a player of his ability and the only target that he finds is the wall of defenders in front of him."
        },
        {
            "gameTime": "2 - 26:59",
            "label": "",
            "description": "A player from Granada CF takes his opponent down, the referee blows his whistle for a foul. Real Madrid earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 25:59",
            "label": "",
            "description": "Luka Modric (Real Madrid) whips a long ball in from the free kick which is intercepted by Andres Fernandez."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "y-card",
            "description": "Javier Marquez (Granada CF) takes out his opponent with a horrific tackle and is relieved when the referee only shows him a yellow card."
        },
        {
            "gameTime": "2 - 24:22",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 24:08",
            "label": "",
            "description": "sends a pass into the box, but his attempt is thwarted and cleared. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 22:34",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 22:20",
            "label": "",
            "description": "Karim Benzema (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 21:40",
            "label": "substitution",
            "description": "Jose Ramon Sandoval prepares a substitution. Ruben Rochina is replaced by Fran Rico (Granada CF)."
        },
        {
            "gameTime": "2 - 20:30",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the right post."
        },
        {
            "gameTime": "2 - 20:07",
            "label": "",
            "description": "A dangerous towering header by Raphael Varane (Real Madrid) from around the penalty spot goes just over the bar. This corner kick didn't change the score."
        },
        {
            "gameTime": "2 - 19:20",
            "label": "corner",
            "description": "will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 18:52",
            "label": "",
            "description": "Great solo effort by Cristiano Ronaldo (Real Madrid) as he tricks his way past two defenders before firing in a drive from long range towards the bottom right corner. The goalkeeper is alert and makes a save. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "2 - 18:22",
            "label": "",
            "description": "Real Madrid are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "2 - 16:17",
            "label": "substitution",
            "description": "Rafael Benitez has decided to introduce fresh legs, with Mateo Kovacic (Real Madrid) replacing Toni Kroos."
        },
        {
            "gameTime": "2 - 15:46",
            "label": "substitution",
            "description": "Isaac Success comes off the pitch to be replaced by Robert Ibanez (Granada CF)."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "",
            "description": "Youseff El Arabi (Granada CF) dribbled past his opponents before finding himself in a great position to strike. But his low attempt from just outside of the box went straight towards the middle of the goal and Keylor Navas made a comfortable save."
        },
        {
            "gameTime": "2 - 13:15",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) rises above the defending players to meet the corner kick. His precise header looks to be going under the crossbar, but Andres Fernandez is alert and somehow manages to keep the ball out."
        },
        {
            "gameTime": "2 - 12:53",
            "label": "corner",
            "description": "There's an opportunity for Toni Kroos (Real Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 12:29",
            "label": "",
            "description": "The ball is cleared after Marcelo (Real Madrid) attempted to dribble past an opposing player. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 09:44",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Isco finds Karim Benzema (Real Madrid), who jumps highest and steers a close range header in the countermovement of the goalkeeper. His effort was both strong and precise, and Andres Fernandez had no chance of stopping that. 0:0."
        },
        {
            "gameTime": "2 - 08:56",
            "label": "",
            "description": "Juan Martinez Munuera blows the whistle, Javier Marquez (Granada CF) is penalised for a foul. Free kick. Real Madrid will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 06:20",
            "label": "",
            "description": "What a chance that is! Isaac Success (Granada CF) finds himself in a promising position after receiving a pass on the edge of the box. His attempt goes just over the bar."
        },
        {
            "gameTime": "2 - 05:16",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) cracks a volley from just outside the box, but his miskick goes skyward. The ball is off of the pitch and it's a goal kick for Granada CF."
        },
        {
            "gameTime": "2 - 03:50",
            "label": "",
            "description": "Real Madrid keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "2 - 03:03",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Isco (Real Madrid)."
        },
        {
            "gameTime": "2 - 00:48",
            "label": "",
            "description": "A great solo effort from Cristiano Ronaldo (Real Madrid) and he attempts to surprise the goalkeeper with a long range shot low towards the middle of the goal. Andres Fernandez has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. Real Madrid dominated the opening period and easily created the most chances. The home team are playing possession football, while the away team look to find a weakness in the opposition's defence mainly with their rapid counter attacks."
        },
        {
            "gameTime": "1 - 45:27",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "",
            "description": "Karim Benzema (Real Madrid) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "1 - 44:14",
            "label": "",
            "description": "Karim Benzema (Real Madrid) tries to find Cristiano Ronaldo, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 43:30",
            "label": "",
            "description": "A rebound falls at the feet of Miguel Lopes (Granada CF) who unleashes a shot from long range towards the goal. However, his effort is poor and it flies high over the crossbar."
        },
        {
            "gameTime": "1 - 42:49",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Isco (Real Madrid) was quite harsh and Juan Martinez Munuera didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 40:57",
            "label": "",
            "description": "That was close by Isco (Real Madrid)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "1 - 38:28",
            "label": "",
            "description": "Isaac Success (Granada CF) latches on to a precise defence splitting pass and drills a nice strike from a promising distance towards the middle of the goal. Keylor Navas has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 37:11",
            "label": "",
            "description": "The linesman raises his flag. Cristiano Ronaldo (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "1 - 35:30",
            "label": "",
            "description": "The foul by Karim Benzema (Real Madrid) was seen by Juan Martinez Munuera who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 34:42",
            "label": "y-card",
            "description": "Edgar Mendez (Granada CF) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "1 - 32:12",
            "label": "",
            "description": "Granada CF are happy showing off their ball keeping skills and that is only interrupted when the defender steps in."
        },
        {
            "gameTime": "1 - 30:29",
            "label": "",
            "description": "Luka Modric (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the right post. Andres Fernandez is alert and denies him with a nice save."
        },
        {
            "gameTime": "1 - 27:46",
            "label": "",
            "description": "Karim Benzema (Real Madrid) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "1 - 26:22",
            "label": "",
            "description": "Real Madrid are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 24:33",
            "label": "",
            "description": "The free kick into the box finds Youseff El Arabi (Granada CF), who directs his header into the middle of the goal, but the keeper pulls off a fantastic reflex save. Great goalkeeping."
        },
        {
            "gameTime": "1 - 24:02",
            "label": "",
            "description": "Isco (Real Madrid) fouls an opponent. At least that's what referee Juan Martinez Munuera signals. Granada CF are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 23:35",
            "label": "",
            "description": "The corner kick is deflected to Isco (Real Madrid), who immediately sends in a long range shot. However, he hits the ball poorly and it goes high over the bar. The ball is off of the pitch and it's a goal kick for Granada CF."
        },
        {
            "gameTime": "1 - 23:29",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) will take the corner."
        },
        {
            "gameTime": "1 - 22:37",
            "label": "",
            "description": "Real Madrid show off their ball retention skills as they exchange one two passes and the move is only interrupted when the final pass is intercepted. The linesman points to the corner flag, Real Madrid are going to take it."
        },
        {
            "gameTime": "1 - 22:20",
            "label": "corner",
            "description": "The corner from Luka Modric (Real Madrid) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 21:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries his luck from a long range free kick and the ball is aimed to low to the middle, but Andres Fernandez is alert and thwarts the effort. Good work from Real Madrid as they win a corner."
        },
        {
            "gameTime": "1 - 20:39",
            "label": "",
            "description": "Edgar Mendez (Granada CF) brings his opponent down. Juan Martinez Munuera has a clear sight of it and blows his whistle for a foul. Real Madrid have been awarded a free kick."
        },
        {
            "gameTime": "1 - 19:46",
            "label": "",
            "description": "Youseff El Arabi (Granada CF) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 18:54",
            "label": "",
            "description": "A neat pass is well received by Cristiano Ronaldo (Real Madrid), who is lurking on the edge of the box and strikes the ball towards the bottom right corner, but the goalkeeper makes an incredible save to block his shot."
        },
        {
            "gameTime": "1 - 17:24",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to find Karim Benzema, but puts far too much on the pass and the chance is gone. The ball goes out of play and Granada CF will have a goal kick."
        },
        {
            "gameTime": "1 - 16:30",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 15:11",
            "label": "",
            "description": "Cristiano Biraghi (Granada CF) commits a rough foul. Juan Martinez Munuera stops the game and makes a call. It's a free kick to Real Madrid, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 13:28",
            "label": "",
            "description": "Isco (Real Madrid) tries his luck with a low long range effort after receiving a precise pass, but Andres Fernandez has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 13:19",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 12:34",
            "label": "",
            "description": "Luka Modric (Real Madrid) looks to break free, but an opposing player clears the ball away. The ball is out of play and Real Madrid manage to earn a corner."
        },
        {
            "gameTime": "1 - 11:52",
            "label": "",
            "description": "Karim Benzema (Real Madrid) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 11:11",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 10:54",
            "label": "",
            "description": "Real Madrid are happy to keep the ball as they wait for gaps in defence to open up. However, an opposing player steps in and clears. The ball goes out for a corner. Real Madrid can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 09:48",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Marcelo (Real Madrid) takes it short."
        },
        {
            "gameTime": "1 - 09:11",
            "label": "",
            "description": "The Real Madrid players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition. Real Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 07:40",
            "label": "",
            "description": "Edgar Mendez (Granada CF) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 06:11",
            "label": "",
            "description": "Karim Benzema (Real Madrid) finds himself beyond the last defender but the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 05:02",
            "label": "",
            "description": "tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 04:21",
            "label": "",
            "description": "Toni Kroos (Real Madrid) takes a direct free kick."
        },
        {
            "gameTime": "1 - 03:36",
            "label": "",
            "description": "Javier Marquez (Granada CF) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul. It's a free kick to Real Madrid in a dangerous position."
        },
        {
            "gameTime": "1 - 02:12",
            "label": "",
            "description": "The ball has crossed the sideline. Real Madrid are taking a throw in."
        },
        {
            "gameTime": "1 - 00:59",
            "label": "",
            "description": "The Real Madrid players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 00:12",
            "label": "",
            "description": "Real Madrid will kick the game off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Juan Martinez Munuera."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Here we have the head to head record between the two teams: 7.2.2016 2:1, 5.4.2015 9:1, 1.11.2014 4:0, 25.1.2014 2:0, 26.8.2013 1:0."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "110:34 That's Real Madrid's goals for and against."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. Real Madrid were better today and displayed masterful control and movement. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "Granada CF",
    "gameDate": "19/09/2015 - 17:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "1 - 0"
}