{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/france_ligue-1/2016-2017/2017-05-14 - 22-00 St Etienne 0 - 5 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:30",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "soccer-ball",
            "description": "Giovani Lo Celso produces a sweet pass and picks out Julian Draxler (Paris SG) inside the box. He quickly takes a shot which goes into the bottom right corner and leaves the goalkeeper helpless. He makes it 0:5!"
        },
        {
            "gameTime": "2 - 39:48",
            "label": "y-card",
            "description": "Amaury Delerue shows a yellow card to Giovani Lo Celso (Paris SG) for his blatant foul."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "substitution",
            "description": "Christophe Galtier has decided to substitute Kevin Malcuit and he is replaced by Ronael Pierre Gabriel (St Etienne)."
        },
        {
            "gameTime": "2 - 33:53",
            "label": "substitution",
            "description": "A substitution has been made. Marco Verratti is replaced by Giovani Lo Celso (Paris SG)."
        },
        {
            "gameTime": "2 - 33:48",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Lucas walks off the pitch to be replaced by Goncalo Guedes (Paris SG)."
        },
        {
            "gameTime": "2 - 33:00",
            "label": "soccer-ball",
            "description": "Lucas (Paris SG) has a great chance inside the box and puts the ball into the back of the net."
        },
        {
            "gameTime": "2 - 31:33",
            "label": "corner",
            "description": "Lucas (Paris SG) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 28:30",
            "label": "corner",
            "description": "The corner kick from Lucas (Paris SG) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "Edinson Cavani (Paris SG) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Stephane Ruffier."
        },
        {
            "gameTime": "2 - 27:00",
            "label": "soccer-ball",
            "description": "Goal! Edinson Cavani (Paris SG) is quickest to react to the rebound and stabs the ball into the back of the net. It's 0:3."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "substitution",
            "description": "Substitution. Robert Beric is replaced by Alexander Soderlund (St Etienne)."
        },
        {
            "gameTime": "2 - 23:06",
            "label": "",
            "description": "Edinson Cavani (Paris SG) misses a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball floats high over the crossbar!"
        },
        {
            "gameTime": "2 - 20:25",
            "label": "",
            "description": "Edinson Cavani (Paris SG) smashes the ball towards goal from the edge of the penalty box, but his effort flies just a few inches wide of the right post."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "",
            "description": "Julian Draxler (Paris SG) misses a sitter as his shot goes over the bar."
        },
        {
            "gameTime": "2 - 10:52",
            "label": "substitution",
            "description": "Substitution. Henri Saivet makes his way off the pitch and Benjamin Corgnet (St Etienne) comes on as his replacement."
        },
        {
            "gameTime": "2 - 10:24",
            "label": "corner",
            "description": "Romain Hamouma (St Etienne) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 10:01",
            "label": "corner",
            "description": "The resulting corner from Romain Hamouma (St Etienne) is cleared by the defence."
        },
        {
            "gameTime": "2 - 08:33",
            "label": "corner",
            "description": "Jordan Veretout (St Etienne) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 06:14",
            "label": "corner",
            "description": "Lucas (Paris SG) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 06:00",
            "label": "corner",
            "description": "Lucas (Paris SG) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 05:07",
            "label": "",
            "description": "Julian Draxler (Paris SG) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Stephane Ruffier to get hold of the ball. Paris SG get a corner."
        },
        {
            "gameTime": "2 - 02:05",
            "label": "",
            "description": "Amaury Delerue blows his whistle for a foul after Florentin Pogba (St Etienne) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Unai Emery Etxegoien gives a chance to Marquinhos (Paris SG) and Thiago Silva is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:13",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 42:27",
            "label": "",
            "description": "Marco Verratti (Paris SG) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Stephane Ruffier."
        },
        {
            "gameTime": "1 - 37:44",
            "label": "soccer-ball",
            "description": "Goal! Lucas (Paris SG) pounced on a loose ball inside the box and beats the goalkeeper with a shot into the top of the net. He makes it 0:2."
        },
        {
            "gameTime": "1 - 33:56",
            "label": "",
            "description": "Marco Verratti (Paris SG) pulls the shirt of his opponent and the referee stops play for a foul."
        },
        {
            "gameTime": "1 - 32:49",
            "label": "",
            "description": "Paris SG slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "1 - 26:16",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Henri Saivet (St Etienne) was quite harsh and Amaury Delerue didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 24:45",
            "label": "",
            "description": "Romain Hamouma (St Etienne) fouls an opponent. At least that's what referee Amaury Delerue signals."
        },
        {
            "gameTime": "1 - 23:06",
            "label": "corner",
            "description": "Lucas (Paris SG) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 21:30",
            "label": "corner",
            "description": "The resulting corner from Julian Draxler (Paris SG) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 19:01",
            "label": "corner",
            "description": "Kevin Malcuit (St Etienne) takes the corner kick, but Kevin Trapp reads it well and stops the effort."
        },
        {
            "gameTime": "1 - 17:36",
            "label": "",
            "description": "Amaury Delerue blows his whistle. Jordan Veretout (St Etienne) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 15:17",
            "label": "corner",
            "description": "The corner from Lucas (Paris SG) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 13:35",
            "label": "corner",
            "description": "St Etienne didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "1 - 12:01",
            "label": "corner",
            "description": "Lucas (Paris SG) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 06:28",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) has a great chance to score from deep inside the box! He finds some space for the shot, but sends it errantly way past the left post. Very poor attempt."
        },
        {
            "gameTime": "1 - 05:34",
            "label": "",
            "description": "Lucas (Paris SG) has a good chance to get on the scoresheet and fires the ball towards goal from the edge of the penalty box, but it goes narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 01:54",
            "label": "soccer-ball",
            "description": "Edinson Cavani (Paris SG) finds some space inside the box and powers his header past the goalkeeper, giving him no chance."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Amaury Delerue."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's the end of the match."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "14/05/2017 - 22:00",
    "gameHomeTeam": "St Etienne",
    "gameScore": "0 - 5"
}