{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-10-15 - 17-15 Barcelona 4 - 0 Dep. La Coruna/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side dominated this game. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        },
        {
            "gameTime": "2 - 47:22",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:43",
            "label": "",
            "description": "Alcacer Paco (Barcelona) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:48",
            "label": "y-card",
            "description": "Lionel Messi (Barcelona) receives a yellow card for infringement."
        },
        {
            "gameTime": "2 - 42:13",
            "label": "",
            "description": "Lionel Messi (Barcelona) takes the free kick from mid range, but he balloons his effort high over the bar. What a miskick!"
        },
        {
            "gameTime": "2 - 41:08",
            "label": "",
            "description": "A free kick to Barcelona from around 20 metres out. Let's see who will take it."
        },
        {
            "gameTime": "2 - 40:58",
            "label": "",
            "description": "Jose Sanchez blows for a foul after Alejandro Arribas (Dep. La Coruna) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 40:19",
            "label": "attendance",
            "description": "The attendance is 83553."
        },
        {
            "gameTime": "2 - 39:29",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 38:52",
            "label": "",
            "description": "Gerard Pique (Barcelona) sends a lofted cross into the box which is headed clear. Barcelona will take a corner kick."
        },
        {
            "gameTime": "2 - 37:58",
            "label": "",
            "description": "A goal, which was scored by Jeremy Mathieu (Barcelona), was disallowed due to offside."
        },
        {
            "gameTime": "2 - 37:25",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Neymar (Barcelona)."
        },
        {
            "gameTime": "2 - 37:01",
            "label": "",
            "description": "Lionel Messi (Barcelona) wasted a huge opportunity! The fans already began to celebrate as he unleashed a powerful shot from the edge of the box after a brilliant solo effort. The ball went towards the top left corner, but German Lux made a crucial save! The referee signals a corner kick to Barcelona."
        },
        {
            "gameTime": "2 - 35:55",
            "label": "",
            "description": "Lionel Messi (Barcelona) sends in a pass which fails to reach any of his teammates. The ball goes out of play and Dep. La Coruna will have a goal kick."
        },
        {
            "gameTime": "2 - 35:01",
            "label": "",
            "description": "Neymar (Barcelona) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 32:49",
            "label": "",
            "description": "A pass by Lionel Messi (Barcelona) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 31:49",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Barcelona."
        },
        {
            "gameTime": "2 - 30:22",
            "label": "",
            "description": "Florin Andone (Dep. La Coruna) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 27:06",
            "label": "",
            "description": "German Lux earns applause from the crowd! He dives superbly to deny a dangerous first time effort from the edge of the six yard box. Alcacer Paco (Barcelona) was the player who tested the keeper's reflexes. Nice goalkeeping skills."
        },
        {
            "gameTime": "2 - 26:11",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Arda Turan (Barcelona) takes it short."
        },
        {
            "gameTime": "2 - 25:36",
            "label": "",
            "description": "A close range header from Alcacer Paco (Barcelona) went to the bottom left corner. German Lux makes sure the score remains the same as he pulls off an exquisite save and deflects the ball onto the post. The ball is out of play. A goal scoring opportunity from a corner for Barcelona."
        },
        {
            "gameTime": "2 - 24:01",
            "label": "",
            "description": "Arda Turan (Barcelona) had a good opportunity when he latched on to a cross from the wing, but his strike wasn't accurate at all and the ball went well wide of the right post."
        },
        {
            "gameTime": "2 - 23:21",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 22:56",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Denis Suarez (Barcelona) comes onto the pitch for Rafinha."
        },
        {
            "gameTime": "2 - 22:14",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) hammers the ball towards goal from long range, but one of the defenders reacts brilliantly to block the shot. The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "2 - 19:19",
            "label": "r-card",
            "description": "Laure (Dep. La Coruna) is sent off after deserving nothing other than a red card from a referee for clattering into his opponent!"
        },
        {
            "gameTime": "2 - 17:56",
            "label": "substitution",
            "description": "That's the end of the game for Bruno Gama, who is replaced by Luisinho (Dep. La Coruna)."
        },
        {
            "gameTime": "2 - 17:18",
            "label": "",
            "description": "Gerard Pique (Barcelona) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but he sent it well over the bar."
        },
        {
            "gameTime": "2 - 17:01",
            "label": "corner",
            "description": "Neymar (Barcelona) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 16:45",
            "label": "",
            "description": "Lucas Digne (Barcelona) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Barcelona win a corner."
        },
        {
            "gameTime": "2 - 16:11",
            "label": "",
            "description": "Neymar (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 15:47",
            "label": "",
            "description": "Lionel Messi (Barcelona) dribbles into space and finds himself in a shooting position, but his shot from the edge of the box is bravely blocked."
        },
        {
            "gameTime": "2 - 15:20",
            "label": "",
            "description": "Bruno Gama (Dep. La Coruna) dinks a cross into the box from the free kick. However, the opposition defence thwarts the attack, preventing anyone from finishing."
        },
        {
            "gameTime": "2 - 14:56",
            "label": "",
            "description": "Dangerous play by Arda Turan (Barcelona). Jose Sanchez blows his whistle for a foul. There is a free kick near the sideline to Dep. La Coruna."
        },
        {
            "gameTime": "2 - 13:55",
            "label": "y-card",
            "description": "Florin Andone (Dep. La Coruna) is booked by the referee."
        },
        {
            "gameTime": "2 - 12:43",
            "label": "soccer-ball",
            "description": "Goal Lionel Messi (Barcelona)! Lionel Messi (Barcelona) was put through by Neymar and he showed brilliant composure inside the box to fire into the top of the net. 4:0."
        },
        {
            "gameTime": "2 - 10:33",
            "label": "substitution",
            "description": "Here is a change. Emre Colak is going off and Gaizka Garitano gives the last tactical orders to Ryan Babel (Dep. La Coruna)."
        },
        {
            "gameTime": "2 - 09:31",
            "label": "substitution",
            "description": "Sergio Busquets comes off the pitch to be replaced by Lionel Messi (Barcelona)."
        },
        {
            "gameTime": "2 - 07:34",
            "label": "",
            "description": "Florin Andone (Dep. La Coruna) wriggles into space inside the box with excellent ball control, but his effort on goal is well blocked."
        },
        {
            "gameTime": "2 - 06:38",
            "label": "y-card",
            "description": "Pedro Mosquera Parada (Dep. La Coruna) is booked."
        },
        {
            "gameTime": "2 - 05:50",
            "label": "corner",
            "description": "A dangerous looking corner kick from Neymar (Barcelona) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 04:37",
            "label": "",
            "description": "Neymar (Barcelona) fails to send a pass into the box as his effort is cut out. The ball is out of play. Barcelona will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 03:16",
            "label": "",
            "description": "Good movement by Alcacer Paco (Barcelona), but he can't find any of his teammates as the cross is poor. The ball goes out of play and Dep. La Coruna will have a goal kick."
        },
        {
            "gameTime": "2 - 01:30",
            "label": "corner",
            "description": "Emre Colak (Dep. La Coruna) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The need to improve in the second half has brought about a change. Luis Suarez comes off for Alcacer Paco (Barcelona)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Jose Sanchez starts the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. The home fans will be really pleased with what they've seen from their players so far. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 46:27",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Jose Sanchez has ended it."
        },
        {
            "gameTime": "1 - 43:40",
            "label": "",
            "description": "Arda Turan picks out Luis Suarez (Barcelona), who drives a shot just wide of the left post from the edge of the box."
        },
        {
            "gameTime": "1 - 42:57",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Neymar is the provider as he slips the ball to Luis Suarez (Barcelona) who simply steers it home from close range. It's 3:0."
        },
        {
            "gameTime": "1 - 40:32",
            "label": "",
            "description": "Luis Suarez (Barcelona) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the right post."
        },
        {
            "gameTime": "1 - 39:10",
            "label": "",
            "description": "Great teamplay by Barcelona as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 35:28",
            "label": "soccer-ball",
            "description": "Goal 2:0! Rafinha (Barcelona) taps home from close range after the rebound fell kindly into his path."
        },
        {
            "gameTime": "1 - 35:20",
            "label": "",
            "description": "Gerard Pique (Barcelona) receives a lofted pass and is given time inside the box to unleash a low shot goalwards. The ball is directed towards the middle of the goal, but it lacks power and German Lux pulls off a comfortable save to thwart the effort."
        },
        {
            "gameTime": "1 - 34:27",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 34:07",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "",
            "description": "Luis Suarez (Barcelona) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 30:20",
            "label": "corner",
            "description": "Emre Colak (Dep. La Coruna) sends over a poor, overhit cross from the corner kick and the ball goes out of play. The ball is off of the pitch and it's a goal kick for Barcelona."
        },
        {
            "gameTime": "1 - 28:32",
            "label": "substitution",
            "description": "Gaizka Garitano is forced to make an unplanned substitution as Sidnei suffers an injury and Alejandro Arribas (Dep. La Coruna) comes on."
        },
        {
            "gameTime": "1 - 25:35",
            "label": "",
            "description": "Luis Suarez (Barcelona) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 23:57",
            "label": "",
            "description": "Fernando Navarro (Dep. La Coruna) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "1 - 22:33",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Florin Andone (Dep. La Coruna)."
        },
        {
            "gameTime": "1 - 20:40",
            "label": "soccer-ball",
            "description": "Goal! Rafinha (Barcelona) finds himself some space inside the box to get on the end of a pass from Luis Suarez, then sends the ball low into the middle of the net. 1:0."
        },
        {
            "gameTime": "1 - 18:06",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the bottom left corner is, however, superbly saved by German Lux!"
        },
        {
            "gameTime": "1 - 16:15",
            "label": "",
            "description": "Florin Andone (Dep. La Coruna) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the right post."
        },
        {
            "gameTime": "1 - 14:20",
            "label": "",
            "description": "Sidnei (Dep. La Coruna) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 12:24",
            "label": "",
            "description": "Neymar (Barcelona) attempts to threaten the keeper from a long range free kick, but his breathtaking effort flies just inches over the crossbar. It could have been a beautiful goal!"
        },
        {
            "gameTime": "1 - 11:43",
            "label": "injury",
            "description": "Sidnei (Dep. La Coruna) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 11:08",
            "label": "",
            "description": "Jose Sanchez blows his whistle after Pedro Mosquera Parada (Dep. La Coruna) kicks an opponent's legs instead of the ball. Barcelona will take a free kick."
        },
        {
            "gameTime": "1 - 08:54",
            "label": "",
            "description": "Emre Colak (Dep. La Coruna) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 07:48",
            "label": "",
            "description": "Luis Suarez (Barcelona) is furious with himself for wasting a glorious chance. He got to a rebound inside the 6 yard box, but his header floated over the crossbar."
        },
        {
            "gameTime": "1 - 07:18",
            "label": "",
            "description": "Neymar (Barcelona) controls a cross deep inside the box and hits the crossbar!"
        },
        {
            "gameTime": "1 - 06:20",
            "label": "",
            "description": "The Barcelona players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 04:35",
            "label": "",
            "description": "A pass from Arda Turan (Barcelona) is intercepted by German Lux and the move breaks down."
        },
        {
            "gameTime": "1 - 03:14",
            "label": "",
            "description": "Fernando Navarro (Dep. La Coruna) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "1 - 01:01",
            "label": "",
            "description": "Gerard Pique (Barcelona) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone. It's a throw in for Dep. La Coruna."
        },
        {
            "gameTime": "1 - 00:11",
            "label": "",
            "description": "The players are out and the match is about to start. Barcelona will have the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jose Sanchez will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The leading assist man for Barcelona is Neymar, with 6 assists so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Barcelona is Lionel Messi with 9 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side dominated this game. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        }
    ],
    "gameAwayTeam": "Dep. La Coruna",
    "gameDate": "15/10/2016 - 17:15",
    "gameHomeTeam": "Barcelona",
    "gameScore": "4 - 0"
}