{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2015-12-12 - 17-30 Bayern Munich 2 - 0 Ingolstadt/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:00",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Great display from the home side, you have to say that they were the better side today. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 44:31",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "2 - 43:03",
            "label": "y-card",
            "description": "Javi Martinez (Bayern Munich) sees a yellow card from Michael Weiner after he sent one of the opposing players to the ground. A free kick has been awarded to Ingolstadt."
        },
        {
            "gameTime": "2 - 42:41",
            "label": "",
            "description": "Rafinha (Bayern Munich) swings a cross into the box, but it's far too close to Ramazan Ozcan, who smothers the ball."
        },
        {
            "gameTime": "2 - 41:24",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "2 - 38:22",
            "label": "",
            "description": "Robert Bauer (Ingolstadt) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 38:06",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) is penalised for holding. Michael Weiner signals a set piece. A free kick to Ingolstadt."
        },
        {
            "gameTime": "2 - 37:30",
            "label": "",
            "description": "Bayern Munich are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "2 - 35:34",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) volleys the ball towards goal from the edge of the penalty box, but one of the defenders blocks his shot."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "substitution",
            "description": "Pep Guardiola prepares a substitution. Thomas Muller is replaced by Sebastian Rode (Bayern Munich)."
        },
        {
            "gameTime": "2 - 32:55",
            "label": "substitution",
            "description": "Lukas Hinterseer comes off the pitch to be replaced by Maurice Multhaup (Ingolstadt)."
        },
        {
            "gameTime": "2 - 32:38",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) makes a driving run into the box but he cannot work any space for a shot."
        },
        {
            "gameTime": "2 - 29:08",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Philipp Lahm (Bayern Munich) was set free in the area by Thomas Muller and made no mistake with a lovely finish into the left side of the net. 2:0."
        },
        {
            "gameTime": "2 - 28:49",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 26:42",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) goes close to scoring with a shot from inside the box, but he drags his effort wide of the right post."
        },
        {
            "gameTime": "2 - 26:23",
            "label": "corner",
            "description": "Thomas Muller (Bayern Munich) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 26:07",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) races towards goal but the defender gets back well to make a challenge. Now Bayern Munich have a corner."
        },
        {
            "gameTime": "2 - 25:55",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) is caught offside!"
        },
        {
            "gameTime": "2 - 24:35",
            "label": "",
            "description": "The linesman raises his flag. Rafinha (Bayern Munich) is adjudged offside."
        },
        {
            "gameTime": "2 - 24:16",
            "label": "substitution",
            "description": "That's the end of the game for Jerome Boateng, who is replaced by Xabi Alonso (Bayern Munich)."
        },
        {
            "gameTime": "2 - 23:05",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Ramazan Ozcan to get hold of the ball."
        },
        {
            "gameTime": "2 - 22:29",
            "label": "attendance",
            "description": "The attendance for today's match is 75000."
        },
        {
            "gameTime": "2 - 22:02",
            "label": "substitution",
            "description": "Here is a change. Stefan Lex is going off and Ralph Hasenhuttl gives the last tactical orders to Max Christiansen (Ingolstadt)."
        },
        {
            "gameTime": "2 - 21:39",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "2 - 21:28",
            "label": "",
            "description": "Michael Weiner blows his whistle after Tobias Levels (Ingolstadt) kicks an opponent's legs instead of the ball. Bayern Munich have a free kick."
        },
        {
            "gameTime": "2 - 19:15",
            "label": "soccer-ball",
            "description": "Goal! Jerome Boateng displays great vision and sends a pass to Robert Lewandowski (Bayern Munich), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 1:0."
        },
        {
            "gameTime": "2 - 18:22",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) gets a shot from distance but fails to generate enough power to beat the goalkeeper."
        },
        {
            "gameTime": "2 - 17:54",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Ramazan Ozcan is alert and denies him."
        },
        {
            "gameTime": "2 - 15:53",
            "label": "",
            "description": "The resulting free kick from Thiago Alcantara (Bayern Munich) ends up in the gloves of the keeper."
        },
        {
            "gameTime": "2 - 15:45",
            "label": "",
            "description": "Roger (Ingolstadt) trips an opposition player and Michael Weiner signals a foul. Bayern Munich are awarded the free kick."
        },
        {
            "gameTime": "2 - 14:40",
            "label": "funfact",
            "description": "14:9 – the total goal attempt statistics."
        },
        {
            "gameTime": "2 - 13:02",
            "label": "corner",
            "description": "Pascal Gross (Ingolstadt) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 12:33",
            "label": "",
            "description": "What a sweet touch by Stefan Lex (Ingolstadt) as he collects a pass deep inside the box and decides to go for goal. It's on target but easy for Manuel Neuer to hold. The ball goes out of play. Ingolstadt are awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:48",
            "label": "",
            "description": "Javi Martinez (Bayern Munich) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "2 - 10:17",
            "label": "y-card",
            "description": "Michael Weiner shows a yellow card to Tobias Levels (Ingolstadt), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 09:43",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) attempts to find one of his teammates with a ball from a free kick outside the box. The goalkeeper climbs high above all the players in the box to intercept the cross and snuff out the opportunity."
        },
        {
            "gameTime": "2 - 09:14",
            "label": "y-card",
            "description": "A yellow card for a tackle by Jerome Boateng (Bayern Munich). Michael Weiner doesn't hesitate at all to make this decision. Ingolstadt have a free kick."
        },
        {
            "gameTime": "2 - 08:11",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) makes space inside the box for a shot, but his effort goes just over the crossbar."
        },
        {
            "gameTime": "2 - 07:29",
            "label": "substitution",
            "description": "Ralph Hasenhuttl has decided to substitute Almog Cohen and he is replaced by Stefan Wannenwetsch (Ingolstadt)."
        },
        {
            "gameTime": "2 - 07:15",
            "label": "",
            "description": "Stefan Lex (Ingolstadt) is flagged for offside."
        },
        {
            "gameTime": "2 - 06:56",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "2 - 05:32",
            "label": "substitution",
            "description": "Substitution. Thiago Alcantara (Bayern Munich) in, Arturo Vidal out."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Ramazan Ozcan is alert and denies him."
        },
        {
            "gameTime": "2 - 04:14",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "2 - 03:06",
            "label": "corner",
            "description": "Arturo Vidal (Bayern Munich) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) produces a poor pass. He attempts to get the ball into the box but it's hacked away. Bayern Munich win a corner."
        },
        {
            "gameTime": "2 - 00:47",
            "label": "",
            "description": "Mathew Leckie (Ingolstadt) commits a foul and Michael Weiner immediately signals a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. Both teams are unsuccessfully trying to control the game and it's pretty even so far. The home team makes a lot of passes and attempts to maintain possession, while the visitors look to counter attack."
        },
        {
            "gameTime": "1 - 46:01",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:47",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:13",
            "label": "corner",
            "description": "The resulting corner from Arturo Vidal (Bayern Munich) is cleared."
        },
        {
            "gameTime": "1 - 43:57",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) unleashed a powerful long range strike, but the ball was blocked by a defender on its way. The referee points to the corner flag and Bayern Munich will take a corner."
        },
        {
            "gameTime": "1 - 42:55",
            "label": "corner",
            "description": "Manuel Neuer leaps to collect the ball from the corner which was sent over by Pascal Gross (Ingolstadt)."
        },
        {
            "gameTime": "1 - 42:47",
            "label": "",
            "description": "The goalkeeper dives to deny Lukas Hinterseer (Ingolstadt), whose promising shot was aimed towards the left post. The ball goes behind for a corner. Ingolstadt will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 42:36",
            "label": "",
            "description": "Stefan Lex (Ingolstadt) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Manuel Neuer guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 41:21",
            "label": "",
            "description": "Roger (Ingolstadt) got on the end of the corner and rifles a low shot from the edge of the box towards the left post, but the goalkeeper makes a stunning diving save."
        },
        {
            "gameTime": "1 - 41:02",
            "label": "corner",
            "description": "Pascal Gross (Ingolstadt) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 40:37",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender. The linesman points to the corner flag, Ingolstadt are going to take it."
        },
        {
            "gameTime": "1 - 40:01",
            "label": "",
            "description": "The free kick is taken by Pascal Gross (Ingolstadt), but ball is cleared."
        },
        {
            "gameTime": "1 - 39:55",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) robs an opponent of the ball and explodes in anger when Michael Weiner blows for a foul. It's a free kick to Ingolstadt, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 38:18",
            "label": "",
            "description": "Holger Badstuber (Bayern Munich) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 37:31",
            "label": "",
            "description": "Stefan Lex (Ingolstadt) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 36:36",
            "label": "",
            "description": "Flag up against Robert Lewandowski (Bayern Munich). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 35:52",
            "label": "",
            "description": "Marvin Matip (Ingolstadt) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the left post."
        },
        {
            "gameTime": "1 - 35:23",
            "label": "corner",
            "description": "Pascal Gross (Ingolstadt) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 35:14",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) produces a dangerous lofted cross into the box which is intercepted. The referee and his assistant both point at the corner flag. Ingolstadt will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 32:03",
            "label": "",
            "description": "The game is interrupted as Lukas Hinterseer (Ingolstadt) is flagged offside."
        },
        {
            "gameTime": "1 - 30:02",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 29:35",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "1 - 28:19",
            "label": "",
            "description": "Rafinha (Bayern Munich) trips an opponent with a slide tackle. Michael Weiner stops the game and he could give him a card, but eventually decides on just a warning. Ingolstadt are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 27:14",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 25:18",
            "label": "corner",
            "description": "Arturo Vidal (Bayern Munich) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 25:09",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. Bayern Munich have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 24:57",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "1 - 23:15",
            "label": "",
            "description": "A pass by Jerome Boateng (Bayern Munich) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 21:35",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 20:17",
            "label": "",
            "description": "Lukas Hinterseer (Ingolstadt) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "1 - 19:33",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) takes the resultant free kick from the edge of the box and tries to find one of his teammates with a cross, but the keeper climbs high and gets to it first, collecting the ball with ease."
        },
        {
            "gameTime": "1 - 19:27",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Philipp Lahm (Bayern Munich). Michael Weiner saw the sliding tackle and blows for a foul. Ingolstadt are awarded a free kick."
        },
        {
            "gameTime": "1 - 19:15",
            "label": "",
            "description": "Holger Badstuber (Bayern Munich) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 15:28",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "1 - 14:45",
            "label": "injury",
            "description": "Holger Badstuber (Bayern Munich) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "1 - 14:19",
            "label": "",
            "description": "Michael Weiner blows his whistle. Holger Badstuber (Bayern Munich) commits a foul after dangerous play. It's a free kick to Ingolstadt, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 12:40",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the right post."
        },
        {
            "gameTime": "1 - 11:21",
            "label": "",
            "description": "The ball is cleared after Kingsley Coman (Bayern Munich) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 10:15",
            "label": "",
            "description": "Manuel Neuer is alert and has a clear sight of a long through ball from Mathew Leckie (Ingolstadt). Easy save!"
        },
        {
            "gameTime": "1 - 08:52",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 08:33",
            "label": "",
            "description": "Javi Martinez (Bayern Munich) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net."
        },
        {
            "gameTime": "1 - 06:25",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "1 - 05:11",
            "label": "",
            "description": "Pascal Gross (Ingolstadt) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "1 - 03:23",
            "label": "",
            "description": "Stefan Lex (Ingolstadt) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 01:46",
            "label": "",
            "description": "Lukas Hinterseer (Ingolstadt) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 00:48",
            "label": "",
            "description": "Lukas Hinterseer (Ingolstadt) is adjudged offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Bayern Munich will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Michael Weiner was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        }
    ],
    "gameAwayTeam": "Ingolstadt",
    "gameDate": "12/12/2015 - 17:30",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "2 - 0"
}