{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-03-12 - 18-15 Dep. La Coruna 2 - 1 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 47:30",
            "label": "",
            "description": "Faycal Fajr (Dep. La Coruna) doesn't hesitate and begins a run towards the opponent's goal. Defenders try to tackle him, but he manages to keep the ball at his feet and pulls the trigger in front of the goal. The strike, though, was not as successful as the solo run and the ball is easily stopped by the keeper."
        },
        {
            "gameTime": "2 - 46:56",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) sends in a poor cross from the corner and German Lux has no trouble gathering it."
        },
        {
            "gameTime": "2 - 46:23",
            "label": "corner",
            "description": "The resulting corner from Ivan Rakitic (Barcelona) comes to nothing. The linesman points to the corner flag, Barcelona are going to take it."
        },
        {
            "gameTime": "2 - 45:29",
            "label": "",
            "description": "Lionel Messi (Barcelona) produces a shot from a direct free kick on the edge of the box. His effort sails narrowly over the crossbar. The goalkeeper was lucky there. The ball is off of the pitch and it's a goal kick for Dep. La Coruna."
        },
        {
            "gameTime": "2 - 45:16",
            "label": "",
            "description": "It seems like Ivan Rakitic (Barcelona) is about to take a free kick. The goalkeeper has to be alert and careful how to position the defensive wall. This is the perfect distance for a direct shot."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:41",
            "label": "",
            "description": "Celso Borges (Dep. La Coruna) makes a slide tackle, but referee David Fernandez Borbalan blows for a foul. Barcelona are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 44:14",
            "label": "corner",
            "description": "Sergio Busquets (Barcelona) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 43:41",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) crosses the ball into the box, but one of the defending players averts the threat. The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 42:29",
            "label": "",
            "description": "Joselu (Dep. La Coruna) makes a driving run into the box but he cannot work any space for a shot. The ball is off of the pitch and it's a goal kick for Barcelona."
        },
        {
            "gameTime": "2 - 40:55",
            "label": "substitution",
            "description": "Laure (Dep. La Coruna) comes onto the pitch because Juanfran simply cannot continue any longer after picking up an injury."
        },
        {
            "gameTime": "2 - 40:05",
            "label": "injury",
            "description": "Looks like Juanfran (Dep. La Coruna) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 39:08",
            "label": "",
            "description": "Sergi Roberto (Barcelona) had a good opportunity when he latched on to a cross from the wing, but his strike wasn't accurate at all and the ball went well over the bar. The ball is off of the pitch and it's a goal kick for Dep. La Coruna."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "",
            "description": "Gerard Pique (Barcelona) attempts to score as he rises near the penalty spot and heads the ball down to the middle of the goal. German Lux pulls off a comfortable save to stop the ball from hitting the net."
        },
        {
            "gameTime": "2 - 37:40",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) works the corner short."
        },
        {
            "gameTime": "2 - 34:18",
            "label": "",
            "description": "Luis Suarez (Barcelona) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for German Lux to get hold of the ball."
        },
        {
            "gameTime": "2 - 32:51",
            "label": "corner",
            "description": "The resulting corner, taken by Lionel Messi (Barcelona), comes to nothing."
        },
        {
            "gameTime": "2 - 31:56",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Alcacer Paco (Barcelona) comes onto the pitch so that Denis Suarez can be given a rest."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "corner",
            "description": "Luis Suarez (Barcelona) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 30:16",
            "label": "attendance",
            "description": "The attendance for today's match is 28473."
        },
        {
            "gameTime": "2 - 28:59",
            "label": "soccer-ball",
            "description": "GOAL! The corner is whipped in and Alex Bergantinos (Dep. La Coruna) is in the right place at the right time, planting his header straight into the bottom right corner. He makes it 2:1."
        },
        {
            "gameTime": "2 - 28:30",
            "label": "corner",
            "description": "Emre Colak (Dep. La Coruna) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 28:12",
            "label": "",
            "description": "Joselu (Dep. La Coruna) outjumps the defence to meet the resulting corner and heads the ball towards the top left corner. The long range header is not powerful enough, and the keeper comfortably makes a save. The ball goes out for a corner. Dep. La Coruna can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 27:43",
            "label": "corner",
            "description": "Faycal Fajr (Dep. La Coruna) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 25:16",
            "label": "substitution",
            "description": "Gael Kakuta (Dep. La Coruna) joins the action as a substitute, replacing Bruno Gama."
        },
        {
            "gameTime": "2 - 21:41",
            "label": "",
            "description": "Sergi Roberto (Barcelona) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "2 - 18:34",
            "label": "",
            "description": "Denis Suarez (Barcelona) picks up a pass and unleashes a strong shot from inside the box, but the goalkeeper is equal to it!"
        },
        {
            "gameTime": "2 - 18:05",
            "label": "",
            "description": "Bruno Gama (Dep. La Coruna) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Marc Andre ter Stegen was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 16:54",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Carles Gil as he is replaced by Emre Colak (Dep. La Coruna)."
        },
        {
            "gameTime": "2 - 14:21",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) is caught offside, but it was a really close call."
        },
        {
            "gameTime": "2 - 12:27",
            "label": "substitution",
            "description": "The substitution has been made. Ivan Rakitic (Barcelona) has replaced Andre Gomes."
        },
        {
            "gameTime": "2 - 12:11",
            "label": "substitution",
            "description": "Luis Enrique has decided to make a change. Andres Iniesta (Barcelona) replaces Arda Turan."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Lionel Messi (Barcelona), whose instinctive shot towards goal flashes inches wide of the left post. The ball is off of the pitch and it's a goal kick for Dep. La Coruna."
        },
        {
            "gameTime": "2 - 10:27",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Faycal Fajr (Dep. La Coruna) takes it short."
        },
        {
            "gameTime": "2 - 10:17",
            "label": "",
            "description": "Faycal Fajr (Dep. La Coruna) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. Good work from Dep. La Coruna as they win a corner."
        },
        {
            "gameTime": "2 - 10:12",
            "label": "",
            "description": "Sergio Busquets (Barcelona) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 07:57",
            "label": "",
            "description": "Faycal Fajr (Dep. La Coruna) had a good opportunity when he latched on to a cross from the wing, but his strike from the penalty spot wasn't accurate enough and the ball went a few inches over the bar. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "2 - 07:16",
            "label": "",
            "description": "A cross from Juanfran (Dep. La Coruna) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 06:48",
            "label": "",
            "description": "Bruno Gama (Dep. La Coruna) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 00:57",
            "label": "soccer-ball",
            "description": "Goal! Luis Suarez (Barcelona) fires the rebound into the bottom right corner after the ball breaks to him in the box. The score is 1:1."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "David Fernandez Borbalan blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 42:14",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 39:38",
            "label": "soccer-ball",
            "description": "Goal! Joselu (Dep. La Coruna) was in the right place at the right time to pounce on the rebound inside the box and gleefully rifles the ball home. It's 1:0."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "corner",
            "description": "The ball is out of play. Dep. La Coruna win a corner kick."
        },
        {
            "gameTime": "1 - 35:24",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Joselu (Dep. La Coruna) was quite harsh and David Fernandez Borbalan didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 34:01",
            "label": "",
            "description": "The linesman raises his flag for offside before Luis Suarez (Barcelona) heads on."
        },
        {
            "gameTime": "1 - 33:38",
            "label": "",
            "description": "Andre Gomes (Barcelona) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the right post."
        },
        {
            "gameTime": "1 - 32:24",
            "label": "",
            "description": "Luis Suarez (Barcelona) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 30:59",
            "label": "",
            "description": "Lionel Messi (Barcelona) chips a pass over the line of defenders to get the ball to Luis Suarez, but his attempt is intercepted and cleared."
        },
        {
            "gameTime": "1 - 27:16",
            "label": "",
            "description": "A cross into the box from Juanfran (Dep. La Coruna) is cleared."
        },
        {
            "gameTime": "1 - 24:04",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "1 - 22:30",
            "label": "",
            "description": "Carles Gil (Dep. La Coruna) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 20:35",
            "label": "corner",
            "description": "The resulting corner from Lionel Messi (Barcelona) is cleared by the defence."
        },
        {
            "gameTime": "1 - 20:29",
            "label": "",
            "description": "What a goal scoring opportunity! Lionel Messi (Barcelona) makes a good run into the box to meet a cross and fires the ball in on goal, but the shot is amazingly blocked by a defender. Barcelona have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 19:07",
            "label": "",
            "description": "Barcelona are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "1 - 18:21",
            "label": "",
            "description": "The game is interrupted as is flagged offside."
        },
        {
            "gameTime": "1 - 13:43",
            "label": "y-card",
            "description": "Fernando Navarro (Dep. La Coruna) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 13:40",
            "label": "",
            "description": "Javier Mascherano (Barcelona) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "1 - 13:40",
            "label": "",
            "description": "A clumsy foul by Fernando Navarro (Dep. La Coruna) and David Fernandez Borbalan blows his whistle."
        },
        {
            "gameTime": "1 - 12:00",
            "label": "",
            "description": "Joselu (Dep. La Coruna) is flagged for offside."
        },
        {
            "gameTime": "1 - 10:58",
            "label": "",
            "description": "A lofted cross from Denis Suarez (Barcelona) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 08:57",
            "label": "",
            "description": "Joselu (Dep. La Coruna) receives a low pass just outside the box and unleashes a fine strike towards the right post. Marc Andre ter Stegen pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 08:16",
            "label": "",
            "description": "Juanfran (Dep. La Coruna) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 05:42",
            "label": "",
            "description": "The free kick is delivered by Faycal Fajr (Dep. La Coruna) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "1 - 05:13",
            "label": "",
            "description": "Denis Suarez (Barcelona) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 02:24",
            "label": "",
            "description": "Denis Suarez (Barcelona) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be David Fernandez Borbalan."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last 5 games between these two teams have been goal rich, with an average of 4.8 goals per game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dep. La Coruna have not tasted defeat in their last 3 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "12/03/2017 - 18:15",
    "gameHomeTeam": "Dep. La Coruna",
    "gameScore": "2 - 1"
}