{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2017-02-27 - 23-00 Leicester 3 - 1 Liverpool/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:01",
            "label": "whistle",
            "description": "That's it for today, Michael Oliver has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 46:24",
            "label": "",
            "description": "A pass from James Milner (Liverpool) is intercepted by Kasper Schmeichel and the move breaks down."
        },
        {
            "gameTime": "2 - 45:01",
            "label": "substitution",
            "description": "A substitution has been made. Marc Albrighton is replaced by Benjamin Chilwell (Leicester)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 5 min. of added time."
        },
        {
            "gameTime": "2 - 43:36",
            "label": "attendance",
            "description": "The attendance for today's match is 32034."
        },
        {
            "gameTime": "2 - 43:31",
            "label": "",
            "description": "Demarai Gray (Leicester) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 43:07",
            "label": "corner",
            "description": "James Milner (Liverpool) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 42:55",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Nathaniel Clyne (Liverpool). Liverpool will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 41:38",
            "label": "corner",
            "description": "Benjamin Woodburn (Liverpool) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 41:15",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) is unlucky with a low drive from the edge of the box. A decent save by Kasper Schmeichel stops the ball from hitting the middle of the net. Liverpool earn a corner."
        },
        {
            "gameTime": "2 - 40:47",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "2 - 38:12",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to substitute Lucas Leiva and he is replaced by Benjamin Woodburn (Liverpool)."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "",
            "description": "Jamie Vardy (Leicester) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 37:09",
            "label": "injury",
            "description": "Jamie Vardy (Leicester) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 36:07",
            "label": "corner",
            "description": "Philippe Coutinho (Liverpool) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 34:18",
            "label": "substitution",
            "description": "Riyad Mahrez comes off the pitch to be replaced by Demarai Gray (Leicester)."
        },
        {
            "gameTime": "2 - 33:17",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) wastes a big chance! He unleashes a shot from the edge of the box and it goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 32:29",
            "label": "corner",
            "description": "The goalkeeper punched the ball away after James Milner (Liverpool) took the corner."
        },
        {
            "gameTime": "2 - 31:12",
            "label": "",
            "description": "Christian Fuchs (Leicester) had an opportunity from long range. His low shot was directed towards the middle of the goal, but Simon Mignolet was alert and made a comfortable save."
        },
        {
            "gameTime": "2 - 30:41",
            "label": "",
            "description": "Liverpool control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 23:35",
            "label": "substitution",
            "description": "The manager makes a subsitution with Daniel Amartey (Leicester) coming on for Shinji Okazaki."
        },
        {
            "gameTime": "2 - 22:44",
            "label": "soccer-ball",
            "description": "Philippe Coutinho (Liverpool) scores! He latches on to a pass and produces a perfect strike from the edge of the box that goes inside the left post and past the goalkeeper."
        },
        {
            "gameTime": "2 - 20:53",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to make a change. Divock Origi (Liverpool) replaces Adam Lallana."
        },
        {
            "gameTime": "2 - 20:42",
            "label": "substitution",
            "description": "It will be a substitution. Alberto Moreno (Liverpool) is ready to enter the pitch as Sadio Mane walks off."
        },
        {
            "gameTime": "2 - 19:47",
            "label": "corner",
            "description": "Philippe Coutinho (Liverpool) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 19:24",
            "label": "",
            "description": "Adam Lallana (Liverpool) fashions a shot from the edge of the box after receiving an accurate pass. Kasper Schmeichel makes a stunning save to stop the effort from flying into the right side of the goal. Liverpool win a corner."
        },
        {
            "gameTime": "2 - 14:55",
            "label": "soccer-ball",
            "description": "The ball hits the back of the net! Christian Fuchs showcases his brilliant technique and produces a beautiful lofted cross into the box. Jamie Vardy (Leicester) gets onto the scoresheet by sweetly heading it low inside the right post – 3:0."
        },
        {
            "gameTime": "2 - 13:58",
            "label": "",
            "description": "The linesman raises his flag. Jamie Vardy (Leicester) is adjudged offside."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "corner",
            "description": "The corner from Philippe Coutinho (Liverpool) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 11:47",
            "label": "",
            "description": "Sadio Mane (Liverpool) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. Liverpool force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 09:02",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) aims a low effort to the middle of the goal, but the goalkeeper makes a comfortable save."
        },
        {
            "gameTime": "2 - 07:34",
            "label": "",
            "description": "Neat passing move from Liverpool in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:56",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:35",
            "label": "corner",
            "description": "Philippe Coutinho (Liverpool) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 46:21",
            "label": "",
            "description": "Emre Can (Liverpool) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the bottom right corner is, however, superbly saved by Kasper Schmeichel! The referee and his assistant both point at the corner flag. Liverpool will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 40:49",
            "label": "corner",
            "description": "The resulting corner from Philippe Coutinho (Liverpool) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 38:16",
            "label": "soccer-ball",
            "description": "What an absolute cracking goal! Daniel Drinkwater (Leicester) hits a perfect volley from long range and the ball flies into the bottom right corner. Take a bow son."
        },
        {
            "gameTime": "1 - 36:26",
            "label": "corner",
            "description": "Riyad Mahrez (Leicester) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 36:08",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) sends a pass into the box, but his attempt is thwarted and cleared. The linesman points to the corner flag, Leicester are going to take it."
        },
        {
            "gameTime": "1 - 30:00",
            "label": "corner",
            "description": "James Milner (Liverpool) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 29:47",
            "label": "",
            "description": "James Milner (Liverpool) tries to slide the ball through to a teammate but it's well blocked by a defender. Liverpool will take a corner kick."
        },
        {
            "gameTime": "1 - 29:15",
            "label": "",
            "description": "Danny Simpson (Leicester) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 27:22",
            "label": "soccer-ball",
            "description": "Goal! Marc Albrighton slips it to Jamie Vardy (Leicester) on the edge of the box and he finds the bottom right corner with a great effort. The score is 1:0."
        },
        {
            "gameTime": "1 - 26:13",
            "label": "injury",
            "description": "Danny Simpson (Leicester) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "1 - 25:24",
            "label": "",
            "description": "The ball is cleared after Philippe Coutinho (Liverpool) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 20:12",
            "label": "corner",
            "description": "Riyad Mahrez (Leicester) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "1 - 19:59",
            "label": "",
            "description": "Jamie Vardy (Leicester) shoots from the edge of the penalty area. The ball travels towards the target, but Simon Mignolet easily deals with the threat. The linesman makes the right call and Leicester will have a corner."
        },
        {
            "gameTime": "1 - 19:04",
            "label": "corner",
            "description": "James Milner (Liverpool) sends in a poor cross from the corner and Kasper Schmeichel has no trouble gathering it."
        },
        {
            "gameTime": "1 - 18:40",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance. Liverpool get a corner."
        },
        {
            "gameTime": "1 - 14:28",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 10:48",
            "label": "",
            "description": "Joel Matip (Liverpool) is penalised for a foul. Michael Oliver had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 10:28",
            "label": "corner",
            "description": "The corner kick from Philippe Coutinho (Liverpool) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 10:20",
            "label": "corner",
            "description": "Corner kick. Philippe Coutinho (Liverpool) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 09:54",
            "label": "",
            "description": "Sadio Mane (Liverpool) tries to send a pass but it's blocked. Liverpool force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 06:59",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 06:29",
            "label": "",
            "description": "Shinji Okazaki (Leicester) attempts to convert a cross into a goal, but his promising header from near the penalty spot towards the right post is denied by a decent save from Simon Mignolet. The ball goes out of play and Leicester have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 03:53",
            "label": "",
            "description": "The linesman raises his flag for offside before Riyad Mahrez (Leicester) heads on."
        },
        {
            "gameTime": "1 - 03:18",
            "label": "corner",
            "description": "Marc Albrighton (Leicester) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 03:05",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) fails to find any of his teammates inside the box as his pass is blocked. The referee signals a corner kick to Leicester."
        },
        {
            "gameTime": "1 - 02:28",
            "label": "",
            "description": "Sadio Mane (Liverpool) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 01:04",
            "label": "injury",
            "description": "The game is interrupted now, Sadio Mane (Liverpool) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 00:47",
            "label": "",
            "description": "Michael Oliver blows for a foul after Jamie Vardy (Leicester) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Leicester will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Michael Oliver will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester have not scored a goal in their last 6 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "54:30 That's the number of goals Liverpool have scored and conceded."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester have lost 5 matches in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's it for today, Michael Oliver has blown his whistle and the game is over."
        }
    ],
    "gameAwayTeam": "Liverpool",
    "gameDate": "27/02/2017 - 23:00",
    "gameHomeTeam": "Leicester",
    "gameScore": "3 - 1"
}