{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-03 - 22-45 B. Monchengladbach 1 - 1 Juventus/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The host team were superior on the pitch today. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        },
        {
            "gameTime": "2 - 48:17",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:55",
            "label": "",
            "description": "Thorgan Hazard (B. Monchengladbach) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 45:55",
            "label": "",
            "description": "Paul Pogba (Juventus) sends a teasing cross into the area, but Yann Sommer intercepts the ball."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:10",
            "label": "",
            "description": "Thorgan Hazard (B. Monchengladbach) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "corner",
            "description": "Ibrahima Traore (B. Monchengladbach) works the corner short."
        },
        {
            "gameTime": "2 - 43:29",
            "label": "",
            "description": "What a sweet touch by Thorgan Hazard (B. Monchengladbach) after latching on to a fine pass on the edge of the box! He finds some space and unleashes a cannonball towards the roof of the net. The goalkeeper makes a brilliant save, pushing the ball onto the post. The referee and his assistant both point at the corner flag. B. Monchengladbach will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "substitution",
            "description": "Massimiliano Allegri has decided to introduce fresh legs, with Mario Lemina (Juventus) replacing Stefano Sturaro."
        },
        {
            "gameTime": "2 - 41:33",
            "label": "corner",
            "description": "Oscar Wendt (B. Monchengladbach) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 41:15",
            "label": "",
            "description": "Mahmoud Dahoud (B. Monchengladbach) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort. The referee signals a corner kick to B. Monchengladbach."
        },
        {
            "gameTime": "2 - 39:41",
            "label": "substitution",
            "description": "Here is a change. Fabian Johnson is going off and Andre Schubert gives the last tactical orders to Thorgan Hazard (B. Monchengladbach)."
        },
        {
            "gameTime": "2 - 38:47",
            "label": "",
            "description": "Oscar Wendt (B. Monchengladbach) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "",
            "description": "B. Monchengladbach are just stroking the ball across the park now, but the defence is doing very well breaking up their possession."
        },
        {
            "gameTime": "2 - 34:59",
            "label": "attendance",
            "description": "The attendance for today's match is 46217."
        },
        {
            "gameTime": "2 - 34:18",
            "label": "",
            "description": "Oscar Wendt (B. Monchengladbach) latches on to a pin point through ball, but one of the defending players dispossess him. Brilliant defending."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "",
            "description": "Nice passing game by B. Monchengladbach. They are increasing their possession with a series of long passes and waiting for the right moment to create an attacking opportunity."
        },
        {
            "gameTime": "2 - 31:50",
            "label": "",
            "description": "What a save from Gianluigi Buffon! Lars Stindl (B. Monchengladbach) jumps high to meet a cross and glances a promising header from close range, but the goalkeeper pulls off a brilliant stop to keep it out."
        },
        {
            "gameTime": "2 - 29:21",
            "label": "substitution",
            "description": "Substitution. Alvaro Morata leaves the pitch and is replaced by Andrea Barzagli (Juventus)."
        },
        {
            "gameTime": "2 - 28:25",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) goes on a mazy run and tries his luck with a mid range strike, but one of the defending players steps in and makes a block."
        },
        {
            "gameTime": "2 - 27:53",
            "label": "",
            "description": "B. Monchengladbach keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "2 - 26:55",
            "label": "funfact",
            "description": "The percentage of ball possession is – 67:33."
        },
        {
            "gameTime": "2 - 26:31",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 25:20",
            "label": "corner",
            "description": "Ibrahima Traore (B. Monchengladbach) takes a short corner kick."
        },
        {
            "gameTime": "2 - 25:06",
            "label": "",
            "description": "Fabian Johnson (B. Monchengladbach) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety. The ball is out of play. B. Monchengladbach win a corner kick."
        },
        {
            "gameTime": "2 - 23:10",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Ibrahima Traore (B. Monchengladbach), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 22:52",
            "label": "",
            "description": "Granit Xhaka (B. Monchengladbach) with a wonderful solo effort. He blasted from long range, but the shot towards the bottom left corner was thwarted by Gianluigi Buffon. The referee blows his whistle, B. Monchengladbach are awarded a corner kick."
        },
        {
            "gameTime": "2 - 21:56",
            "label": "y-card",
            "description": "Stefano Sturaro (Juventus) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Bjorn Kuipers didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 20:11",
            "label": "",
            "description": "B. Monchengladbach seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 18:53",
            "label": "",
            "description": "Chance! Fabian Johnson (B. Monchengladbach) comes within inches of scoring after picking up a pass from Oscar Wendt, but his shot from inside the box flashes just over the bar."
        },
        {
            "gameTime": "2 - 17:40",
            "label": "substitution",
            "description": "The substitution is prepared. Juan Cuadrado (Juventus) joins the action as a substitute, replacing Paulo Dybala."
        },
        {
            "gameTime": "2 - 17:36",
            "label": "y-card",
            "description": "Paulo Dybala (Juventus) is literally asking for a yellow card with his behaviour. The referee agrees and books him."
        },
        {
            "gameTime": "2 - 16:53",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Paulo Dybala (Juventus)."
        },
        {
            "gameTime": "2 - 16:48",
            "label": "",
            "description": "The ball is cleared after Paul Pogba (Juventus) attempted to dribble past an opposing player. Juventus force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 15:59",
            "label": "corner",
            "description": "The corner from Paulo Dybala (Juventus) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 15:31",
            "label": "",
            "description": "Paul Pogba (Juventus) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort. The referee points to the corner flag and Juventus will take a corner."
        },
        {
            "gameTime": "2 - 13:59",
            "label": "",
            "description": "Bjorn Kuipers blows the whistle, Raffael (B. Monchengladbach) is penalised for a foul. Juventus are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 12:51",
            "label": "",
            "description": "Mahmoud Dahoud (B. Monchengladbach) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards wide of the right post."
        },
        {
            "gameTime": "2 - 10:59",
            "label": "corner",
            "description": "Ibrahima Traore (B. Monchengladbach) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 10:53",
            "label": "",
            "description": "Oscar Wendt (B. Monchengladbach) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. B. Monchengladbach have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 10:25",
            "label": "y-card",
            "description": "The foul by Claudio Marchisio (Juventus) is worthy of a card and a yellow is duly shown by Bjorn Kuipers."
        },
        {
            "gameTime": "2 - 09:59",
            "label": "",
            "description": "Alvaro Dominguez (B. Monchengladbach) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 09:44",
            "label": "",
            "description": "That's a well taken pass by Mahmoud Dahoud (B. Monchengladbach). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 09:26",
            "label": "corner",
            "description": "Ibrahima Traore (B. Monchengladbach) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 09:06",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) wastes a good opportunity as his pass into the box is blocked by the defence. The ball is out of play and the linesman points at the corner flag. Corner to B. Monchengladbach."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "injury",
            "description": "Alvaro Dominguez (B. Monchengladbach) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 07:30",
            "label": "r-card",
            "description": "Hernanes (Juventus) makes an ugly challenge on his opponent and receives a red card from the referee!"
        },
        {
            "gameTime": "2 - 05:55",
            "label": "corner",
            "description": "Paulo Dybala (Juventus) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 05:41",
            "label": "",
            "description": "Leonardo Bonucci (Juventus) leaps like a salmon to produce a header from the resulting corner, but one of the defending players intercepts the ball and averts the danger. Juventus will take a corner kick."
        },
        {
            "gameTime": "2 - 05:20",
            "label": "corner",
            "description": "Hernanes (Juventus) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 04:57",
            "label": "corner",
            "description": "Paulo Dybala (Juventus) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety. Juventus have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 04:32",
            "label": "",
            "description": "Alvaro Morata (Juventus) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. The ball goes out for a corner. Juventus can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 03:28",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Paul Pogba (Juventus)."
        },
        {
            "gameTime": "2 - 02:36",
            "label": "",
            "description": "Stefano Sturaro (Juventus) sends a pass into the box, but his attempt is thwarted and cleared. The ball is out of play. Juventus will have a throw in."
        },
        {
            "gameTime": "2 - 01:59",
            "label": "",
            "description": "The foul by Leonardo Bonucci (Juventus) was seen by Bjorn Kuipers who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 01:58",
            "label": "corner",
            "description": "Paulo Dybala (Juventus) will take the corner."
        },
        {
            "gameTime": "2 - 01:06",
            "label": "",
            "description": "Paul Pogba (Juventus) knew what to do with the ball, but was just a bit unlucky. After receiving a pass, he sent the ball goalwards from some 24 metres out, but he missed the right post by a whisker."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. Neither side has gained the upper hand as yet. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 46:04",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:34",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Juventus."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:45",
            "label": "soccer-ball",
            "description": "Sensational! Stephan Lichtsteiner (Juventus) shows off his superb ability as he volleys the ball from inside the box onto the bottom of the left post and into the net. The assist goes to Paul Pogba and the score changes to 1:1."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "",
            "description": "Lars Stindl (B. Monchengladbach) collects a pass and has an effort from 20 metres out, but it flies just over the crossbar."
        },
        {
            "gameTime": "1 - 39:03",
            "label": "corner",
            "description": "Paulo Dybala (Juventus) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 38:40",
            "label": "",
            "description": "Patrice Evra (Juventus) creates himself some space inside the goalmouth and connects with the free kick. His accurate header would have probably ended up in the bottom left corner, but Yann Sommer pulls off a superb reflex save to thwart him. The referee points to the corner flag. It's a corner to Juventus."
        },
        {
            "gameTime": "1 - 38:20",
            "label": "",
            "description": "Paulo Dybala (Juventus) takes a direct free kick."
        },
        {
            "gameTime": "1 - 37:54",
            "label": "",
            "description": "Referee Bjorn Kuipers sees the trip by Oscar Wendt (B. Monchengladbach) and doesn't hesitate to blow his whistle. Juventus are awarded a free kick."
        },
        {
            "gameTime": "1 - 36:59",
            "label": "",
            "description": "B. Monchengladbach hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "1 - 33:31",
            "label": "",
            "description": "Hernanes (Juventus) creates himself some space on the edge of the box and unleashes a strong shot which is blocked by a defender."
        },
        {
            "gameTime": "1 - 31:54",
            "label": "",
            "description": "Granit Xhaka (B. Monchengladbach) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 30:58",
            "label": "",
            "description": "Bjorn Kuipers blows his whistle and it's Paul Pogba (Juventus) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 30:38",
            "label": "",
            "description": "A lofted cross from Ibrahima Traore (B. Monchengladbach) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 29:59",
            "label": "",
            "description": "B. Monchengladbach keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "1 - 28:36",
            "label": "",
            "description": "Hernanes (Juventus) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 27:24",
            "label": "",
            "description": "Granit Xhaka (B. Monchengladbach) knew what to do with the ball, but was just a bit unlucky. After receiving a pass, he sent the ball goalwards from some 23 metres out, but it flew just over the bar."
        },
        {
            "gameTime": "1 - 25:50",
            "label": "",
            "description": "Giorgio Chiellini (Juventus) was the quickest one to orientate himself inside the box and leaps to connect with a cross from the corner kick. He produces a fine header, but it flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 25:27",
            "label": "corner",
            "description": "Paulo Dybala (Juventus) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 24:52",
            "label": "",
            "description": "Wow, what an escape. Paulo Dybala (Juventus) has an effort from inside the box but it's brilliantly blocked. The ball is out of play. Juventus will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 23:56",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Havard Nordtveit (B. Monchengladbach) sacrificed accuracy for power, and thus his attempt went well over the bar. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "1 - 23:41",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 22:52",
            "label": "",
            "description": "Havard Nordtveit (B. Monchengladbach) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the bottom right corner is, however, superbly saved by Gianluigi Buffon!"
        },
        {
            "gameTime": "1 - 21:50",
            "label": "corner",
            "description": "Ibrahima Traore (B. Monchengladbach) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 21:37",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) fashions a shot from the edge of the box after receiving an accurate pass. Gianluigi Buffon makes a stunning save to stop the effort from flying into the roof of the net. The ball goes out of play. B. Monchengladbach are awarded a corner kick."
        },
        {
            "gameTime": "1 - 21:19",
            "label": "corner",
            "description": "Ibrahima Traore (B. Monchengladbach) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 20:56",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) tries to send the ball in front of the goal, but the opposition's defence averts the threat. B. Monchengladbach get a corner."
        },
        {
            "gameTime": "1 - 19:44",
            "label": "",
            "description": "An attempted cross from Stephan Lichtsteiner (Juventus) is cleared. The linesman signals a throw in for Juventus."
        },
        {
            "gameTime": "1 - 17:37",
            "label": "soccer-ball",
            "description": "Fabian Johnson (B. Monchengladbach) latches on to a precise pass deep inside the box from Raffael, and he beats the goalkeeper with a low accurate shot into the bottom left corner. He makes it 1:0."
        },
        {
            "gameTime": "1 - 17:30",
            "label": "",
            "description": "Oscar Wendt (B. Monchengladbach) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 16:26",
            "label": "",
            "description": "B. Monchengladbach control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 14:28",
            "label": "",
            "description": "The linesman raises his flag for offside before Stefano Sturaro (Juventus) heads on."
        },
        {
            "gameTime": "1 - 13:02",
            "label": "",
            "description": "Mahmoud Dahoud (B. Monchengladbach) collects an accurate pass and tries his luck from about 24 metres. He was very close to scoring, but the ball ends up hitting the bar."
        },
        {
            "gameTime": "1 - 11:53",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Havard Nordtveit (B. Monchengladbach), but the defence gets it clear."
        },
        {
            "gameTime": "1 - 10:44",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) looks to break free, but an opposing player clears the ball away. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "1 - 09:08",
            "label": "",
            "description": "B. Monchengladbach enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 07:37",
            "label": "",
            "description": "Mahmoud Dahoud (B. Monchengladbach) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 06:50",
            "label": "",
            "description": "Bjorn Kuipers blows his whistle for a foul after Hernanes (Juventus) hacks down one of his opponents. B. Monchengladbach win a free kick. B. Monchengladbach try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "1 - 06:26",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) passes the ball into the box but an opposing player clears."
        },
        {
            "gameTime": "1 - 04:42",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 04:23",
            "label": "",
            "description": "B. Monchengladbach spell of possession comes to an end after a mistake."
        },
        {
            "gameTime": "1 - 03:16",
            "label": "",
            "description": "Alvaro Morata (Juventus) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 02:01",
            "label": "",
            "description": "Patrice Evra (Juventus) misses a rebound from the penalty spot. The ball flies just a few inches over the bar."
        },
        {
            "gameTime": "1 - 01:45",
            "label": "",
            "description": "The free kick from long range, taken by Juventus, is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 01:18",
            "label": "",
            "description": "Bjorn Kuipers blows his whistle after Oscar Wendt (B. Monchengladbach) brings one of his opponents down with a strong tackle. Free kick. Juventus will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Juventus will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bjorn Kuipers will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The host team were superior on the pitch today. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        }
    ],
    "gameAwayTeam": "Juventus",
    "gameDate": "03/11/2015 - 22:45",
    "gameHomeTeam": "B. Monchengladbach",
    "gameScore": "1 - 1"
}