{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-01-15 - 17-00 Napoli 3 - 1 Pescara/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The host team were better throughout the game. The tactic of the home side was slow build up play and the away side was creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "2 - 48:58",
            "label": "whistle",
            "description": "That's it for today, Claudio Gavillucci has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:55",
            "label": "soccer-ball",
            "description": "Gianluca Caprari (Pescara) makes no mistake from the penalty spot after waiting for Pepe Reina to move before rolling the ball into the middle of the goal!"
        },
        {
            "gameTime": "2 - 48:34",
            "label": "",
            "description": "Gianluca Caprari (Pescara) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 48:08",
            "label": "penalty",
            "description": "A clumsy foul by Elseid Hysaj (Napoli) and Claudio Gavillucci blows his whistle. Pescara are about to take a penalty!"
        },
        {
            "gameTime": "2 - 46:27",
            "label": "",
            "description": "Good team movement sets up Dries Mertens (Napoli) on the edge of the box, but he slices the ball narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:27",
            "label": "",
            "description": "A cross is clipped into the penalty area by Emanuele Giaccherini (Napoli) but poses no threat."
        },
        {
            "gameTime": "2 - 43:40",
            "label": "",
            "description": "Emanuele Giaccherini (Napoli) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the right hand post, but Albano Bizzarri was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "substitution",
            "description": "Ivan Strinic goes off the pitch and Cristian Maggio (Napoli) comes on."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "soccer-ball",
            "description": "Goal 3:0! Allan laid the ball off to Dries Mertens (Napoli), who shot from close range low into the back of the net, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 38:37",
            "label": "corner",
            "description": "Ledian Memushaj (Pescara) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 37:19",
            "label": "",
            "description": "Emanuele Giaccherini (Napoli) makes a reckless foul in order to win the ball from his opponent. Claudio Gavillucci has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 36:55",
            "label": "",
            "description": "Michele Fornasier (Pescara) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "2 - 34:28",
            "label": "substitution",
            "description": "Maurizio Sarri prepares a substitution. Lorenzo Insigne is replaced by Emanuele Giaccherini (Napoli)."
        },
        {
            "gameTime": "2 - 32:33",
            "label": "",
            "description": "Dario Zuparic (Pescara) commits a rough challenge and Claudio Gavillucci blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 30:28",
            "label": "",
            "description": "Dries Mertens (Napoli) wastes a promising chance! He tries his luck with a shot from mid range, but his effort hits the crossbar! A few inches lower and it could have been a sweet goal!"
        },
        {
            "gameTime": "2 - 30:14",
            "label": "corner",
            "description": "The resulting corner from Jose Callejon (Napoli) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 29:44",
            "label": "",
            "description": "Dries Mertens (Napoli) blasts the ball from just outside the box, but his attempt is blocked by the defender. The ball goes out for a corner. Napoli can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 28:09",
            "label": "",
            "description": "A brilliant individual effort! Jose Callejon (Napoli) tricks his way past challenges into the box and drags his shot narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 26:50",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Alberto Cerri (Pescara) for Alberto Gilardino."
        },
        {
            "gameTime": "2 - 25:46",
            "label": "",
            "description": "An attempted cross from Bryan Cristante (Pescara) is cleared."
        },
        {
            "gameTime": "2 - 24:40",
            "label": "substitution",
            "description": "Massimo Oddo has decided to make a change. Alexandru Ionut Mitrita (Pescara) replaces Valerio Verre."
        },
        {
            "gameTime": "2 - 24:10",
            "label": "corner",
            "description": "The corner from Ivan Strinic (Napoli) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 23:37",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) produces a ferocious strike from the edge of the box. His dangerous effort towards the roof of the net is blocked by Albano Bizzarri, who pulls off a superb save to keep the ball out of the net. The linesman makes the right call and Napoli will have a corner."
        },
        {
            "gameTime": "2 - 22:34",
            "label": "",
            "description": "Neat passing move from Pescara in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 19:27",
            "label": "substitution",
            "description": "Here is a change. is going off and Maurizio Sarri gives the last tactical orders to Allan (Napoli)."
        },
        {
            "gameTime": "2 - 19:00",
            "label": "corner",
            "description": "Ahmad Benali (Pescara) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 18:51",
            "label": "substitution",
            "description": "Here comes a substitution. Alessandro Bruno is given a rest as he is replaced by Michele Fornasier (Pescara)."
        },
        {
            "gameTime": "2 - 18:17",
            "label": "",
            "description": "Gianluca Caprari (Pescara) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger. Now Pescara have a corner."
        },
        {
            "gameTime": "2 - 17:10",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 15:34",
            "label": "",
            "description": "That was close by Ahmad Benali (Pescara)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the right post."
        },
        {
            "gameTime": "2 - 13:49",
            "label": "",
            "description": "Elseid Hysaj (Napoli) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "injury",
            "description": "Gianluca Caprari (Pescara) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 09:32",
            "label": "",
            "description": "What a great effort! Lorenzo Insigne (Napoli) decides to unleash a long range shot. Despite hitting it very well, it scorches inches over the crossbar. We could have witnessed a magnificent goal."
        },
        {
            "gameTime": "2 - 08:30",
            "label": "y-card",
            "description": "Albano Bizzarri (Pescara) picks up a yellow card."
        },
        {
            "gameTime": "2 - 07:23",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 06:40",
            "label": "corner",
            "description": "The resulting corner from Ivan Strinic (Napoli) is cleared. The ball is out of play and the linesman points at the corner flag. Corner to Napoli."
        },
        {
            "gameTime": "2 - 05:48",
            "label": "",
            "description": "Elseid Hysaj (Napoli) crosses the ball into the box, but one of the defending players averts the threat. The ball is out of play. Napoli will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 04:00",
            "label": "soccer-ball",
            "description": "It's a goal! Marek Hamsik (Napoli) shows off his superb ability as he volleys the ball from inside the box into the right side of the target. The assist goes to and the score changes to 2:0."
        },
        {
            "gameTime": "2 - 02:10",
            "label": "",
            "description": "Jose Callejon (Napoli) receives a low pass just outside the box and unleashes a fine strike towards the right post. Albano Bizzarri pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "2 - 01:42",
            "label": "soccer-ball",
            "description": "The ball is whipped in from the free kick and finds Lorenzo Tonelli (Napoli), who rises and produces an amazing header into the top right corner."
        },
        {
            "gameTime": "2 - 00:36",
            "label": "",
            "description": "Claudio Gavillucci blows for a foul after Dario Zuparic (Pescara) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "",
            "description": "Let's hope the managers of both teams will be able to stir up the players as up till now the game has lacked any interesting or exciting moments. The home fans will be really pleased with what they've seen from their players so far. The home team are playing possession football, while the away team look to find a weakness in the opposition's defence mainly with their rapid counter attacks."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 43:17",
            "label": "",
            "description": "Gianluca Caprari (Pescara) attempts to score from a mid range free kick, but he curls his effort a few inches over the crossbar."
        },
        {
            "gameTime": "1 - 43:15",
            "label": "y-card",
            "description": "A yellow card for a tackle by Ahmad Benali (Pescara). Claudio Gavillucci doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 42:18",
            "label": "y-card",
            "description": "Today's referee Claudio Gavillucci rightly decides to book Lorenzo Tonelli (Napoli) for his harsh tackle."
        },
        {
            "gameTime": "1 - 40:00",
            "label": "y-card",
            "description": "Claudio Gavillucci shows a yellow card to Andrea Coda (Pescara) for a tough tackle."
        },
        {
            "gameTime": "1 - 38:36",
            "label": "",
            "description": "Dries Mertens (Napoli) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 37:00",
            "label": "",
            "description": "Ahmad Benali (Pescara) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "1 - 36:13",
            "label": "",
            "description": "Jose Callejon (Napoli) makes a rough challenge and Claudio Gavillucci blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 34:51",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) attempted to pick out a free teammate inside the box, but Albano Bizzarri comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 33:54",
            "label": "",
            "description": "Dries Mertens (Napoli) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 32:34",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) has a goal ruled out for offside!"
        },
        {
            "gameTime": "1 - 31:45",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 30:20",
            "label": "",
            "description": "Elseid Hysaj (Napoli) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "1 - 29:04",
            "label": "",
            "description": "Alberto Gilardino (Pescara) makes a strong challenge and Claudio Gavillucci blows for a foul."
        },
        {
            "gameTime": "1 - 28:02",
            "label": "",
            "description": "Dries Mertens (Napoli) serves up a nice cross, but Albano Bizzarri punches the ball away."
        },
        {
            "gameTime": "1 - 27:32",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 26:29",
            "label": "",
            "description": "Ledian Memushaj (Pescara) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 24:53",
            "label": "",
            "description": "Ivan Strinic (Napoli) plays an extraordinary diagonal pass and Elseid Hysaj darts into free space to control the ball."
        },
        {
            "gameTime": "1 - 22:21",
            "label": "",
            "description": "Dries Mertens (Napoli) controls a nice lofted pass and shoots from the edge of the box, but his attempt is neither hard nor precise, so Albano Bizzarri stops it easily."
        },
        {
            "gameTime": "1 - 21:48",
            "label": "",
            "description": "Dries Mertens (Napoli) sends a pass into the penalty area, but the opponent manages to cut it out."
        },
        {
            "gameTime": "1 - 20:26",
            "label": "",
            "description": "Ahmad Benali (Pescara) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "1 - 18:41",
            "label": "",
            "description": "dinks a cross into the box from the free kick. However, the opposition defence thwarts the attack, preventing anyone from finishing."
        },
        {
            "gameTime": "1 - 18:05",
            "label": "",
            "description": "Andrea Coda (Pescara) gives away a foul for a clumsy challenge. Referee Claudio Gavillucci saw the whole situation. Free kick. Napoli will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 15:35",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "1 - 14:13",
            "label": "",
            "description": "Jose Callejon (Napoli) receives the ball in the penalty box and immediately fires a first time effort that sails well wide of the right post."
        },
        {
            "gameTime": "1 - 12:44",
            "label": "",
            "description": "The linesman raises his flag. Alberto Gilardino (Pescara) is adjudged offside."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "",
            "description": "Jose Callejon (Napoli) missed a big chance! He produces a stunning volley from inside the box, but his effort goes not far wide of the right post."
        },
        {
            "gameTime": "1 - 11:34",
            "label": "",
            "description": "Napoli keep the ball well and push forward with purpose, but here comes an interception from the opposition."
        },
        {
            "gameTime": "1 - 10:00",
            "label": "",
            "description": "Ledian Memushaj (Pescara) commits a rough challenge and Claudio Gavillucci blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 08:39",
            "label": "",
            "description": "Dries Mertens (Napoli) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "1 - 08:25",
            "label": "corner",
            "description": "Jose Callejon (Napoli) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 08:21",
            "label": "",
            "description": "Marek Hamsik (Napoli) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post. The ball goes out of play and Pescara will have a goal kick."
        },
        {
            "gameTime": "1 - 06:39",
            "label": "",
            "description": "The linesman raises his flag for offside before Ahmad Benali (Pescara) heads on."
        },
        {
            "gameTime": "1 - 05:46",
            "label": "",
            "description": "Pepe Reina is alert and has a clear sight of a long through ball from Dario Zuparic (Pescara). Easy save!"
        },
        {
            "gameTime": "1 - 04:07",
            "label": "corner",
            "description": "The corner from Jose Callejon (Napoli) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 03:40",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) gets on the end of a pass on the edge of the box but his shot is blocked. Good work from Napoli as they win a corner."
        },
        {
            "gameTime": "1 - 02:32",
            "label": "",
            "description": "Gianluca Caprari (Pescara) trips an opponent with a slide tackle. Claudio Gavillucci stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 01:37",
            "label": "",
            "description": "Ahmad Benali (Pescara) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 00:49",
            "label": "",
            "description": "Valerio Verre (Pescara) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pescara will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Claudio Gavillucci."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pescara are now without a win in their last 16 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dries Mertens from Napoli will look to add to his goal tally, he has netted 11 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The host team were better throughout the game. The tactic of the home side was slow build up play and the away side was creating their opportunities using lightning fast counter attacks."
        }
    ],
    "gameAwayTeam": "Pescara",
    "gameDate": "15/01/2017 - 17:00",
    "gameHomeTeam": "Napoli",
    "gameScore": "3 - 1"
}