{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-02-27 - 18-00 Real Madrid 0 - 1 Atl. Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. There wasn't any evident superiority by either side today. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 46:44",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) has received a yellow card for his foul."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "y-card",
            "description": "A yellow card is awarded to Daniel Carvajal (Real Madrid)."
        },
        {
            "gameTime": "2 - 45:58",
            "label": "y-card",
            "description": "Angel Correa (Atl. Madrid) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Carlos Clos Gomez didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:32",
            "label": "attendance",
            "description": "The attendance for today's match is 79436."
        },
        {
            "gameTime": "2 - 42:35",
            "label": "",
            "description": "CHANCE! Danilo (Real Madrid) fires just wide of the right post from inside the box after running onto a splendid pass from Jese."
        },
        {
            "gameTime": "2 - 41:12",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) sends a long ball in, but Jan Oblak comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 38:43",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) latched on to an accurate cross inside the box and attempted to direct the ball with a nice header towards the net, but the goalkeeper reacted quickly to keep the ball out."
        },
        {
            "gameTime": "2 - 35:51",
            "label": "substitution",
            "description": "It is time for a substitution. Angel Correa (Atl. Madrid) is on for Fernando Torres."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "",
            "description": "Jese (Real Madrid) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "2 - 32:45",
            "label": "",
            "description": "Luka Modric (Real Madrid) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "substitution",
            "description": "The manager makes a subsitution with Matias Kranevitter (Atl. Madrid) coming on for Augusto Fernandez."
        },
        {
            "gameTime": "2 - 29:29",
            "label": "",
            "description": "Lucas (Real Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 27:00",
            "label": "y-card",
            "description": "Today's referee Carlos Clos Gomez rightly decides to book Jose Maria Gimenez (Atl. Madrid) for his harsh tackle."
        },
        {
            "gameTime": "2 - 26:41",
            "label": "",
            "description": "Borja Mayoral Moya (Real Madrid) picks up the rebound and shoots. The goalkeeper was ready and denies his effort with a fine save."
        },
        {
            "gameTime": "2 - 25:53",
            "label": "",
            "description": "Saul Niguez (Atl. Madrid) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "substitution",
            "description": "Substitution. Jese (Real Madrid) replaces Isco."
        },
        {
            "gameTime": "2 - 24:20",
            "label": "injury",
            "description": "The game is interrupted now, Saul Niguez (Atl. Madrid) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "",
            "description": "A brilliant cross into the box finds Cristiano Ronaldo (Real Madrid), who directs his header to the middle of the goal, but the goalkeeper shows his reflexes and makes an astonishing save."
        },
        {
            "gameTime": "2 - 21:32",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Keylor Navas."
        },
        {
            "gameTime": "2 - 20:11",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "2 - 18:42",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) sends a teasing cross into the area, but Jan Oblak intercepts the ball."
        },
        {
            "gameTime": "2 - 16:55",
            "label": "y-card",
            "description": "Carlos Clos Gomez shows a yellow card to Lucas (Real Madrid), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 14:18",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) swings a cross into the box, but it's far too close to Keylor Navas, who smothers the ball."
        },
        {
            "gameTime": "2 - 14:00",
            "label": "",
            "description": "Isco (Real Madrid) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "substitution",
            "description": "James Rodriguez will be replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 11:07",
            "label": "corner",
            "description": "A dangerous looking corner kick from Toni Kroos (Real Madrid) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 10:48",
            "label": "",
            "description": "James Rodriguez (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "2 - 07:37",
            "label": "soccer-ball",
            "description": "Goal! Filipe Luis provides Antoine Griezmann (Atl. Madrid) with a nice pass inside the box. It allows him to finish with a precise effort inside the left post. 0:1."
        },
        {
            "gameTime": "2 - 06:19",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) was too forceful with his tackle and Carlos Clos Gomez interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 03:23",
            "label": "",
            "description": "Koke (Atl. Madrid) releases Antoine Griezmann with a precise pass and he attempts to finish, but is immediately surrounded by the defenders and loses the ball."
        },
        {
            "gameTime": "2 - 02:24",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Cristiano Ronaldo (Real Madrid), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Zinedine Zidane gives a chance to Borja Mayoral Moya (Real Madrid) and Karim Benzema is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. The home fans will be really pleased with what they've seen from their players so far. The home team are playing possession football, while the away team look to find a weakness in the opposition's defence mainly with their rapid counter attacks."
        },
        {
            "gameTime": "1 - 45:05",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:17",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) launches a cross from the corner, but Jan Oblak is alert to thwart the effort."
        },
        {
            "gameTime": "1 - 43:58",
            "label": "",
            "description": "James Rodriguez (Real Madrid) wastes a good opportunity as his pass into the box is blocked by the defence. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 43:34",
            "label": "",
            "description": "Carlos Clos Gomez blows his whistle as Koke (Atl. Madrid) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 42:24",
            "label": "corner",
            "description": "Koke (Atl. Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 42:09",
            "label": "",
            "description": "Koke (Atl. Madrid) beats a few defenders in the penalty area and drives a low shot towards the right side of the goal, but the goalkeeper reacts superbly to make a wonderful save. Atl. Madrid will take a corner kick."
        },
        {
            "gameTime": "1 - 40:57",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Koke (Atl. Madrid), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 40:34",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) decided to shoot after receiving a sweet pass. If it wasn't for Keylor Navas's superb save the ball would have probably ended up in the top of the net. The ball is out of play. Atl. Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 38:53",
            "label": "",
            "description": "Flag goes up against Saul Niguez (Atl. Madrid) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 38:42",
            "label": "corner",
            "description": "Koke (Atl. Madrid) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 38:14",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) looks to break free, but an opposing player clears the ball away. Now Atl. Madrid have a corner."
        },
        {
            "gameTime": "1 - 37:42",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 36:44",
            "label": "y-card",
            "description": "Filipe Luis (Atl. Madrid) picks up a yellow card for a foul."
        },
        {
            "gameTime": "1 - 35:33",
            "label": "",
            "description": "Danilo (Real Madrid) sends a cross into the box, but Jan Oblak comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 33:23",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 32:18",
            "label": "",
            "description": "Karim Benzema (Real Madrid) unleashes a decent effort from just outside the box which goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 31:17",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fires the resulting free kick on goal from a medium range, but sees his shot saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 30:21",
            "label": "y-card",
            "description": "Carlos Clos Gomez shows a yellow card to Diego Godin (Atl. Madrid) for a tough tackle."
        },
        {
            "gameTime": "1 - 27:56",
            "label": "",
            "description": "Flag up against Cristiano Ronaldo (Real Madrid). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 26:29",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 25:14",
            "label": "",
            "description": "Karim Benzema (Real Madrid) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 24:17",
            "label": "",
            "description": "The linesman raises his flag. Fernando Torres (Atl. Madrid) is adjudged offside."
        },
        {
            "gameTime": "1 - 21:44",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) makes an overly aggressive challenge and Carlos Clos Gomez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 18:57",
            "label": "",
            "description": "Raphael Varane (Real Madrid) shows good awareness deep inside the box as he latches on to a cross from the resulting free kick. He jumps high but his towering header lacks a little bit of accuracy and flies inches wide of the right hand post."
        },
        {
            "gameTime": "1 - 16:19",
            "label": "",
            "description": "Carlos Clos Gomez blows his whistle and signals a foul after Juanfran (Atl. Madrid) brought his opponent down. Real Madrid have a free kick."
        },
        {
            "gameTime": "1 - 15:26",
            "label": "",
            "description": "Real Madrid hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 13:14",
            "label": "",
            "description": "Carlos Clos Gomez blows his whistle after Fernando Torres (Atl. Madrid) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 10:41",
            "label": "corner",
            "description": "Koke (Atl. Madrid) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "1 - 10:20",
            "label": "",
            "description": "Filipe Luis (Atl. Madrid) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. The ball is out of play and Atl. Madrid manage to earn a corner."
        },
        {
            "gameTime": "1 - 09:41",
            "label": "",
            "description": "Antoine Griezmann sprays a wonderful pass out to Augusto Fernandez (Atl. Madrid), who cannot get enough power or direction to cause Keylor Navas problems and the goalkeeper is able to watch the ball go just wide of the right post."
        },
        {
            "gameTime": "1 - 09:28",
            "label": "corner",
            "description": "Koke (Atl. Madrid) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 09:03",
            "label": "",
            "description": "A lofted cross from Juanfran (Atl. Madrid) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The referee blows his whistle, Atl. Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 07:17",
            "label": "",
            "description": "Danilo (Real Madrid) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 04:36",
            "label": "",
            "description": "An attempted cross from Cristiano Ronaldo (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 03:05",
            "label": "",
            "description": "Juanfran (Atl. Madrid) robs an opponent of the ball and explodes in anger when Carlos Clos Gomez blows for a foul."
        },
        {
            "gameTime": "1 - 00:52",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) creates a yard of space for himself and tries an effort from the edge of the box, but it goes just wide of the left post."
        },
        {
            "gameTime": "1 - 00:40",
            "label": "",
            "description": "Karim Benzema (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 00:09",
            "label": "",
            "description": "Atl. Madrid will kick the game off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Carlos Clos Gomez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. There wasn't any evident superiority by either side today. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        }
    ],
    "gameAwayTeam": "Atl. Madrid",
    "gameDate": "27/02/2016 - 18:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "0 - 1"
}