{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-10-03 - 17-00 Manchester City 6 - 1 Newcastle Utd/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. Manchester City were dominant and more threatening of the two sides. It was a fairly one sided match. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was what is known as kick and rush football."
        },
        {
            "gameTime": "2 - 49:02",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 48:03",
            "label": "",
            "description": "Jesus Navas (Manchester City) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "2 - 47:37",
            "label": "corner",
            "description": "The corner from Florian Thauvin (Newcastle Utd) is intercepted by Joe Hart."
        },
        {
            "gameTime": "2 - 47:11",
            "label": "corner",
            "description": "Florian Thauvin (Newcastle Utd) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear. The referee points to the corner flag and Newcastle Utd will take a corner."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "Florian Thauvin (Newcastle Utd) tries to send a pass but it's blocked. Newcastle Utd get a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "2 - 42:05",
            "label": "y-card",
            "description": "Booking. Eliaquim Mangala (Manchester City) receives a caution from the referee."
        },
        {
            "gameTime": "2 - 42:04",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 42:02",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) sprays a pass out to Wilfried Bony, but he can't beat his man inside the box. It will be a corner kick for Manchester City."
        },
        {
            "gameTime": "2 - 41:50",
            "label": "attendance",
            "description": "The attendance for today's match is 53850."
        },
        {
            "gameTime": "2 - 39:49",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 36:11",
            "label": "y-card",
            "description": "Pablo Zabaleta (Manchester City) is booked after bringing down an opponent. Kevin Friend had an easy decision to make."
        },
        {
            "gameTime": "2 - 35:03",
            "label": "",
            "description": "Wilfried Bony (Manchester City) commits a foul after unfairly pressing his opponent during an attacking move."
        },
        {
            "gameTime": "2 - 32:58",
            "label": "",
            "description": "Wilfried Bony (Manchester City) makes a driving run into the box but he cannot work any space for a shot."
        },
        {
            "gameTime": "2 - 31:02",
            "label": "",
            "description": "Kelechi Iheanacho (Manchester City) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Tim Krul guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "substitution",
            "description": "Substitution. Kelechi Iheanacho (Manchester City) in, David Silva out."
        },
        {
            "gameTime": "2 - 28:04",
            "label": "",
            "description": "Wilfried Bony (Manchester City) spurns a great opportunity from inside the 6 yard box. The ball flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 26:28",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) tries to find Aleksandar Kolarov, but he puts too much power on the pass."
        },
        {
            "gameTime": "2 - 25:47",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 25:39",
            "label": "",
            "description": "Jesus Navas (Manchester City) serves up a nice cross, but Tim Krul punches the ball away. The ball is out of play. Manchester City win a corner kick."
        },
        {
            "gameTime": "2 - 24:08",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "2 - 22:25",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the right post."
        },
        {
            "gameTime": "2 - 22:10",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Kevin De Bruyne (Manchester City) takes it short."
        },
        {
            "gameTime": "2 - 21:48",
            "label": "",
            "description": "The ball is cleared after David Silva (Manchester City) attempted to dribble past an opposing player. The ball is out of play and the linesman points at the corner flag. Corner to Manchester City."
        },
        {
            "gameTime": "2 - 20:52",
            "label": "substitution",
            "description": "Moussa Sissoko goes off the pitch and Cheik Tiote (Newcastle Utd) comes on."
        },
        {
            "gameTime": "2 - 20:39",
            "label": "substitution",
            "description": "Steve McClaren has decided to introduce fresh legs, with Florian Thauvin (Newcastle Utd) replacing Yoan Gouffran."
        },
        {
            "gameTime": "2 - 20:02",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Sergio Aguero walks off the pitch to be replaced by Wilfried Bony (Manchester City)."
        },
        {
            "gameTime": "2 - 19:20",
            "label": "",
            "description": "Fabricio Coloccini (Newcastle Utd) brings his opponent down with a tackle and Kevin Friend blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 19:05",
            "label": "y-card",
            "description": "Fabricio Coloccini (Newcastle Utd) receives a yellow card for infringement."
        },
        {
            "gameTime": "2 - 16:53",
            "label": "soccer-ball",
            "description": "Goal! Kevin De Bruyne displays great vision and sends a pass to Sergio Aguero (Manchester City), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 6:1."
        },
        {
            "gameTime": "2 - 15:35",
            "label": "",
            "description": "Manchester City are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 14:30",
            "label": "soccer-ball",
            "description": "Sergio Aguero (Manchester City) scores! He latches on to a pass and produces a perfect strike from the edge of the box. The ball goes inside the right post and past the goalkeeper."
        },
        {
            "gameTime": "2 - 12:52",
            "label": "",
            "description": "Neat passing move from Manchester City in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 11:46",
            "label": "",
            "description": "Jamaal Lascelles (Newcastle Utd) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "2 - 10:35",
            "label": "injury",
            "description": "The game is interrupted now, Moussa Sissoko (Newcastle Utd) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 07:58",
            "label": "soccer-ball",
            "description": "Kevin De Bruyne (Manchester City) finds himself unmarked in the penalty box and gets himself on the end of a brilliant cross to smash the ball into the top left corner."
        },
        {
            "gameTime": "2 - 07:56",
            "label": "substitution",
            "description": "It will be a substitution. Jamaal Lascelles (Newcastle Utd) is ready to enter the pitch as Kevin Mbabu walks off."
        },
        {
            "gameTime": "2 - 04:52",
            "label": "soccer-ball",
            "description": "Goal! Sergio Aguero (Manchester City) picks up a pass and gets to the edge of the box before clipping a brilliant lob over the goalkeeper and into the empty net. He makes it 3:1."
        },
        {
            "gameTime": "2 - 04:49",
            "label": "",
            "description": "The Manchester City players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "2 - 03:37",
            "label": "soccer-ball",
            "description": "GOAL 2:1! Sergio Aguero (Manchester City) brilliantly slaloms his way forward past a few defenders and unleashes a shot from the edge of the box, which is deflected and goes into the back of the net."
        },
        {
            "gameTime": "2 - 03:19",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) sends a short pass into the box, David Silva takes a touch to control the ball, but one of the defenders robs him of it and clears to safety."
        },
        {
            "gameTime": "2 - 01:48",
            "label": "",
            "description": "The foul by Pablo Zabaleta (Manchester City) was seen by Kevin Friend who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Manuel Pellegrini makes a half time substitution. Jesus Navas (Manchester City) comes on in place of Raheem Sterling."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. The hosts are enjoying a clear advantage over the opposition. Pass and move. The home side have played some possession football so far, while the visitors have been patient as they wait for the right moment to hit them on the break."
        },
        {
            "gameTime": "1 - 48:07",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by David Silva (Manchester City), was easily dealt with by one of the defenders. Manchester City force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 47:25",
            "label": "",
            "description": "Kevin Friend interrupts the game for a tactical foul by Daryl Janmaat (Newcastle Utd). Manchester City are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 45:02",
            "label": "y-card",
            "description": "Fernandinho (Manchester City) is awarded a yellow card. The referee showed him no mercy."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "1 - 44:37",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the right post."
        },
        {
            "gameTime": "1 - 41:55",
            "label": "soccer-ball",
            "description": "GOAL! Sergio Aguero (Manchester City) scores with a header from close range after Fernandinho headed a pin point lofted cross into his path. It's 1:1."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 40:50",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) takes the corner which is cleared by the opposition's defence. Manchester City have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 40:02",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) looks to break free, but an opposing player clears the ball away. The ball is out of play and Manchester City manage to earn a corner."
        },
        {
            "gameTime": "1 - 39:48",
            "label": "",
            "description": "Raheem Sterling (Manchester City) trips an opposition player and Kevin Friend signals a foul."
        },
        {
            "gameTime": "1 - 39:19",
            "label": "",
            "description": "Manchester City are seeing far more of the ball now."
        },
        {
            "gameTime": "1 - 37:30",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 37:22",
            "label": "corner",
            "description": "The resulting corner, taken by David Silva (Manchester City), comes to nothing."
        },
        {
            "gameTime": "1 - 37:15",
            "label": "",
            "description": "The free kick from long range, taken by Manchester City, is intercepted by one of the defenders. Manchester City win a corner."
        },
        {
            "gameTime": "1 - 35:39",
            "label": "injury",
            "description": "Pablo Zabaleta (Manchester City) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 35:30",
            "label": "y-card",
            "description": "Vurnon Anita (Newcastle Utd) takes out his opponent with a nasty challenge and is relieved when the referee only gives him a booking."
        },
        {
            "gameTime": "1 - 33:49",
            "label": "",
            "description": "Sergio Aguero (Manchester City) smashes the ball towards goal from the edge of the penalty box, but his effort flies just a few inches wide of the right post."
        },
        {
            "gameTime": "1 - 33:25",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 31:16",
            "label": "",
            "description": "David Silva (Manchester City) finds his teammate inside the box with a sweet pass. However, Sergio Aguero wasn't able to finish and lost the ball."
        },
        {
            "gameTime": "1 - 29:14",
            "label": "",
            "description": "Daryl Janmaat (Newcastle Utd) is able to continue to play."
        },
        {
            "gameTime": "1 - 28:53",
            "label": "injury",
            "description": "Daryl Janmaat (Newcastle Utd) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 26:44",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) has a great chance inside the six yard box, shoots low to the middle of the goal, but Joe Hart pulls off an exquisite save to deny him."
        },
        {
            "gameTime": "1 - 25:23",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) wins himself enough space to connect with a cross inside the box, but his fine header goes narrowly over the crossbar!"
        },
        {
            "gameTime": "1 - 24:42",
            "label": "",
            "description": "Flag goes up against Daryl Janmaat (Newcastle Utd) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 22:28",
            "label": "",
            "description": "The ball spins up and hits the hand of Fernando (Manchester City) after he fails to control it and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 22:11",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 21:04",
            "label": "",
            "description": "Ayoze Perez (Newcastle Utd) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 19:13",
            "label": "",
            "description": "Raheem Sterling (Manchester City) sends a teasing cross into the area, but Tim Krul intercepts the ball."
        },
        {
            "gameTime": "1 - 17:26",
            "label": "soccer-ball",
            "description": "It's a goal! Aleksandar Mitrovic (Newcastle Utd) makes it 0:1. He jumped highest to connect with a perfect cross from Georginio Wijnaldum and planted his close range header into the left side of the goal. Joe Hart was helpless."
        },
        {
            "gameTime": "1 - 16:35",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 16:09",
            "label": "",
            "description": "Raheem Sterling receives a short pass from David Silva (Manchester City), but the opposition's defence thwarts his effort."
        },
        {
            "gameTime": "1 - 14:46",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd)'s poor effort is easily saved by Joe Hart. He connects well with a cross, but mistimes it a little, and it heads towards the middle of the target and straight into the grateful hands of the goalkeeper."
        },
        {
            "gameTime": "1 - 14:02",
            "label": "",
            "description": "Fernandinho (Manchester City) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "1 - 11:13",
            "label": "",
            "description": "Sergio Aguero (Manchester City) latches onto a cross into the box from the wing and gets in a header. It went well towards the goal, but it was blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 08:19",
            "label": "",
            "description": "David Silva (Manchester City) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards over the bar."
        },
        {
            "gameTime": "1 - 07:40",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) produces a mid range free kick and sends a daisy cutter towards the left post, but the goalkeeper makes a good save and stops his effort."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "A clumsy foul by Daryl Janmaat (Newcastle Utd) and Kevin Friend blows his whistle. Free kick. Manchester City will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 06:19",
            "label": "",
            "description": "Sergio Aguero (Manchester City) sends a low pass from outside the box to Raheem Sterling. He lines up a shot, but the defence intercepts at the last moment. The ball has crossed the sideline. Manchester City are taking a throw in."
        },
        {
            "gameTime": "1 - 05:04",
            "label": "",
            "description": "A pass by Aleksandar Kolarov (Manchester City) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 03:23",
            "label": "corner",
            "description": "Georginio Wijnaldum (Newcastle Utd) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 03:06",
            "label": "",
            "description": "Daryl Janmaat (Newcastle Utd) produces a dangerous lofted cross into the box which is intercepted. Corner kick. Newcastle Utd will have an opportunity."
        },
        {
            "gameTime": "1 - 02:27",
            "label": "",
            "description": "The Newcastle Utd players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Newcastle Utd will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Kevin Friend will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "5x that's the number of matches that Newcastle Utd have lost at home so far this season, while they have lost 14x away."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Manchester City have earned 66 points so far in the competition, of which 38 points earned at home."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Manchester City's worst defeat of the season was on 26.9. against Tottenham, they suffered a humiliating defeat 1:4."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. Manchester City were dominant and more threatening of the two sides. It was a fairly one sided match. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was what is known as kick and rush football."
        }
    ],
    "gameAwayTeam": "Newcastle Utd",
    "gameDate": "03/10/2015 - 17:00",
    "gameHomeTeam": "Manchester City",
    "gameScore": "6 - 1"
}