{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2017-04-09 - 18-00 Everton 4 - 2 Leicester/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:16",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 46:38",
            "label": "",
            "description": "Benjamin Chilwell (Leicester) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:31",
            "label": "",
            "description": "Robert Madley blows his whistle and it's Riyad Mahrez (Leicester) who is penalised for an offensive foul. Good decision by the referee. A free kick has been awarded to Everton."
        },
        {
            "gameTime": "2 - 43:36",
            "label": "",
            "description": "Close! Romelu Lukaku (Everton) picks up the ball in space and from inside the penalty area sends a shot inches wide of the right post."
        },
        {
            "gameTime": "2 - 43:17",
            "label": "corner",
            "description": "The corner from Riyad Mahrez (Leicester) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 42:25",
            "label": "",
            "description": "Robert Huth (Leicester) gathers a nice lofted pass deep inside the box and attempts to put the ball low into the middle of the goal, but his shot is deflected away by one of the defending players. The referee signals a corner kick to Leicester."
        },
        {
            "gameTime": "2 - 41:50",
            "label": "corner",
            "description": "Riyad Mahrez (Leicester) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 40:19",
            "label": "",
            "description": "Ross Barkley (Everton) receives a low pass just outside the box and drills a fine strike towards the middle of the goal. Kasper Schmeichel pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "2 - 34:19",
            "label": "",
            "description": "One of the Everton players unfairly tackled his opponent and conceded a foul. Leicester have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 33:12",
            "label": "corner",
            "description": "Riyad Mahrez (Leicester) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 32:55",
            "label": "substitution",
            "description": "Substitution. Leonardo Ulloa (Leicester) in, Marc Albrighton out."
        },
        {
            "gameTime": "2 - 32:33",
            "label": "",
            "description": "Ahmed Musa (Leicester) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders. The ball is out of play. A goal scoring opportunity from a corner for Leicester."
        },
        {
            "gameTime": "2 - 28:53",
            "label": "",
            "description": "Riyad Mahrez (Leicester) commits a foul and Robert Madley immediately signals a free kick."
        },
        {
            "gameTime": "2 - 27:32",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Morgan Schneiderlin leaves the pitch and Gareth Barry (Everton) comes on."
        },
        {
            "gameTime": "2 - 26:48",
            "label": "",
            "description": "Ross Barkley (Everton) and Romelu Lukaku attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 18:16",
            "label": "y-card",
            "description": "It's like he was asking for a caution. Andy King (Leicester) receives a yellow card."
        },
        {
            "gameTime": "2 - 15:54",
            "label": "substitution",
            "description": "Craig Shakespeare decides to make a substitution. Jamie Vardy will be replaced by Ahmed Musa (Leicester)."
        },
        {
            "gameTime": "2 - 15:23",
            "label": "substitution",
            "description": "Substitution. Demarai Gray makes way for Riyad Mahrez (Leicester)."
        },
        {
            "gameTime": "2 - 11:55",
            "label": "soccer-ball",
            "description": "Romelu Lukaku (Everton) wins himself some space inside the box after the corner kick and finishes with a low shot into the middle of the goal."
        },
        {
            "gameTime": "2 - 11:48",
            "label": "corner",
            "description": "Kevin Mirallas (Everton) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 10:51",
            "label": "",
            "description": "Jamie Vardy (Leicester) and Marc Albrighton attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 06:09",
            "label": "corner",
            "description": "Demarai Gray (Leicester) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 05:50",
            "label": "",
            "description": "The referee and one of his assistants signal for a corner kick to Leicester. Islam Slimani (Leicester) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the left side of the net, but Joel Robles leaps like a salmon to deny him."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 48:25",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Robert Madley has ended it."
        },
        {
            "gameTime": "1 - 46:07",
            "label": "corner",
            "description": "Leicester have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "1 - 44:01",
            "label": "y-card",
            "description": "Leighton Baines (Everton) is yellow carded for breaking the rules of the game."
        },
        {
            "gameTime": "1 - 40:30",
            "label": "soccer-ball",
            "description": "Kevin Mirallas sends in a great cross from the corner, finding Phil Jagielka (Everton) who outjumps the defence to finish into the top right corner with a header. The score is 3:2."
        },
        {
            "gameTime": "1 - 39:39",
            "label": "corner",
            "description": "Kevin Mirallas (Everton) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 39:38",
            "label": "corner",
            "description": "Kevin Mirallas (Everton) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 34:58",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Marc Albrighton (Leicester), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 34:28",
            "label": "",
            "description": "Kevin Mirallas (Everton) rises above the opponent's defence and heads a precise cross towards the middle of the goal. His effort, however, is blocked by Kasper Schmeichel, who pulls off a comfortable save!"
        },
        {
            "gameTime": "1 - 33:29",
            "label": "",
            "description": "One of the Leicester players tripped an opponent and conceded a foul. Another situation results in a direct free kick for Everton."
        },
        {
            "gameTime": "1 - 31:47",
            "label": "",
            "description": "Romelu Lukaku (Everton) plays a one two with Leighton Baines, but the move breaks down."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "y-card",
            "description": "Kevin Mirallas (Everton) is booked by the referee."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "y-card",
            "description": "The game is interrupted because of a yellow card that is shown to Robert Huth (Leicester)."
        },
        {
            "gameTime": "1 - 26:31",
            "label": "",
            "description": "Demarai Gray (Leicester) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 25:37",
            "label": "",
            "description": "Poor challenge! Leighton Baines (Everton) is penalised for tripping and Robert Madley blows his whistle. Leicester win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 22:13",
            "label": "soccer-ball",
            "description": "The ball hits the back of the net! Ross Barkley showcases his brilliant technique and produces a beautiful lofted cross into the box, where Romelu Lukaku (Everton) manages to convert it into a sweet goal. He heads it inside the right post and gets on the scoresheet – 2:2."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "corner",
            "description": "Kevin Mirallas (Everton) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 09:33",
            "label": "soccer-ball",
            "description": "Marc Albrighton (Leicester) scores a goal from the resulting free kick, sending it into the top right corner. What a strike that is, absolutely fantastic!"
        },
        {
            "gameTime": "1 - 09:00",
            "label": "",
            "description": "Matthew Pennington (Everton) is penalised for holding. Robert Madley signals a set piece. Leicester win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 03:33",
            "label": "soccer-ball",
            "description": "Islam Slimani (Leicester) with a wonderful piece of finishing. He makes a yard for himself after a well taken pass inside the box and nets into the bottom right corner."
        },
        {
            "gameTime": "1 - 00:56",
            "label": "soccer-ball",
            "description": "Goal! Tom Davies (Everton) fires home from very close range after latching on to a pass from Kevin Mirallas. The score is 1:0."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Robert Madley."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester have gone 10 consecutive matches without a draw."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester have won 5 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "In the last 5 games between these two teams there were 4 matches with over 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most prolific goal scorer for Everton is Romelu Lukaku with 21 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        }
    ],
    "gameAwayTeam": "Leicester",
    "gameDate": "09/04/2017 - 18:00",
    "gameHomeTeam": "Everton",
    "gameScore": "4 - 2"
}