{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-10-29 - 17-00 Tottenham 1 - 1 Leicester/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "What a terrific football game that was, with everything included. Tottenham were the better team in today's clash. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        },
        {
            "gameTime": "2 - 50:19",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 49:37",
            "label": "",
            "description": "Leonardo Ulloa (Leicester) wasted a great chance as he climbed high to connect with a cross from the free kick inside the penalty area. He produced a header which went wide of the right post by a whisker."
        },
        {
            "gameTime": "2 - 49:00",
            "label": "",
            "description": "Jan Vertonghen (Tottenham) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Robert Madley with no other option than to blow for a foul. It's a free kick to Leicester in a dangerous position."
        },
        {
            "gameTime": "2 - 48:29",
            "label": "",
            "description": "What an opportunity! Jan Vertonghen (Tottenham) picked the ball up and fired a projectile of a shot from long range which threatened the goalkeeper. The shot went painfully close to the right post!"
        },
        {
            "gameTime": "2 - 48:21",
            "label": "",
            "description": "Georges Kevin N'Koudou (Tottenham) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 46:25",
            "label": "",
            "description": "Wes Morgan (Leicester) creates himself some space inside the goalmouth and connects with the resulting free kick. His accurate header would have probably ended up in the bottom right corner, but Hugo Lloris pulls off a superb reflex save to thwart him."
        },
        {
            "gameTime": "2 - 45:53",
            "label": "",
            "description": "Robert Madley interrupts the game. One of the players from Tottenham won the ball, but his effort is adjudged unfair. Leicester have a free kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "y-card",
            "description": "Danny Simpson (Leicester) is booked after bringing down an opponent. Robert Madley had an easy decision to make."
        },
        {
            "gameTime": "2 - 42:12",
            "label": "substitution",
            "description": "Substitution. Victor Wanyama makes way for Harry Winks (Tottenham)."
        },
        {
            "gameTime": "2 - 41:54",
            "label": "",
            "description": "Jan Vertonghen (Tottenham) latches on to a superb cross inside the box but only hits the crossbar with a fine header. What a chance!"
        },
        {
            "gameTime": "2 - 41:08",
            "label": "corner",
            "description": "Tottenham work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "2 - 40:40",
            "label": "",
            "description": "Georges Kevin N'Koudou (Tottenham) races towards goal but the defender gets back well to make a challenge. Tottenham get a corner."
        },
        {
            "gameTime": "2 - 39:36",
            "label": "",
            "description": "The referee blows his whistle for a foul after Vincent Janssen (Tottenham) overruns the ball during an attack and makes an aggressive challenge on his opponent."
        },
        {
            "gameTime": "2 - 39:21",
            "label": "",
            "description": "Christian Eriksen (Tottenham) tries to find Vincent Janssen with a clever through ball from the corner of the box, but the defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "2 - 38:00",
            "label": "",
            "description": "Marc Albrighton (Leicester) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "substitution",
            "description": "Substitution. Dele Alli did his best and is replaced by Georges Kevin N'Koudou (Tottenham)."
        },
        {
            "gameTime": "2 - 35:25",
            "label": "",
            "description": "Christian Fuchs (Leicester) pounces on the rebound on the edge of the box but his wild shot goes high over the crossbar."
        },
        {
            "gameTime": "2 - 34:34",
            "label": "corner",
            "description": "Heung Min Son (Tottenham) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 34:07",
            "label": "",
            "description": "The ball is cleared after Heung Min Son (Tottenham) attempted to dribble past an opposing player. The ball is out of play and Tottenham manage to earn a corner."
        },
        {
            "gameTime": "2 - 33:27",
            "label": "",
            "description": "Christian Fuchs (Leicester) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 32:45",
            "label": "substitution",
            "description": "Substitution. Shinji Okazaki leaves the pitch and is replaced by Leonardo Ulloa (Leicester)."
        },
        {
            "gameTime": "2 - 31:48",
            "label": "",
            "description": "Kyle Walker (Tottenham) sends a cross into the box, but Kasper Schmeichel comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "",
            "description": "Vincent Janssen (Tottenham) goes on a mazy run, gets into the box and from around the penalty spot he misses the target. What a chance that was!"
        },
        {
            "gameTime": "2 - 29:47",
            "label": "",
            "description": "Jeffery Schlupp (Leicester) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 27:40",
            "label": "",
            "description": "Jamie Vardy (Leicester) sends a low pass from outside the box to Jeffery Schlupp. He lines up a shot, but the defence intercepts at the last moment."
        },
        {
            "gameTime": "2 - 26:55",
            "label": "substitution",
            "description": "Riyad Mahrez will be replaced by Marc Albrighton (Leicester)."
        },
        {
            "gameTime": "2 - 25:39",
            "label": "",
            "description": "Close effort! Vincent Janssen (Tottenham) takes the resulting free kick from a promising distance, but he sends it narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 24:49",
            "label": "",
            "description": "Andy King (Leicester) makes a bad challenge and the referee blows his whistle for a foul. Tottenham earn a free kick."
        },
        {
            "gameTime": "2 - 22:52",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Jeffery Schlupp (Leicester) replaces Ahmed Musa."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "y-card",
            "description": "Robert Madley shows a yellow card to Victor Wanyama (Tottenham) for his blatant foul."
        },
        {
            "gameTime": "2 - 19:55",
            "label": "y-card",
            "description": "Jamie Vardy (Leicester) is shown a yellow card by the referee."
        },
        {
            "gameTime": "2 - 17:58",
            "label": "y-card",
            "description": "Ahmed Musa (Leicester) has tested the patience of referee Robert Madley and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "corner",
            "description": "The corner from Christian Eriksen (Tottenham) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 16:27",
            "label": "",
            "description": "After some miscommunication between the defenders, Jan Vertonghen (Tottenham) gets to a rebound and plants a header towards the underside of the bar, but Kasper Schmeichel leaps to stop his dangerous attempt. Tottenham force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 15:54",
            "label": "",
            "description": "Christian Eriksen (Tottenham) whips in the free kick, but one of the defenders comfortably clears the ball away."
        },
        {
            "gameTime": "2 - 15:23",
            "label": "",
            "description": "Riyad Mahrez (Leicester) makes a rough challenge and Robert Madley blows his whistle for a foul. Tottenham have a free kick."
        },
        {
            "gameTime": "2 - 13:45",
            "label": "",
            "description": "That was a nice football moment. Christian Eriksen (Tottenham) receives an amazing defence splitting low pass on the edge of the box and blasts the ball towards the bottom left corner. Kasper Schmeichel guesses his intention and dives superbly to deny him with a remarkable save!"
        },
        {
            "gameTime": "2 - 12:33",
            "label": "",
            "description": "Heung Min Son (Tottenham) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 11:03",
            "label": "",
            "description": "Christian Eriksen (Tottenham) fails to produce a decent enough free kick for a player of his ability and the only target that he finds is the wall of defenders in front of him."
        },
        {
            "gameTime": "2 - 10:09",
            "label": "",
            "description": "Rough tackle by Daniel Drinkwater (Leicester). The referee blows his whistle for a foul. Tottenham will take a free kick near the side line."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "y-card",
            "description": "Riyad Mahrez (Leicester) is booked after bringing down an opponent. Robert Madley had an easy decision to make."
        },
        {
            "gameTime": "2 - 08:14",
            "label": "",
            "description": "Kasper Schmeichel makes a brilliant save! Heung Min Son (Tottenham) easily weaves through the defence and unleashes a shot from just outside of the box. His effort goes towards the middle of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "2 - 07:27",
            "label": "",
            "description": "Christian Eriksen (Tottenham) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "2 - 06:11",
            "label": "corner",
            "description": "The resulting corner from Christian Eriksen (Tottenham) comes to nothing."
        },
        {
            "gameTime": "2 - 05:31",
            "label": "",
            "description": "What a great touch by Vincent Janssen (Tottenham) as he controls a fine pass into the box and takes a shot to the bottom left corner, but an opposing player makes a clearance. Great defending. Tottenham have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:10",
            "label": "",
            "description": "Ahmed Musa (Leicester) is able to continue to play."
        },
        {
            "gameTime": "2 - 03:58",
            "label": "injury",
            "description": "Ahmed Musa (Leicester) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "2 - 02:56",
            "label": "soccer-ball",
            "description": "Goal 1:1! Jamie Vardy laid the ball off to Ahmed Musa (Leicester), who slots it into the back of the net from close range, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 01:23",
            "label": "",
            "description": "Danny Rose (Tottenham) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The fans in the stadium won't regret buying tickets for today's game as they have witnessed a great game so far, and nothing suggests it's going to change in the second half. It was a fairly one sided opening 45 minutes, with Tottenham much the better side better so far. Pass and move. The home side have played some possession football so far, while the visitors have been patient as they wait for the right moment to hit them on the break."
        },
        {
            "gameTime": "1 - 47:20",
            "label": "whistle",
            "description": "Robert Madley has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:35",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 44:30",
            "label": "",
            "description": "Danny Rose (Tottenham) bursts into the box and pulls the trigger, but he can't beat the goalkeeper. He directed his shot towards the left post, but one of the defenders reacted brilliantly to block it. The ball is out of play. Tottenham win a corner kick."
        },
        {
            "gameTime": "1 - 43:58",
            "label": "soccer-ball",
            "description": "Vincent Janssen (Tottenham) smoothly converts the penalty with a stunning effort which ends up inside the right post."
        },
        {
            "gameTime": "1 - 43:39",
            "label": "",
            "description": "Vincent Janssen (Tottenham) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 42:40",
            "label": "penalty",
            "description": "Robert Huth (Leicester) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play. PENALTY AWARDED to Tottenham!"
        },
        {
            "gameTime": "1 - 41:40",
            "label": "",
            "description": "Robert Madley blows for a foul after Daniel Drinkwater (Leicester) was too aggressive in the battle for the ball. Tottenham are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 40:59",
            "label": "y-card",
            "description": "That will be a yellow card for one of the players. The one who gets booked is Heung Min Son (Tottenham)."
        },
        {
            "gameTime": "1 - 40:29",
            "label": "",
            "description": "CHANCE! Dele Alli (Tottenham) fires just over the crossbar from inside the box after running onto a splendid pass from Kyle Walker."
        },
        {
            "gameTime": "1 - 38:55",
            "label": "",
            "description": "Christian Fuchs (Leicester) latched on to a fine cross from the corner kick on the edge of the box. His shot, however, flies narrowly over the bar."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "corner",
            "description": "Riyad Mahrez (Leicester) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 38:22",
            "label": "",
            "description": "Shinji Okazaki (Leicester) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. Leicester force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 36:57",
            "label": "",
            "description": "Christian Eriksen (Tottenham) fires the resulting free kick on goal from long distance, but the goalkeeper blocks his effort."
        },
        {
            "gameTime": "1 - 36:55",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Danny Rose (Tottenham) was quite harsh and Robert Madley didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 35:35",
            "label": "",
            "description": "Wes Morgan (Leicester) commits a rough challenge and Robert Madley blows his whistle for a foul. Tottenham win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 34:23",
            "label": "",
            "description": "Christian Eriksen sends a good ball to the edge of the box and Vincent Janssen (Tottenham) gets in a shot which goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 33:52",
            "label": "corner",
            "description": "The resulting corner, taken by Christian Eriksen (Tottenham), comes to nothing."
        },
        {
            "gameTime": "1 - 33:07",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Victor Wanyama (Tottenham). Good work from Tottenham as they win a corner."
        },
        {
            "gameTime": "1 - 32:28",
            "label": "",
            "description": "Riyad Mahrez swings the cross over. Shinji Okazaki (Leicester) gets his head to it but it goes just over the crossbar."
        },
        {
            "gameTime": "1 - 32:07",
            "label": "",
            "description": "Tottenham try to speed play up by taking a quick free kick."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "",
            "description": "Shinji Okazaki (Leicester) makes a slide tackle, but referee Robert Madley blows for a foul. There is a free kick near the sideline to Tottenham."
        },
        {
            "gameTime": "1 - 31:02",
            "label": "",
            "description": "Jamie Vardy (Leicester) makes a driving run into the box but he cannot work any space for a shot."
        },
        {
            "gameTime": "1 - 30:25",
            "label": "",
            "description": "Robert Madley blows his whistle and it's Wes Morgan (Leicester) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 30:12",
            "label": "",
            "description": "Riyad Mahrez (Leicester) takes a direct free kick."
        },
        {
            "gameTime": "1 - 29:31",
            "label": "",
            "description": "Kyle Walker (Tottenham) was too fierce in his attempt to get the ball from his opponent and Robert Madley blows for a foul. Leicester are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 27:49",
            "label": "",
            "description": "Kyle Walker (Tottenham) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 25:18",
            "label": "",
            "description": "Riyad Mahrez (Leicester) sends a long ball in, but Hugo Lloris comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 24:19",
            "label": "",
            "description": "Victor Wanyama (Tottenham) unleashes a superb first time shot from the edge of the box, but it flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 23:37",
            "label": "",
            "description": "A lofted cross from Danny Rose (Tottenham) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 21:19",
            "label": "",
            "description": "Neat passing move from Tottenham in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 20:10",
            "label": "",
            "description": "Christian Eriksen (Tottenham) stands over the resultant free kick from mid range, but his shot goes just wide of the left post."
        },
        {
            "gameTime": "1 - 19:50",
            "label": "",
            "description": "Daniel Drinkwater (Leicester) trips an opponent with a slide tackle. Robert Madley stops the game and he could give him a card, but eventually decides on just a warning. Tottenham get a free kick."
        },
        {
            "gameTime": "1 - 19:08",
            "label": "",
            "description": "What a great touch by Vincent Janssen (Tottenham) as he controls a fine pass into the box and takes a shot to the bottom left corner, but an opposing player makes a clearance. Great defending."
        },
        {
            "gameTime": "1 - 16:51",
            "label": "",
            "description": "Christian Eriksen (Tottenham) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 14:54",
            "label": "",
            "description": "Ahmed Musa (Leicester) produces a poor pass. He attempts to get the ball into the box but it's hacked away."
        },
        {
            "gameTime": "1 - 14:29",
            "label": "",
            "description": "Danny Rose (Tottenham) receives an accurate pass and finds some space for a shot. The keeper is prepared and denies his low, long range blast aimed directly at the bottom of the net."
        },
        {
            "gameTime": "1 - 13:30",
            "label": "",
            "description": "Dele Alli (Tottenham) finds himself some space just outside the box, collects a rebound and sends an effort in on goal. Kasper Schmeichel pulls off a fantastic reflex save to stop the ball going into the middle of the target."
        },
        {
            "gameTime": "1 - 13:13",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 12:38",
            "label": "",
            "description": "Christian Eriksen (Tottenham) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The linesman makes the right call and Tottenham will have a corner."
        },
        {
            "gameTime": "1 - 10:40",
            "label": "",
            "description": "Moussa Dembele (Tottenham) latches on to a pass inside the box, but his low effort towards the right post is well blocked."
        },
        {
            "gameTime": "1 - 08:41",
            "label": "",
            "description": "Ahmed Musa (Leicester) connects with an accurate pass inside the box and fires the ball to the bottom right corner, but one of the defending players steps in to block the effort."
        },
        {
            "gameTime": "1 - 07:52",
            "label": "",
            "description": "Christian Fuchs (Leicester) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "1 - 06:44",
            "label": "",
            "description": "Riyad Mahrez (Leicester) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 05:28",
            "label": "corner",
            "description": "Heung Min Son (Tottenham) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 05:20",
            "label": "",
            "description": "Kyle Walker (Tottenham) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The referee points to the corner flag and Tottenham will take a corner."
        },
        {
            "gameTime": "1 - 03:51",
            "label": "",
            "description": "Tottenham players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 02:49",
            "label": "",
            "description": "Robert Huth (Leicester) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "",
            "description": "Ahmed Musa (Leicester) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Tottenham will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Robert Madley got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Tottenham are still unbeaten at home this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester have lost 4x away this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Heung Min Son from Tottenham will look to add to his goal tally, he has netted 4 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a terrific football game that was, with everything included. Tottenham were the better team in today's clash. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        }
    ],
    "gameAwayTeam": "Leicester",
    "gameDate": "29/10/2016 - 17:00",
    "gameHomeTeam": "Tottenham",
    "gameScore": "1 - 1"
}