{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-12-03 - 18-15 Barcelona 1 - 1 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. It was a very tight match, with not much between the two teams. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 48:11",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 47:45",
            "label": "",
            "description": "Sergi Roberto (Barcelona) quickly gets to a rebound somewhere around the penalty spot and attempts a header. His effort might have ended up in the net, but one of the defenders was well positioned on the goal line and knocked the ball away."
        },
        {
            "gameTime": "2 - 47:40",
            "label": "",
            "description": "Denis Suarez (Barcelona) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "2 - 47:11",
            "label": "",
            "description": "Marco Asensio (Real Madrid) is penalised after knocking an opponent down. Barcelona win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:30",
            "label": "soccer-ball",
            "description": "GOAL! Luka Modric curls the free kick into the box. Sergio Ramos (Real Madrid) peels off his marker and arrows a brilliant header past Marc Andre ter Stegen and into the left side of the net. 1:1."
        },
        {
            "gameTime": "2 - 43:59",
            "label": "y-card",
            "description": "Javier Mascherano (Barcelona) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Carlos Clos Gomez didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "corner",
            "description": "A dangerous looking corner kick from Luka Modric (Real Madrid) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 43:24",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) plants a goal bound header towards the bottom right corner after a nice cross inside the box, but one of the defenders manages to deflect it away. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 41:57",
            "label": "substitution",
            "description": "Luis Enrique has decided to substitute Neymar and he is replaced by Denis Suarez (Barcelona)."
        },
        {
            "gameTime": "2 - 41:36",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) rises above the defence inside the box to power a fine header, but the goalkeeper is lucky as the ball flies just over the bar."
        },
        {
            "gameTime": "2 - 40:57",
            "label": "substitution",
            "description": "Substitution. Mariano Diaz (Real Madrid) in, Mateo Kovacic out."
        },
        {
            "gameTime": "2 - 40:12",
            "label": "",
            "description": "Carlos Clos Gomez couldn't ignore the rough tackle by Casemiro (Real Madrid) and blew his whistle."
        },
        {
            "gameTime": "2 - 39:01",
            "label": "",
            "description": "The free kick is taken by Luka Modric (Real Madrid), but ball is cleared."
        },
        {
            "gameTime": "2 - 38:24",
            "label": "",
            "description": "We are about to witness a long range indirect free kick by Real Madrid. From a position like this it's difficult to score."
        },
        {
            "gameTime": "2 - 37:54",
            "label": "y-card",
            "description": "The referee had an easy decision to make. A yellow card is given to Sergio Busquets (Barcelona) for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 36:08",
            "label": "",
            "description": "CHANCE! Andres Iniesta finds Lionel Messi (Barcelona) with a sweet pass, but he can't find the target as his effort from inside the box goes just wide of the right post!"
        },
        {
            "gameTime": "2 - 34:37",
            "label": "y-card",
            "description": "Daniel Carvajal (Real Madrid) is booked after bringing down an opponent. Carlos Clos Gomez had an easy decision to make."
        },
        {
            "gameTime": "2 - 33:21",
            "label": "",
            "description": "Marco Asensio (Real Madrid) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him."
        },
        {
            "gameTime": "2 - 32:30",
            "label": "substitution",
            "description": "Substitution. Andre Gomes makes way for Arda Turan (Barcelona)."
        },
        {
            "gameTime": "2 - 32:05",
            "label": "substitution",
            "description": "Zinedine Zidane decides to make a substitution. Karim Benzema will be replaced by Marco Asensio (Real Madrid)."
        },
        {
            "gameTime": "2 - 30:45",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 30:24",
            "label": "",
            "description": "A cross into the box from Marcelo (Real Madrid) is cleared. Real Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 29:44",
            "label": "y-card",
            "description": "The main referee, Carlos Clos Gomez, is apparently not going to tolerate any discussions. Luis Suarez (Barcelona) is given a yellow card for dissent."
        },
        {
            "gameTime": "2 - 28:46",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 28:18",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 25:18",
            "label": "",
            "description": "Neymar (Barcelona) misses a good chance to score. An inch perfect cross into the box finds Neymar (Barcelona) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 24:16",
            "label": "corner",
            "description": "Neymar (Barcelona) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 23:59",
            "label": "",
            "description": "What a great touch by Andres Iniesta (Barcelona) as he controls a fine pass into the box and fires the ball to the left post, but the effort is brilliantly blocked. Barcelona win a corner."
        },
        {
            "gameTime": "2 - 23:32",
            "label": "",
            "description": "Casemiro (Real Madrid) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 22:40",
            "label": "",
            "description": "Neymar (Barcelona) weaves through the defence with ease and gets into a good position in front of goal. He pulls the trigger in an effort to beat the keeper, but fails as the ball zooms over the bar."
        },
        {
            "gameTime": "2 - 20:36",
            "label": "substitution",
            "description": "Here's the change. Isco leaves the pitch and Casemiro (Real Madrid) comes on as a substitute."
        },
        {
            "gameTime": "2 - 20:21",
            "label": "",
            "description": "Isco (Real Madrid) brings his opponent down. Carlos Clos Gomez has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 17:41",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends a chip pass into the box, but Keylor Navas is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 16:29",
            "label": "",
            "description": "Neymar (Barcelona) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "2 - 14:22",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Ivan Rakitic walks off the pitch to be replaced by Andres Iniesta (Barcelona)."
        },
        {
            "gameTime": "2 - 13:43",
            "label": "",
            "description": "Andre Gomes (Barcelona) makes a reckless foul in order to win the ball from his opponent. Carlos Clos Gomez has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "",
            "description": "Karim Benzema (Real Madrid) received a clever through ball which could have put him in a promising position, but the defence was alert to the danger."
        },
        {
            "gameTime": "2 - 10:30",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 09:38",
            "label": "corner",
            "description": "Isco (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 07:41",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Neymar flights the free kick into the box, where Luis Suarez (Barcelona) peels off his marker and heads it straight into the bottom right corner from the edge of the six yard box. He makes it 1:0."
        },
        {
            "gameTime": "2 - 06:33",
            "label": "",
            "description": "Raphael Varane (Real Madrid) commits a rough challenge and Carlos Clos Gomez blows his whistle for an infringement. Barcelona earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 05:59",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) makes some space to meet a perfect cross inside the box, but he blazes his shot over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "2 - 03:25",
            "label": "",
            "description": "Lucas (Real Madrid) couldn't beat the offside trap and the flag goes up. The assistant referee quickly made a difficult call as it was a really tight offside."
        },
        {
            "gameTime": "2 - 02:01",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "",
            "description": "Luis Suarez (Barcelona) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net. The ball is out of play. Barcelona win a corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have seen an attractive offensive game so far and the fans have nothing to complain about. Neither side is enjoying any significant control of the game. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 44:31",
            "label": "",
            "description": "Raphael Varane (Real Madrid) jumps inside the box to meet the corner and aims a low header towards middle of the goal, but the goalkeeper shows his reflexes to stop the effort."
        },
        {
            "gameTime": "1 - 44:23",
            "label": "corner",
            "description": "Isco (Real Madrid) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 43:51",
            "label": "",
            "description": "Karim Benzema (Real Madrid) wriggles into space inside the box with excellent ball control, but his effort on goal is well blocked. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 40:03",
            "label": "corner",
            "description": "Neymar (Barcelona) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 39:36",
            "label": "",
            "description": "Jordi Alba (Barcelona) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. The ball is out of play. A goal scoring opportunity from a corner for Barcelona."
        },
        {
            "gameTime": "1 - 37:55",
            "label": "",
            "description": "Nice individual effort by Cristiano Ronaldo (Real Madrid). He gets all the way through to the keeper and hits a low drive to the middle of the goal, but Marc Andre ter Stegen does a good job to anticipate the direction of the ball and keeps it out."
        },
        {
            "gameTime": "1 - 37:24",
            "label": "",
            "description": "Luka Modric (Real Madrid) finds himself beyond the last defender but the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 36:44",
            "label": "corner",
            "description": "The resulting corner from Luka Modric (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 36:15",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) produces a promising shot towards the left side of the goal after his wonderful solo run, but Marc Andre ter Stegen thwarts him and the score remains the same. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "1 - 35:31",
            "label": "",
            "description": "Lionel Messi (Barcelona) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "1 - 35:05",
            "label": "",
            "description": "A free kick is awarded from a very dangerous distance. It's situated just a few metres from outside the box. Several players gather around the ball, but it seems like Lionel Messi (Barcelona) is going to have a crack himself."
        },
        {
            "gameTime": "1 - 34:08",
            "label": "",
            "description": "Dangerous play by Daniel Carvajal (Real Madrid). Carlos Clos Gomez blows his whistle for a foul. Barcelona have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 31:24",
            "label": "",
            "description": "Marcelo (Real Madrid) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box well wide of the left post."
        },
        {
            "gameTime": "1 - 30:45",
            "label": "",
            "description": "Sergi Roberto (Barcelona) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation."
        },
        {
            "gameTime": "1 - 27:54",
            "label": "y-card",
            "description": "Neymar (Barcelona) makes a bad challenge and receives a yellow card. The referee had no doubt."
        },
        {
            "gameTime": "1 - 26:33",
            "label": "",
            "description": "Javier Mascherano (Barcelona) makes a rough challenge and Carlos Clos Gomez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 24:34",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 24:23",
            "label": "",
            "description": "Luis Suarez (Barcelona) races towards goal but the defender gets back well to make a challenge. Barcelona force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 23:04",
            "label": "",
            "description": "Marcelo (Real Madrid) serves up a nice cross, but Marc Andre ter Stegen punches the ball away."
        },
        {
            "gameTime": "1 - 21:55",
            "label": "",
            "description": "Karim Benzema (Real Madrid) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety."
        },
        {
            "gameTime": "1 - 20:08",
            "label": "",
            "description": "Luis Suarez (Barcelona) misses a good chance to score. An inch perfect cross into the box finds Luis Suarez (Barcelona) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 18:32",
            "label": "",
            "description": "Lionel Messi (Barcelona) attempts to threaten the opposition goal with the direct free kick. He unloads a thunderbolt strike directed to the right side of the goal. The goalkeeper stretches and makes a superb save!"
        },
        {
            "gameTime": "1 - 16:56",
            "label": "",
            "description": "Luka Modric (Real Madrid) was trying to get to the ball but clattered into the legs of the opponent as well. Carlos Clos Gomez blows his whistle for an infringement. Barcelona are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 15:21",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to convert a cross into a goal, but his promising header from near the penalty spot towards the middle of the net is denied by Marc Andre ter Stegen. This effort really didn't trouble him."
        },
        {
            "gameTime": "1 - 14:59",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. The referee and the linesman both signal a throw in for Real Madrid."
        },
        {
            "gameTime": "1 - 14:15",
            "label": "",
            "description": "Referee Carlos Clos Gomez sees the trip by Luka Modric (Real Madrid) and doesn't hesitate to blow his whistle. That's a free kick to Barcelona."
        },
        {
            "gameTime": "1 - 12:47",
            "label": "y-card",
            "description": "Isco (Real Madrid) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "1 - 12:19",
            "label": "",
            "description": "The game is interrupted as Luis Suarez (Barcelona) is flagged offside."
        },
        {
            "gameTime": "1 - 12:03",
            "label": "",
            "description": "Raphael Varane (Real Madrid) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 11:50",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 11:17",
            "label": "",
            "description": "Marcelo (Real Madrid) flights in the cross, but the defender is alert and clears to safety. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "1 - 09:38",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 09:13",
            "label": "",
            "description": "What a goal scoring opportunity! Sergi Roberto (Barcelona) makes a good run into the box to meet a cross and fires the ball in on goal, but the shot is amazingly blocked by a defender. The ball goes out of play and Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 08:16",
            "label": "",
            "description": "Barcelona are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "1 - 06:02",
            "label": "",
            "description": "Lionel Messi (Barcelona) breaks past challenges inside the box, but puts too much pace on his pass to Neymar."
        },
        {
            "gameTime": "1 - 04:31",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) did his best to latch onto a through ball, but it was too strong."
        },
        {
            "gameTime": "1 - 01:38",
            "label": "",
            "description": "Sergio Busquets (Barcelona) launches into a thunderous tackle on his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 01:00",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Carlos Clos Gomez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Cristiano Ronaldo is the biggest threat to an opponent! He has already scored 13 goals and is top scorer in this Real Madrid team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid will be striving to extend their brilliant 6 match winning run in this competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Luis Suarez has the most assists (13) for Barcelona this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. It was a very tight match, with not much between the two teams. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "03/12/2016 - 18:15",
    "gameHomeTeam": "Barcelona",
    "gameScore": "1 - 1"
}