{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-10-24 - 17-00 Celta Vigo 1 - 3 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. The superiority of the away team was evident on the pitch today. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 50:28",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 49:57",
            "label": "soccer-ball",
            "description": "Denis Cheryshev sends a precise lofted cross into the box. Marcelo (Real Madrid) latches on to it and finishes with a quick shot inside the left post. The goalkeeper had no chance. The score changes to 1:3."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "corner",
            "description": "Nolito (Celta Vigo) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "",
            "description": "Duran Nolito (Celta Vigo) whips the ball in from the long range free kick, but the first man gets it clear. Celta Vigo will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 46:11",
            "label": "",
            "description": "Neat link up play between Toni Kroos (Real Madrid) and Cristiano Ronaldo, but Sergio Alvarez reads the game well and the move breaks down."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 5 min. of added time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "The Real Madrid players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 43:14",
            "label": "",
            "description": "A cross from Nolito (Celta Vigo) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 41:07",
            "label": "",
            "description": "John Guidetti (Celta Vigo) receives a precise pass on the edge of the box and bends his effort inches wide of the left post. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "2 - 39:11",
            "label": "soccer-ball",
            "description": "Nolito (Celta Vigo) scores with a great individual effort! He makes a good run, skips past defenders and fires the ball from the edge of the box past the diving goalkeeper. The shot went into the top left corner. Absolutely phenomenal!"
        },
        {
            "gameTime": "2 - 36:33",
            "label": "substitution",
            "description": "We are about to witness a substitution. John Guidetti (Celta Vigo) is replacing Fabian Orellana."
        },
        {
            "gameTime": "2 - 35:29",
            "label": "substitution",
            "description": "Substitution. Pablo Pedro Hernandez makes way for Carles Planas (Celta Vigo)."
        },
        {
            "gameTime": "2 - 35:26",
            "label": "",
            "description": "Jonny (Celta Vigo) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 34:59",
            "label": "substitution",
            "description": "Substitution. Luka Modric (Real Madrid) did his best and is replaced by Nacho."
        },
        {
            "gameTime": "2 - 34:06",
            "label": "",
            "description": "Duran Nolito (Celta Vigo) tries to find Iago Aspas, but he puts too much power on the pass."
        },
        {
            "gameTime": "2 - 32:55",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 31:10",
            "label": "",
            "description": "Keylor Navas (Real Madrid) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 31:05",
            "label": "injury",
            "description": "The game is interrupted now, Keylor Navas (Real Madrid) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 30:21",
            "label": "",
            "description": "Iago Aspas (Celta Vigo) dribbles into the box, but Keylor Navas is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 29:49",
            "label": "",
            "description": "Duran Nolito (Celta Vigo) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 27:23",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Fabian Orellana (Celta Vigo), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "Pablo Pedro Hernandez (Celta Vigo) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. Celta Vigo have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 26:49",
            "label": "",
            "description": "Nolito (Celta Vigo) bursts into the box and pulls the trigger, but he can't beat the goalkeeper. He directed his low drive towards the middle of the goal, but one of the defenders reacted brilliantly to block it."
        },
        {
            "gameTime": "2 - 25:28",
            "label": "",
            "description": "Isco (Real Madrid) finds himself with a great opportunity! He unleashes a shot from the edge of the box, which whizzes just wide of the left post! The ball goes out of play and Celta Vigo will have a goal kick."
        },
        {
            "gameTime": "2 - 25:15",
            "label": "",
            "description": "Nolito (Celta Vigo) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 24:29",
            "label": "substitution",
            "description": "Substitution. Jese will be replaced by Denis Cheryshev (Real Madrid)."
        },
        {
            "gameTime": "2 - 23:19",
            "label": "",
            "description": "What a great touch by Isco (Real Madrid) after latching on to a precise pass on the edge of the box! He finds some space and rips a shot close to the left post. The goalkeeper makes an astonishing save, knocking the ball onto the post."
        },
        {
            "gameTime": "2 - 22:31",
            "label": "",
            "description": "Hugo Mallo (Celta Vigo) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "2 - 21:49",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Nemanja Radoja (Celta Vigo) comes onto the pitch for Daniel Wass."
        },
        {
            "gameTime": "2 - 20:35",
            "label": "corner",
            "description": "Isco (Real Madrid) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 19:44",
            "label": "",
            "description": "Isco (Real Madrid) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 19:37",
            "label": "corner",
            "description": "Corner kick. Toni Kroos (Real Madrid) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 19:27",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a precise low pass inside the box, controls the ball and releases it towards the right post. Unfortunately for him, Sergio Alvarez makes a great save to stop his effort. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 18:12",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Sergio Alvarez is alert and denies him."
        },
        {
            "gameTime": "2 - 16:31",
            "label": "substitution",
            "description": "will be replaced by Isco (Real Madrid)."
        },
        {
            "gameTime": "2 - 15:38",
            "label": "y-card",
            "description": "Nolito (Celta Vigo) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 12:15",
            "label": "",
            "description": "Toni Kroos (Real Madrid) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "2 - 11:59",
            "label": "y-card",
            "description": "Augusto Fernandez (Celta Vigo) argues with the referee and receives a yellow card for dissent."
        },
        {
            "gameTime": "2 - 11:58",
            "label": "y-card",
            "description": "Iago Aspas (Celta Vigo) has too much to say to the referee and is cautioned."
        },
        {
            "gameTime": "2 - 11:42",
            "label": "yr-card",
            "description": "Gustavo Daniel Cabral (Celta Vigo) sees a second yellow card from the referee and already knows what will come next. It's a red and the match is over for Gustavo Daniel Cabral (Celta Vigo)."
        },
        {
            "gameTime": "2 - 11:40",
            "label": "y-card",
            "description": "Pablo Pedro Hernandez (Celta Vigo) has received a yellow card for his foul."
        },
        {
            "gameTime": "2 - 10:15",
            "label": "",
            "description": "Ambitious effort from Fabian Orellana (Celta Vigo). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well over the bar."
        },
        {
            "gameTime": "2 - 09:46",
            "label": "",
            "description": "The referee blows his whistle as Sergio Ramos (Real Madrid) was too aggressive in his challenge."
        },
        {
            "gameTime": "2 - 09:10",
            "label": "",
            "description": "Marcelo (Real Madrid) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "2 - 08:52",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 08:41",
            "label": "",
            "description": "The ball is cleared after Marcelo (Real Madrid) attempted to dribble past an opposing player. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 07:34",
            "label": "",
            "description": "What a chance that is! Cristiano Ronaldo (Real Madrid) squanders a huge opportunity as he latches on to a perfect cross from the wing. He produces a bullet header from around the penalty spot which goes high over the crossbar! The ball goes out of play and Celta Vigo will have a goal kick."
        },
        {
            "gameTime": "2 - 06:01",
            "label": "y-card",
            "description": "The game has begun to heat up. Lucas (Real Madrid) challenges an opponent and receives a deserved yellow card for his ugly tackle."
        },
        {
            "gameTime": "2 - 05:45",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 05:35",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Toni Kroos (Real Madrid), was easily dealt with by one of the defenders. The referee and his assistant both point at the corner flag. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 05:22",
            "label": "",
            "description": "Fabian Orellana (Celta Vigo) commits a foul after bringing down his opponent with a slide tackle. Real Madrid are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 05:04",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 04:48",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. The ball goes out for a corner. Real Madrid can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 04:10",
            "label": "",
            "description": "A neat pass is well received by , who is lurking on the edge of the box and strikes the ball on goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "2 - 04:02",
            "label": "",
            "description": "Duran Nolito (Celta Vigo) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "2 - 02:54",
            "label": "",
            "description": "Good touch by Daniel Wass (Celta Vigo) as he receives a great pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, the effort misses the net and flies well wide to the right. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "2 - 01:50",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Fabian Orellana (Celta Vigo), whose instinctive shot towards goal flashes inches wide of the right post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "This is how football should be full of action, thrilling moments and spectacular opportunities. And we have only had the first 45 minutes, so the expectations for the second half are high. The away side are dominant and dictating the tempo of the game, mainly because of their higher activity and more accurate passing. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 45:06",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:46",
            "label": "",
            "description": "Iago Aspas almost found himself in a promising position after Daniel Wass (Celta Vigo) tried to send a defence splitting pass, but one of the defenders reacts well and makes a timely interception."
        },
        {
            "gameTime": "1 - 43:45",
            "label": "",
            "description": "Pablo Pedro Hernandez (Celta Vigo) leaps highest in the penalty area to get on the end of a cross from the set piece, and he produces a promising goal bound header towards the right side of the goal, but Keylor Navas pulls off a decent save to deny him."
        },
        {
            "gameTime": "1 - 42:08",
            "label": "",
            "description": "Nolito (Celta Vigo) will take the free kick."
        },
        {
            "gameTime": "1 - 42:01",
            "label": "",
            "description": "The game is interrupted. Danilo (Real Madrid) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did. A free kick is awarded to Celta Vigo."
        },
        {
            "gameTime": "1 - 41:19",
            "label": "",
            "description": "Danilo (Real Madrid) knocks his opponent down with an over the top tackle."
        },
        {
            "gameTime": "1 - 40:31",
            "label": "",
            "description": "Real Madrid control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 40:19",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 39:01",
            "label": "",
            "description": "Keylor Navas pulls off a great save to deny Fabian Orellana (Celta Vigo), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "1 - 37:58",
            "label": "",
            "description": "Marcelo (Real Madrid) clips a neat ball into the box in the direction of Cristiano Ronaldo, but he can't get on the end of the pass."
        },
        {
            "gameTime": "1 - 36:15",
            "label": "y-card",
            "description": "Gustavo Daniel Cabral (Celta Vigo) makes a bad challenge on his opponent and is booked by the referee."
        },
        {
            "gameTime": "1 - 34:11",
            "label": "",
            "description": "flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 32:43",
            "label": "corner",
            "description": "Duran Nolito (Celta Vigo) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 32:00",
            "label": "",
            "description": "Jonny (Celta Vigo) fires the resulting free kick on goal from a medium range, but sees his shot saved by the goalkeeper. Celta Vigo have a corner."
        },
        {
            "gameTime": "1 - 30:02",
            "label": "",
            "description": "Marcelo (Real Madrid) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 29:49",
            "label": "",
            "description": "Marcelo receives a sweet cross inside the box from Toni Kroos (Real Madrid), but one of the defenders rushes in bravely to intercept the move."
        },
        {
            "gameTime": "1 - 28:33",
            "label": "",
            "description": "Augusto Fernandez (Celta Vigo) sprays a pass out to Iago Aspas, but he can't beat his man to get to the ball."
        },
        {
            "gameTime": "1 - 25:23",
            "label": "",
            "description": "Pablo Pedro Hernandez (Celta Vigo) tries his luck with a long range effort after receiving a precise pass. It goes to the right side of the goal, but Keylor Navas has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 22:59",
            "label": "soccer-ball",
            "description": "Goal! Jese displays great vision and sends a pass to Danilo (Real Madrid), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 0:2."
        },
        {
            "gameTime": "1 - 19:57",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Nolito (Celta Vigo) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "1 - 18:10",
            "label": "",
            "description": "Nolito (Celta Vigo) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 17:32",
            "label": "corner",
            "description": "Nolito (Celta Vigo) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 17:16",
            "label": "",
            "description": "Iago Aspas (Celta Vigo) was in a good shooting position just outside the box and unleashed a first time shot towards the inside of the left post, but the goalkeeper made a decent save to thwart his effort. The referee points to the corner flag and Celta Vigo will take a corner."
        },
        {
            "gameTime": "1 - 15:54",
            "label": "",
            "description": "Iago Aspas (Celta Vigo) rises above the defenders and places a towering header towards the middle of the goal, but Keylor Navas is prepared to thwart his effort."
        },
        {
            "gameTime": "1 - 12:21",
            "label": "corner",
            "description": "Daniel Wass (Celta Vigo) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 11:57",
            "label": "",
            "description": "Duran Nolito (Celta Vigo) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort. The referee and one of his assistants signal for a corner kick to Celta Vigo."
        },
        {
            "gameTime": "1 - 10:52",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a cross in and finds inside the box, but one of the defenders steps in and clears the danger."
        },
        {
            "gameTime": "1 - 09:35",
            "label": "",
            "description": "Duran Nolito (Celta Vigo) latches on to an accurate pass inside the box and immediately unleashes a shot towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 07:11",
            "label": "soccer-ball",
            "description": "feeds the ball through to Cristiano Ronaldo (Real Madrid), who picks up the pass inside the box and quickly sends it into the right side of the goal! The goalkeeper was helpless. 0:0!"
        },
        {
            "gameTime": "1 - 06:10",
            "label": "",
            "description": "Good defending. Cristiano Ronaldo (Real Madrid) tries to find Jese inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 03:44",
            "label": "",
            "description": "The ball flies way wide of the left post as Danilo (Real Madrid) produces an imprecise volley strike from long distance. The ball is off of the pitch and it's a goal kick for Celta Vigo."
        },
        {
            "gameTime": "1 - 03:27",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) works the corner short."
        },
        {
            "gameTime": "1 - 03:14",
            "label": "",
            "description": "Danilo (Real Madrid) races towards goal but the defender gets back well to make a challenge. Real Madrid force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 02:17",
            "label": "corner",
            "description": "The resulting corner from Toni Kroos (Real Madrid) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 01:46",
            "label": "",
            "description": "Danilo (Real Madrid) sends the ball into the box from the side of the pitch, but his cross is blocked. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Carlos Clos Gomez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. The superiority of the away team was evident on the pitch today. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "24/10/2015 - 17:00",
    "gameHomeTeam": "Celta Vigo",
    "gameScore": "1 - 3"
}