{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-03-01 - 21-30 Barcelona 6 - 1 Gijon/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:07",
            "label": "whistle",
            "description": "That's it for today, Jose Sanchez has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 46:18",
            "label": "corner",
            "description": "Barcelona take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:21",
            "label": "",
            "description": "Neymar (Barcelona) sends a cross into the box, but Ivan Cuellar comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 41:52",
            "label": "soccer-ball",
            "description": "Goal 6:1! Sergi Roberto tees up Ivan Rakitic (Barcelona) inside the box and he curls the ball into the right side of the net and past Ivan Cuellar."
        },
        {
            "gameTime": "2 - 41:08",
            "label": "funfact",
            "description": "The percentage of ball possession is – 74:26."
        },
        {
            "gameTime": "2 - 40:57",
            "label": "",
            "description": "Great teamplay by Barcelona as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 37:51",
            "label": "corner",
            "description": "The resulting corner from Ivan Rakitic (Barcelona) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 36:04",
            "label": "",
            "description": "One of the players from Barcelona times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 33:49",
            "label": "",
            "description": "The ball is cleared after Ivan Rakitic (Barcelona) attempted to dribble past an opposing player. The ball is out of play. A goal scoring opportunity from a corner for Barcelona."
        },
        {
            "gameTime": "2 - 33:10",
            "label": "corner",
            "description": "Neymar (Barcelona) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the bottom right corner. Ivan Cuellar has a clear sight of it and makes a comfortable save. The ball is out of play and the linesman points at the corner flag. Corner to Barcelona."
        },
        {
            "gameTime": "2 - 30:58",
            "label": "substitution",
            "description": "Joan Rubi has decided to make a change. Mikel Vesga (Gijon) replaces Sergio Alvarez."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 28:35",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Ivan Rakitic (Barcelona), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 28:21",
            "label": "substitution",
            "description": "The manager makes a subsitution with Sergi Roberto (Barcelona) coming on for Rafinha."
        },
        {
            "gameTime": "2 - 27:42",
            "label": "",
            "description": "Good clearance! Alcacer Paco (Barcelona) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him. Barcelona win a corner."
        },
        {
            "gameTime": "2 - 27:35",
            "label": "attendance",
            "description": "The attendance for today's match is 56605."
        },
        {
            "gameTime": "2 - 26:42",
            "label": "",
            "description": "Neymar (Barcelona) tries his luck with a long range effort after receiving a precise pass, but Ivan Cuellar has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 25:45",
            "label": "",
            "description": "Neymar (Barcelona) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "2 - 25:33",
            "label": "",
            "description": "Xavi Torres (Gijon) was trying to get to the ball but clattered into the legs of the opponent as well. Jose Sanchez blows his whistle for an infringement. There is a free kick near the sideline to Barcelona."
        },
        {
            "gameTime": "2 - 23:31",
            "label": "",
            "description": "Barcelona are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "soccer-ball",
            "description": "GOAL! Neymar (Barcelona) stands over the free kick and from 21 metres out curls the ball into the right side of the net. Excellent free kick!"
        },
        {
            "gameTime": "2 - 18:47",
            "label": "",
            "description": "Jose Sanchez blows his whistle for a foul after Juan Rodriguez (Gijon) hacks down one of his opponents. Barcelona will take a free kick."
        },
        {
            "gameTime": "2 - 18:09",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) dances his way past two defending players and gets to the edge of the box from where he unleashes a shot that goes well wide of the left post."
        },
        {
            "gameTime": "2 - 15:25",
            "label": "substitution",
            "description": "Luis Enrique has decided to substitute Lionel Messi and he is replaced by Andre Gomes (Barcelona)."
        },
        {
            "gameTime": "2 - 13:58",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Burgui walks off the pitch to be replaced by Ismael Lopez Blanco (Gijon)."
        },
        {
            "gameTime": "2 - 13:48",
            "label": "",
            "description": "Lionel Messi (Barcelona) fires in the free kick from a promising position just outside the box. It's a fantastic strike and looks set for glory, but it only rattles the left post!"
        },
        {
            "gameTime": "2 - 12:41",
            "label": "",
            "description": "Barcelona are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 12:24",
            "label": "",
            "description": "Victor Rodriguez (Gijon) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "2 - 11:41",
            "label": "corner",
            "description": "Gijon take a short corner kick."
        },
        {
            "gameTime": "2 - 10:12",
            "label": "",
            "description": "Neymar (Barcelona) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 09:36",
            "label": "y-card",
            "description": "Jose Sanchez shows a yellow card to Juan Rodriguez (Gijon) for his blatant foul. Barcelona have a free kick."
        },
        {
            "gameTime": "2 - 07:13",
            "label": "",
            "description": "Neymar (Barcelona) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the left post."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "corner",
            "description": "Barcelona work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "2 - 05:40",
            "label": "",
            "description": "Lionel Messi (Barcelona) connects with a pass but sees his shot from the edge of the box blocked. The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "2 - 03:52",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Lionel Messi, who plays a vital role in the build up. He squares it to Alcacer Paco (Barcelona), who beats Ivan Cuellar with a brilliant shot into the right side of the net. 4:1."
        },
        {
            "gameTime": "2 - 02:51",
            "label": "",
            "description": "The free kick from long range, taken by Gijon, is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 02:32",
            "label": "",
            "description": "Samuel Umtiti (Barcelona) gives away a foul for a fierce tackle on an opponent. Free kick. Gijon will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "",
            "description": "A pass into the penalty area from Lionel Messi (Barcelona) is intercepted by the defence. The ball goes out of play and Gijon will have a goal kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Luis Suarez will not participate anymore and Alcacer Paco (Barcelona) is coming on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Joan Rubi has made a change at the break. Victor Rodriguez (Gijon) has come on in place of Douglas Pereira."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Jose Sanchez starts the second half."
        },
        {
            "gameTime": "1 - 46:27",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:41",
            "label": "",
            "description": "The foul by Neymar (Barcelona) was seen by Jose Sanchez who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "y-card",
            "description": "Neymar (Barcelona) has too much to say to the referee and receives a caution."
        },
        {
            "gameTime": "1 - 44:26",
            "label": "y-card",
            "description": "A yellow card for a tackle by Carlos Castro (Gijon). Jose Sanchez doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "Neymar (Barcelona) zig zags his way into the box and drills a low shot towards the right post, but the goalkeeper pulls off a superb stop."
        },
        {
            "gameTime": "1 - 42:20",
            "label": "corner",
            "description": "Douglas Pereira (Gijon) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 41:49",
            "label": "",
            "description": "Burgui (Gijon) weaves through the defence with ease and gets one on one with the keeper, but fails to score with his strike towards the right side of the target as Marc Andre ter Stegen produces a good save. Gijon have a corner."
        },
        {
            "gameTime": "1 - 40:56",
            "label": "",
            "description": "Neymar (Barcelona) sends a chip pass into the box, but Ivan Cuellar is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 40:36",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Neymar (Barcelona) takes it short."
        },
        {
            "gameTime": "1 - 40:14",
            "label": "",
            "description": "Jordi Alba (Barcelona) sends a sweet pass into the penalty area, but one of the defenders averts the danger. It will be a corner kick for Barcelona."
        },
        {
            "gameTime": "1 - 37:55",
            "label": "",
            "description": "Luis Suarez (Barcelona) gets on the end of a pass and takes a low shot from the edge of the box which is straight at Ivan Cuellar, who makes a comfortable save."
        },
        {
            "gameTime": "1 - 37:09",
            "label": "",
            "description": "Denis Suarez (Barcelona) gets on the ball and beats an opponent, but his run is stopped by the referee Jose Sanchez who sees an offensive foul."
        },
        {
            "gameTime": "1 - 36:54",
            "label": "",
            "description": "Luis Suarez (Barcelona) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 34:50",
            "label": "",
            "description": "Neymar (Barcelona) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 34:22",
            "label": "corner",
            "description": "A dangerous looking corner kick from Neymar (Barcelona) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 33:52",
            "label": "",
            "description": "Denis Suarez (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Corner kick. Barcelona will have an opportunity."
        },
        {
            "gameTime": "1 - 32:30",
            "label": "",
            "description": "Luis Suarez (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 29:13",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Gijon was in an offside position."
        },
        {
            "gameTime": "1 - 26:36",
            "label": "soccer-ball",
            "description": "GOAL! Luis Suarez (Barcelona) got to the ball in front of the goal and he couldn't miss from there. His strike went in off the left hand post. The score is 3:1."
        },
        {
            "gameTime": "1 - 24:59",
            "label": "corner",
            "description": "The resulting corner from Neymar (Barcelona) is cleared."
        },
        {
            "gameTime": "1 - 24:45",
            "label": "",
            "description": "Wow, what an escape. Luis Suarez (Barcelona) has an effort from inside the box but it's brilliantly blocked. Barcelona earn a corner."
        },
        {
            "gameTime": "1 - 24:34",
            "label": "",
            "description": "Barcelona take a quick free kick and immediately restart play."
        },
        {
            "gameTime": "1 - 23:55",
            "label": "y-card",
            "description": "Jose Sanchez shows a yellow card to Burgui (Gijon) for a tough tackle. That's a free kick to Barcelona."
        },
        {
            "gameTime": "1 - 20:57",
            "label": "soccer-ball",
            "description": "Goal! Carlos Castro (Gijon) was in the right place at the right time to pounce on the rebound inside the box and gleefully rifles the ball home. It's 2:1."
        },
        {
            "gameTime": "1 - 20:55",
            "label": "",
            "description": "What a chance that is! Sergio Alvarez (Gijon) wastes a huge opportunity as he receives a beautiful pass inside the box but is somehow only able to prod the ball onto the right post!"
        },
        {
            "gameTime": "1 - 18:43",
            "label": "",
            "description": "Barcelona seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 14:40",
            "label": "corner",
            "description": "Gijon have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "1 - 14:14",
            "label": "",
            "description": "Elderson (Gijon) races towards goal but the defender gets back well to make a challenge. The ball is out of play and Gijon manage to earn a corner."
        },
        {
            "gameTime": "1 - 14:01",
            "label": "",
            "description": "Douglas Pereira (Gijon) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 12:14",
            "label": "",
            "description": "Neymar (Barcelona) goes on a mazy run and tries his luck with a mid range strike, but one of the defending players steps in and makes a block."
        },
        {
            "gameTime": "1 - 10:23",
            "label": "soccer-ball",
            "description": "Goal! Luis Suarez (Barcelona) gets a shot away from inside the box and the effort is deflected past the goalkeeper. 2:0."
        },
        {
            "gameTime": "1 - 08:26",
            "label": "soccer-ball",
            "description": "It's a goal! Lionel Messi (Barcelona) does well to meet a cross inside the box and powers a header past the helpless goalkeeper."
        },
        {
            "gameTime": "1 - 07:18",
            "label": "",
            "description": "Barcelona control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 05:25",
            "label": "",
            "description": "Neymar (Barcelona) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 04:05",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) commits a foul and Jose Sanchez immediately signals a free kick."
        },
        {
            "gameTime": "1 - 02:13",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Rafinha (Barcelona), whose instinctive shot towards goal flashes inches over the top."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gijon will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jose Sanchez will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gijon have signed: Lacina Traore (Monaco), Elderson (Monaco)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "In the 37 games that Gijon have played so far this season, 23 have had over 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "12 the number of consecutive matches that Barcelona scored at least one goal."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's it for today, Jose Sanchez has blown his whistle and the game is over."
        }
    ],
    "gameAwayTeam": "Gijon",
    "gameDate": "01/03/2017 - 21:30",
    "gameHomeTeam": "Barcelona",
    "gameScore": "6 - 1"
}