{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-09-21 - 21-45 Genoa 0 - 0 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. The performance of both teams was pretty much even. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 48:28",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "",
            "description": "Pepe Reina was forced into action to thwart Giovanni Simeone (Genoa). He found himself some space after latching on to a pass and unleashed a shot to the right post but couldn't beat the keeper."
        },
        {
            "gameTime": "2 - 45:55",
            "label": "",
            "description": "Jorginho (Napoli) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the right post."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:03",
            "label": "corner",
            "description": "The resulting corner from Edenilson (Genoa) is cleared."
        },
        {
            "gameTime": "2 - 42:47",
            "label": "",
            "description": "Ezequiel Munoz (Genoa) is picked out by one of his teammates with a great cross, but his poor control allows the defence to clear and avert the threat. The referee and his assistant both point at the corner flag. Genoa will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 41:44",
            "label": "substitution",
            "description": "A substitution has been made. Lucas Ocampos is replaced by Edenilson (Genoa)."
        },
        {
            "gameTime": "2 - 40:54",
            "label": "",
            "description": "Pepe Reina pulls off a great save to deny Diego Laxalt (Genoa), who makes himself some space inside the box and unleashes a quick low drive to the bottom right corner."
        },
        {
            "gameTime": "2 - 38:57",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 37:15",
            "label": "corner",
            "description": "Lucas Ocampos (Genoa) fails to deliver a decent cross from the corner and the ball goes out of play."
        },
        {
            "gameTime": "2 - 37:06",
            "label": "",
            "description": "A cross from Lucas Orban (Genoa) fails to reach the box as the defence clears the ball away to safety. Genoa have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 36:49",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to make a change. Manolo Gabbiadini (Napoli) replaces Arkadiusz Milik."
        },
        {
            "gameTime": "2 - 33:57",
            "label": "y-card",
            "description": "Today's referee Antonio Damato rightly decides to book Jorginho (Napoli) for his harsh tackle."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "",
            "description": "Diego Laxalt (Genoa) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 32:40",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) stands over the resultant free kick from mid range, but his shot goes just over the crossbar. It could have been a fantastic goal!"
        },
        {
            "gameTime": "2 - 31:59",
            "label": "substitution",
            "description": "Darko Lazovic comes off the pitch to be replaced by Ezequiel Munoz (Genoa)."
        },
        {
            "gameTime": "2 - 31:50",
            "label": "y-card",
            "description": "Antonio Damato shows a yellow card to Giovanni Simeone (Genoa) for a tough tackle."
        },
        {
            "gameTime": "2 - 29:26",
            "label": "y-card",
            "description": "Olivier Ntcham (Genoa) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 28:57",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Mattia Perin is alert and denies him."
        },
        {
            "gameTime": "2 - 28:37",
            "label": "",
            "description": "Neat passing move from Napoli in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to substitute Allan (Napoli) and he is replaced by ."
        },
        {
            "gameTime": "2 - 25:11",
            "label": "",
            "description": "Jose Callejon (Napoli) latches on to an accurate pass inside the box and immediately unleashes a shot towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 23:48",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 22:22",
            "label": "substitution",
            "description": "Substitution. Dries Mertens walks off the pitch and Lorenzo Insigne (Napoli) comes on as a substitute."
        },
        {
            "gameTime": "2 - 21:28",
            "label": "corner",
            "description": "Darko Lazovic (Genoa) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 21:10",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Diego Laxalt (Genoa). The referee blows his whistle, Genoa are awarded a corner kick."
        },
        {
            "gameTime": "2 - 19:44",
            "label": "",
            "description": "Jose Callejon (Napoli) tries to find Marek Hamsik, but he puts too much power on the pass."
        },
        {
            "gameTime": "2 - 18:43",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 18:41",
            "label": "",
            "description": "Napoli have a corner. Marek Hamsik (Napoli) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 17:16",
            "label": "",
            "description": "Lucas Ocampos (Genoa) is deemed to be in an offside position by the linesman and it looks like it is the right decision despite being a very close call."
        },
        {
            "gameTime": "2 - 16:57",
            "label": "",
            "description": "What an amazing save by Mattia Perin! Arkadiusz Milik (Napoli) swirls around the defenders and attempts to beat the keeper with a close range shot towards the bottom right corner, but fails."
        },
        {
            "gameTime": "2 - 16:31",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 16:00",
            "label": "",
            "description": "Jorginho (Napoli) finds himself in a promising position after receiving a beautiful cross from the side, but the opposition defence is ready and one of the defenders averts the threat with a quick interception. The ball goes out of play. Napoli are awarded a corner kick."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "",
            "description": "Jose Callejon (Napoli) almost finds himself in a very promising position, but he is flagged offside by the linesman."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "",
            "description": "Nicolas Burdisso (Genoa) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "2 - 13:30",
            "label": "corner",
            "description": "Darko Lazovic (Genoa) will take the corner."
        },
        {
            "gameTime": "2 - 11:20",
            "label": "",
            "description": "Darko Lazovic (Genoa) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the right side of the net, but Pepe Reina leaps like a salmon to deny him."
        },
        {
            "gameTime": "2 - 09:32",
            "label": "",
            "description": "Marek Hamsik (Napoli) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "2 - 07:41",
            "label": "y-card",
            "description": "Tomas Rincon (Genoa) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 06:24",
            "label": "y-card",
            "description": "Elseid Hysaj (Napoli) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Antonio Damato ignores the protests."
        },
        {
            "gameTime": "2 - 04:46",
            "label": "corner",
            "description": "Jose Callejon (Napoli) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 03:20",
            "label": "",
            "description": "Raul Albiol (Napoli) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort. The linesman points to the corner flag, Napoli are going to take it."
        },
        {
            "gameTime": "2 - 03:05",
            "label": "corner",
            "description": "Dries Mertens (Napoli) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 02:12",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety. The ball is out of play. A goal scoring opportunity from a corner for Napoli."
        },
        {
            "gameTime": "2 - 01:47",
            "label": "",
            "description": "The linesman makes the right call and Napoli will have a corner. Arkadiusz Milik (Napoli) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The fans have so far witnessed an unattractive game, with barely any exciting moments to stir interest. Neither team has really been able to control the flow of the game. The home team's main weapon is fast counter attacks, while the away side attempts to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:03",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Antonio Damato has ended it."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:46",
            "label": "",
            "description": "Jose Callejon (Napoli) receives a low pass just outside the box and unleashes a fine strike towards the middle of the goal. Mattia Perin pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 43:20",
            "label": "",
            "description": "Darko Lazovic (Genoa) is caught offside by the linesman and it looks like it is the right decision despite being a very close call."
        },
        {
            "gameTime": "1 - 42:01",
            "label": "corner",
            "description": "Armando Izzo (Genoa) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 41:42",
            "label": "",
            "description": "Giovanni Simeone (Genoa) flights in the cross, but the defender is alert and clears to safety. The ball is out of play and Genoa manage to earn a corner."
        },
        {
            "gameTime": "1 - 41:01",
            "label": "",
            "description": "The linesman signals that Diego Laxalt (Genoa) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 39:20",
            "label": "",
            "description": "Luca Rigoni (Genoa) latches on to a precise pass and one on one with the keeper slams the ball towards the left hand post. Pepe Reina is alert, though, and leaps like a salmon to deny him."
        },
        {
            "gameTime": "1 - 38:14",
            "label": "",
            "description": "A crossfield pass from Lucas Orban (Genoa) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 37:00",
            "label": "",
            "description": "A pass by Dries Mertens (Napoli) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 35:08",
            "label": "corner",
            "description": "The resulting corner, taken by Faouzi Ghoulam (Napoli), comes to nothing."
        },
        {
            "gameTime": "1 - 34:22",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) is in a clear offside position and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 33:33",
            "label": "",
            "description": "Marek Hamsik (Napoli) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Good work from Napoli as they win a corner."
        },
        {
            "gameTime": "1 - 31:56",
            "label": "y-card",
            "description": "A yellow card for a tackle by Lucas Orban (Genoa). Antonio Damato doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 30:02",
            "label": "substitution",
            "description": "Here comes a substitution. Leonardo Pavoletti is given a rest as he is replaced by Giovanni Simeone (Genoa)."
        },
        {
            "gameTime": "1 - 29:36",
            "label": "",
            "description": "Dries Mertens (Napoli) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 28:43",
            "label": "",
            "description": "Lucas Ocampos (Genoa) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 26:53",
            "label": "",
            "description": "Antonio Damato blows his whistle after Elseid Hysaj (Napoli) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 24:39",
            "label": "",
            "description": "Leonardo Pavoletti (Genoa) attempts to convert a cross into a goal, but his promising header from near the penalty spot towards the middle of the net is denied by Pepe Reina. This effort really didn't trouble him."
        },
        {
            "gameTime": "1 - 23:44",
            "label": "",
            "description": "Jose Callejon (Napoli) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 22:25",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) is forced to stop his forward run after being caught in an offside position by the linesman."
        },
        {
            "gameTime": "1 - 20:22",
            "label": "",
            "description": "A pass by Dries Mertens (Napoli) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 18:07",
            "label": "",
            "description": "Marek Hamsik (Napoli) expertly controls a neat clever pass inside the box, but his effort crashes against the crossbar! What an opportunity that was!"
        },
        {
            "gameTime": "1 - 17:05",
            "label": "",
            "description": "Jose Callejon (Napoli) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "1 - 16:31",
            "label": "",
            "description": "Darko Lazovic (Genoa) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 15:55",
            "label": "",
            "description": "Lucas Ocampos (Genoa) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance."
        },
        {
            "gameTime": "1 - 14:20",
            "label": "",
            "description": "A pass by Marek Hamsik (Napoli) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 12:33",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 11:39",
            "label": "",
            "description": "Good movement by Dries Mertens (Napoli), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "1 - 10:09",
            "label": "",
            "description": "Darko Lazovic (Genoa) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 08:56",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) gives away a foul for a clumsy challenge. Referee Antonio Damato saw the whole situation."
        },
        {
            "gameTime": "1 - 08:14",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 08:00",
            "label": "corner",
            "description": "Napoli win a corner. Faouzi Ghoulam (Napoli) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 07:18",
            "label": "",
            "description": "Jose Callejon (Napoli) races towards goal but the defender gets back well to make a challenge. Napoli force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 06:14",
            "label": "",
            "description": "The ball is cleared after Lucas Ocampos (Genoa) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 04:27",
            "label": "",
            "description": "A beautiful low pass from the side is received by Darko Lazovic (Genoa), who was waiting for his chance. However, the defence is alert and spanks the ball away."
        },
        {
            "gameTime": "1 - 03:02",
            "label": "",
            "description": "Elseid Hysaj (Napoli) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "1 - 00:40",
            "label": "",
            "description": "Lucas Ocampos (Genoa) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Genoa will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Damato will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most cautioned player for Genoa is Miguel Veloso with 4 yellow cards."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli haven't lost in their last 3 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Napoli is Jose Callejon with 7 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. The performance of both teams was pretty much even. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "21/09/2016 - 21:45",
    "gameHomeTeam": "Genoa",
    "gameScore": "0 - 0"
}