{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-01-09 - 22-30 Real Madrid 5 - 0 Dep. La Coruna/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The host team were better throughout the game. Short passing and possession was the style of the home side, while the visiting side tried to hit their opposition on the break."
        },
        {
            "gameTime": "2 - 46:14",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 45:23",
            "label": "soccer-ball",
            "description": "Karim Benzema (Real Madrid) with a wonderful piece of finishing. He produces a superb first timer that goes in off the inside of the left post. What a goal that is!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:02",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) unleashes a powerful first time volley towards goal, but the ball goes well wide of the left post."
        },
        {
            "gameTime": "2 - 42:23",
            "label": "",
            "description": "Luis Alberto (Dep. La Coruna) is clearly in an offside position and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 40:40",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 40:36",
            "label": "",
            "description": "Jese (Real Madrid) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender. It will be a corner kick for Real Madrid."
        },
        {
            "gameTime": "2 - 40:06",
            "label": "",
            "description": "The Real Madrid players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 37:53",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) got into an offside position. It was tight, but it's not the first time he got caught today."
        },
        {
            "gameTime": "2 - 37:11",
            "label": "",
            "description": "Juanfran (Dep. La Coruna) gets the ball from a rebound and shoots from long range, but sends the ball high over the crossbar. The goalkeeper doesn't have to worry about this one. Very poor attempt."
        },
        {
            "gameTime": "2 - 36:55",
            "label": "corner",
            "description": "The corner from Lucas Perez (Dep. La Coruna) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 36:35",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) wastes a good opportunity as his pass into the box is blocked by the defence. The ball goes out of play. Dep. La Coruna are awarded a corner kick."
        },
        {
            "gameTime": "2 - 34:39",
            "label": "",
            "description": "Luka Modric links up with Cristiano Ronaldo (Real Madrid), who fires just wide of the left post from the edge of the box."
        },
        {
            "gameTime": "2 - 33:43",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Lucas Perez (Dep. La Coruna), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 33:04",
            "label": "",
            "description": "Luisinho (Dep. La Coruna) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the right post is, however, superbly saved by Keylor Navas! The ball is out of play. Dep. La Coruna will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 31:09",
            "label": "corner",
            "description": "Lucas Perez (Dep. La Coruna) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 31:01",
            "label": "",
            "description": "Alex Bergantinos (Dep. La Coruna) fails to send a pass into the box as his effort is cut out. Good work from Dep. La Coruna as they win a corner."
        },
        {
            "gameTime": "2 - 29:00",
            "label": "substitution",
            "description": "Here comes a substitution. Gareth Bale is given a rest as he is replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 28:12",
            "label": "",
            "description": "The flag goes up and the referee blows his whistle another offside by Cristiano Ronaldo (Real Madrid), who has already been caught several times today."
        },
        {
            "gameTime": "2 - 28:03",
            "label": "attendance",
            "description": "The attendance for today's match is 71267."
        },
        {
            "gameTime": "2 - 27:41",
            "label": "",
            "description": "That didn't go as planned! Cristiano Ronaldo (Real Madrid) tried his luck from the edge of the box, but his effort low towards the middle of the goal was too weak to get past German Lux, who easily kept it out."
        },
        {
            "gameTime": "2 - 26:59",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) strikes a promising volley towards goal, but one of the defenders is quick enough to step in and make a crucial block."
        },
        {
            "gameTime": "2 - 25:47",
            "label": "",
            "description": "The free kick is taken by James Rodriguez (Real Madrid), but ball is cleared."
        },
        {
            "gameTime": "2 - 25:19",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "y-card",
            "description": "Pedro Perez Montero shows a yellow card to Alejandro Arribas (Dep. La Coruna) for a tough tackle. Real Madrid win a free kick."
        },
        {
            "gameTime": "2 - 22:47",
            "label": "",
            "description": "The linesman raises his flag for offside before Oriol Riera (Dep. La Coruna) heads on."
        },
        {
            "gameTime": "2 - 22:10",
            "label": "injury",
            "description": "Looks like Daniel Carvajal (Real Madrid) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 20:36",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Oriol Riera (Dep. La Coruna) is coming onto the pitch as Faycal Fajr cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 20:31",
            "label": "substitution",
            "description": "Victor Sanchez decides to make a substitution. Fernando Navarro will be replaced by Luisinho (Dep. La Coruna)."
        },
        {
            "gameTime": "2 - 20:10",
            "label": "substitution",
            "description": "Substitution. James Rodriguez (Real Madrid) in, Isco out."
        },
        {
            "gameTime": "2 - 18:45",
            "label": "y-card",
            "description": "The foul by Pedro Mosquera Parada (Dep. La Coruna) is worthy of a card and a yellow is duly shown by Pedro Perez Montero."
        },
        {
            "gameTime": "2 - 17:32",
            "label": "soccer-ball",
            "description": "Toni Kroos sends in a great cross from the corner and finds Gareth Bale (Real Madrid), who outjumps the defence to put the ball into the roof of the net with a stunning header. The score is 4:0."
        },
        {
            "gameTime": "2 - 17:20",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 16:47",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 15:22",
            "label": "",
            "description": "Luka Modric (Real Madrid) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "2 - 15:01",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Lucas Perez (Dep. La Coruna). Pedro Perez Montero saw the sliding tackle and blows for a foul. Real Madrid have a free kick."
        },
        {
            "gameTime": "2 - 13:24",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a clever long through ball and finds himself in a promising position inside the box, but the defence is alert to the danger and clears."
        },
        {
            "gameTime": "2 - 09:54",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Lucas Perez (Dep. La Coruna)."
        },
        {
            "gameTime": "2 - 09:28",
            "label": "",
            "description": "Pedro Mosquera Parada (Dep. La Coruna) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. Now Dep. La Coruna have a corner."
        },
        {
            "gameTime": "2 - 07:11",
            "label": "",
            "description": "Alex Bergantinos (Dep. La Coruna) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 03:52",
            "label": "soccer-ball",
            "description": "What a goal! Cristiano Ronaldo plays it to Gareth Bale (Real Madrid), who finds himself unmarked inside the box and slots a first time shot past German Lux into the bottom right corner. 3:0."
        },
        {
            "gameTime": "2 - 00:52",
            "label": "substitution",
            "description": "The need to improve in the second half has brought about a change. Federico Cartabia comes off for Jonas Gutierrez (Dep. La Coruna)."
        },
        {
            "gameTime": "2 - 00:13",
            "label": "substitution",
            "description": "Half time substitution. Zinedine Zidane decided to make a change. Sergio Ramos is replaced by Raphael Varane (Real Madrid)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Pedro Perez Montero starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. The hosts dominated much of the first period. The home side are attempting to hold onto the ball for as long as possible. The away team, on the other hand, are playing long ball football."
        },
        {
            "gameTime": "1 - 45:10",
            "label": "whistle",
            "description": "Pedro Perez Montero has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 44:16",
            "label": "corner",
            "description": "Faycal Fajr (Dep. La Coruna) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "1 - 43:58",
            "label": "",
            "description": "Federico Cartabia (Dep. La Coruna) crosses the ball into the box, but one of the defending players averts the threat. Dep. La Coruna force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 40:59",
            "label": "",
            "description": "Luis Alberto (Dep. La Coruna) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "1 - 39:33",
            "label": "",
            "description": "This was a piece of cake for German Lux. Karim Benzema (Real Madrid) found himself some space after latching on to a pass, but his strike only went low to the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "1 - 38:51",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) latches on to a superb cross into the box and hits the left post with a fine header. What a chance!"
        },
        {
            "gameTime": "1 - 37:22",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) collects a pass and has an effort from 21 metres out, but it flies just wide of the left post."
        },
        {
            "gameTime": "1 - 37:00",
            "label": "",
            "description": "What a chance that is! Lucas Perez (Dep. La Coruna) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 33:54",
            "label": "",
            "description": "Marcelo (Real Madrid) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 32:44",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of German Lux."
        },
        {
            "gameTime": "1 - 29:29",
            "label": "",
            "description": "CHANCE! Lucas Perez (Dep. La Coruna) picks up a pass inside the box and has a sight of goal, but he sends his shot well wide of the left post."
        },
        {
            "gameTime": "1 - 28:13",
            "label": "corner",
            "description": "Federico Cartabia (Dep. La Coruna) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "1 - 28:02",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Alex Bergantinos (Dep. La Coruna). Corner kick. Dep. La Coruna will have an opportunity."
        },
        {
            "gameTime": "1 - 26:38",
            "label": "corner",
            "description": "Federico Cartabia (Dep. La Coruna) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 26:16",
            "label": "",
            "description": "Luis Alberto (Dep. La Coruna) delivers a crossfield pass, but the ball is cut out before it reaches its intended target. The linesman points to the corner flag, Dep. La Coruna are going to take it."
        },
        {
            "gameTime": "1 - 25:47",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to beat the offside trap, but it was a really close call."
        },
        {
            "gameTime": "1 - 25:28",
            "label": "",
            "description": "Faycal Fajr (Dep. La Coruna) sends a teasing cross into the area, but Keylor Navas intercepts the ball."
        },
        {
            "gameTime": "1 - 24:34",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) weaves through the defence with ease and gets into a good position in front of goal. He pulls the trigger in an effort to beat the keeper, but fails as the ball zooms around the right post."
        },
        {
            "gameTime": "1 - 23:36",
            "label": "",
            "description": "Federico Cartabia (Dep. La Coruna) had a good chance to change the score. He ran towards the goal and unleashed a low shot from long range which went towards the middle of the goal, but Keylor Navas was ready and made a save."
        },
        {
            "gameTime": "1 - 21:16",
            "label": "soccer-ball",
            "description": "Daniel Carvajal showcases his great technique and produces a beautiful lofted cross into the box. Gareth Bale (Real Madrid) meets the cross and gets himself onto the scoresheet with a header down into the middle of the net. It's 2:0."
        },
        {
            "gameTime": "1 - 21:13",
            "label": "",
            "description": "Marcelo (Real Madrid) misses a sitter from inside the six yard box after striking the ball narrowly wide of the goal."
        },
        {
            "gameTime": "1 - 20:23",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "1 - 18:54",
            "label": "",
            "description": "Karim Benzema (Real Madrid) commits a foul and Pedro Perez Montero immediately signals a free kick."
        },
        {
            "gameTime": "1 - 18:45",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 18:14",
            "label": "",
            "description": "Isco (Real Madrid) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Real Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 14:59",
            "label": "y-card",
            "description": "German Lux (Dep. La Coruna) is literally asking for a yellow card with his behaviour. The referee agrees and books him."
        },
        {
            "gameTime": "1 - 14:55",
            "label": "soccer-ball",
            "description": "Goal! Sergio Ramos takes aim and his effort deflects off Karim Benzema (Real Madrid) to beat the goalkeeper. 1:0."
        },
        {
            "gameTime": "1 - 14:30",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) will take a corner kick."
        },
        {
            "gameTime": "1 - 13:30",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender. Real Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 12:54",
            "label": "",
            "description": "Lovely cross from Marcelo to find Karim Benzema (Real Madrid) deep in the box, but he steers his header well over the bar."
        },
        {
            "gameTime": "1 - 11:35",
            "label": "",
            "description": "Pedro Mosquera Parada (Dep. La Coruna) sends a cross into the box, but Keylor Navas comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 10:55",
            "label": "corner",
            "description": "Faycal Fajr (Dep. La Coruna) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 10:30",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) had a golden opportunity. He volleyed from point blank range towards the bottom left corner, but Keylor Navas was alert and made an amazing save! Dep. La Coruna have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 10:11",
            "label": "corner",
            "description": "Federico Cartabia (Dep. La Coruna) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 09:49",
            "label": "",
            "description": "Luis Alberto (Dep. La Coruna) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender. The ball goes behind for a corner. Dep. La Coruna will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 09:28",
            "label": "",
            "description": "Isco (Real Madrid) sends a chip pass into the box, but German Lux is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 08:18",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 07:57",
            "label": "",
            "description": "A neat pass is well received by Cristiano Ronaldo (Real Madrid), who is lurking on the edge of the box and strikes the ball towards the bottom left corner, but the goalkeeper makes an incredible save to block his shot. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 07:25",
            "label": "",
            "description": "Faycal Fajr (Dep. La Coruna) controls a nice lofted pass and shoots from the edge of the box, but his attempt is neither hard nor precise, so Keylor Navas stops it easily."
        },
        {
            "gameTime": "1 - 05:33",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 04:45",
            "label": "",
            "description": "Luis Alberto (Dep. La Coruna) finds space on the edge of the box, but his wild shot goes high over the bar."
        },
        {
            "gameTime": "1 - 04:19",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) picks up a long through ball, but German Lux deserves praise for a brilliant reaction and interception."
        },
        {
            "gameTime": "1 - 01:37",
            "label": "",
            "description": "Gareth Bale (Real Madrid) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "",
            "description": "The players are on the pitch and Dep. La Coruna will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Pedro Perez Montero."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The host team were better throughout the game. Short passing and possession was the style of the home side, while the visiting side tried to hit their opposition on the break."
        }
    ],
    "gameAwayTeam": "Dep. La Coruna",
    "gameDate": "09/01/2016 - 22:30",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "5 - 0"
}