{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-12-09 - 22-45 Dortmund 1 - 1 Anderlecht/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The home side were dominant and dictated the tempo of the game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 48:14",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 47:43",
            "label": "",
            "description": "Anderlecht are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:20",
            "label": "",
            "description": "Dortmund are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "substitution",
            "description": "Aleksandar Mitrovic comes off the pitch to be replaced by Michael Heylen (Anderlecht)."
        },
        {
            "gameTime": "2 - 41:04",
            "label": "",
            "description": "Referee Alberto Undiano Mallenco sees the trip by Olivier Deschacht (Anderlecht) and doesn't hesitate to blow his whistle. Dortmund are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 40:38",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Erik Durm (Dortmund) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 38:54",
            "label": "substitution",
            "description": "Substitution. Jakub Blaszczykowski (Dortmund) receives a signal from the referee and is now allowed to enter the pitch as Shinji Kagawa walks off."
        },
        {
            "gameTime": "2 - 38:41",
            "label": "soccer-ball",
            "description": "Anthony Vanden Borre sends a superb cross into the box. Aleksandar Mitrovic (Anderlecht) latches on to it and from close range plants a header into the top left corner, leaving Mitchell Langerak beaten. He displayed his eye for goal there excellent finish. The score is 1:0."
        },
        {
            "gameTime": "2 - 38:00",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) takes the ball, nicely zig zags through the defence, but his shot to the left post is smartly dealt with by Silvio Proto."
        },
        {
            "gameTime": "2 - 36:48",
            "label": "corner",
            "description": "Dennis Praet (Anderlecht) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 36:42",
            "label": "",
            "description": "Aleksandar Mitrovic (Anderlecht) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender. The referee points to the corner flag and Anderlecht will take a corner."
        },
        {
            "gameTime": "2 - 36:16",
            "label": "",
            "description": "Anderlecht string together a series of short passes."
        },
        {
            "gameTime": "2 - 34:47",
            "label": "",
            "description": "What a big chance! Henrikh Mkhitaryan (Dortmund) picks up an inch perfect pass inside the box and fires the ball just over the crossbar. The ball goes out of play and Anderlecht will have a goal kick."
        },
        {
            "gameTime": "2 - 33:41",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) makes a reckless foul in order to win the ball from his opponent. Alberto Undiano Mallenco has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 33:17",
            "label": "substitution",
            "description": "Here comes a substitution. Tired Ibrahima Conte (Anderlecht) left the pitch, and Cyriac Gohi Bi (Anderlecht) is coming on to help his team."
        },
        {
            "gameTime": "2 - 32:42",
            "label": "",
            "description": "Erik Durm (Dortmund) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play and Anderlecht will have a goal kick."
        },
        {
            "gameTime": "2 - 32:08",
            "label": "",
            "description": "Frank Acheampong (Anderlecht) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 31:04",
            "label": "",
            "description": "Ciro Immobile (Dortmund) attempted to send a defence splitting pass into space where Pierre Emerick Aubameyang was lurking. It could have put him one on one with the goalkeeper, but one of the defending players somehow manages to avert the threat."
        },
        {
            "gameTime": "2 - 29:29",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Marcel Schmelzer will be replaced by Pierre Emerick Aubameyang (Dortmund)."
        },
        {
            "gameTime": "2 - 29:07",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Frank Acheampong (Anderlecht)."
        },
        {
            "gameTime": "2 - 28:47",
            "label": "",
            "description": "Leander Dendoncker (Anderlecht) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "2 - 27:53",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 27:02",
            "label": "",
            "description": "Ciro Immobile (Dortmund) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 25:54",
            "label": "",
            "description": "Ciro Immobile (Dortmund) picks up the rebound just outside the box and releases a weak shot straight at the goalkeeper who saves."
        },
        {
            "gameTime": "2 - 24:51",
            "label": "corner",
            "description": "The resulting corner, taken by Marcel Schmelzer (Dortmund), comes to nothing."
        },
        {
            "gameTime": "2 - 24:45",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) picks up a rebound inside the penalty area and sends a shot to the top left corner, but is denied by a reflex save from Silvio Proto. Good work from Dortmund as they win a corner."
        },
        {
            "gameTime": "2 - 24:31",
            "label": "",
            "description": "Ciro Immobile (Dortmund) wriggles into space inside the box with excellent ball control, but his effort on goal is well blocked."
        },
        {
            "gameTime": "2 - 23:37",
            "label": "substitution",
            "description": "Besnik Hasi has decided to make a change. Youri Tielemans (Anderlecht) replaces Sacha Kljestan."
        },
        {
            "gameTime": "2 - 22:09",
            "label": "",
            "description": "Frank Acheampong (Anderlecht) sends a pass into the penalty area, but the opponent manages to cut it out."
        },
        {
            "gameTime": "2 - 20:59",
            "label": "",
            "description": "Ciro Immobile (Dortmund) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 20:07",
            "label": "substitution",
            "description": "Today's match ends for Ilkay Gundogan who will be replaced by Oliver Kirch (Dortmund)."
        },
        {
            "gameTime": "2 - 19:05",
            "label": "",
            "description": "Dennis Praet (Anderlecht) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 18:12",
            "label": "",
            "description": "What a wasted chance that was! A precise cross into the box finds Aleksandar Mitrovic (Anderlecht), whose header goes wide of the goal. The ball goes out of play and Dortmund will have a goal kick."
        },
        {
            "gameTime": "2 - 17:46",
            "label": "",
            "description": "Alberto Undiano Mallenco interrupts the game for a tactical foul by Ciro Immobile (Dortmund)."
        },
        {
            "gameTime": "2 - 16:57",
            "label": "",
            "description": "Olivier Deschacht (Anderlecht) makes an overly aggressive challenge and Alberto Undiano Mallenco blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 16:12",
            "label": "",
            "description": "Leander Dendoncker (Anderlecht) handled the ball and gives away a free kick."
        },
        {
            "gameTime": "2 - 14:30",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball into the stands. Nice run, but poor finish! The ball goes out of play and Anderlecht will have a goal kick."
        },
        {
            "gameTime": "2 - 12:52",
            "label": "soccer-ball",
            "description": "Ciro Immobile (Dortmund) receives the ball inside the box, reacts quickly and without any problems stabs the ball inside the right post."
        },
        {
            "gameTime": "2 - 12:05",
            "label": "",
            "description": "Ciro Immobile (Dortmund) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 11:06",
            "label": "",
            "description": "Ibrahima Conte (Anderlecht) sends over a free kick from long range but the defence is alert."
        },
        {
            "gameTime": "2 - 10:11",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "2 - 09:46",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "",
            "description": "Ciro Immobile (Dortmund) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "2 - 08:16",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) meets a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Silvio Proto pulls off an easy save."
        },
        {
            "gameTime": "2 - 08:07",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) passes the ball and slows down the tempo so his team can continue with their combination play."
        },
        {
            "gameTime": "2 - 06:13",
            "label": "",
            "description": "It's a weak and poor shot by Ciro Immobile (Dortmund) as he flashes a first time shot from the edge of the box. The ball flies well wide of the right post. The ball goes out of play and Anderlecht will have a goal kick."
        },
        {
            "gameTime": "2 - 05:38",
            "label": "",
            "description": "Dortmund keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "2 - 05:06",
            "label": "",
            "description": "The referee blows his whistle as Neven Subotic (Dortmund) was too aggressive in his challenge."
        },
        {
            "gameTime": "2 - 04:40",
            "label": "",
            "description": "The ball is cleared after Ilkay Gundogan (Dortmund) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 04:12",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle for a foul after Ibrahima Conte (Anderlecht) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 03:52",
            "label": "",
            "description": "What an amazing save by Silvio Proto! Henrikh Mkhitaryan (Dortmund) swirls around the defenders and attempts to beat the keeper with a close range shot low towards the middle of the target, but fails."
        },
        {
            "gameTime": "2 - 03:20",
            "label": "",
            "description": "A precise low pass is received by Ciro Immobile (Dortmund), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the right post. The ball is off of the pitch and it's a goal kick for Anderlecht."
        },
        {
            "gameTime": "2 - 01:15",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) takes the chance to have an effort at goal from inside the box but misses to the left of the target. The ball is off of the pitch and it's a goal kick for Anderlecht."
        },
        {
            "gameTime": "2 - 00:54",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. The visitors played second fiddle to the home team in the first half. Pass and move. The home side have played some possession football so far, while the visitors have been patient as they wait for the right moment to hit them on the break."
        },
        {
            "gameTime": "1 - 45:12",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:00",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Shinji Kagawa (Dortmund) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 43:03",
            "label": "",
            "description": "Unbelievable miss! Sacha Kljestan (Anderlecht) reacts superbly to latch on to a rebound, but he blazes the ball high over the crossbar! The ball goes out of play and Dortmund will have a goal kick."
        },
        {
            "gameTime": "1 - 42:14",
            "label": "",
            "description": "Erik Durm (Dortmund) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 40:08",
            "label": "",
            "description": "Erik Durm (Dortmund) gets the ball from a rebound and shoots from long range, but sends the ball miles wide of the left post. The goalkeeper doesn't have to worry about this one. Very poor attempt. The ball goes out of play and Anderlecht will have a goal kick."
        },
        {
            "gameTime": "1 - 39:51",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 39:34",
            "label": "",
            "description": "Kevin Grosskreutz (Dortmund) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety. Dortmund will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 38:56",
            "label": "",
            "description": "Erik Durm (Dortmund) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone. The ball is off of the pitch and it's a goal kick for Anderlecht."
        },
        {
            "gameTime": "1 - 38:25",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball. The linesman signals a throw in for Dortmund."
        },
        {
            "gameTime": "1 - 37:57",
            "label": "",
            "description": "A pass by Chancel Mbemba (Anderlecht) ends up in no man's land, and the attacking effort comes to an end. It's a throw in for Dortmund."
        },
        {
            "gameTime": "1 - 36:41",
            "label": "",
            "description": "Dortmund players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "1 - 34:45",
            "label": "",
            "description": "Erik Durm (Dortmund) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 33:24",
            "label": "",
            "description": "Ibrahima Conte (Anderlecht) plays a through ball inside the box, but it's too strong and Mitchell Langerak comes off his line to intercept."
        },
        {
            "gameTime": "1 - 32:06",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 31:10",
            "label": "",
            "description": "This was a piece of cake for Silvio Proto. Henrikh Mkhitaryan (Dortmund) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "1 - 30:31",
            "label": "corner",
            "description": "The resulting corner from Dennis Praet (Anderlecht) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 30:09",
            "label": "",
            "description": "Anthony Vanden Borre (Anderlecht) sends a pass into the box, but his attempt is thwarted and cleared. Anderlecht have a corner."
        },
        {
            "gameTime": "1 - 29:28",
            "label": "",
            "description": "Kevin Grosskreutz (Dortmund) is quickest inside the box and leaps to connect with the resulting set piece. He produces a fine header, but it floats just over the crossbar. The ball is off of the pitch and it's a goal kick for Anderlecht."
        },
        {
            "gameTime": "1 - 29:02",
            "label": "corner",
            "description": "Marcel Schmelzer (Dortmund) takes the corner."
        },
        {
            "gameTime": "1 - 28:29",
            "label": "",
            "description": "Ciro Immobile (Dortmund) goes on a mazy run, skips past two defenders and pulls the trigger in front of the keeper. Silvio Proto makes a great save to deny his effort directed to the top left corner. The referee blows his whistle, Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 27:29",
            "label": "",
            "description": "Anthony Vanden Borre (Anderlecht) crosses the ball forward but it is intercepted."
        },
        {
            "gameTime": "1 - 25:54",
            "label": "",
            "description": "Ciro Immobile (Dortmund) makes a decision to dribble through the defence towards the goal. He gets inside the box, pulls the trigger, but hits the ball very poorly and it goes yards wide of the target. The ball is off of the pitch and it's a goal kick for Anderlecht."
        },
        {
            "gameTime": "1 - 25:10",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) makes a strong challenge and Alberto Undiano Mallenco blows for a foul."
        },
        {
            "gameTime": "1 - 23:56",
            "label": "",
            "description": "Leander Dendoncker (Anderlecht) extricates himself from the difficult situation with a good pass, comfortably eluding the pressing opponent."
        },
        {
            "gameTime": "1 - 23:36",
            "label": "corner",
            "description": "The resulting corner from Dennis Praet (Anderlecht) comes to nothing."
        },
        {
            "gameTime": "1 - 23:03",
            "label": "",
            "description": "Dennis Praet (Anderlecht) tries his luck with a shot from long range, but his effort is well blocked by one of the defending players. The ball goes behind for a corner. Anderlecht will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 22:18",
            "label": "",
            "description": "The game is interrupted as Marcel Schmelzer (Dortmund) is flagged offside."
        },
        {
            "gameTime": "1 - 21:57",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 20:53",
            "label": "",
            "description": "Frank Acheampong (Anderlecht) sends a cross into the box, but Mitchell Langerak comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 20:03",
            "label": "",
            "description": "Olivier Deschacht (Anderlecht) takes the free kick from a long way out but the defender manages to get it clear."
        },
        {
            "gameTime": "1 - 19:50",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) brings an opponent down and Alberto Undiano Mallenco interrupts the game."
        },
        {
            "gameTime": "1 - 18:59",
            "label": "",
            "description": "Erik Durm (Dortmund) is adjudged offside."
        },
        {
            "gameTime": "1 - 18:45",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) passes the ball into the box but an opposing player clears. The ball is behind the touchline and Dortmund will take a throw in."
        },
        {
            "gameTime": "1 - 17:42",
            "label": "",
            "description": "Kevin Grosskreutz (Dortmund) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 15:17",
            "label": "",
            "description": "Some neat passing and movement from Dortmund as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 14:05",
            "label": "",
            "description": "Nuri Sahin (Dortmund) is unable to feed a through ball into the path of his teammates. The ball goes out of play and Anderlecht will have a goal kick."
        },
        {
            "gameTime": "1 - 13:29",
            "label": "",
            "description": "Anthony Vanden Borre (Anderlecht) escapes without any punishment from the referee after using excessive force to foul his opponent. It's a free kick to Dortmund, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 12:10",
            "label": "",
            "description": "Matthias Ginter (Dortmund) brings his opponent down with a tackle and Alberto Undiano Mallenco blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 11:43",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "1 - 11:17",
            "label": "",
            "description": "Aleksandar Mitrovic (Anderlecht) latches on to an accurate pass on the edge of the box and unleashes a strong shot towards goal, but his effort is denied by the well positioned keeper."
        },
        {
            "gameTime": "1 - 09:46",
            "label": "",
            "description": "Kevin Grosskreutz (Dortmund) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 08:16",
            "label": "",
            "description": "A pass from Erik Durm (Dortmund) is intercepted by Silvio Proto and the move breaks down."
        },
        {
            "gameTime": "1 - 07:40",
            "label": "",
            "description": "Fabrice N'Sakala (Anderlecht) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 07:24",
            "label": "",
            "description": "Ibrahima Conte (Anderlecht) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "1 - 07:12",
            "label": "injury",
            "description": "Fabrice N'Sakala (Anderlecht) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 06:47",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle after Erik Durm (Dortmund) brings one of his opponents down with a strong tackle. Anderlecht are awarded the free kick."
        },
        {
            "gameTime": "1 - 06:21",
            "label": "",
            "description": "Fabrice N'Sakala (Anderlecht) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 06:01",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 04:53",
            "label": "corner",
            "description": "Marcel Schmelzer (Dortmund) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 04:32",
            "label": "",
            "description": "Kevin Großkreutz (Dortmund) is first to the rebound and sends a header goalwards but it's blocked. Wow, what an escape there for the opposition. Dortmund earn a corner."
        },
        {
            "gameTime": "1 - 03:42",
            "label": "",
            "description": "Ciro Immobile (Dortmund) blows a good opportunity. He has a lot of space around him and fires a terrific shot from the edge of the box towards the middle of the goal, but the goalkeeper makes a brilliant save and stops this one!"
        },
        {
            "gameTime": "1 - 01:39",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 00:48",
            "label": "",
            "description": "Dortmund seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Dortmund will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Alberto Undiano Mallenco."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The home side were dominant and dictated the tempo of the game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "Anderlecht",
    "gameDate": "09/12/2014 - 22:45",
    "gameHomeTeam": "Dortmund",
    "gameScore": "1 - 1"
}