{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-08-29 - 21-30 Barcelona 1 - 0 Malaga/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Great display from the home side, you have to say that they were the better side today. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        },
        {
            "gameTime": "2 - 48:04",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 46:00",
            "label": "y-card",
            "description": "The referee demonstrates he won't tolerate this behaviour. Miguel Torres (Malaga) is given a yellow card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:35",
            "label": "substitution",
            "description": "Luis Enrique has decided to make a change. Jeremy Mathieu (Barcelona) replaces Thomas Vermaelen."
        },
        {
            "gameTime": "2 - 44:00",
            "label": "y-card",
            "description": "The referee has issued a yellow card to Fernando Tissone (Malaga)."
        },
        {
            "gameTime": "2 - 42:26",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Luis Suarez (Barcelona) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "2 - 41:05",
            "label": "substitution",
            "description": "The substitution is prepared. Sandro Ramirez (Barcelona) joins the action as a substitute, replacing Neymar."
        },
        {
            "gameTime": "2 - 38:42",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Neymar (Barcelona)."
        },
        {
            "gameTime": "2 - 38:26",
            "label": "",
            "description": "Idriss Carlos Kameni was forced into action to thwart Lionel Messi (Barcelona). He found himself some space after picking up a pass and unleashed a shot to the left post but couldn't beat the keeper. The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 37:03",
            "label": "",
            "description": "Neymar (Barcelona) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 34:47",
            "label": "",
            "description": "Recio (Malaga) unleashes a shot, but his effort is poor and floats well wide of the right post."
        },
        {
            "gameTime": "2 - 33:14",
            "label": "funfact",
            "description": "Shots on target – 13:1."
        },
        {
            "gameTime": "2 - 31:12",
            "label": "",
            "description": "Luis Suarez (Barcelona) makes space inside the box for a shot, but his effort goes just wide of the left post."
        },
        {
            "gameTime": "2 - 30:10",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Neymar (Barcelona) takes it short."
        },
        {
            "gameTime": "2 - 30:01",
            "label": "",
            "description": "Rafinha (Barcelona) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. The ball is out of play. A goal scoring opportunity from a corner for Barcelona."
        },
        {
            "gameTime": "2 - 27:32",
            "label": "substitution",
            "description": "Ricardo Horta goes off the pitch and Juanpi (Malaga) comes on."
        },
        {
            "gameTime": "2 - 27:26",
            "label": "soccer-ball",
            "description": "Goal! Thomas Vermaelen (Barcelona) was in the right place at the right time to pounce on the rebound inside the box and gleefully rifles the ball home. It's 1:0."
        },
        {
            "gameTime": "2 - 27:20",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends a teasing cross into the area, but Idriss Carlos Kameni intercepts the ball."
        },
        {
            "gameTime": "2 - 26:49",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 26:40",
            "label": "",
            "description": "Lionel Messi (Barcelona) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball goes out of play. Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "2 - 26:29",
            "label": "",
            "description": "Barcelona produce a short pass from the free kick."
        },
        {
            "gameTime": "2 - 26:04",
            "label": "",
            "description": "Fernando Tissone (Malaga) gives away a foul for a clumsy challenge. Referee Santiago Jaime Latre saw the whole situation. Barcelona will take a free kick near the side line."
        },
        {
            "gameTime": "2 - 25:16",
            "label": "",
            "description": "Jordi Alba (Barcelona) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "2 - 25:02",
            "label": "",
            "description": "A clumsy foul by Recio (Malaga) and Santiago Jaime Latre blows his whistle. There is a free kick near the sideline to Barcelona."
        },
        {
            "gameTime": "2 - 24:14",
            "label": "",
            "description": "The game is interrupted as Luis Suarez (Barcelona) is flagged offside."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "",
            "description": "Lionel Messi (Barcelona) blows a good opportunity. He has a lot of space around him and fires a terrific shot from the edge of the box towards the right side of the goal, but the goalkeeper makes a brilliant save and stops this one!"
        },
        {
            "gameTime": "2 - 21:33",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends a chip pass into the box, but Idriss Carlos Kameni is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 20:22",
            "label": "",
            "description": "Juan Carlos (Malaga) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 19:19",
            "label": "",
            "description": "That didn't go as planned! Lionel Messi (Barcelona) tried his luck from the edge of the box, but his effort towards the bottom right corner was too weak to get past Idriss Carlos Kameni, who easily kept it out."
        },
        {
            "gameTime": "2 - 19:07",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 18:49",
            "label": "",
            "description": "Lionel Messi (Barcelona) tries to slide the ball through to a teammate but it's well blocked by a defender. The ball is out of play. Barcelona will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 17:51",
            "label": "substitution",
            "description": "Substitution. Rafinha (Barcelona) receives a signal from the referee and is now allowed to enter the pitch as Ivan Rakitic walks off."
        },
        {
            "gameTime": "2 - 17:05",
            "label": "corner",
            "description": "Idriss Carlos Kameni leaps to intercept the corner kick from Ivan Rakitic (Barcelona)."
        },
        {
            "gameTime": "2 - 16:39",
            "label": "",
            "description": "Neymar (Barcelona) blows a clear opportunity to score a goal. He was one on one with Idriss Carlos Kameni inside the six yard box and attempted to put the ball into the left side of the target, but was denied by a great save. The referee blows his whistle, Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "2 - 15:39",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 15:10",
            "label": "",
            "description": "Lionel Messi (Barcelona) fails to find any of his teammates inside the box as his pass is blocked. Barcelona win a corner."
        },
        {
            "gameTime": "2 - 14:06",
            "label": "",
            "description": "Flag up against Luis Suarez (Barcelona). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 13:10",
            "label": "",
            "description": "Andres Iniesta (Barcelona) smashes the ball towards goal from the edge of the penalty box, but his effort flies just a few inches wide of the right post."
        },
        {
            "gameTime": "2 - 12:47",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 12:34",
            "label": "",
            "description": "Idriss Carlos Kameni hears the fans clapping his superb goalkeeping. Lionel Messi (Barcelona) shoots from the edge of the box towards the right side of the goal, but the goalkeeper makes a magnificent save. Good work from Barcelona as they win a corner."
        },
        {
            "gameTime": "2 - 09:03",
            "label": "",
            "description": "Santiago Jaime Latre blows his whistle and it's Juan Carlos (Malaga) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 08:26",
            "label": "substitution",
            "description": "Here comes a substitution. Nordin Amrabat is given a rest as he is replaced by Charles (Malaga)."
        },
        {
            "gameTime": "2 - 07:13",
            "label": "",
            "description": "Thomas Vermaelen (Barcelona) controls the ball from the corner kick and takes a shot from the edge of the box towards the bottom right corner. The goalkeeper has a clear sight of the shot and thwarts him with a comfortable save."
        },
        {
            "gameTime": "2 - 07:02",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) will take the corner."
        },
        {
            "gameTime": "2 - 06:34",
            "label": "",
            "description": "Idriss Carlos Kameni pulls off a great save to deny Lionel Messi (Barcelona), who makes himself some space inside the box and unleashes a quick low drive to the bottom left corner. Barcelona will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 05:02",
            "label": "",
            "description": "Javier Mascherano (Barcelona) gets a shot away from distance, but wasn't really set to take it and fires high and wide. The ball is off of the pitch and it's a goal kick for Malaga."
        },
        {
            "gameTime": "2 - 04:19",
            "label": "attendance",
            "description": "The attendance for today's match is 79068."
        },
        {
            "gameTime": "2 - 02:28",
            "label": "",
            "description": "Nordin Amrabat (Malaga) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We can hope that the managers will be able to motivate the players and stir them to improve their performance for after the half time break. We haven't seen really exciting football in the previous 45 minutes. The home side is dominant and dictating the tempo of the game, mainly because of their work rate and accurate passing. Pass and move. The home side have played some possession football so far, while the visitors have been patient as they wait for the right moment to hit them on the break."
        },
        {
            "gameTime": "1 - 46:14",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "corner",
            "description": "Idriss Carlos Kameni comes off his line to intercept the corner from Ivan Rakitic (Barcelona)."
        },
        {
            "gameTime": "1 - 44:48",
            "label": "funfact",
            "description": "15:2 – the corner kicks stats."
        },
        {
            "gameTime": "1 - 44:34",
            "label": "",
            "description": "Jordi Alba (Barcelona) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. The linesman points to the corner flag, Barcelona are going to take it."
        },
        {
            "gameTime": "1 - 43:29",
            "label": "",
            "description": "That was a poorly executed free kick from long distance. Lionel Messi (Barcelona) was trying to produce a cross into the penalty area, but his effort sailed off the pitch."
        },
        {
            "gameTime": "1 - 42:46",
            "label": "",
            "description": "Barcelona have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 42:38",
            "label": "y-card",
            "description": "Recio (Malaga) picks up a yellow card for an infringement."
        },
        {
            "gameTime": "1 - 41:48",
            "label": "",
            "description": "That didn't go as planned! Luis Suarez (Barcelona) tried his luck from the edge of the box, but his effort towards the middle of the goal was too weak to get past Idriss Carlos Kameni, who easily kept it out."
        },
        {
            "gameTime": "1 - 41:13",
            "label": "corner",
            "description": "The resulting corner from Ricardo Horta (Malaga) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 40:46",
            "label": "",
            "description": "Ricardo Horta (Malaga) fails to send a pass into the box as his effort is cut out. Now Malaga have a corner."
        },
        {
            "gameTime": "1 - 40:21",
            "label": "",
            "description": "Luis Suarez (Barcelona) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 38:21",
            "label": "",
            "description": "A cross from Jordi Alba (Barcelona) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 36:20",
            "label": "",
            "description": "Nordin Amrabat (Malaga) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 35:12",
            "label": "",
            "description": "This was a piece of cake for Idriss Carlos Kameni. Luis Suarez (Barcelona) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "1 - 34:03",
            "label": "",
            "description": "Sergi Roberto (Barcelona) finds the space inside the box to meet a cross, but his effort from near the penalty spot towards the right post is saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 32:53",
            "label": "",
            "description": "Andres Iniesta (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 31:43",
            "label": "",
            "description": "Neymar (Barcelona) is unlucky with a goal bound effort from the edge of the box. A fortuitous save from Idriss Carlos Kameni stops the ball from going into the middle of the goal."
        },
        {
            "gameTime": "1 - 31:02",
            "label": "",
            "description": "Raul Albentosa (Malaga) should know this behaviour is beyond the rules. He was too careless with his challenge and left Santiago Jaime Latre no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 28:50",
            "label": "",
            "description": "Lionel Messi (Barcelona) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety. Barcelona have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 28:41",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) works the corner short."
        },
        {
            "gameTime": "1 - 28:32",
            "label": "",
            "description": "The Barcelona players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition. Barcelona earn a corner."
        },
        {
            "gameTime": "1 - 27:37",
            "label": "",
            "description": "Nordin Amrabat (Malaga) brings his opponent down. Santiago Jaime Latre has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 25:02",
            "label": "",
            "description": "Javier Mascherano (Barcelona) latches on to a superb cross inside the box but only hits the crossbar with a fine header. What a chance!"
        },
        {
            "gameTime": "1 - 24:50",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 24:47",
            "label": "substitution",
            "description": "Weligton is substituted due to injury. Javier Gracia Carlos gives a chance to Raul Albentosa (Malaga)."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "injury",
            "description": "Looks like Weligton (Malaga) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 23:28",
            "label": "",
            "description": "Lionel Messi (Barcelona) sends a pass into the box, but his attempt is thwarted and cleared. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 21:57",
            "label": "",
            "description": "One of the players from Malaga times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 21:04",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 20:53",
            "label": "",
            "description": "Jordi Alba (Barcelona) wastes a good opportunity as his pass into the box is blocked by the defence. It will be a corner kick for Barcelona."
        },
        {
            "gameTime": "1 - 20:17",
            "label": "",
            "description": "Duje Cop (Malaga) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 20:13",
            "label": "",
            "description": "Nordin Amrabat (Malaga) will take the free kick."
        },
        {
            "gameTime": "1 - 19:43",
            "label": "",
            "description": "Poor challenge! Javier Mascherano (Barcelona) is penalised for tripping and Santiago Jaime Latre blows his whistle. Malaga are awarded the free kick."
        },
        {
            "gameTime": "1 - 18:41",
            "label": "",
            "description": "Juan Carlos (Malaga) was close to scoring after he unleashed a powerful shot which went a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 18:03",
            "label": "corner",
            "description": "Ricardo Horta (Malaga) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "1 - 17:44",
            "label": "",
            "description": "Recio (Malaga) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The referee points to the corner flag. It's a corner to Malaga."
        },
        {
            "gameTime": "1 - 16:48",
            "label": "",
            "description": "Javier Mascherano (Barcelona) plays a terrific long ball forward to Jordi Alba, but he can't beat his man and the move breaks down."
        },
        {
            "gameTime": "1 - 14:01",
            "label": "",
            "description": "Sergio Busquets (Barcelona) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the left post."
        },
        {
            "gameTime": "1 - 13:35",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner."
        },
        {
            "gameTime": "1 - 13:16",
            "label": "",
            "description": "Lionel Messi (Barcelona) shoots from outside the box, but his effort is blocked. Barcelona will take a corner kick."
        },
        {
            "gameTime": "1 - 11:07",
            "label": "",
            "description": "The ball is cleared after Luis Suarez (Barcelona) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 08:12",
            "label": "",
            "description": "Sergio Busquets (Barcelona) had an opportunity from long range. His low shot was directed towards the middle of the goal, but Idriss Carlos Kameni was alert and made a comfortable save."
        },
        {
            "gameTime": "1 - 06:34",
            "label": "",
            "description": "Andres Iniesta (Barcelona) threads a pass through the eye of a needle into the box for Luis Suarez, but Idriss Carlos Kameni displays great awareness to stop him."
        },
        {
            "gameTime": "1 - 03:40",
            "label": "",
            "description": "Goal disallowed! Luis Suarez (Barcelona) scores but Santiago Jaime Latre blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 03:32",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 02:59",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends the ball into the box from the side of the pitch, but his cross is blocked. Barcelona force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "",
            "description": "Duje Cop (Malaga) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Santiago Jaime Latre."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Great display from the home side, you have to say that they were the better side today. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        }
    ],
    "gameAwayTeam": "Malaga",
    "gameDate": "29/08/2015 - 21:30",
    "gameHomeTeam": "Barcelona",
    "gameScore": "1 - 0"
}