{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-04-30 - 13-30 AS Roma 1 - 3 Lazio/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:41",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "r-card",
            "description": "Antonio Rudiger (AS Roma) takes out his opponent after failing to control himself and the referee has no choice but to show him a deserved red card!"
        },
        {
            "gameTime": "2 - 47:10",
            "label": "y-card",
            "description": "Marco Parolo (Lazio) was probably a bit loose with his words to Daniele Orsato, who decides to show him a yellow."
        },
        {
            "gameTime": "2 - 46:36",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Lucas Biglia (Lazio)."
        },
        {
            "gameTime": "2 - 45:49",
            "label": "",
            "description": "Sergej Milinkovic Savic (Lazio) strikes a promising volley towards goal, but one of the defenders is quick enough to step in and make a crucial block. The linesman makes the right call and Lazio will have a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:23",
            "label": "",
            "description": "The game is interrupted. One of the players from AS Roma is cautioned for aggressive play."
        },
        {
            "gameTime": "2 - 44:04",
            "label": "",
            "description": "Francesco Totti (AS Roma) will take the free kick."
        },
        {
            "gameTime": "2 - 42:01",
            "label": "substitution",
            "description": "Balde Keita comes off the pitch to be replaced by Filip Dordevic (Lazio)."
        },
        {
            "gameTime": "2 - 41:30",
            "label": "y-card",
            "description": "Booking. Balde Keita (Lazio) receives a caution from the referee."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Senad Lulic, who plays a vital role in the build up. He squares it to Balde Keita (Lazio), who beats Wojciech Szczesny with a brilliant shot into the bottom right corner. 1:3."
        },
        {
            "gameTime": "2 - 37:51",
            "label": "corner",
            "description": "Lucas Biglia (Lazio) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 37:03",
            "label": "",
            "description": "Felipe Anderson (Lazio) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Wojciech Szczesny to get hold of the ball. Lazio have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 36:00",
            "label": "y-card",
            "description": "Wesley Hoedt (Lazio) has tested the patience of referee Daniele Orsato and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 33:45",
            "label": "",
            "description": "Lazio are ruled offside."
        },
        {
            "gameTime": "2 - 30:58",
            "label": "",
            "description": "Emerson (AS Roma) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "2 - 28:40",
            "label": "substitution",
            "description": "The manager has been forced to make a substitution and the injured Stefan de Vrij leaves the pitch to be replaced by Wesley Hoedt (Lazio)."
        },
        {
            "gameTime": "2 - 27:54",
            "label": "substitution",
            "description": "Daniele De Rossi will be replaced by Francesco Totti (AS Roma)."
        },
        {
            "gameTime": "2 - 26:30",
            "label": "corner",
            "description": "The resulting corner from Radja Nainggolan (AS Roma) is cleared by the defence."
        },
        {
            "gameTime": "2 - 26:15",
            "label": "",
            "description": "Bruno Peres (AS Roma) slaloms his way past challenges, but an opposing player does well to get the ball away. It will be a corner kick for AS Roma."
        },
        {
            "gameTime": "2 - 21:44",
            "label": "",
            "description": "Mohamed Salah (AS Roma) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 19:03",
            "label": "corner",
            "description": "The resulting corner from Lucas Biglia (Lazio) is cleared."
        },
        {
            "gameTime": "2 - 18:52",
            "label": "substitution",
            "description": "A substitution has been made. Federico Fazio goes off and Diego Perotti (AS Roma) comes on."
        },
        {
            "gameTime": "2 - 18:41",
            "label": "",
            "description": "Felipe Anderson (Lazio) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the left post. Wojciech Szczesny is alert and denies him with a nice save. The ball is out of play. A goal scoring opportunity from a corner for Lazio."
        },
        {
            "gameTime": "2 - 17:11",
            "label": "",
            "description": "Balde Keita (Lazio) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 14:38",
            "label": "",
            "description": "CHANCE! Balde Keita (Lazio) picks up a perfect pass inside the box, makes himself some space for a shot, but his effort goes just over the crossbar."
        },
        {
            "gameTime": "2 - 14:07",
            "label": "",
            "description": "Balde Keita (Lazio) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) latches on to a precise defence splitting pass and drills a nice strike from a promising distance towards the middle of the goal. Thomas Strakosha has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 09:32",
            "label": "",
            "description": "Kevin Strootman (AS Roma) receives a good pass and from just outside the box he unleashes a promising strike, but the shot is blocked by the defender."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "soccer-ball",
            "description": "Dusan Basta (Lazio) receives a precise pass just outside the box and drills a glorious strike into the bottom left corner off the post. The goalkeeper was helpless."
        },
        {
            "gameTime": "2 - 04:12",
            "label": "",
            "description": "Ambitious effort from Edin Dzeko (AS Roma). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well wide of the left post."
        },
        {
            "gameTime": "2 - 03:16",
            "label": "corner",
            "description": "Radja Nainggolan (AS Roma) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 02:25",
            "label": "",
            "description": "Thomas Strakosha was forced into action to thwart Edin Dzeko (AS Roma). He found himself some space after picking up a pass and unleashed a shot to the top right corner but couldn't beat the keeper. The referee points to the corner flag and AS Roma will take a corner."
        },
        {
            "gameTime": "2 - 00:53",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Luciano Spalletti gives a chance to Bruno Peres (AS Roma) and Stephan El Shaarawy is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "whistle",
            "description": "Daniele Orsato has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "soccer-ball",
            "description": "Daniele De Rossi (AS Roma) steps up and confidently powers his spot kick into the bottom right corner."
        },
        {
            "gameTime": "1 - 44:56",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 44:55",
            "label": "y-card",
            "description": "Lucas Biglia (Lazio) attempts to discuss the decision with Daniele Orsato, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "1 - 44:18",
            "label": "penalty",
            "description": "Wallace (Lazio) brings his opponent down with a tackle and Daniele Orsato blows his whistle for a foul. AS Roma are about to take a penalty!"
        },
        {
            "gameTime": "1 - 42:34",
            "label": "substitution",
            "description": "Jordan Lukaku is being substituted because of an injury. Simone Inzaghi sends Felipe Anderson (Lazio) on the pitch."
        },
        {
            "gameTime": "1 - 41:56",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) tries his luck with a low long range effort after receiving a precise pass, but Thomas Strakosha has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 36:02",
            "label": "corner",
            "description": "Lucas Biglia (Lazio) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 35:31",
            "label": "",
            "description": "A big opportunity is wasted by Marco Parolo (Lazio), who makes a yard for himself and produces a mid range rocket of a shot towards the bottom left corner. Unfortunately for him, Wojciech Szczesny pulls off a fantastic save to stop the effort. The ball goes out for a corner. Lazio can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 34:00",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) is unable to feed a through ball into the path of his teammates."
        },
        {
            "gameTime": "1 - 28:44",
            "label": "",
            "description": "Balde Keita (Lazio) collects a pass from the flank, looks up and fires in a goal bound shot from the edge of the box which canons off a defender to safety."
        },
        {
            "gameTime": "1 - 28:20",
            "label": "",
            "description": "The linesman signals that Sergej Milinkovic Savic (Lazio) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 27:35",
            "label": "corner",
            "description": "Thomas Strakosha leaps to collect the ball from the corner which was sent over by Radja Nainggolan (AS Roma)."
        },
        {
            "gameTime": "1 - 27:20",
            "label": "corner",
            "description": "Kevin Strootman (AS Roma) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance. The referee and one of his assistants signal for a corner kick to AS Roma."
        },
        {
            "gameTime": "1 - 27:09",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) serves up a nice cross, but the defence clears the danger. AS Roma win a corner."
        },
        {
            "gameTime": "1 - 23:10",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 18:34",
            "label": "",
            "description": "The foul by Balde Keita (Lazio) was seen by Daniele Orsato who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 17:51",
            "label": "corner",
            "description": "Lucas Biglia (Lazio) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 17:34",
            "label": "",
            "description": "Marco Parolo (Lazio) produces a ferocious strike from the edge of the box. His dangerous effort towards the bottom right corner is blocked by Wojciech Szczesny, who pulls off a superb save to keep the ball out of the net. The ball goes out of play and Lazio have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:42",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from AS Roma."
        },
        {
            "gameTime": "1 - 11:39",
            "label": "soccer-ball",
            "description": "Goal! Balde Keita (Lazio) weaves his way past opponents, and he unleashes a magnificent effort from the edge of the box into the bottom right corner. Wojciech Szczesny had no chance of reaching it. The score is 0:1."
        },
        {
            "gameTime": "1 - 10:49",
            "label": "",
            "description": "Lucas Biglia (Lazio) blows an opportunity as he sends a rebound from just outside of the box narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 08:37",
            "label": "corner",
            "description": "Radja Nainggolan (AS Roma) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 08:07",
            "label": "",
            "description": "What an amazing save by Thomas Strakosha! Mohamed Salah (AS Roma) swirls around the defenders and attempts to beat the keeper with a close range shot towards the bottom left corner, but fails. The linesman points to the corner flag, AS Roma are going to take it."
        },
        {
            "gameTime": "1 - 07:24",
            "label": "corner",
            "description": "Radja Nainggolan (AS Roma) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 07:10",
            "label": "",
            "description": "That's unlucky! Radja Nainggolan (AS Roma) beautifully controls a pass and from the edge of the box drills a shot in on goal, but it's inadvertently blocked by a defender and cleared. AS Roma force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 03:16",
            "label": "corner",
            "description": "Radja Nainggolan (AS Roma) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 03:00",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) sends a cross into the box, but the opposition's defence clears the ball to safety. AS Roma will take a corner kick."
        },
        {
            "gameTime": "1 - 02:34",
            "label": "corner",
            "description": "Radja Nainggolan (AS Roma) sends the corner into the box, but Thomas Strakosha intercepts it and averts the threat."
        },
        {
            "gameTime": "1 - 02:06",
            "label": "",
            "description": "Thomas Strakosha was forced into action to thwart Edin Dzeko (AS Roma). He found himself some space after picking up a pass and unleashed a shot towards the roof of the net but couldn't beat the keeper. The ball goes out of play. AS Roma are awarded a corner kick."
        },
        {
            "gameTime": "1 - 00:42",
            "label": "",
            "description": "Balde Keita (Lazio) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. AS Roma will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Daniele Orsato was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ciro Immobile looks sharp as he's the top goal scorer for Lazio with 20 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma have not lost for 6 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's the end of the match."
        }
    ],
    "gameAwayTeam": "Lazio",
    "gameDate": "30/04/2017 - 13:30",
    "gameHomeTeam": "AS Roma",
    "gameScore": "1 - 3"
}