{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-03-19 - 14-30 Empoli 2 - 3 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:14",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 47:16",
            "label": "",
            "description": "Massimo Maccarone (Empoli) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat. The ball goes out of play and Napoli will have a goal kick."
        },
        {
            "gameTime": "2 - 45:35",
            "label": "",
            "description": "Omar El Kaddouri (Empoli) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 43:18",
            "label": "",
            "description": "Massimo Maccarone (Empoli) misses a good chance to score. An inch perfect cross into the box finds Massimo Maccarone (Empoli) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 42:20",
            "label": "injury",
            "description": "Faouzi Ghoulam (Napoli) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 40:17",
            "label": "substitution",
            "description": "Giovanni Martusciello prepares a substitution. Daniele Croce is replaced by Federico Dimarco (Empoli)."
        },
        {
            "gameTime": "2 - 38:46",
            "label": "",
            "description": "Mame Thiam (Empoli) wasted a great chance as he climbed high to connect with a cross from the free kick inside the penalty area. He produced a header which went a whisker over the bar."
        },
        {
            "gameTime": "2 - 38:01",
            "label": "y-card",
            "description": "Raul Albiol (Napoli) is booked after bringing down an opponent. Antonio Damato had an easy decision to make."
        },
        {
            "gameTime": "2 - 37:39",
            "label": "substitution",
            "description": "Substitution. Dries Mertens makes way for Arkadiusz Milik (Napoli)."
        },
        {
            "gameTime": "2 - 36:54",
            "label": "soccer-ball",
            "description": "Massimo Maccarone (Empoli) smoothly converts the penalty with a stunning effort which ends up inside the right post."
        },
        {
            "gameTime": "2 - 36:43",
            "label": "",
            "description": "Massimo Maccarone (Empoli) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 36:05",
            "label": "penalty",
            "description": "Antonio Damato blows his whistle after Faouzi Ghoulam (Napoli) brings one of his opponents down with a strong tackle. PENALTY to Empoli! Let's see who will take responsibility."
        },
        {
            "gameTime": "2 - 34:57",
            "label": "",
            "description": "So close! Omar El Kaddouri (Empoli) delivers a cross into the box, it almost finds the head of one of his teammates, but one of the defenders is quickest to the ball and coolly deals with the threat."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "y-card",
            "description": "Elseid Hysaj (Napoli) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 32:48",
            "label": "",
            "description": "Half chance! Marek Hamsik (Napoli) plays a pass into the box, but Lukasz Skorupski reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 31:45",
            "label": "substitution",
            "description": "We are about to witness a substitution. Emanuele Giaccherini (Napoli) is replacing Lorenzo Insigne."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "y-card",
            "description": "Jose Mauri (Empoli) has tested the patience of referee Antonio Damato and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 27:51",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) is adjudged offside."
        },
        {
            "gameTime": "2 - 26:14",
            "label": "",
            "description": "Jose Callejon (Napoli) collects a pass and has an effort from distance to the top right corner, but Lukasz Skorupski answers with a superb save to deny him."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Assane Diousse leaves the pitch and Jose Mauri (Empoli) comes on."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "soccer-ball",
            "description": "Omar El Kaddouri (Empoli) finds the back of the net. He unloads a low shot from the edge of the box that goes inside the left post. A textbook free kick execution!"
        },
        {
            "gameTime": "2 - 23:59",
            "label": "",
            "description": "This will be a very dangerous free kick from just outside the box and it's a very promising distance, indeed. Let's see what Omar El Kaddouri (Empoli) will come up with."
        },
        {
            "gameTime": "2 - 23:39",
            "label": "y-card",
            "description": "Antonio Damato shows a yellow card to Jose Callejon (Napoli) for his blatant foul."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "substitution",
            "description": "The manager makes a subsitution with Massimo Maccarone (Empoli) coming on for Manuel Pucciarelli."
        },
        {
            "gameTime": "2 - 20:30",
            "label": "",
            "description": "Manuel Pucciarelli (Empoli) tries to latch onto a through ball, but it's too long."
        },
        {
            "gameTime": "2 - 19:47",
            "label": "",
            "description": "Mame Thiam (Empoli) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 18:50",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Assane Diousse (Empoli) was quite harsh and Antonio Damato didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 16:33",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to make a change. Amadou Diawara (Napoli) replaces Jorginho."
        },
        {
            "gameTime": "2 - 14:56",
            "label": "",
            "description": "Pepe Reina pulls off a great save to deny Mame Thiam (Empoli) after receiving a precise defence splitting pass. The effort is headed for the right side of the goal, but the goalkeeper dives superbly to stop it. Definitely the best save of this match so far!"
        },
        {
            "gameTime": "2 - 12:42",
            "label": "",
            "description": "Mame Thiam (Empoli) latches onto a lofted pass on the edge of the penalty box and unleashes a volley towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 12:09",
            "label": "",
            "description": "Vlad Chiriches (Napoli) commits a rough foul. Antonio Damato stops the game and makes a call. Empoli are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 08:45",
            "label": "corner",
            "description": "Dries Mertens (Napoli) sends the corner into the box, but Lukasz Skorupski intercepts it and averts the threat."
        },
        {
            "gameTime": "2 - 08:21",
            "label": "",
            "description": "Marek Hamsik (Napoli) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort. The ball is out of play. Napoli will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 07:12",
            "label": "",
            "description": "What a chance! The ball is inside the box and Jose Callejon (Napoli) takes a first time shot on goal, but his volley goes narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 06:19",
            "label": "",
            "description": "Good touch by Jose Callejon (Napoli) as he receives a great pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, the effort misses the net and flies well wide to the right."
        },
        {
            "gameTime": "2 - 05:02",
            "label": "",
            "description": "Jose Callejon (Napoli) produces a poor pass. He attempts to get the ball into the box but it's hacked away."
        },
        {
            "gameTime": "2 - 03:14",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Omar El Kaddouri (Empoli)."
        },
        {
            "gameTime": "2 - 02:39",
            "label": "",
            "description": "The ball is cleared after Manuel Pucciarelli (Empoli) attempted to dribble past an opposing player. The referee blows his whistle, Empoli are awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:07",
            "label": "",
            "description": "Manuel Pasqual (Empoli) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 47:04",
            "label": "whistle",
            "description": "Antonio Damato has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 46:37",
            "label": "",
            "description": "A lofted cross from Mame Thiam (Empoli) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The linesman signals a throw in for Empoli."
        },
        {
            "gameTime": "1 - 45:11",
            "label": "",
            "description": "Jose Callejon (Napoli) attempts to put in the resulting set piece, but he miskicks and sends the ball into the stands. A strong but inaccurate shot."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:16",
            "label": "injury",
            "description": "The game is interrupted now, Andrea Costa (Empoli) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 42:40",
            "label": "",
            "description": "Andrea Costa (Empoli) makes a bad challenge and the referee blows his whistle for a foul. Napoli win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 41:45",
            "label": "",
            "description": "Dries Mertens (Napoli) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 40:50",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 39:04",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Mame Thiam (Empoli), whose instinctive shot towards goal flashes inches wide of the left post. The ball is off of the pitch and it's a goal kick for Napoli."
        },
        {
            "gameTime": "1 - 37:43",
            "label": "soccer-ball",
            "description": "Lorenzo Insigne (Napoli) smoothly converts the penalty with a beautiful low drive into the left side of the net."
        },
        {
            "gameTime": "1 - 37:33",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 37:05",
            "label": "penalty",
            "description": "Antonio Damato interrupts the game for a tactical foul by Manuel Pasqual (Empoli). PENALTY! One of the players from Napoli is about to take a penalty kick."
        },
        {
            "gameTime": "1 - 36:10",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "1 - 33:20",
            "label": "",
            "description": "Mame Thiam (Empoli) produces a lovely chip pass into the box, but one of the opposition players cuts it out."
        },
        {
            "gameTime": "1 - 32:41",
            "label": "",
            "description": "Flag up against Assane Diousse (Empoli). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 31:43",
            "label": "y-card",
            "description": "It must be a yellow card. It is. Jorginho (Napoli) receives the caution after an awful tackle."
        },
        {
            "gameTime": "1 - 31:03",
            "label": "",
            "description": "Napoli are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 27:58",
            "label": "",
            "description": "Antonio Damato blows his whistle as Jose Callejon (Napoli) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 25:16",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "1 - 23:31",
            "label": "soccer-ball",
            "description": "Dries Mertens (Napoli) unleashes a beautiful rocket of a shot from a long range free kick. The ball goes into the top right corner and leaves the goalkeeper beaten. This takes hours and hours on the training ground. The score is 0:2."
        },
        {
            "gameTime": "1 - 22:27",
            "label": "",
            "description": "Antonio Damato blows his whistle and signals a foul after Daniele Croce (Empoli) brought his opponent down. Napoli have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 21:45",
            "label": "",
            "description": "Manuel Pucciarelli (Empoli) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 19:00",
            "label": "soccer-ball",
            "description": "Goal! Lorenzo Insigne (Napoli) fires the rebound into the bottom left corner after the ball breaks to him in the box. The score is 0:1."
        },
        {
            "gameTime": "1 - 18:55",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 17:02",
            "label": "",
            "description": "Omar El Kaddouri (Empoli) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 15:02",
            "label": "",
            "description": "Omar El Kaddouri (Empoli) sends over a free kick from long range but the defence is alert."
        },
        {
            "gameTime": "1 - 14:19",
            "label": "",
            "description": "Marek Hamsik (Napoli) latches onto a brilliant cross and fires the ball towards goal, but his shot goes high over the crossbar."
        },
        {
            "gameTime": "1 - 09:00",
            "label": "corner",
            "description": "Omar El Kaddouri (Empoli) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 08:42",
            "label": "",
            "description": "Manuel Pasqual (Empoli) sends a lofted cross into the box which is headed clear. The linesman makes the right call and Empoli will have a corner."
        },
        {
            "gameTime": "1 - 06:57",
            "label": "penalty-missed",
            "description": "Dries Mertens (Napoli) wastes a huge opportunity to score from the penalty spot. He attempts to slot low into the middle of the target, but Lukasz Skorupski pulls off a save."
        },
        {
            "gameTime": "1 - 06:47",
            "label": "",
            "description": "Dries Mertens (Napoli) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 06:00",
            "label": "y-card",
            "description": "Andrea Costa (Empoli) makes it easy for the referee to show him a yellow card."
        },
        {
            "gameTime": "1 - 05:59",
            "label": "penalty",
            "description": "Antonio Damato blows his whistle for a foul after Andrea Costa (Empoli) hacks down one of his opponents. Napoli have been awarded a penalty kick!"
        },
        {
            "gameTime": "1 - 05:30",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) serves up a nice cross, but Lukasz Skorupski punches the ball away."
        },
        {
            "gameTime": "1 - 03:30",
            "label": "",
            "description": "Mame Thiam (Empoli) is flagged for offside."
        },
        {
            "gameTime": "1 - 02:25",
            "label": "",
            "description": "Manuel Pasqual (Empoli) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 00:26",
            "label": "",
            "description": "Mame Thiam (Empoli) fouls an opponent. At least that's what referee Antonio Damato signals."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Empoli will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Antonio Damato."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli have gone 6 consecutive matches without a draw."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dries Mertens is the biggest threat to an opponent! He has already scored 19 goals and is top scorer in this Napoli team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "15:43 The goals scored and conceded record for Empoli in the league so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "19/03/2017 - 14:30",
    "gameHomeTeam": "Empoli",
    "gameScore": "2 - 3"
}