{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-16 - 21-45 Chelsea 4 - 0 Maccabi Tel Aviv/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Chelsea were better today and displayed masterful control and movement. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        },
        {
            "gameTime": "2 - 46:57",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 46:23",
            "label": "",
            "description": "The ball is cleared after Bertrand Traore (Chelsea) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 45:29",
            "label": "",
            "description": "Gary Cahill (Chelsea) sends a long ball in, but Predrag Rajkovic comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:42",
            "label": "corner",
            "description": "Nikola Mitrovic (Maccabi Tel Aviv) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 43:28",
            "label": "",
            "description": "Dor Peretz (Maccabi Tel Aviv) passes the ball into the box but an opposing player clears. The ball goes out of play. Maccabi Tel Aviv are awarded a corner kick."
        },
        {
            "gameTime": "2 - 42:37",
            "label": "",
            "description": "CHANCE! Nosa Igiebor (Maccabi Tel Aviv) picks up a pass inside the box and has a sight of goal, but he blazes his shot well over the top. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "2 - 41:46",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) fouls an opponent. At least that's what referee Felix Zwayer signals. Maccabi Tel Aviv are awarded the free kick."
        },
        {
            "gameTime": "2 - 39:53",
            "label": "",
            "description": "Dejan Radonjic (Maccabi Tel Aviv) is caught offside!"
        },
        {
            "gameTime": "2 - 38:27",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Bertrand Traore (Chelsea), whose instinctive shot towards goal flashes inches wide of the left post. The ball is off of the pitch and it's a goal kick for Maccabi Tel Aviv."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "",
            "description": "The Chelsea players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball."
        },
        {
            "gameTime": "2 - 36:05",
            "label": "funfact",
            "description": "Total attempts – 16:7."
        },
        {
            "gameTime": "2 - 35:01",
            "label": "",
            "description": "Bertrand Traore (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away. It's a throw in for Maccabi Tel Aviv."
        },
        {
            "gameTime": "2 - 32:58",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Cesc Fabregas (Chelsea) and he fired home from close range. The score is 4:0."
        },
        {
            "gameTime": "2 - 32:30",
            "label": "",
            "description": "Predrag Rajkovic pulls off a great save to deny Loic Remy (Chelsea) after receiving a precise defence splitting pass. The effort is headed for the left side of the goal, but the goalkeeper dives superbly to stop it. Definitely the best save of this match so far!"
        },
        {
            "gameTime": "2 - 32:12",
            "label": "",
            "description": "Nikola Mitrovic (Maccabi Tel Aviv) attempts to find one of his teammates with a free kick, but the defence is well positioned and clears the ball away from danger."
        },
        {
            "gameTime": "2 - 32:04",
            "label": "",
            "description": "Gary Cahill (Chelsea) was trying to get to the ball but clattered into the legs of the opponent as well. Felix Zwayer blows his whistle for an infringement. Free kick. Maccabi Tel Aviv will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 31:17",
            "label": "substitution",
            "description": "The substitution has been made. Bertrand Traore (Chelsea) has replaced Ruben Loftus Cheek."
        },
        {
            "gameTime": "2 - 30:02",
            "label": "",
            "description": "Predrag Rajkovic (Maccabi Tel Aviv) produces a ferocious strike from the edge of the box. His dangerous effort towards the middle of the goal is blocked by Asmir Begovic, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "2 - 28:42",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) picks up the rebound just a few yards out of the box. He attempts to beat the goalkeeper with a fine shot, but the goalkeeper is on hand to deny him."
        },
        {
            "gameTime": "2 - 28:23",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 27:52",
            "label": "",
            "description": "Eitan Tibi (Maccabi Tel Aviv) brings an opponent down and Felix Zwayer interrupts the game. Chelsea are awarded a free kick."
        },
        {
            "gameTime": "2 - 27:40",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Cesc Fabregas (Chelsea)."
        },
        {
            "gameTime": "2 - 27:28",
            "label": "",
            "description": "Eden Hazard (Chelsea) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders. The ball is out of play. Chelsea will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 27:16",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 26:25",
            "label": "",
            "description": "Chelsea are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 25:49",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Yuval Spungin departs the field of play to be replaced by Dor Peretz (Maccabi Tel Aviv)."
        },
        {
            "gameTime": "2 - 25:10",
            "label": "",
            "description": "Ramires (Chelsea) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box well wide of the left post."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "",
            "description": "A pass into the penalty area from Diego Costa (Chelsea) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 23:46",
            "label": "",
            "description": "Diego Costa (Chelsea) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 21:22",
            "label": "",
            "description": "Gary Cahill (Chelsea) brings his opponent down. Felix Zwayer has a clear sight of it and blows his whistle for a foul. That's a free kick to Maccabi Tel Aviv."
        },
        {
            "gameTime": "2 - 19:32",
            "label": "substitution",
            "description": "Here's the change. Oscar leaves the pitch and Ramires (Chelsea) comes on as a substitute."
        },
        {
            "gameTime": "2 - 18:57",
            "label": "substitution",
            "description": "Slavisa Jokanovic has decided to make a change. Dejan Radonjic (Maccabi Tel Aviv) replaces Avi Rikan."
        },
        {
            "gameTime": "2 - 18:50",
            "label": "substitution",
            "description": "The substitution is prepared. Dor Micha (Maccabi Tel Aviv) joins the action as a substitute, replacing ."
        },
        {
            "gameTime": "2 - 17:36",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) unleashes a shot from 23 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 15:56",
            "label": "",
            "description": "Loic Remy (Chelsea) is flagged for offside."
        },
        {
            "gameTime": "2 - 15:14",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from the edge of the box by Cesc Fabregas (Chelsea) as his effort only hit the wall."
        },
        {
            "gameTime": "2 - 14:52",
            "label": "",
            "description": "Gal Alberman (Maccabi Tel Aviv) tackles a bit over zealously and Felix Zwayer blows for a foul. Chelsea have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 14:22",
            "label": "",
            "description": "Diego Costa (Chelsea) is unable to control an accurate defence splitting pass properly and one of the defending players reacts well to rob him of the ball."
        },
        {
            "gameTime": "2 - 13:00",
            "label": "soccer-ball",
            "description": "Cesc Fabregas sends an inch perfect lofted cross into the box. Diego Costa (Chelsea) latches on to it and finishes with a quick shot which hits the inside of the right post and bounces in off it. The goalkeeper had no chance. The score changes to 3:0."
        },
        {
            "gameTime": "2 - 12:22",
            "label": "",
            "description": "Nikola Mitrovic (Maccabi Tel Aviv) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "",
            "description": "Avi Rikan (Maccabi Tel Aviv) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 10:48",
            "label": "corner",
            "description": "Avi Rikan (Maccabi Tel Aviv) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 10:34",
            "label": "",
            "description": "Avi Rikan (Maccabi Tel Aviv) strikes a powerful volley towards goal, but one of the defenders blocks his attempt. The ball is out of play. A goal scoring opportunity from a corner for Maccabi Tel Aviv."
        },
        {
            "gameTime": "2 - 08:25",
            "label": "",
            "description": "Oscar (Chelsea) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "2 - 08:02",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) takes a short free kick."
        },
        {
            "gameTime": "2 - 07:47",
            "label": "",
            "description": "Tal Ben Haim (Maccabi Tel Aviv) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul. Chelsea have a free kick."
        },
        {
            "gameTime": "2 - 07:36",
            "label": "funfact",
            "description": "Corner kicks – 8:2."
        },
        {
            "gameTime": "2 - 06:14",
            "label": "",
            "description": "Chelsea keep the ball and are displaying some tiki taka style passing at the moment."
        },
        {
            "gameTime": "2 - 04:19",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) is unable to feed an accurate cross into the box. The referee and the linesman both signal a throw in for Maccabi Tel Aviv."
        },
        {
            "gameTime": "2 - 03:44",
            "label": "",
            "description": "Oscar (Chelsea) and Ruben Loftus Cheek attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 01:39",
            "label": "",
            "description": "Felix Zwayer blows his whistle and it's Kurt Zouma (Chelsea) who is penalised for an offensive foul. Good decision by the referee. Maccabi Tel Aviv are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 01:08",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 00:59",
            "label": "",
            "description": "Diego Costa (Chelsea) races towards goal but the defender gets back well to make a challenge. Chelsea force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 00:09",
            "label": "",
            "description": "Nikola Mitrovic (Maccabi Tel Aviv) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 49:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. It was a fairly one sided opening 45 minutes, with Chelsea much the better side better so far. The home team is playing possession football and the away team is basing its game on a well organized defence."
        },
        {
            "gameTime": "1 - 49:02",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 49:00",
            "label": "soccer-ball",
            "description": "Goal! Oscar (Chelsea) slams home the penalty with a precise low shot into the bottom left corner."
        },
        {
            "gameTime": "1 - 47:29",
            "label": "",
            "description": "Oscar (Chelsea) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 47:00",
            "label": "y-card",
            "description": "Felix Zwayer shows a yellow card to Tal Ben Haim (Maccabi Tel Aviv) for a tough tackle."
        },
        {
            "gameTime": "1 - 46:53",
            "label": "penalty",
            "description": "Felix Zwayer blows his whistle and signals a foul after Tal Ben Haim (Maccabi Tel Aviv) brought his opponent down. A penalty is awarded to Chelsea!"
        },
        {
            "gameTime": "1 - 46:13",
            "label": "",
            "description": "A spell of possession for Chelsea in an attempt to control the game."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) looks to break free, but an opposing player clears the ball away. The ball is out of play. Chelsea will have a throw in."
        },
        {
            "gameTime": "1 - 43:27",
            "label": "",
            "description": "Felix Zwayer blows his whistle as Loic Remy (Chelsea) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 43:09",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 42:52",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Chelsea get a corner."
        },
        {
            "gameTime": "1 - 41:53",
            "label": "",
            "description": "Avi Rikan (Maccabi Tel Aviv) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 41:12",
            "label": "",
            "description": "Diego Costa (Chelsea) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 39:16",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) collects a pass and strikes from about 25 metres out. It's a poor attempt which flies well over the bar."
        },
        {
            "gameTime": "1 - 38:04",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) races towards goal but the defender gets back well to make a challenge. The ball is behind the touchline and Maccabi Tel Aviv will take a throw in."
        },
        {
            "gameTime": "1 - 37:22",
            "label": "",
            "description": "Oscar (Chelsea) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 37:05",
            "label": "",
            "description": "Gary Cahill (Chelsea) volleys the ball towards goal from the edge of the penalty box, but one of the defenders blocks his shot."
        },
        {
            "gameTime": "1 - 36:55",
            "label": "corner",
            "description": "Oscar (Chelsea) works the corner short."
        },
        {
            "gameTime": "1 - 36:43",
            "label": "",
            "description": "Diego Costa (Chelsea) races towards goal but the defender gets back well to make a challenge. Now Chelsea have a corner."
        },
        {
            "gameTime": "1 - 36:23",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) sprays a pass out to Nosa Igiebor, but he can't beat his man inside the box."
        },
        {
            "gameTime": "1 - 35:30",
            "label": "corner",
            "description": "The corner from Cesc Fabregas (Chelsea) is intercepted by Predrag Rajkovic."
        },
        {
            "gameTime": "1 - 35:19",
            "label": "",
            "description": "Eden Hazard (Chelsea) looks to break free, but an opposing player clears the ball away. The linesman points to the corner flag, Chelsea are going to take it."
        },
        {
            "gameTime": "1 - 34:55",
            "label": "corner",
            "description": "Oscar (Chelsea) takes a short corner kick."
        },
        {
            "gameTime": "1 - 34:33",
            "label": "",
            "description": "Loic Remy (Chelsea) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger. Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 32:44",
            "label": "y-card",
            "description": "Felix Zwayer shows the yellow card to Nosa Igiebor (Maccabi Tel Aviv) for a heavy challenge."
        },
        {
            "gameTime": "1 - 32:04",
            "label": "",
            "description": "Eden Hazard (Chelsea) sends over a cross, but he can't find any teammate inside the box. Poor delivery. The ball goes out of play and Maccabi Tel Aviv will have a goal kick."
        },
        {
            "gameTime": "1 - 31:52",
            "label": "corner",
            "description": "Oscar (Chelsea) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 31:43",
            "label": "",
            "description": "Eden Hazard (Chelsea) looks to break free, but an opposing player clears the ball away. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 30:51",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) shows good awareness deep inside the box as he latches on to a cross from the resulting free kick. He jumps high but his towering header lacks accuracy and flies well over the crossbar. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 30:19",
            "label": "",
            "description": "Nikola Mitrovic (Maccabi Tel Aviv) takes a direct free kick."
        },
        {
            "gameTime": "1 - 29:46",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) gives away a foul for a fierce tackle on an opponent. It's a free kick to Maccabi Tel Aviv, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 29:23",
            "label": "",
            "description": "The ball is cleared after Avi Rikan (Maccabi Tel Aviv) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 28:48",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Loic Remy (Chelsea)."
        },
        {
            "gameTime": "1 - 27:48",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) sends in a lofted cross from a mid range free kick. His effort, however, goes out of play. The ball goes out of play and Maccabi Tel Aviv will have a goal kick."
        },
        {
            "gameTime": "1 - 27:32",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Gal Alberman (Maccabi Tel Aviv). Felix Zwayer saw the sliding tackle and blows for a foul. Chelsea win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 26:53",
            "label": "",
            "description": "Diego Costa (Chelsea) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 25:58",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) received a clever through ball which could have put him in a promising position, but the defence was alert to the danger."
        },
        {
            "gameTime": "1 - 24:24",
            "label": "",
            "description": "Gary Cahill (Chelsea) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar. The ball is off of the pitch and it's a goal kick for Maccabi Tel Aviv."
        },
        {
            "gameTime": "1 - 24:13",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 23:56",
            "label": "",
            "description": "Diego Costa (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away. Chelsea have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 23:26",
            "label": "",
            "description": "Flag up against Eran Zahavi (Maccabi Tel Aviv). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 22:47",
            "label": "substitution",
            "description": "Problems for Jose Mourinho as Willian is not able to play anymore. His injury is too serious and Diego Costa (Chelsea) replaces him."
        },
        {
            "gameTime": "1 - 22:21",
            "label": "",
            "description": "Avi Rikan (Maccabi Tel Aviv) is adjudged offside."
        },
        {
            "gameTime": "1 - 21:33",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 20:24",
            "label": "",
            "description": "Willian (Chelsea) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 20:10",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) is penalised for holding. Felix Zwayer signals a set piece."
        },
        {
            "gameTime": "1 - 19:32",
            "label": "",
            "description": "The Chelsea players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 18:22",
            "label": "injury",
            "description": "Willian (Chelsea) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 17:57",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) creates a yard of space for himself and tries an effort from distance, but it's blocked."
        },
        {
            "gameTime": "1 - 16:33",
            "label": "",
            "description": "Eden Hazard (Chelsea) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 15:00",
            "label": "soccer-ball",
            "description": "Willian (Chelsea) sends the ball into the net from a long distance direct free kick. It goes exactly inside the right post. Sensational free kick."
        },
        {
            "gameTime": "1 - 14:30",
            "label": "",
            "description": "Felix Zwayer blows the whistle, Yuval Spungin (Maccabi Tel Aviv) is penalised for a foul. Chelsea win a free kick."
        },
        {
            "gameTime": "1 - 13:56",
            "label": "",
            "description": "Eden Hazard (Chelsea) sends a pass into the penalty area, but the opponent manages to cut it out."
        },
        {
            "gameTime": "1 - 13:01",
            "label": "",
            "description": "Willian (Chelsea) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "1 - 12:04",
            "label": "",
            "description": "Willian (Chelsea) sends a teasing cross into the area, but Predrag Rajkovic intercepts the ball."
        },
        {
            "gameTime": "1 - 11:01",
            "label": "",
            "description": "Oscar (Chelsea) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort."
        },
        {
            "gameTime": "1 - 10:11",
            "label": "",
            "description": "Tal Ben Haim (Maccabi Tel Aviv) commits a foul after making a slide tackle on his opponent. Chelsea win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 09:28",
            "label": "",
            "description": "Willian (Chelsea) commits a foul after unfairly battling his opponent for the ball. It's a free kick to Maccabi Tel Aviv in a dangerous position."
        },
        {
            "gameTime": "1 - 08:23",
            "label": "",
            "description": "Chelsea are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "y-card",
            "description": "Tal Ben Haim (Maccabi Tel Aviv) is punished with a yellow card for violating the rules."
        },
        {
            "gameTime": "1 - 06:51",
            "label": "",
            "description": "Willian (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 05:21",
            "label": "penalty-missed",
            "description": "Eden Hazard (Chelsea) doesn't keep his cool and fails to convert the penalty. He skies the ball way over the bar and into the stands."
        },
        {
            "gameTime": "1 - 05:09",
            "label": "",
            "description": "Eden Hazard (Chelsea) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 04:46",
            "label": "y-card",
            "description": "Caution goes to Predrag Rajkovic (Maccabi Tel Aviv)."
        },
        {
            "gameTime": "1 - 04:28",
            "label": "penalty",
            "description": "Predrag Rajkovic (Maccabi Tel Aviv) trips an opposition player and Felix Zwayer signals a foul. Chelsea are given a huge opportunity to score it's a penalty kick!"
        },
        {
            "gameTime": "1 - 03:35",
            "label": "",
            "description": "manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 02:44",
            "label": "",
            "description": "Loic Remy (Chelsea) is penalised for a foul. Felix Zwayer had a clear view and blows his whistle. Maccabi Tel Aviv will take a free kick."
        },
        {
            "gameTime": "1 - 01:00",
            "label": "y-card",
            "description": "The foul by Ruben Loftus Cheek (Chelsea) is worthy of a card and a yellow is duly shown by Felix Zwayer."
        },
        {
            "gameTime": "1 - 00:15",
            "label": "",
            "description": "Oscar (Chelsea) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Chelsea will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Felix Zwayer."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Chelsea were better today and displayed masterful control and movement. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        }
    ],
    "gameAwayTeam": "Maccabi Tel Aviv",
    "gameDate": "16/09/2015 - 21:45",
    "gameHomeTeam": "Chelsea",
    "gameScore": "4 - 0"
}