{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-08-27 - 21-15 Real Madrid 2 - 1 Celta Vigo/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. The home side were better today. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        },
        {
            "gameTime": "2 - 47:57",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:13",
            "label": "",
            "description": "Sergio Alvarez pulls off a great save to deny James Rodriguez (Real Madrid), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "2 - 45:38",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 45:10",
            "label": "",
            "description": "Lucas (Real Madrid) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender. Now Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:15",
            "label": "",
            "description": "James Rodriguez (Real Madrid) is penalised for a foul. Ricardo de Burgos Bengoetxea had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 43:05",
            "label": "corner",
            "description": "Iago Aspas (Celta Vigo) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 40:56",
            "label": "",
            "description": "The foul by Pablo Pedro Hernandez (Celta Vigo) was seen by Ricardo de Burgos Bengoetxea who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 39:51",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Nemanja Radoja departs the field of play to be replaced by Pione Sisto (Celta Vigo)."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "",
            "description": "Pablo Pedro Hernandez (Celta Vigo) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "2 - 38:29",
            "label": "corner",
            "description": "The referee points to the corner flag and Celta Vigo will take a corner."
        },
        {
            "gameTime": "2 - 38:19",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Hugo Mallo (Celta Vigo)."
        },
        {
            "gameTime": "2 - 37:42",
            "label": "attendance",
            "description": "The attendance is 65684."
        },
        {
            "gameTime": "2 - 35:58",
            "label": "soccer-ball",
            "description": "Goal! Toni Kroos (Real Madrid) volleys the ball from the edge of the box and it goes in off the bottom of the right post. Lucas provided the assist. 2:1."
        },
        {
            "gameTime": "2 - 34:36",
            "label": "",
            "description": "Gareth Bale (Real Madrid) attempts to convert a lofted cross as he jumps high and heads the ball to the middle of the goal. Sergio Alvarez shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net."
        },
        {
            "gameTime": "2 - 34:11",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 34:02",
            "label": "",
            "description": "Gareth Bale (Real Madrid) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Good work from Real Madrid as they win a corner."
        },
        {
            "gameTime": "2 - 32:57",
            "label": "",
            "description": "James Rodriguez (Real Madrid) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 31:53",
            "label": "substitution",
            "description": "Substitution. Alvaro Morata walks off the pitch and Mariano Diaz (Real Madrid) comes on as a substitute."
        },
        {
            "gameTime": "2 - 31:35",
            "label": "substitution",
            "description": "Eduardo Berizzo has decided to substitute Daniel Wass and he is replaced by Pape Cheikh (Celta Vigo)."
        },
        {
            "gameTime": "2 - 29:11",
            "label": "",
            "description": "Lucas (Real Madrid) swings a cross into the box, but it's far too close to Sergio Alvarez, who smothers the ball."
        },
        {
            "gameTime": "2 - 27:51",
            "label": "substitution",
            "description": "Iago Aspas (Celta Vigo) joins the action as a substitute, replacing John Guidetti."
        },
        {
            "gameTime": "2 - 26:13",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Toni Kroos (Real Madrid). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 25:47",
            "label": "",
            "description": "James Rodriguez (Real Madrid) races towards goal but the defender gets back well to make a challenge. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 24:11",
            "label": "",
            "description": "Gareth Bale (Real Madrid) attempts to find Alvaro Morata, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "2 - 23:42",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to introduce fresh legs, with James Rodriguez (Real Madrid) replacing Luka Modric."
        },
        {
            "gameTime": "2 - 21:37",
            "label": "soccer-ball",
            "description": "Brilliant finish! Fabian Orellana (Celta Vigo) perfectly collected a pass on the edge of the penalty area from John Guidetti, then produced a nice strike into the left side of the goal. The score is 1:1."
        },
        {
            "gameTime": "2 - 20:40",
            "label": "",
            "description": "Gareth Bale (Real Madrid) climbs high to connect with a cross near the penalty spot but plants a header well wide of the left post."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "substitution",
            "description": "It will be a substitution. Lucas (Real Madrid) is ready to enter the pitch as Marco Asensio walks off."
        },
        {
            "gameTime": "2 - 19:24",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Real Madrid was in an offside position."
        },
        {
            "gameTime": "2 - 18:41",
            "label": "",
            "description": "Post! Alvaro Morata (Real Madrid) latches on to a sweet pass inside the box and unleashes a shot which only hits the right post. What an unlucky moment for him."
        },
        {
            "gameTime": "2 - 17:46",
            "label": "",
            "description": "Casemiro (Real Madrid) unleashes a shot, but his effort is poor and floats well wide of the right post."
        },
        {
            "gameTime": "2 - 14:42",
            "label": "soccer-ball",
            "description": "Goal! Alvaro Morata (Real Madrid) was in the right place at the right time to pounce on the rebound inside the box and gleefully rifles the ball home. It's 1:0."
        },
        {
            "gameTime": "2 - 14:40",
            "label": "",
            "description": "Marco Asensio (Real Madrid) latches on to a precise pass and finds himself one on one with the keeper, but his effort is straight at Sergio Alvarez, who is alert and makes an easy save to deny him."
        },
        {
            "gameTime": "2 - 13:00",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "2 - 10:51",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 10:31",
            "label": "",
            "description": "Gareth Bale (Real Madrid) stands over the free kick and opts to take it himself, sending it towards the top right corner only for Sergio Alvarez to dive and make a save. The referee blows his whistle, Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 09:27",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Jonny (Celta Vigo) was quite harsh and Ricardo de Burgos Bengoetxea didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 08:35",
            "label": "",
            "description": "One of the players from Celta Vigo times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 06:56",
            "label": "",
            "description": "Gareth Bale (Real Madrid) unleashed a poor free kick shot from far out. He intended to threaten the goalkeeper, but instead sent the ball high over the bar."
        },
        {
            "gameTime": "2 - 06:15",
            "label": "y-card",
            "description": "Ricardo de Burgos Bengoetxea shows a yellow card to Hugo Mallo (Celta Vigo), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 05:12",
            "label": "",
            "description": "Marco Asensio (Real Madrid) shoots from the edge of the penalty area. The ball travels low towards the middle of the target, but Sergio Alvarez easily deals with the threat."
        },
        {
            "gameTime": "2 - 04:38",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "2 - 04:09",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 03:44",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 03:21",
            "label": "",
            "description": "Gareth Bale (Real Madrid) looks to break free, but an opposing player clears the ball away. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "2 - 02:56",
            "label": "",
            "description": "Fabian Orellana (Celta Vigo) sends a pass into the penalty area, but the opponent manages to cut it out."
        },
        {
            "gameTime": "2 - 02:15",
            "label": "",
            "description": "Jonny (Celta Vigo) has an effort from the edge of the area, but he skies the ball over the top."
        },
        {
            "gameTime": "2 - 01:40",
            "label": "",
            "description": "The ball is cleared after Daniel Wass (Celta Vigo) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 01:11",
            "label": "",
            "description": "A pass by John Guidetti (Celta Vigo) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Ricardo de Burgos Bengoetxea starts the second half."
        },
        {
            "gameTime": "1 - 46:15",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. The hosts dominated much of the first period. The home team are playing possession football, while the away team look to find a weakness in the opposition's defence mainly with their rapid counter attacks."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:19",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "1 - 43:02",
            "label": "",
            "description": "Nemanja Radoja (Celta Vigo) collects a rebound a long way out and doesn't hesitate to release a goal bound hammer of a shot. His attempt is precise and low towards the middle of the target. It would have ended in the back of the net if it wasn't for Francisco Casilla and his nice save."
        },
        {
            "gameTime": "1 - 42:18",
            "label": "",
            "description": "Fabian Orellana (Celta Vigo) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 41:44",
            "label": "",
            "description": "Ricardo de Burgos Bengoetxea blows his whistle after Casemiro (Real Madrid) kicks an opponent's legs instead of the ball. Free kick. Celta Vigo will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 39:31",
            "label": "",
            "description": "Gareth Bale (Real Madrid) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the right post is, however, superbly saved by Sergio Alvarez!"
        },
        {
            "gameTime": "1 - 37:56",
            "label": "",
            "description": "Fabian Orellana (Celta Vigo) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "",
            "description": "Real Madrid seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 32:48",
            "label": "",
            "description": "Gareth Bale (Real Madrid) connects with the corner kick around the penalty spot, but steers his header just wide of the left post."
        },
        {
            "gameTime": "1 - 31:35",
            "label": "corner",
            "description": "There's an opportunity for Toni Kroos (Real Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 31:16",
            "label": "",
            "description": "Luka Modric (Real Madrid) receives a low pass just outside the box and unleashes a fine strike towards the left post. Sergio Alvarez pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "",
            "description": "Marco Asensio (Real Madrid) tries to find Gareth Bale, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 28:15",
            "label": "",
            "description": "Luka Modric (Real Madrid) tries his luck with a shot from the edge of the box, but the ball crashes against the crossbar! It would have been a superb goal."
        },
        {
            "gameTime": "1 - 25:54",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) commits a foul and Ricardo de Burgos Bengoetxea immediately signals a free kick."
        },
        {
            "gameTime": "1 - 23:12",
            "label": "",
            "description": "Theo Bongonda (Celta Vigo) has a great chance to score, but he blasts the ball well wide of the left post."
        },
        {
            "gameTime": "1 - 22:15",
            "label": "",
            "description": "A pass from Theo Bongonda (Celta Vigo) is intercepted by Francisco Casilla and the move breaks down."
        },
        {
            "gameTime": "1 - 20:45",
            "label": "",
            "description": "Daniel Wass (Celta Vigo) was in a good shooting position just outside the box and unleashed a first time shot towards the middle of the target, but the goalkeeper made a decent save to thwart his effort."
        },
        {
            "gameTime": "1 - 19:26",
            "label": "",
            "description": "Daniel Wass (Celta Vigo) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 16:35",
            "label": "",
            "description": "Great teamplay by Real Madrid as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 14:07",
            "label": "",
            "description": "Luka Modric (Real Madrid) is unlucky with a goal bound effort from the edge of the box. A fortuitous save from Sergio Alvarez stops the ball from going into the middle of the goal."
        },
        {
            "gameTime": "1 - 12:58",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the left post."
        },
        {
            "gameTime": "1 - 10:41",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 08:19",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 06:04",
            "label": "",
            "description": "Luka Modric (Real Madrid) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 05:22",
            "label": "",
            "description": "Celta Vigo are ruled offside."
        },
        {
            "gameTime": "1 - 02:35",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 01:42",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Real Madrid was in an offside position."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Celta Vigo will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ricardo de Burgos Bengoetxea got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last game that Celta Vigo played was against Alaves and it ended 1:3."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have seen many goals in the previous 5 matches between these two teams, with an average of 5.0 goals per game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Cristiano Ronaldo have rippled the net 10x and is the top scorer for Real Madrid this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. The home side were better today. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        }
    ],
    "gameAwayTeam": "Celta Vigo",
    "gameDate": "27/08/2016 - 21:15",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "2 - 1"
}