{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2014-2015/2015-05-09 - 16-30 Dortmund 2 - 0 Hertha Berlin/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. The superiority of the home team was evident on the pitch today. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "Excellent touch by Erik Durm (Dortmund)! He latches on to a precise pass on the edge of the box but miskicks and the ball goes well wide of the right post. Poor effort."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:35",
            "label": "",
            "description": "Kevin Kampl (Dortmund) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 43:47",
            "label": "",
            "description": "The linesman signals that Valentin Stocker (Hertha Berlin) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 42:08",
            "label": "",
            "description": "A pass from Ciro Immobile (Dortmund) is intercepted by Thomas Kraft and the move breaks down."
        },
        {
            "gameTime": "2 - 40:11",
            "label": "corner",
            "description": "The resulting corner from Marvin Plattenhardt (Hertha Berlin) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "",
            "description": "Hertha Berlin are enjoying possession, but one of the opposition players steps in to end the sequence. The linesman points to the corner flag, Hertha Berlin are going to take it."
        },
        {
            "gameTime": "2 - 39:29",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) swings the ball into the box from the corner kick but it's a bit too strong and it goes out of play."
        },
        {
            "gameTime": "2 - 38:55",
            "label": "substitution",
            "description": "Pal Dardai has decided to substitute Genki Haraguchi and he is replaced by Ronny (Hertha Berlin)."
        },
        {
            "gameTime": "2 - 38:55",
            "label": "substitution",
            "description": "Substitution. Sven Bender (Dortmund) on for Shinji Kagawa."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "",
            "description": "Kevin Kampl (Dortmund) fails to send a pass into the box as his effort is cut out. It will be a corner kick for Dortmund."
        },
        {
            "gameTime": "2 - 38:01",
            "label": "",
            "description": "Peter Pekarik (Hertha Berlin) swings a cross into the box, but it's far too close to Mitchell Langerak, who smothers the ball."
        },
        {
            "gameTime": "2 - 37:24",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Thomas Kraft is alert and denies him."
        },
        {
            "gameTime": "2 - 36:14",
            "label": "",
            "description": "CHANCE! Peter Pekarik (Hertha Berlin) picks up a pass inside the box and has a sight of goal, but he sends his shot well wide of the left post."
        },
        {
            "gameTime": "2 - 35:34",
            "label": "",
            "description": "The game is pretty dull as Dortmund are just passing the ball from player to player. Nothing lasts forever, though, and they finally make a mistake, allowing the opposition to pick up the ball."
        },
        {
            "gameTime": "2 - 34:04",
            "label": "",
            "description": "Johnny Heitinga (Hertha Berlin) robs an opponent of the ball and explodes in anger when Tobias Stieler blows for a foul."
        },
        {
            "gameTime": "2 - 33:20",
            "label": "funfact",
            "description": "Total attempts – 15:2."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "",
            "description": "Sandro Wagner (Hertha Berlin) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "2 - 32:35",
            "label": "",
            "description": "Peter Pekarik (Hertha Berlin) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 32:04",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) is penalised for a foul. Tobias Stieler had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 30:54",
            "label": "y-card",
            "description": "The foul by Fabian Lustenberger (Hertha Berlin) is worthy of a card and a yellow is duly shown by Tobias Stieler."
        },
        {
            "gameTime": "2 - 29:04",
            "label": "corner",
            "description": "Marvin Plattenhardt (Hertha Berlin) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 28:43",
            "label": "",
            "description": "Genki Haraguchi (Hertha Berlin) has a shot blocked from inside the box. The ball goes out of play. Hertha Berlin are awarded a corner kick."
        },
        {
            "gameTime": "2 - 28:08",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Marvin Plattenhardt (Hertha Berlin). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "",
            "description": "A cross from Peter Pekarik (Hertha Berlin) fails to reach the box as the defence clears the ball away to safety. The referee points to the corner flag and Hertha Berlin will take a corner."
        },
        {
            "gameTime": "2 - 27:33",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "2 - 26:16",
            "label": "substitution",
            "description": "It's time for a substitution. Lukasz Piszczek (Dortmund) comes on in place of Marcel Schmelzer."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 24:39",
            "label": "",
            "description": "Erik Durm (Dortmund) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 23:40",
            "label": "injury",
            "description": "Looks like Erik Durm (Dortmund) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 23:14",
            "label": "",
            "description": "The linesman raises his flag for offside before Valentin Stocker (Hertha Berlin) heads on."
        },
        {
            "gameTime": "2 - 21:53",
            "label": "",
            "description": "A pass from Erik Durm (Dortmund) is intercepted by Thomas Kraft and the move breaks down."
        },
        {
            "gameTime": "2 - 21:08",
            "label": "substitution",
            "description": "Jurgen Klopp prepares a substitution. Pierre Emerick Aubameyang is replaced by Ciro Immobile (Dortmund)."
        },
        {
            "gameTime": "2 - 19:34",
            "label": "",
            "description": "Valentin Stocker (Hertha Berlin) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 18:14",
            "label": "",
            "description": "A lofted cross from Peter Pekarik (Hertha Berlin) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 17:49",
            "label": "",
            "description": "Tobias Stieler blows the whistle, Pierre Emerick Aubameyang (Dortmund) is penalised for a foul."
        },
        {
            "gameTime": "2 - 16:19",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) tries his luck from long range, but it doesn't give the goalkeeper anything to worry about as it goes high over the bar."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "",
            "description": "The Hertha Berlin players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 12:45",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Henrikh Mkhitaryan (Dortmund)."
        },
        {
            "gameTime": "2 - 12:31",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) wastes a good opportunity as his pass into the box is blocked by the defence. Now Dortmund have a corner."
        },
        {
            "gameTime": "2 - 12:07",
            "label": "",
            "description": "Peter Pekarik (Hertha Berlin) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 09:49",
            "label": "substitution",
            "description": "Pal Dardai is forced to make a change. John Brooks is unable to continue due to injury, Johnny Heitinga (Hertha Berlin) comes on."
        },
        {
            "gameTime": "2 - 09:35",
            "label": "injury",
            "description": "John Brooks (Hertha Berlin) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 08:50",
            "label": "y-card",
            "description": "Neven Subotic (Dortmund) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Tobias Stieler ignores the protests."
        },
        {
            "gameTime": "2 - 07:53",
            "label": "y-card",
            "description": "Per Skjelbred (Hertha Berlin) sees a yellow card from Tobias Stieler after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 06:38",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "",
            "description": "Erik Durm (Dortmund) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. The referee and one of his assistants signal for a corner kick to Dortmund."
        },
        {
            "gameTime": "2 - 05:57",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) fails to deliver a decent cross from the corner and the ball goes out of play."
        },
        {
            "gameTime": "2 - 05:33",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) breaks into the penalty area but his shot is blocked. Dortmund will take a corner kick."
        },
        {
            "gameTime": "2 - 04:02",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "2 - 03:43",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "2 - 01:55",
            "label": "soccer-ball",
            "description": "Erik Durm (Dortmund) receives a precise pass inside the box from Henrikh Mkhitaryan and he beats the goalkeeper with a neat finish into the left side of the net. 2:0."
        },
        {
            "gameTime": "2 - 01:02",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Shinji Kagawa (Dortmund), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Pal Dardai has decided to make a substitution during the half time break. Sandro Wagner (Hertha Berlin) comes on the pitch for Salomon Kalou."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Today's clash hasn't been that attractive up to now, but it hasn't been a total borefest. There have been a few nice movements for both sides. The first half was definitely edged by the home side. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 46:24",
            "label": "whistle",
            "description": "Tobias Stieler has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:03",
            "label": "",
            "description": "Tobias Stieler has a clear sight and sees a foul from Sebastian Kehl (Dortmund)."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:25",
            "label": "",
            "description": "A cross is clipped into the penalty area by Kevin Kampl (Dortmund) but poses no threat."
        },
        {
            "gameTime": "1 - 42:41",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 39:59",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Pierre Emerick Aubameyang (Dortmund). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "1 - 38:10",
            "label": "",
            "description": "Valentin Stocker (Hertha Berlin) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "1 - 37:21",
            "label": "",
            "description": "The Dortmund players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 36:24",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 34:58",
            "label": "y-card",
            "description": "Sebastian Kehl (Dortmund) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Tobias Stieler didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "1 - 33:57",
            "label": "",
            "description": "Per Skjelbred (Hertha Berlin) makes a reckless foul in order to win the ball from his opponent. Tobias Stieler has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 33:07",
            "label": "",
            "description": "Erik Durm (Dortmund) sends a teasing cross into the area, but Thomas Kraft intercepts the ball."
        },
        {
            "gameTime": "1 - 32:06",
            "label": "corner",
            "description": "The corner from Henrikh Mkhitaryan (Dortmund) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 31:58",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. The referee and his assistant both point at the corner flag. Dortmund will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 30:41",
            "label": "",
            "description": "Genki Haraguchi (Hertha Berlin) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 29:31",
            "label": "",
            "description": "Sebastian Langkamp (Hertha Berlin) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 29:08",
            "label": "",
            "description": "Marvin Plattenhardt (Hertha Berlin) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 28:25",
            "label": "",
            "description": "Dangerous play by Neven Subotic (Dortmund). Tobias Stieler blows his whistle for a foul. Hertha Berlin are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 27:27",
            "label": "",
            "description": "Kevin Kampl (Dortmund) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 26:05",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) sends in a cross from the free kick from the edge of the box. His effort is inaccurate and goes out of play."
        },
        {
            "gameTime": "1 - 25:41",
            "label": "y-card",
            "description": "A yellow card for a tackle by Genki Haraguchi (Hertha Berlin). Tobias Stieler doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 23:46",
            "label": "",
            "description": "Genki Haraguchi (Hertha Berlin) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 22:54",
            "label": "",
            "description": "Peter Pekarik (Hertha Berlin) was too forceful with his tackle and Tobias Stieler interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 22:08",
            "label": "",
            "description": "Erik Durm (Dortmund) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 21:37",
            "label": "injury",
            "description": "Erik Durm (Dortmund) picks up an injury."
        },
        {
            "gameTime": "1 - 19:38",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 19:01",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 17:21",
            "label": "",
            "description": "Tobias Stieler blows his whistle after Shinji Kagawa (Dortmund) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 17:04",
            "label": "",
            "description": "Erik Durm (Dortmund) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 16:05",
            "label": "",
            "description": "A pass by Henrikh Mkhitaryan (Dortmund) ends up in no man's land, and the attacking effort comes to an end. The ball goes out of play and Hertha Berlin will have a goal kick."
        },
        {
            "gameTime": "1 - 14:28",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) gets a shot from inside the penalty area and it flies just wide of the left post."
        },
        {
            "gameTime": "1 - 14:06",
            "label": "",
            "description": "Hertha Berlin play a few nice passes from player to player, but their possession doesn't last long as an opposition player intercepts a pass."
        },
        {
            "gameTime": "1 - 11:12",
            "label": "",
            "description": "Erik Durm (Dortmund) commits a rough challenge and Tobias Stieler blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 08:40",
            "label": "soccer-ball",
            "description": "Neven Subotic (Dortmund) outjumps the defence inside the six yard box to meet the corner and scores with a great header into the left side of the goal. The keeper had no chance to react. The score is now 1:0."
        },
        {
            "gameTime": "1 - 08:34",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 08:29",
            "label": "",
            "description": "The ball is cleared after Henrikh Mkhitaryan (Dortmund) attempted to dribble past an opposing player. The ball goes behind for a corner. Dortmund will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 06:47",
            "label": "",
            "description": "Mats Hummels (Dortmund) rises high to meet a cross from the corner kick and plants a header from inside the penalty area. His effort went just narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 06:26",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 06:13",
            "label": "",
            "description": "A cross into the box from Pierre Emerick Aubameyang (Dortmund) is cleared. Dortmund will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 04:11",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 03:51",
            "label": "",
            "description": "Kevin Kampl (Dortmund) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 02:43",
            "label": "",
            "description": "Hertha Berlin enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 01:00",
            "label": "",
            "description": "Neven Subotic (Dortmund) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hertha Berlin will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Tobias Stieler will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. The superiority of the home team was evident on the pitch today. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Hertha Berlin",
    "gameDate": "09/05/2015 - 16:30",
    "gameHomeTeam": "Dortmund",
    "gameScore": "2 - 0"
}