{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-12-04 - 14-30 AC Milan 2 - 1 Crotone/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:23",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. AC Milan were better today and displayed masterful control and movement. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        },
        {
            "gameTime": "2 - 49:22",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 48:36",
            "label": "",
            "description": "The game is interrupted. Aleandro Rosi (Crotone) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did. AC Milan are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 46:57",
            "label": "",
            "description": "That was a poorly executed free kick from long distance. Lorenzo Crisetig (Crotone) was trying to produce a cross into the penalty area, but his effort sailed off the pitch."
        },
        {
            "gameTime": "2 - 46:34",
            "label": "y-card",
            "description": "Marco Di Bello shows a yellow card to Juraj Kucka (AC Milan) for his blatant foul."
        },
        {
            "gameTime": "2 - 45:53",
            "label": "",
            "description": "Lorenzo Crisetig (Crotone) whips a long ball in from the free kick which is intercepted by Gianluigi Donnarumma."
        },
        {
            "gameTime": "2 - 45:33",
            "label": "",
            "description": "Marco Di Bello blows the whistle, Suso (AC Milan) is penalised for a foul. Crotone win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:00",
            "label": "substitution",
            "description": "Vincenzo Montella prepares a substitution. Gianluca Lapadula is replaced by Juraj Kucka (AC Milan)."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Marcus Rohden will be replaced by Simy (Crotone)."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "y-card",
            "description": "Gianluca Lapadula (AC Milan) gets a yellow card. The referee Marco Di Bello made the right call."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "soccer-ball",
            "description": "Goal! Gianluca Lapadula (AC Milan) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball low into the middle of the net. It's 2:1."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "",
            "description": "The free kick into the penalty area from Keisuke Honda (AC Milan) is cleared."
        },
        {
            "gameTime": "2 - 40:02",
            "label": "",
            "description": "Ignazio Abate (AC Milan) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 38:10",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) is penalised for a foul. Marco Di Bello had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 37:23",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 36:00",
            "label": "substitution",
            "description": "It will be a substitution. Keisuke Honda (AC Milan) is ready to enter the pitch as M'Baye Niang walks off."
        },
        {
            "gameTime": "2 - 31:58",
            "label": "corner",
            "description": "The resulting corner from Suso (AC Milan) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 31:38",
            "label": "",
            "description": "Luiz Adriano (AC Milan) is unable to control an accurate defence splitting pass properly and one of the defending players reacts well to rob him of the ball. The referee blows his whistle, AC Milan are awarded a corner kick."
        },
        {
            "gameTime": "2 - 29:46",
            "label": "",
            "description": "Ignazio Abate (AC Milan) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is off of the pitch and it's a goal kick for Crotone."
        },
        {
            "gameTime": "2 - 29:11",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Mario Sampirisi (Crotone) comes onto the pitch for Bruno Martella."
        },
        {
            "gameTime": "2 - 28:00",
            "label": "substitution",
            "description": "Vincenzo Montella has decided to introduce fresh legs, with Luiz Adriano (AC Milan) replacing Jose Sosa."
        },
        {
            "gameTime": "2 - 28:00",
            "label": "",
            "description": "Goal disallowed! Gianluca Lapadula (AC Milan) scores but Marco Di Bello blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 26:51",
            "label": "corner",
            "description": "Jose Sosa (AC Milan) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 26:38",
            "label": "",
            "description": "Suso (AC Milan) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. AC Milan win a corner."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "substitution",
            "description": "Substitution. Raffaele Palladino (Crotone) on for Adrian Stoian."
        },
        {
            "gameTime": "2 - 24:26",
            "label": "",
            "description": "Manuel Locatelli (AC Milan) sends a chip pass into the box, but Alex Cordaz is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 23:34",
            "label": "",
            "description": "One of the players from Crotone times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 22:43",
            "label": "",
            "description": "Gabriel Paletta (AC Milan) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 22:12",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Suso (AC Milan), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "2 - 21:40",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Adrian Stoian (Crotone) was quite harsh and Marco Di Bello didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 20:38",
            "label": "",
            "description": "The AC Milan players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 18:27",
            "label": "",
            "description": "A cross by Mattia De Sciglio (AC Milan) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor. The ball goes out of play and Crotone will have a goal kick."
        },
        {
            "gameTime": "2 - 18:11",
            "label": "",
            "description": "AC Milan control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 17:27",
            "label": "y-card",
            "description": "The referee demonstrates he won't tolerate this behaviour. Jose Sosa (AC Milan) is given a yellow card."
        },
        {
            "gameTime": "2 - 16:47",
            "label": "corner",
            "description": "Adrian Stoian (Crotone) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 16:28",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Marcus Rohden (Crotone). The ball goes out for a corner. Crotone can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 14:51",
            "label": "y-card",
            "description": "Marcus Rohden (Crotone) has tested the patience of referee Marco Di Bello and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 09:36",
            "label": "corner",
            "description": "Adrian Stoian (Crotone) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "penalty-missed",
            "description": "M'Baye Niang (AC Milan) wastes a huge opportunity to score from a penalty kick. He attempts to slot into the top left corner, but Alex Cordaz pulls off a superb save."
        },
        {
            "gameTime": "2 - 07:47",
            "label": "y-card",
            "description": "That will be a yellow card for one of the players. The one who gets booked is Lorenzo Crisetig (Crotone)."
        },
        {
            "gameTime": "2 - 07:46",
            "label": "penalty",
            "description": "Marco Di Bello blows his whistle. Lorenzo Crisetig (Crotone) commits a foul after dangerous play. A penalty is given to AC Milan!"
        },
        {
            "gameTime": "2 - 07:45",
            "label": "",
            "description": "M'Baye Niang (AC Milan) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 04:00",
            "label": "y-card",
            "description": "Manuel Locatelli (AC Milan) is booked after bringing down an opponent. Marco Di Bello had an easy decision to make."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Marco Di Bello blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:24",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. AC Milan enjoyed superiority over the opposition in that first 45 minutes. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 45:23",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 43:00",
            "label": "y-card",
            "description": "Aleandro Rosi (Crotone) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 40:46",
            "label": "soccer-ball",
            "description": "Mario Pasalic (AC Milan) received a delightful pass inside the box before slotting the ball past the goalkeeper. What a brilliant finish!"
        },
        {
            "gameTime": "1 - 40:00",
            "label": "corner",
            "description": "Suso (AC Milan) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 39:48",
            "label": "",
            "description": "M'Baye Niang (AC Milan) misses a good chance to score. An inch perfect cross into the box finds M'Baye Niang (AC Milan) who rises for a header, but sends the ball well over the bar. AC Milan earn a corner."
        },
        {
            "gameTime": "1 - 36:42",
            "label": "",
            "description": "Jose Sosa (AC Milan) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "1 - 35:01",
            "label": "corner",
            "description": "The resulting corner, taken by Suso (AC Milan), comes to nothing."
        },
        {
            "gameTime": "1 - 34:44",
            "label": "corner",
            "description": "Suso (AC Milan) takes the corner, but the opposition's defence is ready and clears the ball to safety. AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 34:23",
            "label": "corner",
            "description": "Suso (AC Milan) floats the ball in from the corner but it's intercepted. The referee and his assistant both point at the corner flag. AC Milan will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 33:58",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball goes out of play and AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 31:22",
            "label": "",
            "description": "Neat passing move from AC Milan in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 30:28",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 28:57",
            "label": "",
            "description": "That's a well taken pass by Jose Sosa (AC Milan). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "1 - 26:00",
            "label": "soccer-ball",
            "description": "Goal 0:1! Marcus Rohden laid the ball off to Diego Falcinelli (Crotone), who slots it into the back of the net from close range, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "1 - 23:01",
            "label": "",
            "description": "Adrian Stoian (Crotone) clutches his head after wasting a good opportunity. He expertly collected the ball from a rebound and fired from long range, but his effort wasn't accurate at all and the ball went miles over the crossbar."
        },
        {
            "gameTime": "1 - 22:45",
            "label": "corner",
            "description": "Adrian Stoian (Crotone) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 22:06",
            "label": "",
            "description": "Marcus Rohden (Crotone) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort. Crotone have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:21",
            "label": "",
            "description": "That was close by M'Baye Niang (AC Milan)! He receives a pass on the edge of the box and shoots, but the ball goes by a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 19:20",
            "label": "",
            "description": "M'Baye Niang (AC Milan) gives away a foul for a clumsy challenge. Referee Marco Di Bello saw the whole situation."
        },
        {
            "gameTime": "1 - 18:10",
            "label": "",
            "description": "Manuel Locatelli (AC Milan) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort! The ball is off of the pitch and it's a goal kick for Crotone."
        },
        {
            "gameTime": "1 - 17:45",
            "label": "",
            "description": "Suso (AC Milan) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 17:16",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) picks up a pass and hits the ball towards goal, but he can't generate enough power to trouble Alex Cordaz."
        },
        {
            "gameTime": "1 - 16:14",
            "label": "",
            "description": "Bruno Martella (Crotone) tries his luck with a low long range effort after receiving a precise pass, but Gianluigi Donnarumma has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 14:59",
            "label": "",
            "description": "Marcello Trotta (Crotone) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 13:43",
            "label": "",
            "description": "Jose Sosa (AC Milan) sends over a free kick from long range but the defence is alert."
        },
        {
            "gameTime": "1 - 12:56",
            "label": "",
            "description": "Lorenzo Crisetig (Crotone) jumps into a tackle and Marco Di Bello blows his whistle for a foul. It's a free kick to AC Milan, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 11:51",
            "label": "",
            "description": "M'Baye Niang (AC Milan) looks to break free, but an opposing player clears the ball away. The ball has crossed the sideline. AC Milan are taking a throw in."
        },
        {
            "gameTime": "1 - 11:12",
            "label": "",
            "description": "Gianluigi Donnarumma makes a save to deny the long range effort from Marcello Trotta (Crotone) towards the middle of the goal."
        },
        {
            "gameTime": "1 - 10:25",
            "label": "",
            "description": "Great teamplay by AC Milan as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 08:38",
            "label": "",
            "description": "Marco Di Bello blows his whistle and it's M'Baye Niang (AC Milan) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 08:06",
            "label": "corner",
            "description": "Adrian Stoian (Crotone) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 07:17",
            "label": "",
            "description": "Leonardo Capezzi (Crotone) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. The ball is out of play. Crotone will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 04:55",
            "label": "corner",
            "description": "The corner kick from Jose Sosa (AC Milan) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 03:13",
            "label": "",
            "description": "M'Baye Niang (AC Milan) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 02:50",
            "label": "",
            "description": "Marcus Rohden (Crotone) races towards goal but the defender gets back well to make a challenge. The ball goes out of play and AC Milan will have a goal kick."
        },
        {
            "gameTime": "1 - 02:18",
            "label": "",
            "description": "A long ball forward to Mattia De Sciglio (AC Milan) is intercepted."
        },
        {
            "gameTime": "1 - 01:13",
            "label": "",
            "description": "The AC Milan players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Crotone will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Marco Di Bello."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "A 0:4 loss was the worst match Crotone have played this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 2:1 in the last game between AC Milan and Crotone."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of AC Milan is Carlos Bacca with 6 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. AC Milan were better today and displayed masterful control and movement. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        }
    ],
    "gameAwayTeam": "Crotone",
    "gameDate": "04/12/2016 - 14:30",
    "gameHomeTeam": "AC Milan",
    "gameScore": "2 - 1"
}