{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-08-29 - 17-00 Liverpool 0 - 3 West Ham/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 51:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. There wasn't any evident superiority by either side today. The tactic of the home side was to keep the ball at their feet as much as possible, while the away team tried to attack as quickly and accurately as possible."
        },
        {
            "gameTime": "2 - 51:58",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 50:40",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Diafra Sakho walks off the pitch to be replaced by Josh Cullen (West Ham)."
        },
        {
            "gameTime": "2 - 49:35",
            "label": "",
            "description": "This shall not pass! Danny Ings (Liverpool) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "2 - 49:16",
            "label": "",
            "description": "West Ham control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 46:40",
            "label": "soccer-ball",
            "description": "Diafra Sakho (West Ham) makes a great solo run and pulls the trigger from inside the box, beating Simon Mignolet with a strike into the right side of the goal. He makes it 0:3."
        },
        {
            "gameTime": "2 - 45:49",
            "label": "y-card",
            "description": "Nathaniel Clyne (Liverpool) will have to be careful for the rest of the match as he is shown a yellow card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "7 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:20",
            "label": "",
            "description": "The game is interrupted as Diafra Sakho (West Ham) is flagged offside."
        },
        {
            "gameTime": "2 - 42:26",
            "label": "substitution",
            "description": "Dimitri Payet is being substituted because of an injury. Slaven Bilic sends Matthew Jarvis (West Ham) on the pitch."
        },
        {
            "gameTime": "2 - 41:48",
            "label": "injury",
            "description": "The game is interrupted now, Dimitri Payet (West Ham) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 40:20",
            "label": "y-card",
            "description": "Kevin Friend shows the yellow card to Danny Ings (Liverpool) for a heavy challenge."
        },
        {
            "gameTime": "2 - 39:06",
            "label": "attendance",
            "description": "The attendance for today's match is 43680."
        },
        {
            "gameTime": "2 - 38:12",
            "label": "",
            "description": "Dejan Lovren (Liverpool) comes close to scoring! He gets the ball inside the box from the resulting corner but his shot flies just over the crossbar. This should be a big warning for the defence."
        },
        {
            "gameTime": "2 - 38:03",
            "label": "corner",
            "description": "James Milner (Liverpool) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 37:30",
            "label": "",
            "description": "Jordon Ibe (Liverpool) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort. The linesman makes the right call and Liverpool will have a corner."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "corner",
            "description": "Jordon Ibe (Liverpool) takes a short corner kick."
        },
        {
            "gameTime": "2 - 37:04",
            "label": "",
            "description": "James Milner (Liverpool) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Liverpool win a corner."
        },
        {
            "gameTime": "2 - 36:18",
            "label": "substitution",
            "description": "Slaven Bilic has decided to make a change. Reece Oxford (West Ham) replaces Manuel Lanzini."
        },
        {
            "gameTime": "2 - 35:39",
            "label": "y-card",
            "description": "The referee gives a yellow card to Manuel Lanzini (West Ham)."
        },
        {
            "gameTime": "2 - 32:59",
            "label": "r-card",
            "description": "An early bath for Mark Noble (West Ham). He receives a red card from Kevin Friend. His teammates will not thank him after the match."
        },
        {
            "gameTime": "2 - 32:28",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Jordon Ibe (Liverpool) comes onto the pitch so that Joe Gomez can be given a rest."
        },
        {
            "gameTime": "2 - 32:05",
            "label": "",
            "description": "Winston Reid (West Ham) connects with the corner kick around the penalty spot, but steers his header just wide of the left post."
        },
        {
            "gameTime": "2 - 32:04",
            "label": "corner",
            "description": "Corner kick. Dimitri Payet (West Ham) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 31:37",
            "label": "",
            "description": "Manuel Lanzini (West Ham) gets on the end of a pass on the edge of the box but his shot is blocked. The referee blows his whistle, West Ham are awarded a corner kick."
        },
        {
            "gameTime": "2 - 31:25",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Dimitri Payet (West Ham)."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "",
            "description": "A cross into the box from Aaron Cresswell (West Ham) is cleared. The ball goes out of play. West Ham are awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:34",
            "label": "corner",
            "description": "A quickly taken corner by West Ham."
        },
        {
            "gameTime": "2 - 30:16",
            "label": "",
            "description": "Aaron Cresswell (West Ham) zig zags his way into the box and fails to direct a shot inside the left post. The goalkeeper pulls off a miraculous stop. The referee points to the corner flag. It's a corner to West Ham."
        },
        {
            "gameTime": "2 - 28:02",
            "label": "",
            "description": "Kevin Friend interrupts the game for a tactical foul by Cheikhou Kouyate (West Ham)."
        },
        {
            "gameTime": "2 - 25:43",
            "label": "",
            "description": "Cheikhou Kouyate (West Ham) sees an opportunity to score and unleashes a powerful first time rocket of a shot from long range. Simon Mignolet has a clear sight of the shot and pulls off a comfortable save to block the effort, which was directed to the right side of the goal."
        },
        {
            "gameTime": "2 - 24:22",
            "label": "y-card",
            "description": "Lucas Leiva (Liverpool) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Kevin Friend ignores the protests."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "",
            "description": "Dimitri Payet (West Ham) takes a short free kick."
        },
        {
            "gameTime": "2 - 22:19",
            "label": "",
            "description": "Poor challenge! Dejan Lovren (Liverpool) is penalised for tripping and Kevin Friend blows his whistle. It's a free kick to West Ham in a dangerous position."
        },
        {
            "gameTime": "2 - 21:10",
            "label": "",
            "description": "Aaron Cresswell (West Ham) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "2 - 18:24",
            "label": "",
            "description": "James Milner (Liverpool) unleashes a superb first time shot from the edge of the box, but it flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 17:30",
            "label": "",
            "description": "Aaron Cresswell (West Ham) sends a cross into the box, but Simon Mignolet comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 17:21",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "",
            "description": "A beautiful low pass from the side is received by Dimitri Payet (West Ham), who was waiting for his chance. However, the defence is alert and spanks the ball away. Now West Ham have a corner."
        },
        {
            "gameTime": "2 - 15:16",
            "label": "substitution",
            "description": "Substitution. Roberto Firmino did his best and is replaced by Danny Ings (Liverpool)."
        },
        {
            "gameTime": "2 - 13:12",
            "label": "",
            "description": "Christian Benteke (Liverpool) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "2 - 12:42",
            "label": "",
            "description": "Pedro Obiang (West Ham) robs an opponent of the ball and explodes in anger when Kevin Friend blows for a foul."
        },
        {
            "gameTime": "2 - 09:10",
            "label": "",
            "description": "Darren Randolph blocks a long range effort from Dejan Lovren (Liverpool) towards the left side of the goal."
        },
        {
            "gameTime": "2 - 06:14",
            "label": "yr-card",
            "description": "Philippe Coutinho (Liverpool) makes a bad challenge and is given a second yellow card which means he's off."
        },
        {
            "gameTime": "2 - 06:12",
            "label": "",
            "description": "Lucas Leiva (Liverpool) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 04:13",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) collects a wonderful lead pass and as he has a lot of space, smashes a terrific shot from long range. His shot goes painfully close to the crossbar!"
        },
        {
            "gameTime": "2 - 03:08",
            "label": "",
            "description": "James Milner (Liverpool) breaks past challenges inside the box, but puts too much pace on his pass to Philippe Coutinho."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Brendan Rodgers has made a change at the break. Alberto Moreno (Liverpool) has come on in place of Emre Can."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Kevin Friend blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 49:59",
            "label": "",
            "description": "There has not been much to choose between the sides after an absorbing 45 minutes. Let's hope they can continue in the same vein in the second period. Even first half from both sides, and they've both had chances. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 49:10",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "y-card",
            "description": "Philippe Coutinho (Liverpool) is cautioned and receives a yellow card."
        },
        {
            "gameTime": "1 - 48:13",
            "label": "corner",
            "description": "James Milner (Liverpool) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 47:53",
            "label": "",
            "description": "James Milner (Liverpool) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. The ball goes out for a corner. Liverpool can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 46:01",
            "label": "",
            "description": "The ball is cleared after Cheikhou Kouyate (West Ham) attempted to dribble past an opposing player. The ball has crossed the sideline. West Ham are taking a throw in."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "1 - 43:52",
            "label": "corner",
            "description": "The resulting corner, taken by Dimitri Payet (West Ham), comes to nothing."
        },
        {
            "gameTime": "1 - 43:30",
            "label": "",
            "description": "Dimitri Payet (West Ham) sends a cross into the box, but the opposition's defence clears the ball to safety. The referee and his assistant both point at the corner flag. West Ham will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 40:13",
            "label": "",
            "description": "Cheikhou Kouyate (West Ham) is penalised for a foul. Kevin Friend had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 38:55",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) misses a good chance to score. An inch perfect cross into the box finds Philippe Coutinho (Liverpool) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 37:54",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Mark Noble (West Ham) was quite harsh and Kevin Friend didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 35:50",
            "label": "",
            "description": "Mark Noble (West Ham) latches onto a lofted pass on the edge of the penalty box and unleashes a volley towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 35:28",
            "label": "",
            "description": "Dimitri Payet (West Ham) takes the free kick and sends the ball into the penalty area, but the opposition's defence is ready."
        },
        {
            "gameTime": "1 - 35:05",
            "label": "",
            "description": "Martin Skrtel (Liverpool) makes a bad challenge and the referee blows his whistle for a foul. There is a free kick near the sideline to West Ham."
        },
        {
            "gameTime": "1 - 33:40",
            "label": "",
            "description": "Cheikhou Kouyate (West Ham) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 33:20",
            "label": "",
            "description": "Good movement by Joe Gomez (Liverpool), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "1 - 31:25",
            "label": "injury",
            "description": "Cheikhou Kouyate (West Ham) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "1 - 28:41",
            "label": "soccer-ball",
            "description": "What a hit! Mark Noble (West Ham) shows good composure inside the box to fire a first time shot inside the right post. 0:2."
        },
        {
            "gameTime": "1 - 28:35",
            "label": "",
            "description": "Manuel Lanzini (West Ham) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 25:21",
            "label": "",
            "description": "Aaron Cresswell (West Ham) takes the rebound on the edge of the box and fires the ball just over the crossbar."
        },
        {
            "gameTime": "1 - 25:03",
            "label": "",
            "description": "Cheikhou Kouyate (West Ham) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 24:25",
            "label": "corner",
            "description": "James Milner (Liverpool) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 24:03",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Liverpool force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 22:21",
            "label": "",
            "description": "Christian Benteke (Liverpool) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 20:14",
            "label": "",
            "description": "Dejan Lovren (Liverpool) commits a foul and Kevin Friend immediately signals a free kick."
        },
        {
            "gameTime": "1 - 19:46",
            "label": "corner",
            "description": "James Milner (Liverpool) takes the corner."
        },
        {
            "gameTime": "1 - 19:34",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) whips a promising cross into the box, but the opposition's defence intercepts the ball. Liverpool have a corner."
        },
        {
            "gameTime": "1 - 17:48",
            "label": "",
            "description": "Lucas Leiva (Liverpool) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 15:18",
            "label": "",
            "description": "Manuel Lanzini (West Ham) creates a good chance for himself and goes for goal from mid range, but he misses the left post by a whisker."
        },
        {
            "gameTime": "1 - 13:33",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 13:21",
            "label": "",
            "description": "Aaron Cresswell (West Ham) sends a lofted cross into the box which is headed clear. The ball goes behind for a corner. West Ham will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 13:04",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 12:48",
            "label": "",
            "description": "Mark Noble (West Ham) tries to slide the ball through to a teammate but it's well blocked by a defender. West Ham force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 12:11",
            "label": "",
            "description": "Dimitri Payet (West Ham) produces a poor lofted pass into the penalty box. His attempt is easily thwarted by the defence."
        },
        {
            "gameTime": "1 - 11:58",
            "label": "",
            "description": "Kevin Friend blows his whistle for a foul after James Milner (Liverpool) hacks down one of his opponents. West Ham have been awarded a free kick."
        },
        {
            "gameTime": "1 - 10:33",
            "label": "",
            "description": "Lucas Leiva (Liverpool) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 10:10",
            "label": "",
            "description": "Manuel Lanzini (West Ham) was trying to get to the ball but clattered into the legs of the opponent as well. Kevin Friend blows his whistle for an infringement. Liverpool have a free kick."
        },
        {
            "gameTime": "1 - 08:03",
            "label": "",
            "description": "OFF THE POST! Roberto Firmino (Liverpool) surges forward and manages to get a powerful shot away from 25 metres out. However, the effort crashes against the left post!"
        },
        {
            "gameTime": "1 - 06:37",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) creates a good chance for himself and goes for goal from mid range, but the effort is well wide of the right post."
        },
        {
            "gameTime": "1 - 04:39",
            "label": "",
            "description": "Liverpool hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 02:47",
            "label": "soccer-ball",
            "description": "Goal! Aaron Cresswell puts the ball on a plate for Manuel Lanzini (West Ham), who scores with a simple close range finish. It's 0:1."
        },
        {
            "gameTime": "1 - 01:32",
            "label": "",
            "description": "Emre Can (Liverpool) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Kevin Friend."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. There wasn't any evident superiority by either side today. The tactic of the home side was to keep the ball at their feet as much as possible, while the away team tried to attack as quickly and accurately as possible."
        }
    ],
    "gameAwayTeam": "West Ham",
    "gameDate": "29/08/2015 - 17:00",
    "gameHomeTeam": "Liverpool",
    "gameScore": "0 - 3"
}