{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-11-26 - 18-00 Liverpool 2 - 0 Sunderland/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The game was controlled by the home side. The home team played possession football and the away players really focused on a well organized defence."
        },
        {
            "gameTime": "2 - 48:08",
            "label": "whistle",
            "description": "That's it for today, Anthony Taylor has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 46:56",
            "label": "substitution",
            "description": "Substitution. Benjamin Woodburn (Liverpool) in, Georginio Wijnaldum out."
        },
        {
            "gameTime": "2 - 46:40",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the right post."
        },
        {
            "gameTime": "2 - 45:40",
            "label": "soccer-ball",
            "description": "James Milner (Liverpool) confidently powers his spot kick into the left side of the goal."
        },
        {
            "gameTime": "2 - 45:20",
            "label": "",
            "description": "James Milner (Liverpool) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 45:10",
            "label": "penalty",
            "description": "Referee Anthony Taylor sees the trip by Didier Ndong (Sunderland) and doesn't hesitate to blow his whistle. It's a penalty! What an opportunity to score for Liverpool."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 41:42",
            "label": "corner",
            "description": "The corner kick from Jordan Henderson (Liverpool) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 41:41",
            "label": "substitution",
            "description": "It is time for a substitution. Lucas Leiva (Liverpool) is on for Roberto Firmino."
        },
        {
            "gameTime": "2 - 41:01",
            "label": "",
            "description": "Emre Can (Liverpool) dribbles into space and finds himself in a shooting position, but his shot from the edge of the box is bravely blocked. The referee points to the corner flag and Liverpool will take a corner."
        },
        {
            "gameTime": "2 - 38:45",
            "label": "",
            "description": "Roberto Firmino (Liverpool) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 37:59",
            "label": "injury",
            "description": "Roberto Firmino (Liverpool) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "",
            "description": "Jordan Henderson (Liverpool) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 35:13",
            "label": "",
            "description": "Half chance! James Milner (Liverpool) plays a pass into the box, but Jordan Pickford reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 33:56",
            "label": "substitution",
            "description": "David William Moyes decides to make a substitution. Duncan Watmore will be replaced by Adnan Januzaj (Sunderland)."
        },
        {
            "gameTime": "2 - 33:39",
            "label": "substitution",
            "description": "Substitution. Lynden Gooch (Sunderland) replaces Steven Pienaar."
        },
        {
            "gameTime": "2 - 32:53",
            "label": "",
            "description": "Joel Matip (Liverpool) jumps for a header from the corner kick, but fails to steer the ball into the goal as it flies high over the bar."
        },
        {
            "gameTime": "2 - 32:37",
            "label": "corner",
            "description": "James Milner (Liverpool) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 32:25",
            "label": "",
            "description": "James Milner (Liverpool) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The referee and his assistant both point at the corner flag. Liverpool will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 29:07",
            "label": "soccer-ball",
            "description": "Goal 1:0! Divock Origi (Liverpool) tries his luck from the edge of the box and scores with an accurate shot inside the right post. Jordan Henderson provided an assist for the goal."
        },
        {
            "gameTime": "2 - 28:16",
            "label": "corner",
            "description": "James Milner (Liverpool) swings in a cross from the corner, but Jordan Pickford reads it well and gathers the ball."
        },
        {
            "gameTime": "2 - 28:02",
            "label": "corner",
            "description": "James Milner (Liverpool) whips in the corner, but one of the defending players gets a head on it and intercepts. Liverpool force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 27:48",
            "label": "",
            "description": "Sadio Mane (Liverpool) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort. The ball is out of play and Liverpool manage to earn a corner."
        },
        {
            "gameTime": "2 - 27:34",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 27:07",
            "label": "",
            "description": "Sadio Mane (Liverpool) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball goes out of play. Liverpool are awarded a corner kick."
        },
        {
            "gameTime": "2 - 25:58",
            "label": "",
            "description": "Jordan Henderson (Liverpool) takes a shot from a mid range free kick and the ball flies inches wide of the left post!"
        },
        {
            "gameTime": "2 - 24:58",
            "label": "y-card",
            "description": "Steven Pienaar (Sunderland) takes his opponent down and receives a yellow card from the referee."
        },
        {
            "gameTime": "2 - 24:39",
            "label": "",
            "description": "Roberto Firmino (Liverpool) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "2 - 23:51",
            "label": "",
            "description": "Roberto Firmino (Liverpool) wriggles into space inside the box with excellent ball control, but his effort on goal is well blocked. Roberto Firmino (Liverpool) is the first to arrive to a rebound inside the penalty area and unleashes a quick strike towards the middle of the target that beats the keeper. One of the defenders, however, makes a goal line clearance."
        },
        {
            "gameTime": "2 - 23:27",
            "label": "",
            "description": "Victor Anichebe (Sunderland) misses a good chance to score. An inch perfect cross into the box finds Victor Anichebe (Sunderland) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 23:10",
            "label": "",
            "description": "Duncan Watmore (Sunderland) dribbles into the box, but Loris Karius is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 22:23",
            "label": "",
            "description": "Patrick van Aanholt (Sunderland) wasted an opportunity to score from the free kick from about 22 metres out. His attempt hit the defensive wall."
        },
        {
            "gameTime": "2 - 21:40",
            "label": "y-card",
            "description": "What was Dejan Lovren (Liverpool) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "2 - 19:38",
            "label": "",
            "description": "What an opportunity that was! The ball rebounded out to Emre Can (Liverpool), whose shot from the edge of the box goes a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 18:39",
            "label": "y-card",
            "description": "John O'Shea (Sunderland) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "2 - 18:17",
            "label": "corner",
            "description": "Patrick van Aanholt (Sunderland) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 17:40",
            "label": "",
            "description": "Victor Anichebe (Sunderland) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. Sunderland force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 17:06",
            "label": "",
            "description": "Jordan Henderson (Liverpool) latches on to an accurate pass on the edge of the box and immediately unleashes a shot which is wide of the mark."
        },
        {
            "gameTime": "2 - 15:17",
            "label": "",
            "description": "Lamine Kone (Sunderland) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "2 - 14:16",
            "label": "y-card",
            "description": "Lamine Kone (Sunderland) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 12:57",
            "label": "",
            "description": "Roberto Firmino (Liverpool) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the right side of the net, but Jordan Pickford leaps like a salmon to deny him."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "corner",
            "description": "The resulting corner from Jordan Henderson (Liverpool) is cleared by the defence."
        },
        {
            "gameTime": "2 - 11:31",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The referee signals a corner kick to Liverpool."
        },
        {
            "gameTime": "2 - 10:11",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 08:50",
            "label": "",
            "description": "Roberto Firmino (Liverpool) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 07:41",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) receives a lofted pass from out wide and shoots from close range, but the ball flies way past the left hand post."
        },
        {
            "gameTime": "2 - 05:33",
            "label": "",
            "description": "A pass by Roberto Firmino (Liverpool) ends up in no man's land, and the attacking effort comes to an end. It's a throw in for Liverpool."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "",
            "description": "A neat pass is well received by Sadio Mane (Liverpool), who is lurking on the edge of the box and strikes the ball on goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "2 - 03:47",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) makes a driving run into the box but he cannot work any space for a shot."
        },
        {
            "gameTime": "2 - 02:59",
            "label": "",
            "description": "Liverpool are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 49:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. The home side is easily dictating the tempo in this game. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 49:04",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 48:42",
            "label": "",
            "description": "Sadio Mane (Liverpool) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Jordan Pickford guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 47:12",
            "label": "",
            "description": "Dejan Lovren (Liverpool) collects a wonderful lead pass and creates some space to smash the ball goalwards from long range. His shot goes painfully wide of the left post!"
        },
        {
            "gameTime": "1 - 45:48",
            "label": "",
            "description": "Emre Can (Liverpool) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball goes well wide of the right post!"
        },
        {
            "gameTime": "1 - 45:28",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "1 - 43:31",
            "label": "",
            "description": "Divock Origi (Liverpool) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "",
            "description": "Emre Can (Liverpool) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "1 - 40:57",
            "label": "corner",
            "description": "The referee awards a corner and Jordan Henderson (Liverpool) goes over to take it."
        },
        {
            "gameTime": "1 - 40:47",
            "label": "",
            "description": "Sadio Mane (Liverpool) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Liverpool will take a corner kick."
        },
        {
            "gameTime": "1 - 39:13",
            "label": "",
            "description": "Liverpool control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 36:53",
            "label": "",
            "description": "Dejan Lovren (Liverpool) leaps high deep inside the box to meet a beautiful cross from the resultant free kick. He glances a header goalwards, but it goes narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 35:58",
            "label": "",
            "description": "Divock Origi (Liverpool) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 33:41",
            "label": "substitution",
            "description": "That's the end of the game for Philippe Coutinho, who is replaced by Divock Origi (Liverpool)."
        },
        {
            "gameTime": "1 - 30:01",
            "label": "injury",
            "description": "Philippe Coutinho (Liverpool) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 29:29",
            "label": "",
            "description": "The ball is cleared after Philippe Coutinho (Liverpool) attempted to dribble past an opposing player. The ball has crossed the sideline. Liverpool are taking a throw in."
        },
        {
            "gameTime": "1 - 27:15",
            "label": "",
            "description": "James Milner (Liverpool) sends a long cross over to Sadio Mane, but Jordan Pickford comes forward to gather the ball."
        },
        {
            "gameTime": "1 - 24:45",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the left post."
        },
        {
            "gameTime": "1 - 23:09",
            "label": "",
            "description": "Sadio Mane (Liverpool) has a sight of goal and shoots from distance, but Jordan Pickford is equal to it."
        },
        {
            "gameTime": "1 - 22:55",
            "label": "corner",
            "description": "Patrick van Aanholt (Sunderland) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 22:45",
            "label": "",
            "description": "Steven Pienaar (Sunderland) sends a pass into the box, but his attempt is thwarted and cleared. The ball goes behind for a corner. Sunderland will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 22:07",
            "label": "",
            "description": "Good touch by Patrick van Aanholt (Sunderland) as he receives a great pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, the effort misses the net and flies well wide to the right."
        },
        {
            "gameTime": "1 - 20:41",
            "label": "",
            "description": "CLOSE! Roberto Firmino (Liverpool) shows off his amazing skills with a solo run to the edge of the box before fashioning a shot that whistles over the bar. The ball is off of the pitch and it's a goal kick for Sunderland."
        },
        {
            "gameTime": "1 - 19:42",
            "label": "",
            "description": "Flag up against Jermain Defoe (Sunderland). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 18:06",
            "label": "corner",
            "description": "Patrick van Aanholt (Sunderland) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 16:50",
            "label": "",
            "description": "Steven Pienaar (Sunderland) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Loris Karius. The ball goes out of play. Sunderland are awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:20",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Patrick van Aanholt (Sunderland). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 16:10",
            "label": "",
            "description": "Steven Pienaar (Sunderland) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. It will be a corner kick for Sunderland."
        },
        {
            "gameTime": "1 - 15:24",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Jermain Defoe (Sunderland). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "1 - 14:22",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) produces a ferocious strike from the edge of the box. His dangerous effort towards the right post is blocked by Jordan Pickford, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 12:45",
            "label": "corner",
            "description": "The resulting corner from Philippe Coutinho (Liverpool) is cleared."
        },
        {
            "gameTime": "1 - 12:28",
            "label": "",
            "description": "Sadio Mane (Liverpool) tries to slide the ball through to a teammate but it's well blocked by a defender. Liverpool have a corner."
        },
        {
            "gameTime": "1 - 09:55",
            "label": "",
            "description": "Sadio Mane (Liverpool) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 07:49",
            "label": "",
            "description": "A lofted cross from James Milner (Liverpool) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 05:23",
            "label": "",
            "description": "Roberto Firmino (Liverpool) gets on the end of a pass and takes a low shot from the edge of the box which is straight at Jordan Pickford, who makes a comfortable save."
        },
        {
            "gameTime": "1 - 05:07",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Jermain Defoe (Sunderland) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 04:51",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 03:22",
            "label": "",
            "description": "Duncan Watmore (Sunderland) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 03:01",
            "label": "",
            "description": "Patrick van Aanholt (Sunderland) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 02:52",
            "label": "",
            "description": "A player from Liverpool takes his opponent down, the referee blows his whistle for a foul. That's a free kick to Sunderland."
        },
        {
            "gameTime": "1 - 01:40",
            "label": "corner",
            "description": "The corner from Philippe Coutinho (Liverpool) is intercepted by Jordan Pickford."
        },
        {
            "gameTime": "1 - 01:26",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from James Milner (Liverpool). The linesman points to the corner flag, Liverpool are going to take it."
        },
        {
            "gameTime": "1 - 01:12",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Anthony Taylor."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Sunderland is Jermain Defoe with 8 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sadio Mane is the biggest threat to an opponent! He has already scored 9 goals and is top scorer in this Liverpool team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool are playing some good attacking football with some solid defence. Here is their goals for and against record 35:18."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The game was controlled by the home side. The home team played possession football and the away players really focused on a well organized defence."
        }
    ],
    "gameAwayTeam": "Sunderland",
    "gameDate": "26/11/2016 - 18:00",
    "gameHomeTeam": "Liverpool",
    "gameScore": "2 - 0"
}