{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-08-29 - 23-30 Real Madrid 5 - 0 Betis/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The host team were better throughout the game. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        },
        {
            "gameTime": "2 - 48:08",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 47:19",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "",
            "description": "Isco (Real Madrid) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 46:16",
            "label": "y-card",
            "description": "Xavi Torres (Betis) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Alejandro Hernandez didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 45:35",
            "label": "corner",
            "description": "Betis quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 45:24",
            "label": "",
            "description": "Cristiano Piccini (Betis) looks to break free, but an opposing player clears the ball away. Betis force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:29",
            "label": "",
            "description": "Isco (Real Madrid) fouls an opponent. At least that's what referee Alejandro Hernandez signals."
        },
        {
            "gameTime": "2 - 43:21",
            "label": "soccer-ball",
            "description": "Gareth Bale (Real Madrid) scores a goal! His accurate strike from 25 metres out finds its way behind the goalkeeper and into the bottom left corner, bouncing in off the post. 5:0."
        },
        {
            "gameTime": "2 - 42:15",
            "label": "corner",
            "description": "Isco (Real Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 41:49",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to find any of his teammates inside the box as his pass is blocked. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "y-card",
            "description": "Today's referee Alejandro Hernandez rightly decides to book Casemiro (Real Madrid) for his harsh tackle."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) reacts well and displays good awareness near the penalty spot to get on the end of a cross from the free kick. He jumps high and produces a header which goes well wide of the left post."
        },
        {
            "gameTime": "2 - 37:54",
            "label": "corner",
            "description": "Real Madrid work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "2 - 37:36",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Cristiano Ronaldo (Real Madrid). The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "2 - 35:25",
            "label": "substitution",
            "description": "It will be a substitution. Petros (Betis) is ready to enter the pitch as Alfred N'Diaye walks off."
        },
        {
            "gameTime": "2 - 34:18",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) releases a promising shot from the free kick on the edge of the box. His low drive to the middle of the goal is comfortably saved by Antonio Adan."
        },
        {
            "gameTime": "2 - 33:16",
            "label": "",
            "description": "A player from Betis pulled an opponent down, forcing the referee to blow his whistle. Real Madrid have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 32:25",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) receives a lofted pass from the side and shoots from around the penalty spot, but the ball flies onto the left post!"
        },
        {
            "gameTime": "2 - 31:58",
            "label": "corner",
            "description": "Marcelo (Real Madrid) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 31:53",
            "label": "",
            "description": "Marcelo (Real Madrid) swings in a cross, but the ball is cleared to safety by one of the defending players. The referee and his assistant both point at the corner flag. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 28:15",
            "label": "substitution",
            "description": "That will be all from Luka Modric who is being replaced by the fresh legs of Mateo Kovacic (Real Madrid)."
        },
        {
            "gameTime": "2 - 27:30",
            "label": "",
            "description": "Alvaro Cejudo (Betis) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 26:30",
            "label": "injury",
            "description": "Alvaro Cejudo (Betis) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 25:59",
            "label": "",
            "description": "Alvaro Cejudo (Betis) got the ball on the edge of the box and produced a strong shot, but one of his teammates was standing in the wrong place and unintentionally blocked the effort."
        },
        {
            "gameTime": "2 - 25:42",
            "label": "",
            "description": "Betis produce a short pass from the free kick."
        },
        {
            "gameTime": "2 - 23:44",
            "label": "",
            "description": "Alvaro Cejudo (Betis) sends a cross into the box, but the opposition's defence clears the ball to safety. The referee signals a corner kick to Betis."
        },
        {
            "gameTime": "2 - 23:26",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Juan Vargas (Betis), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 21:56",
            "label": "",
            "description": "Cristiano Piccini (Betis) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "2 - 18:52",
            "label": "substitution",
            "description": "Here is a change. Toni Kroos is going off and Rafael Benitez gives the last tactical orders to Casemiro (Real Madrid)."
        },
        {
            "gameTime": "2 - 17:45",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) bursts into the box and pulls the trigger, but he can't beat the goalkeeper. He directed his shot towards the middle of the goal, but one of the defenders reacted brilliantly to block it."
        },
        {
            "gameTime": "2 - 15:46",
            "label": "penalty-missed",
            "description": "Ruben Castro (Betis) sends the penalty to the bottom right corner, but Keylor Navas pulls off a wonderful save to deny him."
        },
        {
            "gameTime": "2 - 15:40",
            "label": "",
            "description": "Ruben Castro (Betis) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 14:50",
            "label": "y-card",
            "description": "Raphael Varane (Real Madrid) is the one who receives a yellow card."
        },
        {
            "gameTime": "2 - 14:45",
            "label": "",
            "description": "The referee blows his whistle as Danilo (Real Madrid) was too aggressive in his challenge."
        },
        {
            "gameTime": "2 - 14:45",
            "label": "",
            "description": "Danilo (Real Madrid) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 14:45",
            "label": "penalty",
            "description": "Alejandro Hernandez blows his whistle after Raphael Varane (Real Madrid) brings one of his opponents down with a strong tackle. The referee gives a penalty kick to Betis!"
        },
        {
            "gameTime": "2 - 14:17",
            "label": "",
            "description": "Didier Digard (Betis) receives an accurate pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, his effort goes high above the crossbar."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) works the corner short."
        },
        {
            "gameTime": "2 - 13:05",
            "label": "",
            "description": "This was a piece of cake for Antonio Adan. Cristiano Ronaldo (Real Madrid) found himself some space after latching on to a pass, but his strike only went low to the middle of the goal and into the gloves of the prepared keeper. The referee points to the corner flag. It's a corner to Real Madrid."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "funfact",
            "description": "The current number of shots on goal is 11:1."
        },
        {
            "gameTime": "2 - 12:21",
            "label": "corner",
            "description": "The corner from Luka Modric (Real Madrid) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 11:51",
            "label": "",
            "description": "A lofted cross from Marcelo (Real Madrid) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The referee points to the corner flag and Real Madrid will take a corner."
        },
        {
            "gameTime": "2 - 10:11",
            "label": "",
            "description": "Jorge Molina (Betis) commits a foul and Alejandro Hernandez immediately signals a free kick."
        },
        {
            "gameTime": "2 - 07:31",
            "label": "corner",
            "description": "The resulting corner from Luka Modric (Real Madrid) is cleared."
        },
        {
            "gameTime": "2 - 07:15",
            "label": "substitution",
            "description": "Pepe Mel prepares a substitution. Daniel Ceballos is replaced by Didier Digard (Betis)."
        },
        {
            "gameTime": "2 - 07:15",
            "label": "substitution",
            "description": "A substitution has been made. Karim Benzema goes off and Isco (Real Madrid) comes on."
        },
        {
            "gameTime": "2 - 06:15",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:25",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 05:13",
            "label": "",
            "description": "James Rodriguez (Real Madrid) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. It will be a corner kick for Real Madrid."
        },
        {
            "gameTime": "2 - 04:13",
            "label": "soccer-ball",
            "description": "James Rodriguez (Real Madrid) receives a well taken defence splitting low pass inside the box and scores! His great effort makes its way into the bottom right corner of the net."
        },
        {
            "gameTime": "2 - 03:50",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "2 - 01:58",
            "label": "soccer-ball",
            "description": "Gareth Bale produces a beautiful lofted cross into the box, where Karim Benzema (Real Madrid) rises high to head the ball into the middle of the goal and beyond the goalkeeper. He makes it 3:0."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "There will be a change on the pitch for the second half. Pepe Mel probably wasn't satisfied with the performance of Francisco Molinero. He is replaced by Jorge Molina (Betis)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "This is how football should be full of action, thrilling moments and spectacular opportunities. And we have only had the first 45 minutes, so the expectations for the second half are high. Real Madrid dominated the opening period and easily created the most chances. The home team tries to prevail using combination football, while the away teams uses mostly counter attacks."
        },
        {
            "gameTime": "1 - 45:09",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Alejandro Hernandez has ended it."
        },
        {
            "gameTime": "1 - 44:41",
            "label": "",
            "description": "Xavi Torres (Betis) makes a rough challenge and Alejandro Hernandez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 42:40",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is caught offside!"
        },
        {
            "gameTime": "1 - 42:03",
            "label": "",
            "description": "Ruben Castro (Betis) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Keylor Navas."
        },
        {
            "gameTime": "1 - 40:54",
            "label": "",
            "description": "Alvaro Cejudo (Betis) is penalised for a foul. Alejandro Hernandez had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 38:33",
            "label": "soccer-ball",
            "description": "James Rodriguez (Real Madrid) struck with a superb free kick from the edge of the box, sending the ball in off the inside of the left post. The goalkeeper didn't have a chance. Simply glorious! It's 2:0."
        },
        {
            "gameTime": "1 - 36:40",
            "label": "y-card",
            "description": "Alejandro Hernandez shows the yellow card to Francisco Jose Molinero Calderon (Betis) for a heavy challenge."
        },
        {
            "gameTime": "1 - 36:38",
            "label": "",
            "description": "An attempted cross from Marcelo (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 35:03",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "1 - 34:36",
            "label": "",
            "description": "Marcelo (Real Madrid) flights in the cross, but the defender is alert and clears to safety. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "1 - 34:06",
            "label": "",
            "description": "What an amazing save by Antonio Adan! Cristiano Ronaldo (Real Madrid) swirls around the defenders and attempts to beat the keeper with a close range shot towards the middle of the target, but fails."
        },
        {
            "gameTime": "1 - 33:22",
            "label": "",
            "description": "Karim Benzema (Real Madrid) serves up a nice cross, but Antonio Adan punches the ball away. The ball has crossed the sideline. Real Madrid are taking a throw in."
        },
        {
            "gameTime": "1 - 32:50",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 32:16",
            "label": "",
            "description": "Gareth Bale (Real Madrid) produces a lovely chip pass into the box, but one of the opposition players cuts it out. The ball is out of play. A goal scoring opportunity from a corner for Real Madrid."
        },
        {
            "gameTime": "1 - 30:26",
            "label": "",
            "description": "Ruben Castro (Betis) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "y-card",
            "description": "A yellow card for a tackle by Juan Vargas (Betis). Alejandro Hernandez doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 27:59",
            "label": "",
            "description": "The linesman raises his flag for offside before Karim Benzema (Real Madrid) heads on."
        },
        {
            "gameTime": "1 - 27:42",
            "label": "",
            "description": "Juan Vargas (Betis) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 26:41",
            "label": "",
            "description": "Alvaro Cejudo (Betis) jumps into a tackle and Alejandro Hernandez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 25:20",
            "label": "corner",
            "description": "Juan Vargas (Betis) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 25:02",
            "label": "",
            "description": "A cross into the box from Juan Vargas (Betis) is cleared. Betis force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 23:54",
            "label": "",
            "description": "Ruben Castro (Betis) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "1 - 23:20",
            "label": "y-card",
            "description": "Toni Kroos (Real Madrid) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Alejandro Hernandez ignores the protests."
        },
        {
            "gameTime": "1 - 22:20",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) jumps for a header from the corner kick, but fails to steer the ball into the goal as it flies high over the bar."
        },
        {
            "gameTime": "1 - 22:07",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) will take a corner kick."
        },
        {
            "gameTime": "1 - 21:38",
            "label": "",
            "description": "Danilo (Real Madrid) latches on to a pass inside the box, but his low effort towards the right post is well blocked. The ball goes out for a corner. Real Madrid can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 21:19",
            "label": "",
            "description": "Gareth Bale (Real Madrid) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "1 - 20:37",
            "label": "",
            "description": "Ruben Castro (Betis) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 20:08",
            "label": "",
            "description": "A pass from Cristiano Ronaldo (Real Madrid) is intercepted by Antonio Adan and the move breaks down."
        },
        {
            "gameTime": "1 - 19:30",
            "label": "corner",
            "description": "Juan Vargas (Betis) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 19:01",
            "label": "",
            "description": "Alvaro Cejudo (Betis) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Betis have a corner."
        },
        {
            "gameTime": "1 - 18:03",
            "label": "",
            "description": "Danilo (Real Madrid) collects a pass on the edge of the box but he slips the ball just wide of the right post."
        },
        {
            "gameTime": "1 - 16:35",
            "label": "",
            "description": "Cristiano Piccini (Betis) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "1 - 16:10",
            "label": "",
            "description": "Francisco Jose Molinero Calderon (Betis) crosses the ball forward but it is intercepted."
        },
        {
            "gameTime": "1 - 14:25",
            "label": "",
            "description": "Alejandro Hernandez blows the whistle, Danilo (Real Madrid) is penalised for a foul."
        },
        {
            "gameTime": "1 - 12:45",
            "label": "",
            "description": "Real Madrid are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 10:55",
            "label": "",
            "description": "Toni Kroos (Real Madrid) blows an opportunity as he sends a rebound from just outside of the box narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 10:27",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "1 - 10:03",
            "label": "",
            "description": "Gareth Bale (Real Madrid) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "1 - 09:07",
            "label": "",
            "description": "Ruben Castro (Betis) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the right post."
        },
        {
            "gameTime": "1 - 07:58",
            "label": "corner",
            "description": "Betis take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 07:36",
            "label": "",
            "description": "Daniel Ceballos (Betis) sends a lofted cross into the box which is headed clear. The ball goes behind for a corner. Betis will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 06:13",
            "label": "",
            "description": "Gareth Bale (Real Madrid) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 05:33",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "1 - 05:14",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries his luck from a long range free kick and fires the ball to the roof of the net, but Antonio Adan is alert and thwarts the effort. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 03:58",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Xavi Torres (Betis). Alejandro Hernandez saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "1 - 03:06",
            "label": "",
            "description": "Karim Benzema (Real Madrid) zig zags his way into the box and fires the ball towards the middle of the goal, but the goalkeeper makes a great reaction save to stop the effort."
        },
        {
            "gameTime": "1 - 01:54",
            "label": "soccer-ball",
            "description": "James Rodriguez showcases his great technique and produces a beautiful lofted cross into the box. Gareth Bale (Real Madrid) meets the cross and gets himself onto the scoresheet with a header down into the middle of the net. It's 1:0."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Betis will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alejandro Hernandez is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The host team were better throughout the game. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        }
    ],
    "gameAwayTeam": "Betis",
    "gameDate": "29/08/2015 - 23:30",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "5 - 0"
}