{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2016-12-03 - 17-30 Dortmund 4 - 1 B. Monchengladbach/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The hosts were superior today. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "corner",
            "description": "Christian Pulisic (Dortmund) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 43:04",
            "label": "substitution",
            "description": "It is time for a substitution. Emre Mor (Dortmund) is on for Ousmane Dembele."
        },
        {
            "gameTime": "2 - 42:50",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) receives a precise pass and is given time inside the box to send a promising strike towards the right post. Yann Sommer guesses his intention and denies him with a fine save. Dortmund force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 40:54",
            "label": "",
            "description": "Julian Weigl (Dortmund) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "2 - 40:41",
            "label": "",
            "description": "Andre Hahn (B. Monchengladbach) makes a strong challenge and Marco Fritz blows for a foul. Dortmund have a free kick."
        },
        {
            "gameTime": "2 - 39:21",
            "label": "",
            "description": "Dortmund are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 36:35",
            "label": "substitution",
            "description": "Andre Hahn (B. Monchengladbach) joins the action as a substitute, replacing Raffael."
        },
        {
            "gameTime": "2 - 32:55",
            "label": "substitution",
            "description": "Andre Schubert has decided to introduce fresh legs, with Fabian Johnson (B. Monchengladbach) replacing Thorgan Hazard."
        },
        {
            "gameTime": "2 - 32:51",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Marco Reus trots off the pitch and is replaced by Christian Pulisic (Dortmund)."
        },
        {
            "gameTime": "2 - 32:11",
            "label": "",
            "description": "The Dortmund players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "2 - 28:37",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 28:27",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) sends a cross into the box, but the opposition's defence clears the ball to safety. Dortmund force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 28:12",
            "label": "corner",
            "description": "The resulting corner from Raffael (B. Monchengladbach) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 27:51",
            "label": "substitution",
            "description": "Andre Schubert decides to make a substitution. Mahmoud Dahoud will be replaced by Jannik Vestergaard (B. Monchengladbach)."
        },
        {
            "gameTime": "2 - 27:35",
            "label": "",
            "description": "Lars Stindl (B. Monchengladbach) gets himself onto the end of the corner, but his header is blocked. The ball goes behind for a corner. B. Monchengladbach will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 27:16",
            "label": "corner",
            "description": "Raffael (B. Monchengladbach) will take the corner."
        },
        {
            "gameTime": "2 - 27:00",
            "label": "",
            "description": "Raffael (B. Monchengladbach) races towards goal but the defender gets back well to make a challenge. Corner kick. B. Monchengladbach will have an opportunity."
        },
        {
            "gameTime": "2 - 25:27",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 25:14",
            "label": "attendance",
            "description": "The attendance is 81360."
        },
        {
            "gameTime": "2 - 22:50",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Pierre Emerick Aubameyang (Dortmund) was set free in the area by Marco Reus and made no mistake with a lovely finish into the left side of the net. 4:1."
        },
        {
            "gameTime": "2 - 20:55",
            "label": "",
            "description": "Marc Bartra (Dortmund) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 20:47",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 19:37",
            "label": "corner",
            "description": "The corner from Marco Reus (Dortmund) is hurriedly cleared. Dortmund have a corner."
        },
        {
            "gameTime": "2 - 19:06",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) serves up a nice cross, but the defence clears the danger. The referee signals a corner kick to Dortmund."
        },
        {
            "gameTime": "2 - 18:39",
            "label": "soccer-ball",
            "description": "Goal! Marco Reus tees up Ousmane Dembele (Dortmund) on the edge of the box and he fires the ball into the bottom left corner. 4:1."
        },
        {
            "gameTime": "2 - 16:10",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 15:47",
            "label": "",
            "description": "Marco Reus (Dortmund) wriggles into space inside the box with excellent ball control, but his effort on goal is well blocked. The linesman points to the corner flag, Dortmund are going to take it."
        },
        {
            "gameTime": "2 - 15:30",
            "label": "corner",
            "description": "Marco Reus (Dortmund) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 15:10",
            "label": "",
            "description": "Julian Weigl (Dortmund) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. It will be a corner kick for Dortmund."
        },
        {
            "gameTime": "2 - 12:25",
            "label": "",
            "description": "Christoph Kramer (B. Monchengladbach) will take the free kick."
        },
        {
            "gameTime": "2 - 12:04",
            "label": "",
            "description": "Marco Fritz blows his whistle as Pierre Emerick Aubameyang (Dortmund) used excessive force in the tackle during an attack. A free kick is awarded to B. Monchengladbach."
        },
        {
            "gameTime": "2 - 09:10",
            "label": "",
            "description": "Roman Weidenfeller (Dortmund) will take the free kick."
        },
        {
            "gameTime": "2 - 08:35",
            "label": "",
            "description": "Andreas Christensen (B. Monchengladbach) is penalised for a foul. Marco Fritz had a clear view and blows his whistle. It's a free kick to Dortmund in a dangerous position."
        },
        {
            "gameTime": "2 - 08:29",
            "label": "corner",
            "description": "Raffael (B. Monchengladbach) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 08:06",
            "label": "",
            "description": "Raffael (B. Monchengladbach) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety. The ball is out of play. B. Monchengladbach win a corner kick."
        },
        {
            "gameTime": "2 - 04:34",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Marco Reus (Dortmund) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "2 - 01:54",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) will take the free kick."
        },
        {
            "gameTime": "2 - 01:46",
            "label": "",
            "description": "Christoph Kramer (B. Monchengladbach) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Marco Fritz blows for the foul but keeps his cards in his pocket on this occasion. Dortmund win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Both sides have been very active in the first half, providing the fans with an exciting show. The home side is dominant and dictating the tempo of the game, mainly because of their work rate and accurate passing. The home team are playing possession football, while the away team look to find a weakness in the opposition's defence mainly with their rapid counter attacks."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:53",
            "label": "",
            "description": "Sokratis (Dortmund) will take the free kick."
        },
        {
            "gameTime": "1 - 44:37",
            "label": "",
            "description": "Lars Stindl (B. Monchengladbach) handles the ball and everyone in the stadium shouts 'handball'. Dortmund are awarded a free kick."
        },
        {
            "gameTime": "1 - 42:32",
            "label": "",
            "description": "Dortmund hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 38:55",
            "label": "",
            "description": "Christoph Kramer (B. Monchengladbach) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 38:53",
            "label": "",
            "description": "A player from Dortmund brings down an opponent and commits a foul. B. Monchengladbach have a free kick."
        },
        {
            "gameTime": "1 - 37:14",
            "label": "",
            "description": "Marc Bartra (Dortmund) covers his face with his hands after wasting a promising chance. He takes the rebound on the edge of the box but blazes the ball high over the crossbar."
        },
        {
            "gameTime": "1 - 36:26",
            "label": "",
            "description": "Raffael (B. Monchengladbach) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "1 - 35:55",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Nuri Sahin as he is replaced by Julian Weigl (Dortmund)."
        },
        {
            "gameTime": "1 - 35:29",
            "label": "y-card",
            "description": "Lukasz Piszczek (Dortmund) takes his opponent down and receives a yellow card from the referee."
        },
        {
            "gameTime": "1 - 33:29",
            "label": "",
            "description": "Matthias Ginter (Dortmund) receives a fine cross inside the box and attempts to score a goal, but his strike flies just a few inches over the bar."
        },
        {
            "gameTime": "1 - 33:19",
            "label": "corner",
            "description": "Marco Reus (Dortmund) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Marco Reus (Dortmund). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate. Dortmund have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 31:34",
            "label": "",
            "description": "Andreas Christensen (B. Monchengladbach) will take the free kick."
        },
        {
            "gameTime": "1 - 31:07",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) brings his opponent down. Marco Fritz has a clear sight of it and blows his whistle for a foul. B. Monchengladbach are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 26:16",
            "label": "",
            "description": "Flag up against Oscar Wendt (B. Monchengladbach). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 25:23",
            "label": "",
            "description": "Christoph Kramer (B. Monchengladbach) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) was trying to get to the ball but clattered into the legs of the opponent as well. Marco Fritz blows his whistle for an infringement. B. Monchengladbach are awarded the free kick."
        },
        {
            "gameTime": "1 - 22:55",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 22:33",
            "label": "",
            "description": "An attempted cross from Marco Reus (Dortmund) is cleared. Dortmund earn a corner."
        },
        {
            "gameTime": "1 - 21:30",
            "label": "",
            "description": "Yann Sommer (B. Monchengladbach) takes a direct free kick."
        },
        {
            "gameTime": "1 - 20:39",
            "label": "",
            "description": "Marco Fritz blows his whistle after Marcel Schmelzer (Dortmund) brings one of his opponents down with a strong tackle. B. Monchengladbach earn a free kick."
        },
        {
            "gameTime": "1 - 18:46",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 14:55",
            "label": "soccer-ball",
            "description": "Lukasz Piszczek (Dortmund) connects with the ball from the resulting corner and places a precise header past the stranded goalkeeper and into the top right corner. The opposing players are staring at each other, unable to understand what happened. Who will take the blame for that one? Lukasz Piszczek (Dortmund) has a reason to celebrate!"
        },
        {
            "gameTime": "1 - 14:46",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 14:35",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) puts a cross into the box from the free kick but it's cleared. Dortmund win a corner."
        },
        {
            "gameTime": "1 - 13:37",
            "label": "y-card",
            "description": "What was Tobias Strobl (B. Monchengladbach) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "1 - 11:56",
            "label": "",
            "description": "Dortmund string together a series of short passes."
        },
        {
            "gameTime": "1 - 09:38",
            "label": "",
            "description": "The ball is behind the touchline and Dortmund will take a throw in."
        },
        {
            "gameTime": "1 - 06:47",
            "label": "soccer-ball",
            "description": "Goal! Marco Reus slips it to Pierre Emerick Aubameyang (Dortmund) on the edge of the box and he finds the right side of the net with a great effort. The score is 4:1."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "soccer-ball",
            "description": "Raffael (B. Monchengladbach) is in the right place at the right time and perfectly hits a rebound into the bottom left corner."
        },
        {
            "gameTime": "1 - 03:35",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) tries to send a low pass into the box, but it's blocked and cleared."
        },
        {
            "gameTime": "1 - 01:59",
            "label": "",
            "description": "Thorgan Hazard (B. Monchengladbach) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "",
            "description": "Nuri Sahin (Dortmund) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again. B. Monchengladbach are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 00:53",
            "label": "",
            "description": "Marco Reus (Dortmund) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Marco Fritz."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "B. Monchengladbach have earned only 13 points this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "6:0 was the biggest win for Dortmund this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang from Dortmund will look to add to his goal tally, he has netted 13 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The hosts were superior today. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "B. Monchengladbach",
    "gameDate": "03/12/2016 - 17:30",
    "gameHomeTeam": "Dortmund",
    "gameScore": "4 - 1"
}