{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-09-10 - 21-45 Palermo 0 - 3 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:16",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. We witnessed the away side dominate today's game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 46:01",
            "label": "",
            "description": "Napoli are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "2 - 43:51",
            "label": "",
            "description": "Allan (Napoli) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 42:30",
            "label": "",
            "description": "Ilija Nestorovski (Palermo) takes a first time shot from inside the box, but his own player gets in the way and blocks it."
        },
        {
            "gameTime": "2 - 41:19",
            "label": "",
            "description": "Ilija Nestorovski (Palermo) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 39:17",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 38:56",
            "label": "",
            "description": "The ball is cleared after Cristian Maggio (Napoli) attempted to dribble past an opposing player. Now Napoli have a corner."
        },
        {
            "gameTime": "2 - 38:30",
            "label": "substitution",
            "description": "Substitution. Accursio Bentivegna (Palermo) has come on for Roland Sallai."
        },
        {
            "gameTime": "2 - 37:49",
            "label": "",
            "description": "Allan (Napoli) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 35:45",
            "label": "",
            "description": "Napoli keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "2 - 35:09",
            "label": "",
            "description": "Davide Massa interrupts the game. One of the players from Palermo won the ball, but his effort is adjudged unfair."
        },
        {
            "gameTime": "2 - 34:02",
            "label": "injury",
            "description": "The game is interrupted now, Alessandro Gazzi (Palermo) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 32:35",
            "label": "corner",
            "description": "The resulting corner from Faouzi Ghoulam (Napoli) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 31:51",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) receives a precise pass and is given time inside the box to send a promising strike towards the bottom right corner. Josip Posavec guesses his intention and denies him with a fine save. The ball is out of play. Napoli win a corner kick."
        },
        {
            "gameTime": "2 - 28:22",
            "label": "",
            "description": "Bruno Henrique (Palermo) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 27:52",
            "label": "substitution",
            "description": "The referee signals a substitution. Allan (Napoli) is brought on as a substitute for Piotr Zielinski."
        },
        {
            "gameTime": "2 - 26:41",
            "label": "",
            "description": "Edoardo Goldaniga (Palermo) makes a strong challenge and Davide Massa blows for a foul. Napoli are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 24:56",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to substitute Jose Callejon and he is replaced by Dries Mertens (Napoli)."
        },
        {
            "gameTime": "2 - 20:10",
            "label": "substitution",
            "description": "Substitution. Manolo Gabbiadini (Napoli) receives a signal from the referee and is now allowed to enter the pitch as Arkadiusz Milik walks off."
        },
        {
            "gameTime": "2 - 19:45",
            "label": "soccer-ball",
            "description": "Jose Callejon (Napoli) latches on to a brilliant pass and hits a poor shot towards the middle of the goal, but the ball goes into the back of the net after the goalkeeper makes a howler!"
        },
        {
            "gameTime": "2 - 17:53",
            "label": "",
            "description": "Jorginho (Napoli) is unable to feed a through ball into the path of his teammates."
        },
        {
            "gameTime": "2 - 14:49",
            "label": "corner",
            "description": "Roland Sallai (Palermo) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 14:40",
            "label": "",
            "description": "Oscar Hiljemark (Palermo) crosses the ball into the box, but one of the defending players averts the threat. Palermo have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 14:09",
            "label": "corner",
            "description": "Alessandro Diamanti (Palermo) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 13:40",
            "label": "",
            "description": "Haitam Aleesami (Palermo) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 12:14",
            "label": "",
            "description": "Bruno Henrique (Palermo) rises above the defence inside the box, but his header flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 10:38",
            "label": "substitution",
            "description": "Substitution. Bruno Henrique (Palermo) on for Mato Jajalo."
        },
        {
            "gameTime": "2 - 10:21",
            "label": "injury",
            "description": "Faouzi Ghoulam (Napoli) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 08:42",
            "label": "",
            "description": "Jose Callejon (Napoli) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 07:52",
            "label": "",
            "description": "Wow, what an escape. Lorenzo Insigne (Napoli) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "2 - 05:40",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Lorenzo Insigne finds Jose Callejon (Napoli), who jumps highest and steers a close range header into the right side of the goal. His effort was both strong and precise, and Josip Posavec had no chance of stopping that. 0:0."
        },
        {
            "gameTime": "2 - 05:16",
            "label": "",
            "description": "sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 01:23",
            "label": "soccer-ball",
            "description": "A superb goal from great team play! Marek Hamsik (Napoli) latches on to a perfect pass and fires an excellent shot into the top left corner. There is nothing a goalkeeper can do about shots like that."
        },
        {
            "gameTime": "2 - 00:28",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Roberto De Zerbi gives a chance to Ilija Nestorovski (Palermo) and Carlos Embalo is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Davide Massa starts the second half."
        },
        {
            "gameTime": "1 - 45:01",
            "label": "",
            "description": "We are watching a run of the mill game with only a few moments to ignite the crowd. The players surely can surely perform better, they just need to motivate themselves. The visitors were superior in their performance through the first half. They were more active and precise. The home side focuses on defending and lets the opposition enjoy possession of the ball."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 43:42",
            "label": "",
            "description": "That was close by ! He receives a pass on the edge of the box and shoots, but the ball goes by a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 42:04",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "1 - 41:22",
            "label": "",
            "description": "Carlos Embalo (Palermo) commits a rough foul. Davide Massa stops the game and makes a call. Napoli will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 40:07",
            "label": "",
            "description": "Marek Hamsik (Napoli) climbs high to connect with a perfect cross and produces a header that goes not far wide of the left post."
        },
        {
            "gameTime": "1 - 40:02",
            "label": "corner",
            "description": "Jose Callejon (Napoli) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 39:39",
            "label": "",
            "description": "Marek Hamsik (Napoli) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. Napoli force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 39:16",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "1 - 37:31",
            "label": "",
            "description": "Marek Hamsik (Napoli) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 36:42",
            "label": "",
            "description": "Cristian Maggio (Napoli) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "1 - 35:24",
            "label": "",
            "description": "Lorenzo Insigne is the provider with a good cross and Jose Callejon (Napoli) shows great determination to get to the ball on the edge of the box, but he blazes it high over the bar."
        },
        {
            "gameTime": "1 - 34:31",
            "label": "",
            "description": "Cristian Maggio (Napoli) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 32:49",
            "label": "",
            "description": "Roland Sallai (Palermo) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 32:20",
            "label": "",
            "description": "A long pass, executed by Lorenzo Insigne (Napoli), missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 31:04",
            "label": "",
            "description": "That didn't go as planned! Mato Jajalo (Palermo) tried his luck from the edge of the box, but his effort low towards the middle of the goal was too weak to get past Pepe Reina, who easily kept it out."
        },
        {
            "gameTime": "1 - 30:23",
            "label": "",
            "description": "The free kick is taken by Alessandro Diamanti (Palermo), but ball is cleared."
        },
        {
            "gameTime": "1 - 29:21",
            "label": "",
            "description": "Carlos Embalo (Palermo) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 28:36",
            "label": "",
            "description": "Marek Hamsik (Napoli) finds himself in an offside position and the referee stops play after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 27:40",
            "label": "",
            "description": "Jorginho (Napoli) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 25:08",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) sprays a pass out to Arkadiusz Milik, but he can't beat his man inside the box."
        },
        {
            "gameTime": "1 - 23:27",
            "label": "",
            "description": "Flag goes up against Alessandro Diamanti (Palermo) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 21:31",
            "label": "",
            "description": "A pass by Jose Callejon (Napoli) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 19:51",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) fashions a shot from the edge of the box after receiving an accurate pass. Josip Posavec makes a stunning save to stop the effort from flying into the bottom left corner."
        },
        {
            "gameTime": "1 - 19:00",
            "label": "",
            "description": "sends a cross in and finds Jose Callejon (Napoli) inside the box, but one of the defenders steps in and clears the danger."
        },
        {
            "gameTime": "1 - 16:32",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Lorenzo Insigne (Napoli), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "1 - 15:33",
            "label": "corner",
            "description": "The resulting corner from Jose Callejon (Napoli) comes to nothing."
        },
        {
            "gameTime": "1 - 14:25",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) receives a pass inside the box, controls the ball and drills it towards the left post. Unfortunately for him, Josip Posavec makes a great save to stop his effort."
        },
        {
            "gameTime": "1 - 11:41",
            "label": "",
            "description": "CHANCE! Arkadiusz Milik (Napoli) picks up a perfect pass inside the box, makes himself some space for a shot, but his effort goes just over the crossbar."
        },
        {
            "gameTime": "1 - 10:11",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 08:24",
            "label": "",
            "description": "Palermo are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 06:08",
            "label": "",
            "description": "A player from Palermo commits a rough challenge. Davide Massa blows for a foul and keeps the game under control. A free kick has been awarded to Napoli."
        },
        {
            "gameTime": "1 - 05:24",
            "label": "",
            "description": "is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 03:52",
            "label": "",
            "description": "Oscar Hiljemark (Palermo) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "1 - 02:45",
            "label": "",
            "description": "Long passes, short passes and one two passes. Napoli are showcasing great team work by keeping possession and producing pin point passes from player to player. The opposition's players are finding it very difficult to intercept at the moment."
        },
        {
            "gameTime": "1 - 00:31",
            "label": "",
            "description": "Marek Hamsik (Napoli) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Palermo will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Davide Massa will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last 5 games between these two teams have been goal rich, with an average of 3.0 goals per game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli have completed a big transfer by signing ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Palermo have signed: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. We witnessed the away side dominate today's game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "10/09/2016 - 21:45",
    "gameHomeTeam": "Palermo",
    "gameScore": "0 - 3"
}