{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-11-07 - 18-00 Manchester United 2 - 0 West Brom/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The home side dominated today's game. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        },
        {
            "gameTime": "2 - 49:27",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "",
            "description": "The resulting free kick from James McClean (West Brom) ends up in the gloves of the keeper."
        },
        {
            "gameTime": "2 - 45:56",
            "label": "soccer-ball",
            "description": "Juan Manuel Mata (Manchester United) sends Glyn Oliver Myhill the wrong way and fires the penalty into the middle of the goal!"
        },
        {
            "gameTime": "2 - 45:44",
            "label": "r-card",
            "description": "Gareth McAuley (West Brom) can have an early bath after receiving a red card from the referee!"
        },
        {
            "gameTime": "2 - 45:40",
            "label": "",
            "description": "Michael Dean blows his whistle after Bastian Schweinsteiger (Manchester United) brings one of his opponents down with a strong tackle. A free kick is awarded to West Brom."
        },
        {
            "gameTime": "2 - 45:40",
            "label": "penalty",
            "description": "Gareth McAuley (West Brom) trips an opposition player and Michael Dean signals a foul. PENALTY AWARDED to Manchester United!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 42:25",
            "label": "attendance",
            "description": "The attendance for today's match is 75410."
        },
        {
            "gameTime": "2 - 40:53",
            "label": "",
            "description": "Anthony Martial plays a pass to Mata (Manchester United), but he fails to get a decent shot away from inside the box and the ball goes high over the bar."
        },
        {
            "gameTime": "2 - 40:29",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Mata (Manchester United) takes it short."
        },
        {
            "gameTime": "2 - 40:15",
            "label": "",
            "description": "Mata (Manchester United) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Manchester United have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 39:36",
            "label": "substitution",
            "description": "Substitution. Callum McManaman (West Brom) in, Chris Brunt out."
        },
        {
            "gameTime": "2 - 38:39",
            "label": "",
            "description": "Mata (Manchester United) takes a short free kick."
        },
        {
            "gameTime": "2 - 38:08",
            "label": "",
            "description": "Claudio Yacob (West Brom) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation. Manchester United are awarded the free kick."
        },
        {
            "gameTime": "2 - 37:35",
            "label": "",
            "description": "James McClean (West Brom) latches on to a precise lofted cross inside the box, controls the ball and unleashes a fine strike towards the middle of the goal. His dangerous effort is blocked by David de Gea, who makes a glorious save!"
        },
        {
            "gameTime": "2 - 36:44",
            "label": "substitution",
            "description": "The referee signals a substitution. Ander Herrera (Manchester United) is brought on as a substitute for Wayne Rooney."
        },
        {
            "gameTime": "2 - 35:48",
            "label": "",
            "description": "Jesse Lingard (Manchester United) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 34:55",
            "label": "corner",
            "description": "Mata (Manchester United) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 34:43",
            "label": "",
            "description": "Daley Blind (Manchester United) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Manchester United have a corner."
        },
        {
            "gameTime": "2 - 34:13",
            "label": "corner",
            "description": "Wayne Rooney (Manchester United) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 33:58",
            "label": "",
            "description": "The ball is cleared after Anthony Martial (Manchester United) attempted to dribble past an opposing player. The ball goes out of play. Manchester United are awarded a corner kick."
        },
        {
            "gameTime": "2 - 33:37",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Stephane Sessegnon (West Brom)."
        },
        {
            "gameTime": "2 - 31:59",
            "label": "",
            "description": "Michael Carrick (Manchester United) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 30:55",
            "label": "substitution",
            "description": "The manager makes a subsitution with Cameron Borthwick Jackson (Manchester United) coming on for Marcos Rojo."
        },
        {
            "gameTime": "2 - 30:38",
            "label": "",
            "description": "Jesse Lingard (Manchester United) slaloms his way past challenges, but an opposing player does well to get the ball away. The referee and the linesman both signal a throw in for Manchester United."
        },
        {
            "gameTime": "2 - 28:51",
            "label": "",
            "description": "Saido Berahino (West Brom) misses a good chance to score. A perfect cross into the box finds Saido Berahino (West Brom) who rises for a header, but he sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 27:30",
            "label": "",
            "description": "Jesse Lingard (Manchester United) dances his way past two defending players and gets to the edge of the box from where he unleashes a shot that goes well wide of the right post."
        },
        {
            "gameTime": "2 - 26:51",
            "label": "",
            "description": "Jonny Evans (West Brom) plants a header from the edge of the box after a nice cross from the free kick. It lacks accuracy and the ball misses the left post by a few inches."
        },
        {
            "gameTime": "2 - 26:32",
            "label": "substitution",
            "description": "Tony Pulis has decided to make a change. Rickie Lambert (West Brom) replaces Jose Rondon."
        },
        {
            "gameTime": "2 - 26:02",
            "label": "substitution",
            "description": "James Morrison comes off the pitch to be replaced by Saido Berahino (West Brom)."
        },
        {
            "gameTime": "2 - 25:35",
            "label": "",
            "description": "Michael Dean interrupts the game for a tactical foul by Marcos Rojo (Manchester United). It's a free kick to West Brom, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "2 - 25:08",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by James Morrison (West Brom) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 24:01",
            "label": "",
            "description": "The Manchester United players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "2 - 21:56",
            "label": "",
            "description": "Wayne Rooney (Manchester United) receives a pass and fires a shot in from long range, but it's blocked."
        },
        {
            "gameTime": "2 - 20:00",
            "label": "",
            "description": "Bastian Schweinsteiger (Manchester United) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "2 - 19:58",
            "label": "y-card",
            "description": "Chris Brunt (West Brom) commits a nasty foul by bringing down his opponent."
        },
        {
            "gameTime": "2 - 18:53",
            "label": "",
            "description": "A fine lofted pass into the box, sent by James McClean (West Brom), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 16:43",
            "label": "substitution",
            "description": "It is time for a substitution. Phil Jones (Manchester United) is on for Ashley Young."
        },
        {
            "gameTime": "2 - 16:00",
            "label": "",
            "description": "Craig Dawson (West Brom) takes a direct free kick."
        },
        {
            "gameTime": "2 - 15:14",
            "label": "y-card",
            "description": "Marcos Rojo (Manchester United) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "",
            "description": "David de Gea (Manchester United) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "2 - 14:33",
            "label": "y-card",
            "description": "Jose Rondon (West Brom) has tested the patience of referee Michael Dean and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 13:29",
            "label": "",
            "description": "Michael Carrick (Manchester United) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "2 - 12:38",
            "label": "",
            "description": "The Manchester United players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 10:05",
            "label": "",
            "description": "The ball is cleared after Stephane Sessegnon (West Brom) attempted to dribble past an opposing player. The ball goes out of play and Manchester United will have a goal kick."
        },
        {
            "gameTime": "2 - 09:38",
            "label": "",
            "description": "Jonny Evans (West Brom) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 09:20",
            "label": "",
            "description": "A player from Manchester United commits an attacking foul. The referee blows his whistle. It's a free kick to West Brom, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 06:45",
            "label": "soccer-ball",
            "description": "Goal! Jesse Lingard (Manchester United) picks up the ball from a rebound and from the edge of the box he unleashes a shot inside the right post. It's 1:0."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "",
            "description": "Anthony Martial (Manchester United) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 04:34",
            "label": "",
            "description": "Jose Rondon (West Brom) looks to break free, but an opposing player clears the ball away. The ball has crossed the sideline. West Brom are taking a throw in."
        },
        {
            "gameTime": "2 - 04:10",
            "label": "",
            "description": "Michael Dean interrupts the game for a tactical foul by Chris Smalling (Manchester United)."
        },
        {
            "gameTime": "2 - 03:44",
            "label": "",
            "description": "Wayne Rooney (Manchester United) tries to find Anthony Martial with a clever through ball from the corner of the box, but the defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "2 - 01:37",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "2 - 01:07",
            "label": "",
            "description": "Gareth McAuley (West Brom) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 00:48",
            "label": "",
            "description": "Foul! Marcos Rojo (Manchester United) is penalised for pulling back his opponent."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "The players are likely to put the fans to sleep with this performance rather than receiving any vociferous support. Let's hope we are about to see an improvement in the second half. The hosts dominated much of the first period. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 48:03",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 47:26",
            "label": "",
            "description": "Chris Brunt (West Brom) hammered the ball from a long range free kick only into the defensive wall."
        },
        {
            "gameTime": "1 - 46:18",
            "label": "",
            "description": "Chris Smalling (Manchester United) pulls the jersey of one of the opposition players and Michael Dean blows his whistle for a foul. West Brom win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:06",
            "label": "",
            "description": "Anthony Martial (Manchester United) collects a rebound and produces a mid range attempt. The ball goes to the middle of the target, but Glyn Oliver Myhill keeps it out."
        },
        {
            "gameTime": "1 - 43:34",
            "label": "",
            "description": "Wayne Rooney (Manchester United) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "1 - 42:01",
            "label": "y-card",
            "description": "Craig Dawson (West Brom) is shown a yellow card by the referee."
        },
        {
            "gameTime": "1 - 41:18",
            "label": "corner",
            "description": "The resulting corner from Wayne Rooney (Manchester United) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 40:51",
            "label": "",
            "description": "Jesse Lingard (Manchester United) collects a pass and has an effort from distance which is blocked. The ball is out of play. Manchester United win a corner kick."
        },
        {
            "gameTime": "1 - 40:18",
            "label": "",
            "description": "Jesse Lingard (Manchester United) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "1 - 40:02",
            "label": "",
            "description": "Anthony Martial (Manchester United) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 37:40",
            "label": "",
            "description": "Mata (Manchester United) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 37:15",
            "label": "",
            "description": "Wayne Rooney (Manchester United) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 34:48",
            "label": "corner",
            "description": "Chris Brunt (West Brom) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 34:32",
            "label": "",
            "description": "Darren Fletcher (West Brom) whips the ball into the box and Jose Rondon takes a perfect touch to control it, but one of the defenders does well to intercept. West Brom will take a corner kick."
        },
        {
            "gameTime": "1 - 33:42",
            "label": "",
            "description": "The foul by Wayne Rooney (Manchester United) was seen by Michael Dean who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 31:56",
            "label": "",
            "description": "Marcos Rojo (Manchester United) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 30:38",
            "label": "",
            "description": "Wayne Rooney (Manchester United) latches on to a cross on the edge of the box and fires a shot at goal, but his effort was blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 29:57",
            "label": "",
            "description": "Ashley Young (Manchester United) fails to find a teammate across the pitch with a long ball. The ball is off of the pitch and it's a goal kick for West Brom."
        },
        {
            "gameTime": "1 - 29:05",
            "label": "",
            "description": "Bastian Schweinsteiger (Manchester United) strikes the rebound, but it goes well over the bar."
        },
        {
            "gameTime": "1 - 28:35",
            "label": "corner",
            "description": "Wayne Rooney (Manchester United) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 28:20",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) produces a dangerous lofted cross into the box which is intercepted. The linesman points to the corner flag, Manchester United are going to take it."
        },
        {
            "gameTime": "1 - 26:46",
            "label": "",
            "description": "The ball spins up and hits the hand of Anthony Martial (Manchester United) after he fails to control it and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 25:58",
            "label": "",
            "description": "Jesse Lingard (Manchester United) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 24:15",
            "label": "",
            "description": "Ashley Young (Manchester United) commits a foul during an attacking move."
        },
        {
            "gameTime": "1 - 23:28",
            "label": "",
            "description": "Bastian Schweinsteiger (Manchester United) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 22:37",
            "label": "",
            "description": "Michael Carrick (Manchester United) sends a long ball in, but Glyn Oliver Myhill comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 19:56",
            "label": "",
            "description": "Stephane Sessegnon (West Brom) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 19:50",
            "label": "",
            "description": "Jose Rondon (West Brom) comes close to scoring! He meets a lovely lofted pass from James McClean, but sends his close range header way wide of the left post."
        },
        {
            "gameTime": "1 - 18:37",
            "label": "",
            "description": "The free kick into the penalty area from Craig Dawson (West Brom) is cleared."
        },
        {
            "gameTime": "1 - 18:10",
            "label": "",
            "description": "Marcos Rojo (Manchester United) is penalised for holding. Michael Dean signals a set piece. A free kick has been awarded to West Brom."
        },
        {
            "gameTime": "1 - 16:01",
            "label": "",
            "description": "Wayne Rooney plays a lovely pass into Mata (Manchester United), but he can't find the target. His strike from inside the box goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 14:48",
            "label": "",
            "description": "Anthony Martial (Manchester United) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 14:25",
            "label": "",
            "description": "Michael Carrick (Manchester United) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "1 - 14:04",
            "label": "",
            "description": "Chris Brunt (West Brom) launches into a thunderous tackle on his opponent and the referee blows his whistle for a foul. There is a free kick near the sideline to Manchester United."
        },
        {
            "gameTime": "1 - 12:00",
            "label": "",
            "description": "Wayne Rooney (Manchester United) collects a pass and strikes from about 23 metres out. It's a poor attempt which flies well over the bar."
        },
        {
            "gameTime": "1 - 11:25",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 09:39",
            "label": "",
            "description": "Marcos Rojo (Manchester United) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 08:17",
            "label": "",
            "description": "Jose Rondon (West Brom) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 06:18",
            "label": "",
            "description": "Chris Smalling (Manchester United) sends a long ball in, but Glyn Oliver Myhill comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 04:20",
            "label": "",
            "description": "Stephane Sessegnon (West Brom) commits a foul and Michael Dean immediately signals a free kick."
        },
        {
            "gameTime": "1 - 03:07",
            "label": "",
            "description": "Neat passing move from Manchester United in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 01:22",
            "label": "",
            "description": "Daley Blind (Manchester United) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "1 - 00:29",
            "label": "",
            "description": "Dangerous play by James McClean (West Brom). Michael Dean blows his whistle for a foul. Manchester United have been awarded a free kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Manchester United will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Michael Dean will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The home side dominated today's game. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        }
    ],
    "gameAwayTeam": "West Brom",
    "gameDate": "07/11/2015 - 18:00",
    "gameHomeTeam": "Manchester United",
    "gameScore": "2 - 0"
}