{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-04-24 - 21-45 Pescara 1 - 4 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:27",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 41:08",
            "label": "",
            "description": "Cristiano Biraghi (Pescara) takes a mid range free kick and his beautiful strike only rattles the right post."
        },
        {
            "gameTime": "2 - 40:05",
            "label": "",
            "description": "Massimiliano Irrati interrupts the game. One of the players from AS Roma won the ball, but his effort is adjudged unfair. It's a free kick to Pescara, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 37:12",
            "label": "soccer-ball",
            "description": "Goal 1:4! Ledian Memushaj laid the ball off to Ahmad Benali (Pescara), who shot from close range low into the back of the net, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 36:17",
            "label": "substitution",
            "description": "That's the end of the game for Leandro Paredes, who is replaced by Diego Perotti (AS Roma)."
        },
        {
            "gameTime": "2 - 34:59",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to substitute Emerson and he is replaced by Juan Jesus (AS Roma)."
        },
        {
            "gameTime": "2 - 34:55",
            "label": "substitution",
            "description": "Here comes a substitution. Andrea Coda is given a rest as he is replaced by Michele Fornasier (Pescara)."
        },
        {
            "gameTime": "2 - 32:52",
            "label": "corner",
            "description": "The resulting corner, taken by Ahmad Benali (Pescara), comes to nothing."
        },
        {
            "gameTime": "2 - 32:37",
            "label": "corner",
            "description": "Ahmad Benali (Pescara) swings in the corner, but it's comfortably cleared away. Pescara earn a corner."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "",
            "description": "Pescara are passing the ball across the pitch and keep possession. However, an opponent intercepts a pass and the situation changes. Pescara win a corner."
        },
        {
            "gameTime": "2 - 31:21",
            "label": "corner",
            "description": "Valerio Verre (Pescara) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 30:36",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Valerio Verre (Pescara). The ball goes out of play and Pescara have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 28:37",
            "label": "",
            "description": "The linesman raises his flag for offside before Cristiano Biraghi (Pescara) heads on."
        },
        {
            "gameTime": "2 - 25:43",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to make a change. Clement Grenier (AS Roma) replaces Edin Dzeko."
        },
        {
            "gameTime": "2 - 24:12",
            "label": "",
            "description": "Flag goes up against Stephan El Shaarawy (AS Roma) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 21:54",
            "label": "substitution",
            "description": "It's time for a substitution. Valerio Verre (Pescara) comes on in place of Mamadou Coulibaly."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 16:23."
        },
        {
            "gameTime": "2 - 17:24",
            "label": "",
            "description": "Leandro Paredes (AS Roma) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "2 - 14:50",
            "label": "soccer-ball",
            "description": "Stephan El Shaarawy produces a sweet pass and picks out Mohamed Salah (AS Roma) inside the box. He quickly takes a shot which goes into the bottom right corner and leaves the goalkeeper helpless. He makes it 0:4!"
        },
        {
            "gameTime": "2 - 13:29",
            "label": "corner",
            "description": "Gianluca Caprari (Pescara) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 13:15",
            "label": "corner",
            "description": "Ledian Memushaj (Pescara) takes the corner kick but the ball only finds the head of an opponent. The ball is out of play. Pescara win a corner kick."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "",
            "description": "Pescara are just stroking the ball across the park now, but the defence is doing very well breaking up their possession. The referee and one of his assistants signal for a corner kick to Pescara."
        },
        {
            "gameTime": "2 - 11:01",
            "label": "",
            "description": "What a chance that is! Edin Dzeko (AS Roma) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 08:57",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 07:38",
            "label": "",
            "description": "AS Roma move the ball around well as they wait for an opportunity to shoot, but the attack is halted as they lose possession. It will be a corner kick for AS Roma."
        },
        {
            "gameTime": "2 - 06:27",
            "label": "",
            "description": "Edin Dzeko (AS Roma) misses a good chance to score. An inch perfect cross into the box finds Edin Dzeko (AS Roma) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 04:55",
            "label": "",
            "description": "What a chance that is! Stephan El Shaarawy (AS Roma) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 03:55",
            "label": "",
            "description": "Ahmad Benali (Pescara) latches on to an accurate pass on the edge of the box and immediately unleashes a shot which is wide of the mark."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "soccer-ball",
            "description": "Goal! Stephan El Shaarawy slips it to Mohamed Salah (AS Roma) on the edge of the box and he finds the left side of the net with a great effort. The score is 0:3."
        },
        {
            "gameTime": "2 - 01:44",
            "label": "",
            "description": "Leandro Paredes (AS Roma) receives a pass and decides to smash the ball from long range. His poor effort sails well wide of the left post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Zdenek Zeman makes a half time substitution. Alessandro Bruno (Pescara) comes on in place of Sulley Muntari."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:12",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Massimiliano Irrati has ended it."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "soccer-ball",
            "description": "Goal Radja Nainggolan (AS Roma)! Radja Nainggolan (AS Roma) was put through by Edin Dzeko and he showed brilliant composure inside the box to fire into the bottom left corner. 0:2."
        },
        {
            "gameTime": "1 - 43:55",
            "label": "soccer-ball",
            "description": "Goal! Stephan El Shaarawy puts the ball on a plate for Kevin Strootman (AS Roma), who scores with a simple close range finish. It's 0:1."
        },
        {
            "gameTime": "1 - 43:05",
            "label": "",
            "description": "The flag is raised and Mohamed Salah (AS Roma) is offside again, not for the first time today."
        },
        {
            "gameTime": "1 - 39:34",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Sulley Muntari (Pescara) was quite harsh and Massimiliano Irrati didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 36:59",
            "label": "y-card",
            "description": "Cristiano Biraghi (Pescara) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "1 - 36:11",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 35:45",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Antonio Rudiger (AS Roma), is intercepted by the opposition's defence. The referee and his assistant both point at the corner flag. AS Roma will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 35:08",
            "label": "corner",
            "description": "Ledian Memushaj (Pescara) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 34:30",
            "label": "",
            "description": "Ledian Memushaj (Pescara) sends a cross into the box, but the opposition's defence clears the ball to safety. The referee points to the corner flag and Pescara will take a corner."
        },
        {
            "gameTime": "1 - 32:53",
            "label": "",
            "description": "Mohamed Salah (AS Roma) latches on to an accurate pass on the edge of the box and immediately unleashes a shot which is wide of the mark. The ball is off of the pitch and it's a goal kick for Pescara."
        },
        {
            "gameTime": "1 - 30:28",
            "label": "corner",
            "description": "Ledian Memushaj (Pescara) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 30:21",
            "label": "corner",
            "description": "Jean Christophe Bahebeck (Pescara) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear. The ball goes out of play. Pescara are awarded a corner kick."
        },
        {
            "gameTime": "1 - 29:49",
            "label": "",
            "description": "Jean Christophe Bahebeck (Pescara) goes on a weaving run through the defence and gets within shooting range but his effort is blocked. The ball is out of play and Pescara manage to earn a corner."
        },
        {
            "gameTime": "1 - 28:21",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Mohamed Salah (AS Roma) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "1 - 28:02",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) makes an overly aggressive challenge and Massimiliano Irrati blows his whistle for a foul. Pescara have been awarded a free kick."
        },
        {
            "gameTime": "1 - 26:28",
            "label": "",
            "description": "The linesman signals that Mohamed Salah (AS Roma) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 23:50",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 22:23",
            "label": "",
            "description": "AS Roma play a few nice passes from player to player, but their possession doesn't last long as an opposition player intercepts a pass. The ball goes out for a corner. AS Roma can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 21:51",
            "label": "",
            "description": "Flag up against Gianluca Caprari (Pescara). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 20:47",
            "label": "",
            "description": "The game is interrupted as Stephan El Shaarawy (AS Roma) is flagged offside."
        },
        {
            "gameTime": "1 - 19:53",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) expertly controls a neat clever pass inside the box, but his effort crashes against the crossbar! What an opportunity that was!"
        },
        {
            "gameTime": "1 - 18:39",
            "label": "",
            "description": "Kevin Strootman (AS Roma) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the left post."
        },
        {
            "gameTime": "1 - 17:18",
            "label": "",
            "description": "Edin Dzeko (AS Roma) picks up the rebound inside the penalty area and drills a good shot to the middle of the goal. Vincenzo Fiorillo shows how quick his reflexes are and dives superbly to stop the effort. What a save but what a wasted opportunity!"
        },
        {
            "gameTime": "1 - 16:42",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 15:35",
            "label": "",
            "description": "The ball is cleared after Kevin Strootman (AS Roma) attempted to dribble past an opposing player. AS Roma force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 13:48",
            "label": "",
            "description": "Edin Dzeko (AS Roma) jumps for a cross and produces a fine header from near the penalty spot, but it goes a whisker over the bar! What a huge opportunity!"
        },
        {
            "gameTime": "1 - 11:53",
            "label": "",
            "description": "Leandro Paredes (AS Roma) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort. The ball is out of play. AS Roma will have a throw in."
        },
        {
            "gameTime": "1 - 09:23",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) latches onto a brilliant cross and fires the ball towards goal, but his shot goes high over the crossbar."
        },
        {
            "gameTime": "1 - 07:58",
            "label": "",
            "description": "Leandro Paredes (AS Roma) receives a precise pass and threatens the keeper with a long range shot. His attempt goes miles wide of the left post."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Gianluca Caprari (Pescara)."
        },
        {
            "gameTime": "1 - 04:25",
            "label": "",
            "description": "Jean Christophe Bahebeck (Pescara) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. The referee signals a corner kick to Pescara."
        },
        {
            "gameTime": "1 - 02:08",
            "label": "",
            "description": "Mohamed Salah (AS Roma) has a goal ruled out for offside!"
        },
        {
            "gameTime": "1 - 01:25",
            "label": "corner",
            "description": "A dangerous looking corner kick from Stephan El Shaarawy (AS Roma) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 00:47",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) races towards goal but the defender gets back well to make a challenge. The linesman points to the corner flag, AS Roma are going to take it."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Pescara will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Massimiliano Irrati will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma have not lost for 6 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pescara will try to end their 7 game winless streak."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "24/04/2017 - 21:45",
    "gameHomeTeam": "Pescara",
    "gameScore": "1 - 4"
}