{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2017-01-29 - 19-30 1. FSV Mainz 05 1 - 1 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. The game was more or less balanced. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 47:12",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "",
            "description": "Pablo De Blasis (Mainz) unleashes a superb first time shot from the edge of the box, but it flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 45:32",
            "label": "",
            "description": "Aaron Seydel (Mainz) fires the ball towards goal from just outside the penalty area, but it goes narrowly over the crossbar after coming very close to hitting the roof of the net."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 43:37",
            "label": "",
            "description": "Giulio Donati (Mainz) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 43:15",
            "label": "",
            "description": "Rough tackle by Mario Gotze (Dortmund). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 42:40",
            "label": "",
            "description": "Felix Zwayer blows his whistle and it's Sokratis (Dortmund) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 42:27",
            "label": "",
            "description": "Andre Schurrle (Dortmund) takes a direct free kick."
        },
        {
            "gameTime": "2 - 42:10",
            "label": "",
            "description": "Dangerous play by Niko Bungert (Mainz). Felix Zwayer blows his whistle for a foul. Dortmund are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 40:28",
            "label": "substitution",
            "description": "Substitution. Gonzalo Castro makes his way off the pitch and Christian Pulisic (Dortmund) comes on as his replacement."
        },
        {
            "gameTime": "2 - 39:58",
            "label": "",
            "description": "Giulio Donati (Mainz) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball goes out of play and Dortmund will have a goal kick."
        },
        {
            "gameTime": "2 - 39:10",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) whips in the free kick, but one of the defenders comfortably clears the ball away."
        },
        {
            "gameTime": "2 - 37:46",
            "label": "soccer-ball",
            "description": "Danny Latza (Mainz) jumps for a cross and plants a perfect header inside the left post."
        },
        {
            "gameTime": "2 - 37:02",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) attempts to threaten the opposition goal with the direct free kick. He unloads a thunderbolt strike directed to the right side of the goal. The goalkeeper stretches and makes a superb save!"
        },
        {
            "gameTime": "2 - 36:03",
            "label": "",
            "description": "Niko Bungert (Mainz) makes a rough challenge and Felix Zwayer blows his whistle for a foul. Another situation results in a direct free kick for Dortmund."
        },
        {
            "gameTime": "2 - 33:36",
            "label": "",
            "description": "Felix Zwayer couldn't ignore the rough tackle by Pablo De Blasis (Mainz) and blew his whistle."
        },
        {
            "gameTime": "2 - 33:06",
            "label": "",
            "description": "Aaron Seydel (Mainz) makes a strong challenge and Felix Zwayer blows for a foul."
        },
        {
            "gameTime": "2 - 32:53",
            "label": "",
            "description": "The goalkeeper pulls off a save to deny Andre Schurrle (Dortmund), whose low effort is only aimed at the middle of the goal."
        },
        {
            "gameTime": "2 - 31:38",
            "label": "",
            "description": "The game is interrupted as Marco Reus (Dortmund) is flagged offside."
        },
        {
            "gameTime": "2 - 30:07",
            "label": "",
            "description": "Felix Zwayer blows his whistle for a foul after Ousmane Dembele (Dortmund) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 29:15",
            "label": "y-card",
            "description": "Jairo Samperio (Mainz) is the one who receives a yellow card."
        },
        {
            "gameTime": "2 - 29:14",
            "label": "y-card",
            "description": "Andre Schurrle (Dortmund) picks up a caution."
        },
        {
            "gameTime": "2 - 28:23",
            "label": "substitution",
            "description": "That will be all from Yoshinori Muto who is being replaced by the fresh legs of Pablo De Blasis (Mainz)."
        },
        {
            "gameTime": "2 - 27:43",
            "label": "",
            "description": "A cross is clipped into the penalty area by Daniel Brosinski (Mainz) but poses no threat. The ball is off of the pitch and it's a goal kick for Dortmund."
        },
        {
            "gameTime": "2 - 26:17",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to introduce fresh legs, with Ousmane Dembele (Dortmund) replacing Pierre Emerick Aubameyang."
        },
        {
            "gameTime": "2 - 25:54",
            "label": "",
            "description": "Julian Weigl (Dortmund) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Felix Zwayer with no other option than to blow for a foul."
        },
        {
            "gameTime": "2 - 23:34",
            "label": "substitution",
            "description": "The manager makes a subsitution with Aaron Seydel (Mainz) coming on for Fabian Frei."
        },
        {
            "gameTime": "2 - 22:14",
            "label": "attendance",
            "description": "The attendance is 34000."
        },
        {
            "gameTime": "2 - 20:52",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to substitute Raphael Guerreiro and he is replaced by Mario Gotze (Dortmund)."
        },
        {
            "gameTime": "2 - 20:07",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) wins some space for himself around the penalty spot and manages to produce a promising header. One of the defenders stops his effort before it gets to the goalkeeper, making him redundant."
        },
        {
            "gameTime": "2 - 19:33",
            "label": "",
            "description": "Great teamplay by Dortmund as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 16:14",
            "label": "substitution",
            "description": "Substitution. Andre Ramalho (Mainz) in, Jean Philippe Gbamin out."
        },
        {
            "gameTime": "2 - 15:52",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) gets his head on the corner, but he can't find the target as his header flies high over the crossbar."
        },
        {
            "gameTime": "2 - 15:35",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 15:08",
            "label": "",
            "description": "Andre Schurrle (Dortmund) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him. The referee points to the corner flag and Dortmund will take a corner."
        },
        {
            "gameTime": "2 - 13:59",
            "label": "",
            "description": "Marco Reus (Dortmund) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "2 - 10:39",
            "label": "",
            "description": "Fabian Frei (Mainz) finds enough space to climb high and plants a header well wide of the left post. What a poor effort."
        },
        {
            "gameTime": "2 - 10:30",
            "label": "corner",
            "description": "Daniel Brosinski (Mainz) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "",
            "description": "Jairo Samperio (Mainz) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender. 1. FSV Mainz 05 earn a corner."
        },
        {
            "gameTime": "2 - 09:53",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 09:24",
            "label": "injury",
            "description": "Gonzalo Castro (Dortmund) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 08:53",
            "label": "y-card",
            "description": "The foul by Jean Philippe Gbamin (Mainz) is worthy of a card and a yellow is duly shown by Felix Zwayer."
        },
        {
            "gameTime": "2 - 07:10",
            "label": "",
            "description": "Sokratis (Dortmund) commits a rough foul. Felix Zwayer stops the game and makes a call."
        },
        {
            "gameTime": "2 - 05:10",
            "label": "",
            "description": "Yoshinori Muto (Mainz) trips an opposition player and Felix Zwayer signals a foul."
        },
        {
            "gameTime": "2 - 02:51",
            "label": "",
            "description": "The free kick is taken by Levin Oztunali (Mainz), but ball is cleared."
        },
        {
            "gameTime": "2 - 02:27",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "2 - 02:12",
            "label": "",
            "description": "Levin Oztunali (Mainz) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Felix Zwayer blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Let's hope the players will show us more in the second half as the first one has been rather ordinary, devoid of goalscoring opportunities. The game is quite balanced. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 45:01",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 44:01",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) connects with the corner kick around the penalty spot, but steers his header inches over the bar."
        },
        {
            "gameTime": "1 - 43:46",
            "label": "corner",
            "description": "Marco Reus (Dortmund) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 43:18",
            "label": "",
            "description": "Sokratis (Dortmund) latches on to a cross on the edge of the box and fires a shot at goal, but his effort was blocked by one of the defenders. The referee and one of his assistants signal for a corner kick to Dortmund."
        },
        {
            "gameTime": "1 - 42:57",
            "label": "corner",
            "description": "Dortmund work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "1 - 42:39",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) looks to break free, but an opposing player clears the ball away. The ball is out of play. Dortmund win a corner kick."
        },
        {
            "gameTime": "1 - 41:23",
            "label": "",
            "description": "Marco Reus (Dortmund) fouls an opponent. At least that's what referee Felix Zwayer signals."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "",
            "description": "Matthias Ginter (Dortmund) sends a cross into the box, but Jonas Lossl comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 39:28",
            "label": "",
            "description": "The Dortmund players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 35:44",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) sends a long ball in, but Jonas Lossl comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 32:01",
            "label": "",
            "description": "Felix Zwayer has a clear sight and sees a foul from Yoshinori Muto (Mainz)."
        },
        {
            "gameTime": "1 - 29:20",
            "label": "corner",
            "description": "The resulting corner from Raphael Guerreiro (Dortmund) comes to nothing."
        },
        {
            "gameTime": "1 - 29:03",
            "label": "",
            "description": "Andre Schurrle (Dortmund) sends a pass into the box, but his attempt is thwarted and cleared. The referee blows his whistle, Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 26:07",
            "label": "",
            "description": "One of the players from 1. FSV Mainz 05 times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 25:35",
            "label": "",
            "description": "Marco Reus (Dortmund) commits a foul and Felix Zwayer immediately signals a free kick."
        },
        {
            "gameTime": "1 - 23:34",
            "label": "",
            "description": "A pass from Raphael Guerreiro (Dortmund) is intercepted by Jonas Lossl and the move breaks down."
        },
        {
            "gameTime": "1 - 22:44",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) sets the ball for the free kick from 25 metres out. His attempt is aimed under the crossbar, but Jonas Lossl is alert and makes a save."
        },
        {
            "gameTime": "1 - 21:12",
            "label": "",
            "description": "It looks like Stefan Bell (Mainz) saw red with that tackle. Felix Zwayer won't tolerate such behaviour on the pitch and blows for a foul. Dortmund win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 20:00",
            "label": "",
            "description": "Andre Schurrle (Dortmund) unleashes a shot, but his effort is poor and floats high over the bar."
        },
        {
            "gameTime": "1 - 18:52",
            "label": "",
            "description": "Levin Oztunali (Mainz) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "1 - 17:44",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it."
        },
        {
            "gameTime": "1 - 15:53",
            "label": "",
            "description": "Marco Reus (Dortmund) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 14:40",
            "label": "",
            "description": "Jairo Samperio (Mainz) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 14:14",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Yoshinori Muto (Mainz) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "1 - 13:51",
            "label": "corner",
            "description": "The corner from Daniel Brosinski (Mainz) is intercepted by Roman Burki."
        },
        {
            "gameTime": "1 - 13:26",
            "label": "",
            "description": "Daniel Brosinski (Mainz) has the ability to send the ball deep into the penalty area from throw ins and it can lead to very promising situations for his team."
        },
        {
            "gameTime": "1 - 11:43",
            "label": "",
            "description": "Giulio Donati (Mainz) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 11:13",
            "label": "",
            "description": "Poor challenge! Gonzalo Castro (Dortmund) is penalised for tripping and Felix Zwayer blows his whistle."
        },
        {
            "gameTime": "1 - 10:48",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "1 - 09:59",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 07:06",
            "label": "",
            "description": "Fabian Frei (Mainz) meets a cross inside the box, but Roman Burki wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "1 - 06:33",
            "label": "",
            "description": "Dortmund enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 04:11",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) meets a cross inside the box, but his header is blocked by an opposing player."
        },
        {
            "gameTime": "1 - 02:17",
            "label": "soccer-ball",
            "description": "Brilliant finish! Marco Reus (Dortmund) perfectly collected a pass on the edge of the penalty area from Andre Schurrle, then produced a nice strike into the left side of the goal. The score is 0:1."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! 1. FSV Mainz 05 will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Felix Zwayer is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund have not lost for 3 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang has already scored 16 goals and he is the top goal scorer for Dortmund in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jonas Lossl from 1. FSV Mainz 05 has already played 1530 minutes this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. The game was more or less balanced. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "29/01/2017 - 19:30",
    "gameHomeTeam": "1. FSV Mainz 05",
    "gameScore": "1 - 1"
}