{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-01-21 - 18-15 Real Madrid 2 - 1 Malaga/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The home side dominated the game. Both teams attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 49:09",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) is penalised for a foul. Jesus Gil Manzano had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 46:36",
            "label": "corner",
            "description": "There's an opportunity for Toni Kroos (Real Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 46:03",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Toni Kroos (Real Madrid), was easily dealt with by one of the defenders. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 45:53",
            "label": "",
            "description": "A player from Malaga pulled an opponent down, forcing the referee to blow his whistle. It's a free kick to Real Madrid, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 41:22",
            "label": "",
            "description": "The flag is raised and Cristiano Ronaldo (Real Madrid) is offside again, not for the first time today."
        },
        {
            "gameTime": "2 - 40:40",
            "label": "corner",
            "description": "The resulting corner from Toni Kroos (Real Madrid) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 40:29",
            "label": "",
            "description": "The ball is cleared after Isco (Real Madrid) attempted to dribble past an opposing player. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "2 - 39:40",
            "label": "y-card",
            "description": "Lucas (Real Madrid) sees a yellow card from Jesus Gil Manzano after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 39:33",
            "label": "y-card",
            "description": "Today's referee Jesus Gil Manzano rightly decides to book Michael Santos (Malaga) for his harsh tackle."
        },
        {
            "gameTime": "2 - 36:51",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Alvaro Morata (Real Madrid) is coming onto the pitch as Karim Benzema cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 35:53",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a pass inside the box, controls the ball and drills it towards the left post. Unfortunately for him, Idriss Carlos Kameni makes a great save to stop his effort."
        },
        {
            "gameTime": "2 - 33:08",
            "label": "substitution",
            "description": "Marcelo Romero has decided to substitute Adalberto Penaranda and he is replaced by Michael Santos (Malaga)."
        },
        {
            "gameTime": "2 - 32:38",
            "label": "substitution",
            "description": "Luka Modric comes off the pitch to be replaced by Mateo Kovacic (Real Madrid)."
        },
        {
            "gameTime": "2 - 32:13",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows a yellow card to Ignacio Camacho (Malaga) for a tough tackle."
        },
        {
            "gameTime": "2 - 29:52",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to test the goalkeeper after collecting a cross inside the penalty area. Luck doesn't appear to be on his side today as his attempt rattles the left post."
        },
        {
            "gameTime": "2 - 29:36",
            "label": "corner",
            "description": "The resulting corner, taken by Toni Kroos (Real Madrid), comes to nothing."
        },
        {
            "gameTime": "2 - 28:48",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) has a great chance inside the six yard box, shoots to the left side of the goal, but Idriss Carlos Kameni pulls off an exquisite save to deny him. It will be a corner kick for Real Madrid."
        },
        {
            "gameTime": "2 - 27:54",
            "label": "substitution",
            "description": "Substitution. Martin Demichelis (Malaga) on for Juan Carlos."
        },
        {
            "gameTime": "2 - 21:55",
            "label": "substitution",
            "description": "Marcelo Romero decides to make a substitution. Chory Castro will be replaced by Jony (Malaga)."
        },
        {
            "gameTime": "2 - 19:40",
            "label": "corner",
            "description": "The resulting corner from Juanpi (Malaga) is cleared."
        },
        {
            "gameTime": "2 - 19:21",
            "label": "",
            "description": "Juan Carlos (Malaga) takes the ball, nicely zig zags through the defence, but his shot to the left post is smartly dealt with by Keylor Navas. The referee points to the corner flag. It's a corner to Malaga."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "soccer-ball",
            "description": "The ball rebounds and arrives at the feet of Juanpi (Malaga) just outside the box. He doesn't think twice and fires a strong shot into the top of the net. His attempt was beyond the reach of Keylor Navas, so the score changes to 2:1."
        },
        {
            "gameTime": "2 - 17:50",
            "label": "",
            "description": "Juan Carlos (Malaga) zig zags his way into the box and fails to direct a shot inside the left post. The goalkeeper pulls off a miraculous stop."
        },
        {
            "gameTime": "2 - 17:20",
            "label": "",
            "description": "The linesman signals that Cristiano Ronaldo (Real Madrid) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 15:57",
            "label": "corner",
            "description": "Juanpi (Malaga) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 15:49",
            "label": "",
            "description": "Juanpi (Malaga) slides a pass forward, but one of the defenders cuts it out. Malaga win a corner."
        },
        {
            "gameTime": "2 - 15:27",
            "label": "",
            "description": "Juan Carlos (Malaga) sends a teasing cross into the area, but Keylor Navas intercepts the ball."
        },
        {
            "gameTime": "2 - 13:49",
            "label": "",
            "description": "The game is interrupted as Lucas (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "2 - 13:39",
            "label": "",
            "description": "Nacho (Real Madrid) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "2 - 10:55",
            "label": "",
            "description": "Adalberto Penaranda (Malaga) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "2 - 06:20",
            "label": "",
            "description": "Recio (Malaga) unleashes a shot from the edge of the box, but it goes straight at Keylor Navas."
        },
        {
            "gameTime": "2 - 02:37",
            "label": "",
            "description": "The linesman raises his flag for offside before Karim Benzema (Real Madrid) heads on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We've seen some beautiful football and interesting action from both sides in the first half, let's see what the second one will bring. The hosts are enjoying a clear advantage over the opposition. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Jesus Gil Manzano has ended it."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 42:25",
            "label": "soccer-ball",
            "description": "A cross from the free kick is whipped deep into the box by Toni Kroos and Sergio Ramos (Real Madrid) gets in a shot, sending the ball low into the middle of the net. 2:0."
        },
        {
            "gameTime": "1 - 41:50",
            "label": "",
            "description": "Toni Kroos (Real Madrid) will take the free kick."
        },
        {
            "gameTime": "1 - 41:29",
            "label": "",
            "description": "Roberto Rosales (Malaga) tackles a bit over zealously and Jesus Gil Manzano blows for a foul. That's a free kick to Real Madrid."
        },
        {
            "gameTime": "1 - 39:00",
            "label": "",
            "description": "A goal, which was scored by Sergio Ramos (Real Madrid), was disallowed due to offside."
        },
        {
            "gameTime": "1 - 38:32",
            "label": "y-card",
            "description": "The foul by Juan Carlos (Malaga) is worthy of a card and a yellow is duly shown by Jesus Gil Manzano. Real Madrid are awarded the free kick."
        },
        {
            "gameTime": "1 - 36:55",
            "label": "y-card",
            "description": "Casemiro (Real Madrid) has received a yellow card for his foul."
        },
        {
            "gameTime": "1 - 34:55",
            "label": "soccer-ball",
            "description": "Goal! Toni Kroos sent in a fine cross from the corner kick. The perfect pass found Sergio Ramos (Real Madrid) and his bullet header from around the penalty spot went straight into the top left corner. It's 1:0."
        },
        {
            "gameTime": "1 - 34:40",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 34:22",
            "label": "",
            "description": "Lucas (Real Madrid) swings a cross into the box, but it's far too close to Idriss Carlos Kameni, who smothers the ball. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 33:49",
            "label": "",
            "description": "Juanpi (Malaga) crosses the ball into the box from a free kick, but his attempt is well judged by the keeper who saves comfortably."
        },
        {
            "gameTime": "1 - 33:34",
            "label": "",
            "description": "Casemiro (Real Madrid) is penalised for holding. Jesus Gil Manzano signals a set piece. Malaga are awarded a free kick."
        },
        {
            "gameTime": "1 - 31:18",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) whips in a cross from the corner, but Idriss Carlos Kameni is well positioned and punches the ball away."
        },
        {
            "gameTime": "1 - 31:07",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Nacho (Real Madrid), is intercepted by the opposition's defence. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 30:14",
            "label": "",
            "description": "Chory Castro (Malaga) shows good awareness deep inside the box as he latches on to a cross from the resulting free kick. He jumps high but his towering header lacks a little bit of accuracy and flies inches wide of the left hand post."
        },
        {
            "gameTime": "1 - 29:40",
            "label": "corner",
            "description": "Juanpi (Malaga) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "corner",
            "description": "Juanpi (Malaga) whips in the corner, but one of the defending players gets a head on it and intercepts. The ball is out of play. Malaga will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 28:46",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Juanpi (Malaga) is thwarted and cleared to safety. The ball is out of play and the linesman points at the corner flag. Corner to Malaga."
        },
        {
            "gameTime": "1 - 25:36",
            "label": "",
            "description": "Karim Benzema (Real Madrid) latches on to a cross on the edge of the box, but his effort on goal goes well wide of the right post. A really poor shot."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "substitution",
            "description": "Zinedine Zidane is forced to make a change. Marcelo is unable to continue due to injury, Isco (Real Madrid) comes on."
        },
        {
            "gameTime": "1 - 24:27",
            "label": "",
            "description": "The linesman raises his flag. Adalberto Penaranda (Malaga) is adjudged offside."
        },
        {
            "gameTime": "1 - 23:48",
            "label": "",
            "description": "Lucas (Real Madrid) wasted a huge opportunity! The fans already began to celebrate as he produced a shot from the edge of the box after a brilliant solo effort. The ball went towards the right side of the goal, but Idriss Carlos Kameni made an astonishing save!"
        },
        {
            "gameTime": "1 - 21:26",
            "label": "",
            "description": "Jesus Gil Manzano blows his whistle and signals a foul after Juanpi (Malaga) brought his opponent down."
        },
        {
            "gameTime": "1 - 19:16",
            "label": "",
            "description": "Luka Modric (Real Madrid) sends a long ball in, but Idriss Carlos Kameni comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 18:30",
            "label": "",
            "description": "Pablo Fornals (Malaga) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Keylor Navas was alert and the score remained the same."
        },
        {
            "gameTime": "1 - 17:30",
            "label": "",
            "description": "That was a nice football moment. Chory Castro (Malaga) receives an amazing defence splitting low pass on the edge of the box and blasts the ball towards the left post. Keylor Navas guesses his intention and dives superbly to deny him with a remarkable save!"
        },
        {
            "gameTime": "1 - 17:14",
            "label": "",
            "description": "A cross is clipped into the penalty area by Roberto Rosales (Malaga) but poses no threat."
        },
        {
            "gameTime": "1 - 15:36",
            "label": "",
            "description": "OFF THE POST! Chory Castro (Malaga) runs towards the goal to give his teammate support. He receives a fantastic pass and shoots from the edge of the box, but it crashes against the right post. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "1 - 14:32",
            "label": "",
            "description": "Karim Benzema (Real Madrid) had a good opportunity when he latched on to a cross from the wing, but his strike wasn't accurate at all and the ball went well wide of the left post."
        },
        {
            "gameTime": "1 - 14:02",
            "label": "",
            "description": "Jesus Gil Manzano blows his whistle. Adalberto Penaranda (Malaga) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 13:25",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is flagged for offside."
        },
        {
            "gameTime": "1 - 12:32",
            "label": "",
            "description": "Half chance! Pablo Fornals (Malaga) plays a pass into the box, but Keylor Navas reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 11:40",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Idriss Carlos Kameni is alert and denies him."
        },
        {
            "gameTime": "1 - 10:29",
            "label": "",
            "description": "Karim Benzema (Real Madrid) wins himself enough space to connect with a cross inside the box, but his fine header goes narrowly over the crossbar!"
        },
        {
            "gameTime": "1 - 10:06",
            "label": "",
            "description": "Half chance! Lucas (Real Madrid) plays a pass into the box, but Idriss Carlos Kameni reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 08:01",
            "label": "",
            "description": "Karim Benzema (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "1 - 07:47",
            "label": "",
            "description": "Marcelo (Real Madrid) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 07:31",
            "label": "",
            "description": "Lucas (Real Madrid) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 06:23",
            "label": "",
            "description": "Recio (Malaga) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 03:59",
            "label": "",
            "description": "Roberto Rosales (Malaga) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 01:44",
            "label": "",
            "description": "Pablo Fornals (Malaga) jumps into a tackle and Jesus Gil Manzano blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jesus Gil Manzano is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Malaga are now without a win in their last 5 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "1:2 This was the result of the last match between Real Madrid and Sevilla."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The home side dominated the game. Both teams attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Malaga",
    "gameDate": "21/01/2017 - 18:15",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "2 - 1"
}