{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2014-2015/2015-05-02 - 17-00 Cordoba 0 - 8 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Barcelona had more of the game and were superior. Their manager will certainly be the happier of the two managers. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        },
        {
            "gameTime": "2 - 46:48",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 46:23",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Barcelona."
        },
        {
            "gameTime": "2 - 45:08",
            "label": "",
            "description": "should know this behaviour is beyond the rules. He was too careless with his challenge and left Carlos Clos Gomez no option but to blow his whistle."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 42:29",
            "label": "soccer-ball",
            "description": "Goal! Luis Suarez (Barcelona) was in the right place at the right time to pounce on the rebound inside the box and gleefully rifles the ball home. It's 0:8."
        },
        {
            "gameTime": "2 - 42:21",
            "label": "",
            "description": "Luis Suarez (Barcelona) has an effort from distance but it's blocked."
        },
        {
            "gameTime": "2 - 39:30",
            "label": "soccer-ball",
            "description": "Neymar (Barcelona) scores from the penalty spot with a shot that goes inside the right post. How easy is that!"
        },
        {
            "gameTime": "2 - 39:09",
            "label": "",
            "description": "Neymar (Barcelona) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 38:30",
            "label": "penalty",
            "description": "Referee Carlos Clos Gomez sees the trip by Adrian Gunino (Cordoba) and doesn't hesitate to blow his whistle. It's a penalty! What an opportunity to score for Barcelona."
        },
        {
            "gameTime": "2 - 37:18",
            "label": "",
            "description": "Luis Suarez (Barcelona) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "soccer-ball",
            "description": "Goal! Lionel Messi (Barcelona) fires home from very close range after latching on to a pass from Luis Suarez. The score is 0:6."
        },
        {
            "gameTime": "2 - 34:44",
            "label": "",
            "description": "Pedro (Barcelona) sent a pass onto Luis Suarez, who didn't get a chance to finish."
        },
        {
            "gameTime": "2 - 33:38",
            "label": "",
            "description": "Dani Alves (Barcelona) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "2 - 33:23",
            "label": "",
            "description": "Jeremy Mathieu (Barcelona) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "2 - 32:01",
            "label": "",
            "description": "Pedro swings the cross over. Lionel Messi (Barcelona) gets his head to it but it goes just wide of the left post."
        },
        {
            "gameTime": "2 - 30:47",
            "label": "",
            "description": "A pass by Pedro (Barcelona) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 29:26",
            "label": "",
            "description": "The ball is cleared after Lionel Messi (Barcelona) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "",
            "description": "Jordi Alba (Barcelona) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 27:01",
            "label": "",
            "description": "Jordi Alba (Barcelona) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "2 - 26:42",
            "label": "attendance",
            "description": "The attendance for today's match is 13775."
        },
        {
            "gameTime": "2 - 25:57",
            "label": "",
            "description": "Ambitious effort from Florin Andone (Cordoba). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well over the bar."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "",
            "description": "What a big chance! Luis Suarez (Barcelona) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 23:59",
            "label": "",
            "description": "latches on to an accurate pass inside the box and immediately unleashes a shot towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 23:19",
            "label": "substitution",
            "description": "We are about to witness a substitution. Pedro (Barcelona) is replacing Ivan Rakitic."
        },
        {
            "gameTime": "2 - 22:28",
            "label": "",
            "description": "That was close by Lionel Messi (Barcelona)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "2 - 19:54",
            "label": "soccer-ball",
            "description": "Goal! Ivan Rakitic launched the corner kick and superbly found the head of Gerard Pique (Barcelona), whose accurate header from near the penalty spot went into the right side of the goal. It's 0:5."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner."
        },
        {
            "gameTime": "2 - 19:37",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger. The ball goes out for a corner. Barcelona can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 17:56",
            "label": "corner",
            "description": "Claudio Bravo (Barcelona) leaps to collect the ball from the corner which was sent over by Fidel Fidel."
        },
        {
            "gameTime": "2 - 17:18",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Fidel Fidel (Cordoba), but one of the defenders gets it clear. Now Cordoba have a corner."
        },
        {
            "gameTime": "2 - 16:44",
            "label": "",
            "description": "Florin Andone (Cordoba) looks to break free, but an opposing player clears the ball away. The ball goes out of play. Cordoba are awarded a corner kick."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "substitution",
            "description": "The substitution has been made. Jeremy Mathieu (Barcelona) has replaced Javier Mascherano."
        },
        {
            "gameTime": "2 - 16:26",
            "label": "substitution",
            "description": "Jose Antonio Romero prepares a substitution. Bebe is replaced by Fede (Cordoba)."
        },
        {
            "gameTime": "2 - 15:49",
            "label": "substitution",
            "description": "Andres Iniesta goes off the pitch and Xavi (Barcelona) comes on."
        },
        {
            "gameTime": "2 - 14:54",
            "label": "",
            "description": "Neymar (Barcelona) threw away a promising scoring opportunity. He received a fine cross inside the 6 yard box, but missed to the left of the target."
        },
        {
            "gameTime": "2 - 14:20",
            "label": "corner",
            "description": "Bebe (Cordoba) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 14:07",
            "label": "",
            "description": "Patrick Ekeng (Cordoba) produces a long range cannon of a shot after a nice pass. The ball heads towards the left post, but is stopped by a great save from Claudio Bravo and the score remains the same. The referee blows his whistle, Cordoba are awarded a corner kick."
        },
        {
            "gameTime": "2 - 12:50",
            "label": "substitution",
            "description": "Here comes a substitution. Luso Luso is given a rest as he is replaced by Patrick Ekeng (Cordoba)."
        },
        {
            "gameTime": "2 - 11:54",
            "label": "corner",
            "description": "Bebe (Cordoba) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "2 - 11:30",
            "label": "",
            "description": "Luso Luso (Cordoba) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee points to the corner flag and Cordoba will take a corner."
        },
        {
            "gameTime": "2 - 10:54",
            "label": "funfact",
            "description": "25:75 – this is the current ball possession ratio."
        },
        {
            "gameTime": "2 - 07:41",
            "label": "soccer-ball",
            "description": "It's a goal! Luis Suarez (Barcelona) alters the score to 0:4. He latched on to a good cross into the box from Dani Alves, steering his header from close range off the left post into the back of the net. Martin Juan Carlos was helpless."
        },
        {
            "gameTime": "2 - 06:48",
            "label": "y-card",
            "description": "What was Luso Luso (Cordoba) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "2 - 06:10",
            "label": "",
            "description": "Bebe (Cordoba) robs an opponent of the ball and explodes in anger when Carlos Clos Gomez blows for a foul."
        },
        {
            "gameTime": "2 - 05:43",
            "label": "",
            "description": "Luis Suarez (Barcelona) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 05:13",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 05:01",
            "label": "",
            "description": "Neymar (Barcelona) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender. The ball is out of play. A goal scoring opportunity from a corner for Barcelona."
        },
        {
            "gameTime": "2 - 03:46",
            "label": "",
            "description": "Jordi Alba (Barcelona) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 02:37",
            "label": "",
            "description": "Barcelona control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 00:57",
            "label": "soccer-ball",
            "description": "The ball hits the back of the net! Dani Alves showcases his brilliant technique and produces a beautiful lofted cross into the box. Lionel Messi (Barcelona) gets onto the scoresheet by sweetly heading it low inside the left post – 0:3."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Jose Antonio Romero makes a half time substitution. Adrian Gunino (Cordoba) comes on in place of Jose Angel Crespo."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Carlos Clos Gomez blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. Barcelona have arguably been the better of the two sides in the first half. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 47:46",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:57",
            "label": "soccer-ball",
            "description": "Luis Suarez (Barcelona) meets a perfect cross from Andres Iniesta deep inside the box and controls it with a nice first touch. He produces a low shot into the middle of the goal. The score has changed to 0:2."
        },
        {
            "gameTime": "1 - 45:20",
            "label": "",
            "description": "The game is interrupted. Dani Alves (Barcelona) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:25",
            "label": "",
            "description": "Luso Luso (Cordoba) makes a strong challenge and Carlos Clos Gomez blows for a foul."
        },
        {
            "gameTime": "1 - 43:16",
            "label": "",
            "description": "The game is interrupted as Florin Andone (Cordoba) is flagged offside."
        },
        {
            "gameTime": "1 - 41:56",
            "label": "soccer-ball",
            "description": "Goal! Lionel Messi puts a cross into the box and finds Ivan Rakitic (Barcelona), who latches on to it and strikes the ball into the roof of the net. He makes it 0:1."
        },
        {
            "gameTime": "1 - 41:21",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 40:28",
            "label": "",
            "description": "Lionel Messi (Barcelona) attempted to curl the ball over the defensive wall from the free kick, but with no success. The linesman points to the corner flag, Barcelona are going to take it."
        },
        {
            "gameTime": "1 - 39:56",
            "label": "",
            "description": "Aleksandar Pantic (Cordoba) tackles a bit over zealously and Carlos Clos Gomez blows for a foul. Barcelona are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 39:06",
            "label": "",
            "description": "The ball is out of play and the goal kick will be taken by Martin Juan Carlos (Cordoba)."
        },
        {
            "gameTime": "1 - 37:14",
            "label": "",
            "description": "Andres Iniesta (Barcelona) tries his luck with a long range effort after receiving a precise pass. It goes to the bottom left corner, but Martin Juan Carlos has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 36:32",
            "label": "",
            "description": "Neymar (Barcelona) receives a lofted pass from the side and shoots from around the penalty spot, but the ball flies onto the right post!"
        },
        {
            "gameTime": "1 - 36:03",
            "label": "",
            "description": "Bebe (Cordoba) sends a cross into the box, but Claudio Bravo comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 35:48",
            "label": "",
            "description": "Good defending. Neymar (Barcelona) tries to find Lionel Messi inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 34:06",
            "label": "",
            "description": "Jose Angel Crespo (Cordoba) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 32:53",
            "label": "injury",
            "description": "Jose Angel Crespo (Cordoba) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 32:27",
            "label": "",
            "description": "Andres Iniesta (Barcelona) passes the ball onto Jordi Alba, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 31:54",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 31:28",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 31:21",
            "label": "",
            "description": "Andres Iniesta (Barcelona) connects with a pass but sees his shot from the edge of the box blocked. It will be a corner kick for Barcelona."
        },
        {
            "gameTime": "1 - 30:35",
            "label": "",
            "description": "Andres Iniesta (Barcelona) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 30:10",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 29:49",
            "label": "",
            "description": "Jordi Alba (Barcelona) slaloms his way past challenges, but an opposing player does well to get the ball away. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 29:10",
            "label": "",
            "description": "Luis Suarez (Barcelona) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 27:16",
            "label": "",
            "description": "Lionel Messi (Barcelona) weaves through the defence with ease and gets one on one with the keeper, but fails to score with his low strike to the middle of the target as Martin Juan Carlos produces a good save."
        },
        {
            "gameTime": "1 - 26:17",
            "label": "",
            "description": "Florin Andone (Cordoba) is picked out by one of his teammates with a great cross, but his poor control allows the defence to clear and avert the threat."
        },
        {
            "gameTime": "1 - 24:00",
            "label": "",
            "description": "He should have done better. Bebe (Cordoba) is afforded space to connect with a Jose Angel Crespo cross, but his header from the centre of the box flies well over the crossbar."
        },
        {
            "gameTime": "1 - 22:11",
            "label": "",
            "description": "What a miskick by Dani Alves (Barcelona). He smashes a volley from long distance that goes into the stands."
        },
        {
            "gameTime": "1 - 22:10",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) will take the corner."
        },
        {
            "gameTime": "1 - 21:53",
            "label": "",
            "description": "This shall not pass! Lionel Messi (Barcelona) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. Barcelona force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 21:14",
            "label": "",
            "description": "Jordi Alba (Barcelona) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "1 - 20:28",
            "label": "",
            "description": "A long ball forward to Luis Suarez (Barcelona) is intercepted."
        },
        {
            "gameTime": "1 - 19:50",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) whips in a cross from the corner, but Martin Juan Carlos is well positioned and punches the ball away."
        },
        {
            "gameTime": "1 - 19:22",
            "label": "",
            "description": "Jordi Alba (Barcelona) sends a cross in and finds Lionel Messi inside the box, but one of the defenders steps in and clears the danger. Barcelona get a corner."
        },
        {
            "gameTime": "1 - 18:17",
            "label": "",
            "description": "A pass by Bebe (Cordoba) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 17:53",
            "label": "",
            "description": "Florin Andone (Cordoba) is picked out by one of his teammates with a brilliant long range cross, but he doesn't control the ball well and the defence eliminates the danger without any problem."
        },
        {
            "gameTime": "1 - 15:02",
            "label": "",
            "description": "Neymar (Barcelona) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Carlos Clos Gomez with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 14:42",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Neymar (Barcelona), but the defence gets it clear."
        },
        {
            "gameTime": "1 - 14:19",
            "label": "",
            "description": "Luso Luso (Cordoba) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 12:55",
            "label": "injury",
            "description": "Luso Luso (Cordoba) picks up an injury."
        },
        {
            "gameTime": "1 - 12:06",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 11:46",
            "label": "",
            "description": "A beautiful low pass from the side is received by Lionel Messi (Barcelona), who was waiting for his chance. However, the defence is alert and spanks the ball away. The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 11:33",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Bebe (Cordoba) sends it out of play."
        },
        {
            "gameTime": "1 - 10:19",
            "label": "",
            "description": "A lofted cross from Fidel Fidel (Cordoba) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Cordoba earn a corner."
        },
        {
            "gameTime": "1 - 08:52",
            "label": "",
            "description": "Luso Luso (Cordoba) makes an overly aggressive challenge and Carlos Clos Gomez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 06:03",
            "label": "",
            "description": "Florin Andone (Cordoba) is adjudged offside."
        },
        {
            "gameTime": "1 - 05:20",
            "label": "",
            "description": "Neymar (Barcelona) sends a short pass into the box, Lionel Messi takes a touch to control the ball, but one of the defenders robs him of it and clears to safety."
        },
        {
            "gameTime": "1 - 04:41",
            "label": "",
            "description": "Andres Iniesta (Barcelona) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "1 - 04:15",
            "label": "",
            "description": "Javier Mascherano (Barcelona) tries to play a long through ball into Dani Alves, but the defence breaks the move down."
        },
        {
            "gameTime": "1 - 03:33",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 02:03",
            "label": "",
            "description": "Neymar (Barcelona) comes close to scoring. He peels away from his marker and gets on the end of a cross from Dani Alves, but he hits a shot just over the crossbar."
        },
        {
            "gameTime": "1 - 01:03",
            "label": "",
            "description": "Jose Angel Crespo (Cordoba) was too fierce in his attempt to get the ball from his opponent and Carlos Clos Gomez blows for a foul."
        },
        {
            "gameTime": "1 - 00:21",
            "label": "",
            "description": "A cross into the box from Luso Luso (Cordoba) is cleared."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Cordoba will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Clos Gomez will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Barcelona had more of the game and were superior. Their manager will certainly be the happier of the two managers. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "02/05/2015 - 17:00",
    "gameHomeTeam": "Cordoba",
    "gameScore": "0 - 8"
}