{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-12-27 - 20-15 Liverpool 4 - 1 Stoke City/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The home side dominated today's game. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        },
        {
            "gameTime": "2 - 47:55",
            "label": "whistle",
            "description": "That's it for today, Michael Oliver has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 47:06",
            "label": "corner",
            "description": "James Milner (Liverpool) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 46:57",
            "label": "",
            "description": "James Milner (Liverpool) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. Liverpool have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 41:18",
            "label": "",
            "description": "Stoke City are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "2 - 38:36",
            "label": "substitution",
            "description": "Substitution. Wilfried Bony (Stoke City) on for Peter Crouch."
        },
        {
            "gameTime": "2 - 37:48",
            "label": "corner",
            "description": "The corner from James Milner (Liverpool) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 37:34",
            "label": "",
            "description": "What a goal scoring opportunity! Alberto Moreno (Liverpool) finds some space inside the box and gets in a strike, but the shot is brilliantly blocked by one of the defending players sliding in. The referee points to the corner flag and Liverpool will take a corner."
        },
        {
            "gameTime": "2 - 36:44",
            "label": "attendance",
            "description": "The attendance is 53094."
        },
        {
            "gameTime": "2 - 33:16",
            "label": "substitution",
            "description": "Here is a change. Roberto Firmino is going off and Jurgen Klopp gives the last tactical orders to Alberto Moreno (Liverpool)."
        },
        {
            "gameTime": "2 - 32:44",
            "label": "",
            "description": "Ibrahim Afellay (Stoke City) collects a pass and has an effort from 25 metres out, but it flies just over the crossbar."
        },
        {
            "gameTime": "2 - 29:38",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Ibrahim Afellay (Stoke City) comes onto the pitch for Mame Diouf."
        },
        {
            "gameTime": "2 - 28:23",
            "label": "corner",
            "description": "James Milner (Liverpool) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 28:12",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders. The referee points to the corner flag. It's a corner to Liverpool."
        },
        {
            "gameTime": "2 - 24:25",
            "label": "soccer-ball",
            "description": "Goal! It's a catastrophic error from the opponent which has gifted a chance to Daniel Sturridge (Liverpool), who rolls the ball into the back of the net from close range. 4:1."
        },
        {
            "gameTime": "2 - 24:24",
            "label": "substitution",
            "description": "Substitution. Daniel Sturridge (Liverpool) replaces Divock Origi."
        },
        {
            "gameTime": "2 - 23:49",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to substitute Adam Lallana and he is replaced by Emre Can (Liverpool)."
        },
        {
            "gameTime": "2 - 20:17",
            "label": "substitution",
            "description": "We are about to witness a substitution. Ramadan Sobhi (Stoke City) is replacing Glenn Whelan."
        },
        {
            "gameTime": "2 - 19:46",
            "label": "",
            "description": "Liverpool are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "2 - 16:19",
            "label": "corner",
            "description": "James Milner (Liverpool) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 15:28",
            "label": "",
            "description": "Sadio Mane (Liverpool) misses a good chance to score. An inch perfect cross into the box finds Sadio Mane (Liverpool) who rises for a header, but sends the ball well over the bar. The ball is out of play. Liverpool win a corner kick."
        },
        {
            "gameTime": "2 - 13:47",
            "label": "soccer-ball-own",
            "description": "Own goal! Gianelli Imbula Wanga (Stoke City) suffers a good deal of misfortune as he accidentally puts a pass from one of the attacking players into his own net. The score is 3:1."
        },
        {
            "gameTime": "2 - 11:33",
            "label": "corner",
            "description": "James Milner (Liverpool) takes a short corner kick."
        },
        {
            "gameTime": "2 - 11:19",
            "label": "",
            "description": "Adam Lallana (Liverpool) unleashes a bullet of a shot that is blocked by a defender. The ball goes out for a corner. Liverpool can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 09:03",
            "label": "corner",
            "description": "The corner from Joe Allen (Stoke City) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 08:53",
            "label": "",
            "description": "Mame Diouf (Stoke City) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. Stoke City force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 07:01",
            "label": "",
            "description": "Gianelli Imbula Wanga (Stoke City) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 04:32",
            "label": "",
            "description": "What a big chance! James Milner (Liverpool) picks up an inch perfect pass inside the box and misses the net well wide of the right post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "There has been no time for the supporters to get bored during an eventful opening 45 minutes. Both teams provided some breathtaking moments. The hosts dominated much of the first period. The home side have dominated the possession and midfield so far. The visitors have spent most of their time defending and waiting for the right moment to launch counter attacks."
        },
        {
            "gameTime": "1 - 47:55",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:40",
            "label": "",
            "description": "What a big chance! Sadio Mane (Liverpool) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 43:44",
            "label": "soccer-ball",
            "description": "James Milner passes the ball into the penalty area. Roberto Firmino (Liverpool) collects it and quickly sends it into the right side of the goal via the post! The goalkeeper was helpless. 2:1!"
        },
        {
            "gameTime": "1 - 42:30",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 21:6."
        },
        {
            "gameTime": "1 - 39:08",
            "label": "",
            "description": "James Milner (Liverpool) sends a teasing cross into the area, but Lee Grant intercepts the ball."
        },
        {
            "gameTime": "1 - 37:24",
            "label": "",
            "description": "Roberto Firmino (Liverpool) is afforded space inside the box after collecting a pass, but the chance is wasted as his shot goes harmlessly over the crossbar."
        },
        {
            "gameTime": "1 - 35:43",
            "label": "y-card",
            "description": "Michael Oliver shows a yellow card to Joe Allen (Stoke City) for a tough tackle."
        },
        {
            "gameTime": "1 - 33:59",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Adam Lallana (Liverpool) and he fired home from close range. The score is 1:1."
        },
        {
            "gameTime": "1 - 33:58",
            "label": "",
            "description": "Sadio Mane (Liverpool) tries to send a low pass into the box, but it's blocked and cleared."
        },
        {
            "gameTime": "1 - 32:10",
            "label": "",
            "description": "The ball is cleared after Sadio Mane (Liverpool) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 29:42",
            "label": "",
            "description": "Erik Pieters (Stoke City) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety."
        },
        {
            "gameTime": "1 - 26:39",
            "label": "",
            "description": "The linesman signals that Jonathan Walters (Stoke City) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 26:03",
            "label": "",
            "description": "Mame Diouf (Stoke City) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 24:11",
            "label": "injury",
            "description": "Mame Diouf (Stoke City) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 23:42",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by James Milner (Liverpool)."
        },
        {
            "gameTime": "1 - 23:25",
            "label": "",
            "description": "Roberto Firmino (Liverpool) has a shot blocked from inside the box. Liverpool will take a corner kick."
        },
        {
            "gameTime": "1 - 22:47",
            "label": "corner",
            "description": "James Milner (Liverpool) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 22:38",
            "label": "",
            "description": "Adam Lallana (Liverpool) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. The referee signals a corner kick to Liverpool."
        },
        {
            "gameTime": "1 - 19:20",
            "label": "",
            "description": "Gianelli Imbula Wanga (Stoke City) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "1 - 18:12",
            "label": "",
            "description": "Joe Allen (Stoke City) takes the ball, nicely zig zags through the defence, but his low drive to the middle of the goal is smartly dealt with by Simon Mignolet."
        },
        {
            "gameTime": "1 - 16:58",
            "label": "corner",
            "description": "The resulting corner from Joe Allen (Stoke City) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 16:46",
            "label": "",
            "description": "Gianelli Imbula Wanga (Stoke City) sends a cross into the box, but the opposition's defence quickly intercepts the ball. Stoke City get a corner."
        },
        {
            "gameTime": "1 - 16:33",
            "label": "",
            "description": "Ragnar Klavan (Liverpool) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 14:06",
            "label": "",
            "description": "James Milner (Liverpool) unleashes a shot from 23 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 12:50",
            "label": "injury",
            "description": "Looks like Ragnar Klavan (Liverpool) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 11:55",
            "label": "soccer-ball",
            "description": "Erik Pieters produces a beautiful lofted cross into the box, where Jonathan Walters (Stoke City) rises high to head the ball into the left side of the goal and beyond the goalkeeper. He makes it 0:1."
        },
        {
            "gameTime": "1 - 11:50",
            "label": "",
            "description": "One of the defenders is in the right place at the right time and makes a vital stop to deny a close range header from Peter Crouch (Stoke City)."
        },
        {
            "gameTime": "1 - 09:26",
            "label": "",
            "description": "Jordan Henderson (Liverpool) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 08:41",
            "label": "",
            "description": "Roberto Firmino (Liverpool) unleashes a bullet of a shot that is blocked by a defender."
        },
        {
            "gameTime": "1 - 06:34",
            "label": "",
            "description": "Roberto Firmino (Liverpool) rises above the opponent's defence and heads a precise cross towards the middle of the goal. His effort, however, is blocked by Lee Grant, who pulls off a comfortable save!"
        },
        {
            "gameTime": "1 - 05:23",
            "label": "",
            "description": "Jordan Henderson (Liverpool) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "1 - 05:10",
            "label": "corner",
            "description": "James Milner (Liverpool) works the corner short."
        },
        {
            "gameTime": "1 - 04:56",
            "label": "",
            "description": "Divock Origi (Liverpool) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger. Liverpool have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 03:24",
            "label": "",
            "description": "Sadio Mane (Liverpool) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 03:03",
            "label": "",
            "description": "James Milner (Liverpool) makes a strong challenge and Michael Oliver blows for a foul."
        },
        {
            "gameTime": "1 - 01:45",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 01:21",
            "label": "",
            "description": "Sadio Mane (Liverpool) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Michael Oliver."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Stoke City haven't won for 3 matches in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool have not lost for 3 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The home side dominated today's game. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        }
    ],
    "gameAwayTeam": "Stoke City",
    "gameDate": "27/12/2016 - 20:15",
    "gameHomeTeam": "Liverpool",
    "gameScore": "4 - 1"
}