{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-03-20 - 22-30 Real Madrid 4 - 0 Sevilla/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "What a terrific football game that was, with everything included. Real Madrid were dominant and more threatening of the two sides. It was a fairly one sided match. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:07",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) latches on to a lofted pass and strikes the ball! His attempt flies narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 42:46",
            "label": "attendance",
            "description": "The attendance is 72976."
        },
        {
            "gameTime": "2 - 40:31",
            "label": "soccer-ball",
            "description": "Goal! Jese (Real Madrid) is quickest to react to the rebound and stabs the ball into the back of the net. It's 4:0."
        },
        {
            "gameTime": "2 - 40:30",
            "label": "",
            "description": "James Rodriguez (Real Madrid) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "2 - 39:14",
            "label": "",
            "description": "Kevin Gameiro (Sevilla) receives a precise low pass inside the box, controls the ball and releases it towards the left post. Unfortunately for him, Keylor Navas makes a great save to stop his effort."
        },
        {
            "gameTime": "2 - 38:36",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "2 - 36:44",
            "label": "",
            "description": "Sergio Escudero (Sevilla) receives a great pass inside the box and misses a golden chance. The goalkeeper pulls off a stunning save."
        },
        {
            "gameTime": "2 - 35:31",
            "label": "substitution",
            "description": "Karim Benzema goes off the pitch and Isco (Real Madrid) comes on."
        },
        {
            "gameTime": "2 - 34:43",
            "label": "corner",
            "description": "Keylor Navas leaps to collect the ball from the corner which was sent over by Jose Antonio Reyes (Sevilla)."
        },
        {
            "gameTime": "2 - 34:03",
            "label": "",
            "description": "Mariano (Sevilla) sends a cross into the box, but the opposition's defence clears the ball to safety. Sevilla force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 32:46",
            "label": "",
            "description": "Keylor Navas is alert and has a clear sight of a long through ball from Jose Antonio Reyes (Sevilla). Easy save!"
        },
        {
            "gameTime": "2 - 32:01",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner."
        },
        {
            "gameTime": "2 - 31:48",
            "label": "",
            "description": "James Rodriguez (Real Madrid) crosses the ball forward but it is intercepted. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 30:19",
            "label": "substitution",
            "description": "Substitution. James Rodriguez (Real Madrid) replaces Casemiro."
        },
        {
            "gameTime": "2 - 28:25",
            "label": "",
            "description": "Jese (Real Madrid) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety."
        },
        {
            "gameTime": "2 - 26:44",
            "label": "substitution",
            "description": "Unai Emery decides to make a substitution. Sebastian Cristoforo will be replaced by Mariano (Sevilla)."
        },
        {
            "gameTime": "2 - 25:11",
            "label": "substitution",
            "description": "Unai Emery has decided to introduce fresh legs, with Juan Munoz (Sevilla) replacing Iborra."
        },
        {
            "gameTime": "2 - 24:53",
            "label": "substitution",
            "description": "Here comes a substitution. Jese (Real Madrid) is brought on as a substitute for Gareth Bale."
        },
        {
            "gameTime": "2 - 23:22",
            "label": "",
            "description": "Iborra (Sevilla) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "2 - 20:24",
            "label": "soccer-ball",
            "description": "Goal! Karim Benzema feeds Gareth Bale (Real Madrid), who taps the ball into an empty net. He makes it 3:0."
        },
        {
            "gameTime": "2 - 18:58",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) and Karim Benzema matched up again to find some space for an unmarked teammate."
        },
        {
            "gameTime": "2 - 18:54",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Danilo is the provider as he slips the ball to Cristiano Ronaldo (Real Madrid) who simply steers it home from close range. It's 2:0."
        },
        {
            "gameTime": "2 - 17:50",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from 24 metres out by Cristiano Ronaldo (Real Madrid) as his effort only hit the wall."
        },
        {
            "gameTime": "2 - 16:58",
            "label": "",
            "description": "Foul! Coke (Sevilla) is penalised for pulling back his opponent. Real Madrid win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 16:36",
            "label": "y-card",
            "description": "Grzegorz Krychowiak (Sevilla) kept talking out of turn to the referee until Javier Estrada Fernandez lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "2 - 15:55",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Kevin Gameiro (Sevilla) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "2 - 14:51",
            "label": "",
            "description": "CHANCE! Gareth Bale (Real Madrid) rises high to meet the resultant corner kick and attempts to steer his fine header past the goalkeeper, but only hits the crossbar!"
        },
        {
            "gameTime": "2 - 14:50",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 14:14",
            "label": "",
            "description": "Toni Kroos (Real Madrid) shoots from the edge of the penalty area. The ball travels towards the top right corner, but Sergio Rico easily deals with the threat. Real Madrid get a corner."
        },
        {
            "gameTime": "2 - 12:43",
            "label": "penalty-missed",
            "description": "Cristiano Ronaldo (Real Madrid) can't convert the spot kick. It goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 12:27",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 11:53",
            "label": "y-card",
            "description": "Jose Antonio Reyes (Sevilla) got a yellow card."
        },
        {
            "gameTime": "2 - 11:52",
            "label": "penalty",
            "description": "Jose Antonio Reyes (Sevilla) commits an ugly challenge. The referee sees it and immediately blows his whistle. Joy for one side, despair for the other as the referee gives a penalty to Real Madrid!"
        },
        {
            "gameTime": "2 - 11:04",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 08:57",
            "label": "y-card",
            "description": "Javier Estrada Fernandez shows a yellow card to Casemiro (Real Madrid) for a tough tackle."
        },
        {
            "gameTime": "2 - 07:53",
            "label": "corner",
            "description": "Sebastian Cristoforo (Sevilla) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 07:38",
            "label": "",
            "description": "Kevin Gameiro (Sevilla) looks to break free, but his touch lets him down and he loses the ball. The ball goes out of play. Sevilla are awarded a corner kick."
        },
        {
            "gameTime": "2 - 06:01",
            "label": "",
            "description": "Marcelo (Real Madrid) plays an extraordinary diagonal pass and Gareth Bale darts into free space to control the ball."
        },
        {
            "gameTime": "2 - 03:01",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 02:52",
            "label": "",
            "description": "Danilo (Real Madrid) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. The ball goes out for a corner. Real Madrid can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 00:24",
            "label": "substitution",
            "description": "Unai Emery Etxegoien makes a switch. Jose Antonio Reyes (Sevilla) is coming on in place of Diogo Figueiras at the start of the second period."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. Real Madrid enjoyed superiority over the opposition in that first 45 minutes. The home team makes a lot of passes and attempts to maintain possession, while the visitors look to counter attack."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "",
            "description": "Flag up against Cristiano Ronaldo (Real Madrid). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 43:56",
            "label": "",
            "description": "Marcelo (Real Madrid) fashions a shot from the edge of the box after receiving an accurate pass. Sergio Rico makes a comfortable save to stop the effort from flying into the middle of the goal."
        },
        {
            "gameTime": "1 - 42:23",
            "label": "",
            "description": "Coke (Sevilla) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 40:56",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 40:35",
            "label": "",
            "description": "Gareth Bale (Real Madrid) dribbles into the box, but Sergio Rico is quick enough to come off his line and stop him. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 39:09",
            "label": "",
            "description": "Javier Estrada Fernandez blows his whistle and it's Sergio Escudero (Sevilla) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 37:09",
            "label": "",
            "description": "Iborra (Sevilla) is caught offside!"
        },
        {
            "gameTime": "1 - 36:05",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 35:04",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) picks up a pass and hits the ball towards goal, but he can't generate enough power to trouble Sergio Rico."
        },
        {
            "gameTime": "1 - 34:11",
            "label": "",
            "description": "This was a piece of cake for Sergio Rico. Karim Benzema (Real Madrid) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "",
            "description": "Iborra (Sevilla) gives away a foul for a clumsy challenge. Referee Javier Estrada Fernandez saw the whole situation."
        },
        {
            "gameTime": "1 - 28:58",
            "label": "corner",
            "description": "Sergio Escudero (Sevilla) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 28:33",
            "label": "",
            "description": "Diogo Figueiras (Sevilla) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. Corner kick. Sevilla will have an opportunity."
        },
        {
            "gameTime": "1 - 28:23",
            "label": "corner",
            "description": "Sebastian Cristoforo (Sevilla) will take a corner kick."
        },
        {
            "gameTime": "1 - 28:05",
            "label": "",
            "description": "Coke (Sevilla) unleashes a bullet of a shot that is blocked by a defender. The ball goes out of play and Sevilla have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 27:43",
            "label": "corner",
            "description": "Diogo Figueiras (Sevilla) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 26:50",
            "label": "penalty-missed",
            "description": "Penalty saved! Kevin Gameiro (Sevilla) sends the penalty towards the left hand side of the goal, but Keylor Navas pulls off a wonderful save to deny him. The referee blows his whistle, Sevilla are awarded a corner kick."
        },
        {
            "gameTime": "1 - 26:47",
            "label": "",
            "description": "Kevin Gameiro (Sevilla) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 25:40",
            "label": "y-card",
            "description": "Raphael Varane (Real Madrid) is awarded a yellow card for his behaviour."
        },
        {
            "gameTime": "1 - 25:39",
            "label": "penalty",
            "description": "Raphael Varane (Real Madrid) is penalised for holding. Javier Estrada Fernandez signals a set piece. A penalty is awarded to Sevilla!"
        },
        {
            "gameTime": "1 - 23:55",
            "label": "",
            "description": "Gareth Bale (Real Madrid) misses a good chance to score. A perfect cross into the box finds Gareth Bale (Real Madrid) who rises for a header, but he sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 21:41",
            "label": "",
            "description": "Sergio Rico makes a brilliant save! Cristiano Ronaldo (Real Madrid) easily weaves through the defence and fires the ball from mid range. His effort goes towards the right side of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "1 - 21:08",
            "label": "",
            "description": "This is how football should be full of action, thrilling moments and spectacular opportunities. And we have only had the first 45 minutes, so the expectations for the second half are high."
        },
        {
            "gameTime": "1 - 20:39",
            "label": "",
            "description": "Karim Benzema (Real Madrid) wins himself just enough space inside the box to connect with the corner. His header flies towards the middle of the goal, but the goalkeeper blocks the effort."
        },
        {
            "gameTime": "1 - 20:30",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 20:02",
            "label": "",
            "description": "Danilo (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "1 - 19:25",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes a short corner kick."
        },
        {
            "gameTime": "1 - 19:14",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes the ball on and fires in a shot from 18 metres out. Sergio Rico stops the effort which is headed to the left post. It will be a corner kick for Real Madrid."
        },
        {
            "gameTime": "1 - 16:51",
            "label": "",
            "description": "Gareth Bale (Real Madrid) has a goal ruled out for offside!"
        },
        {
            "gameTime": "1 - 16:43",
            "label": "corner",
            "description": "There's an opportunity for Toni Kroos (Real Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 16:22",
            "label": "",
            "description": "OFF THE POST! Gareth Bale (Real Madrid) found himself some space to take a shot from just outside the box. His effort was headed to the left side of the goal, but Sergio Rico came up with a save and tipped the ball onto the post. Real Madrid will take a corner kick."
        },
        {
            "gameTime": "1 - 14:46",
            "label": "",
            "description": "Toni Kroos (Real Madrid) sends a cross into the box, but Sergio Rico comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 13:40",
            "label": "corner",
            "description": "The corner from Sergio Escudero (Sevilla) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 13:18",
            "label": "",
            "description": "Diogo Figueiras (Sevilla) sends a pass into the penalty area, but the opponent manages to cut it out. The referee points to the corner flag and Sevilla will take a corner."
        },
        {
            "gameTime": "1 - 12:39",
            "label": "",
            "description": "The linesman raises his flag. Cristiano Ronaldo (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "1 - 12:11",
            "label": "",
            "description": "Marcelo (Real Madrid) serves up a nice cross, but Sergio Rico punches the ball away."
        },
        {
            "gameTime": "1 - 11:02",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Toni Kroos (Real Madrid), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "1 - 10:25",
            "label": "",
            "description": "Sergio Escudero (Sevilla) was trying to get to the ball but clattered into the legs of the opponent as well. Javier Estrada Fernandez blows his whistle for an infringement. Real Madrid have been awarded a free kick."
        },
        {
            "gameTime": "1 - 09:08",
            "label": "",
            "description": "Luka Modric (Real Madrid) unleashes a bullet of a shot that is blocked by a defender."
        },
        {
            "gameTime": "1 - 08:53",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 08:30",
            "label": "",
            "description": "Toni Kroos (Real Madrid) tries to send a low pass into the box, but it's blocked and cleared. Real Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 07:45",
            "label": "",
            "description": "Keylor Navas doesn't have to worry about this one. Diogo Figueiras plays a pass into the feet of Kevin Gameiro (Sevilla), who is unable to find the target as his effort from inside the box goes high over the bar."
        },
        {
            "gameTime": "1 - 05:49",
            "label": "soccer-ball",
            "description": "What a goal! Gareth Bale plays it to Karim Benzema (Real Madrid), who finds himself unmarked inside the box and slots a first time shot past Sergio Rico into the right side of the goal. 1:0."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "corner",
            "description": "Sebastian Cristoforo (Sevilla) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 04:36",
            "label": "",
            "description": "Sergio Escudero (Sevilla) tries to pass the ball into the penalty area but it's blocked. Sevilla have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 04:25",
            "label": "",
            "description": "The goalkeeper pulls off a save to deny Benoit Tremoulinas (Sevilla), whose effort is only aimed at the middle of the goal."
        },
        {
            "gameTime": "1 - 03:54",
            "label": "corner",
            "description": "Diogo Figueiras (Sevilla) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 03:23",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) crosses the ball into the box, but one of the defending players averts the threat. The referee points to the corner flag. It's a corner to Sevilla."
        },
        {
            "gameTime": "1 - 01:45",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a teasing cross into the area, but Sergio Rico intercepts the ball."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "",
            "description": "Diogo Figueiras (Sevilla) dribbles into the box, but Keylor Navas is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Javier Estrada Fernandez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a terrific football game that was, with everything included. Real Madrid were dominant and more threatening of the two sides. It was a fairly one sided match. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        }
    ],
    "gameAwayTeam": "Sevilla",
    "gameDate": "20/03/2016 - 22:30",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "4 - 0"
}