{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-03 - 22-45 Shakhtar Donetsk 4 - 0 Malmo FF/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. Shakhtar Donetsk were dominant and more threatening of the two sides. It was a fairly one sided match. The home side played long passes and crosses into the box, while the away team's main priority was a flawless defence."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 46:25",
            "label": "",
            "description": "Yoshimar Yotun (Malmo FF) should know this behaviour is beyond the rules. He was too careless with his challenge and left Ovidiu Hategan no option but to blow his whistle."
        },
        {
            "gameTime": "2 - 45:36",
            "label": "y-card",
            "description": "The game has begun to heat up. Alex Teixeira (Shakhtar) challenges an opponent and receives a deserved yellow card for his ugly tackle."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:32",
            "label": "yr-card",
            "description": "Kari Arnason (Malmo FF) is awarded a second yellow by Ovidiu Hategan and subsequently dismisses him with a red one."
        },
        {
            "gameTime": "2 - 42:43",
            "label": "y-card",
            "description": "Olexandr Kucher (Shakhtar) gets a yellow card."
        },
        {
            "gameTime": "2 - 42:42",
            "label": "",
            "description": "Yoshimar Yotun (Malmo FF) makes a reckless foul in order to win the ball from his opponent. Ovidiu Hategan has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 42:42",
            "label": "",
            "description": "The ball spins up and hits the hand of Olexandr Kucher (Shakhtar) after he fails to control it and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 41:43",
            "label": "",
            "description": "Eduardo (Shakhtar) clutches his head in despair after he blew a huge opportunity! He received the ball from the free kick, took a good first touch and unleashed a projectile from close range to the left side of the goal, but Johan Wiland makes a nice save. The ball is out of play. Shakhtar Donetsk win a corner kick."
        },
        {
            "gameTime": "2 - 41:04",
            "label": "corner",
            "description": "The resulting corner from Viktor Kovalenko (Shakhtar) is cleared."
        },
        {
            "gameTime": "2 - 40:13",
            "label": "corner",
            "description": "Darijo Srna (Shakhtar) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 39:57",
            "label": "",
            "description": "Alex Teixeira (Shakhtar) sends a pass into the box, but his attempt is thwarted and cleared. The linesman makes the right call and Shakhtar Donetsk will have a corner."
        },
        {
            "gameTime": "2 - 39:42",
            "label": "",
            "description": "Anton Tinnerholm (Malmo FF) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 36:55",
            "label": "injury",
            "description": "The game is interrupted now, Anton Tinnerholm (Malmo FF) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 36:54",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 24:6."
        },
        {
            "gameTime": "2 - 36:34",
            "label": "",
            "description": "The game is interrupted as Viktor Kovalenko (Shakhtar) is flagged offside."
        },
        {
            "gameTime": "2 - 36:07",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Markus Rosenberg (Malmo FF)."
        },
        {
            "gameTime": "2 - 35:34",
            "label": "",
            "description": "Alex Teixeira (Shakhtar) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "2 - 34:27",
            "label": "",
            "description": "Shakhtar Donetsk enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 33:03",
            "label": "corner",
            "description": "Marlos (Shakhtar) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 32:37",
            "label": "",
            "description": "Viktor Kovalenko (Shakhtar) plays a one two with Darijo Srna, but the move breaks down. The ball goes out for a corner. Shakhtar Donetsk can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 29:09",
            "label": "substitution",
            "description": "Mircea Lucescu has decided to introduce fresh legs, with Viktor Kovalenko (Shakhtar) replacing Bernard."
        },
        {
            "gameTime": "2 - 28:57",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Magnus Wolff Eikrem (Malmo FF) for Nikola Djurdjic."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "soccer-ball",
            "description": "Alex Teixeira (Shakhtar) gets to a rebound inside the six yard box and produces a header. He manages to put the ball inside the left post, and thus alter the score to 2:0."
        },
        {
            "gameTime": "2 - 27:40",
            "label": "",
            "description": "Taison (Shakhtar) receives a precise low pass inside the box, controls it and sends it straight at Johan Wiland, who makes a comfortable save."
        },
        {
            "gameTime": "2 - 26:00",
            "label": "",
            "description": "Alex Teixeira (Shakhtar) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "2 - 25:33",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) commits a foul and Ovidiu Hategan immediately signals a free kick."
        },
        {
            "gameTime": "2 - 25:12",
            "label": "",
            "description": "Pa Konate (Malmo FF) slips through the defence and passes the ball in from the edge of the box. Yoshimar Yotun picks it up but loses it to one of the defenders."
        },
        {
            "gameTime": "2 - 24:46",
            "label": "",
            "description": "The flag is raised and Eduardo (Shakhtar) is offside again, not for the first time today."
        },
        {
            "gameTime": "2 - 22:41",
            "label": "substitution",
            "description": "We are about to witness a substitution. Taison (Shakhtar) is replacing Fred."
        },
        {
            "gameTime": "2 - 22:27",
            "label": "y-card",
            "description": "Darijo Srna (Shakhtar) picks up a yellow card for an infringement."
        },
        {
            "gameTime": "2 - 21:13",
            "label": "",
            "description": "Eduardo (Shakhtar) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 19:24",
            "label": "",
            "description": "The flag goes up and the referee blows his whistle another offside by Alex Teixeira (Shakhtar), who has already been caught several times today."
        },
        {
            "gameTime": "2 - 18:46",
            "label": "",
            "description": "Bernard (Shakhtar) latches on to an accurate pass on the edge of the box and unleashes a strong shot towards goal, but his effort is denied by the well positioned keeper."
        },
        {
            "gameTime": "2 - 15:25",
            "label": "y-card",
            "description": "Taras Stepanenko (Shakhtar) violates the laws of the game and is shown a yellow card by the referee, but it could have been a straight red as well."
        },
        {
            "gameTime": "2 - 14:21",
            "label": "",
            "description": "Alex Teixeira (Shakhtar) attempts to score as he rises near the penalty spot and heads the ball to the left side of the goal. Johan Wiland displays brilliant reflexes and pulls off a comfortable save to stop the ball from hitting the net."
        },
        {
            "gameTime": "2 - 14:19",
            "label": "corner",
            "description": "Marlos (Shakhtar) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 13:23",
            "label": "",
            "description": "Darijo Srna (Shakhtar) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. Shakhtar Donetsk force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 12:54",
            "label": "corner",
            "description": "Bernard (Shakhtar) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 12:45",
            "label": "",
            "description": "The Shakhtar Donetsk players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball. Shakhtar Donetsk force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 09:04",
            "label": "soccer-ball",
            "description": "It's a goal! Eduardo (Shakhtar) makes it 1:0. He jumped highest to connect with a perfect cross from Bernard and planted his close range header into the right side of the goal. Johan Wiland was helpless."
        },
        {
            "gameTime": "2 - 06:04",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) wasted a great chance as he climbed high to connect with a cross from the free kick inside the penalty area. He produced a header which went wide of the left by a whisker."
        },
        {
            "gameTime": "2 - 02:48",
            "label": "soccer-ball",
            "description": "Darijo Srna (Shakhtar) sends Johan Wiland the wrong way and fires the penalty into the middle of the goal!"
        },
        {
            "gameTime": "2 - 02:46",
            "label": "",
            "description": "Darijo Srna (Shakhtar) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 01:40",
            "label": "y-card",
            "description": "Yoshimar Yotun (Malmo FF) kept talking out of turn to the referee until Ovidiu Hategan lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "2 - 01:32",
            "label": "y-card",
            "description": "Ovidiu Hategan shows a yellow card to Kari Arnason (Malmo FF) for a tough tackle."
        },
        {
            "gameTime": "2 - 01:19",
            "label": "penalty",
            "description": "Ovidiu Hategan interrupts the game for a tactical foul by Kari Arnason (Malmo FF). PENALTY to Shakhtar Donetsk! Almost the entire opposition team is gathered around the referee and complaining. However, the decision has been made and it's final."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The need to improve in the second half has brought about a change. Jo Inge Berget comes off for Yoshimar Yotun (Malmo FF)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Mircea Lucescu decided to make a change. Oleksandr Gladky is replaced by Eduardo (Shakhtar)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Ovidiu Hategan starts the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "Both sides have been very active in the first half, providing the fans with an exciting show. It was a fairly one sided opening 45 minutes, with Shakhtar Donetsk much the better side better so far. The home team play long ball football, while the away side focuses on defending and lets the opposition keep possession."
        },
        {
            "gameTime": "1 - 48:58",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 47:48",
            "label": "",
            "description": "Kari Arnason (Malmo FF) leaps highest to meet the resulting set piece and sends his header way off target."
        },
        {
            "gameTime": "1 - 47:24",
            "label": "corner",
            "description": "Vladimir Rodic (Malmo FF) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 47:11",
            "label": "corner",
            "description": "Vladimir Rodic (Malmo FF) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat. It will be a corner kick for Malmo FF."
        },
        {
            "gameTime": "1 - 46:29",
            "label": "",
            "description": "Decent spell from Malmo FF here and they keep the pressure on until one of the defending players steps in. The referee and his assistant both point at the corner flag. Malmo FF will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "",
            "description": "What a big chance! Alex Teixeira (Shakhtar) picks up an inch perfect pass inside the box and fires the ball just over the crossbar."
        },
        {
            "gameTime": "1 - 43:59",
            "label": "corner",
            "description": "Marlos (Shakhtar) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 43:32",
            "label": "",
            "description": "Alex Teixeira (Shakhtar) after a cross wins the header inside the box and steers it goalwards, but Johan Wiland produces a wonderful reflex save. Shakhtar Donetsk win a corner."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "",
            "description": "That was close by Alex Teixeira (Shakhtar)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the right post."
        },
        {
            "gameTime": "1 - 41:08",
            "label": "",
            "description": "Vladimir Rodic (Malmo FF) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "",
            "description": "Ovidiu Hategan has a clear sight and sees a foul from Marlos (Shakhtar)."
        },
        {
            "gameTime": "1 - 39:44",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 24:6."
        },
        {
            "gameTime": "1 - 38:57",
            "label": "",
            "description": "Alex Teixeira (Shakhtar) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 38:07",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 37:36",
            "label": "",
            "description": "Olexandr Kucher (Shakhtar) commits a rough challenge and Ovidiu Hategan blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 37:09",
            "label": "corner",
            "description": "The resulting corner from Marlos (Shakhtar) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 36:46",
            "label": "",
            "description": "Shakhtar Donetsk are showing great team chemistry. They are passing the ball around seamlessly but finally one of the defending players makes an interception. Now Shakhtar Donetsk have a corner."
        },
        {
            "gameTime": "1 - 35:55",
            "label": "",
            "description": "Oleksandr Gladky (Shakhtar) attempts to convert a lofted cross as he jumps high and heads the ball down to the middle of the goal. Johan Wiland shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net."
        },
        {
            "gameTime": "1 - 34:14",
            "label": "",
            "description": "A more precise finish was all that was needed for this set play to have been a success. Yaroslav Rakitsky (Shakhtar) received the ball far out and fired a projectile which went yards over the bar."
        },
        {
            "gameTime": "1 - 31:34",
            "label": "",
            "description": "Ovidiu Hategan blows his whistle after Enoch Adu (Malmo FF) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 28:30",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Oleksandr Gladky (Shakhtar) and he fired home from close range. The score is 1:0."
        },
        {
            "gameTime": "1 - 28:28",
            "label": "",
            "description": "Johan Wiland makes a difficult save to deny Oleksandr Gladky (Shakhtar), who attempted to score with a header from inside the box."
        },
        {
            "gameTime": "1 - 27:42",
            "label": "",
            "description": "Oleksandr Gladky (Shakhtar) can't believe his eyes as he blows an opportunity from close range. It looked really simple and he only needed to tap the ball in, but he failed. The ball goes well wide of the right post. Hang your head in shame son."
        },
        {
            "gameTime": "1 - 26:35",
            "label": "",
            "description": "Darijo Srna (Shakhtar) wins himself enough space to meet the resulting corner on the edge of the box and fires the ball at goal, but the keeper does well to stop his effort."
        },
        {
            "gameTime": "1 - 26:34",
            "label": "corner",
            "description": "Bernard (Shakhtar) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 25:57",
            "label": "",
            "description": "A goal, which was scored by Bernard (Shakhtar), was disallowed due to offside."
        },
        {
            "gameTime": "1 - 24:19",
            "label": "",
            "description": "Erdal Rakip (Malmo FF) makes a strong challenge and Ovidiu Hategan blows for a foul."
        },
        {
            "gameTime": "1 - 21:59",
            "label": "",
            "description": "Nikola Djurdjic (Malmo FF) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Anton Kanibolotsky guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 20:42",
            "label": "",
            "description": "Oleksandr Gladky (Shakhtar) had a good opportunity when he latched on to a cross from the wing, but his header wasn't accurate at all and the ball went well wide of the right post."
        },
        {
            "gameTime": "1 - 19:01",
            "label": "",
            "description": "Bernard (Shakhtar) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance."
        },
        {
            "gameTime": "1 - 17:05",
            "label": "",
            "description": "Chance! Alex Teixeira (Shakhtar) was in a good position inside the box, but he couldn't connect with the pass as it was overhit."
        },
        {
            "gameTime": "1 - 15:52",
            "label": "",
            "description": "Ovidiu Hategan blows for a foul after Anton Tinnerholm (Malmo FF) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 13:41",
            "label": "corner",
            "description": "Bernard (Shakhtar) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 13:26",
            "label": "",
            "description": "Shakhtar Donetsk are enjoying a spell of pressure at the moment, but one of the defenders gets it clear. The ball is out of play and the linesman points at the corner flag. Corner to Shakhtar Donetsk."
        },
        {
            "gameTime": "1 - 13:13",
            "label": "corner",
            "description": "Bernard (Shakhtar) takes a short corner kick."
        },
        {
            "gameTime": "1 - 13:02",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Oleksandr Gladky (Shakhtar). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate. Shakhtar Donetsk force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 12:01",
            "label": "",
            "description": "The linesman raises his flag. Alex Teixeira (Shakhtar) is adjudged offside."
        },
        {
            "gameTime": "1 - 11:38",
            "label": "",
            "description": "Marcio Azevedo (Shakhtar) commits a rough foul. Ovidiu Hategan stops the game and makes a call."
        },
        {
            "gameTime": "1 - 10:40",
            "label": "substitution",
            "description": "Age Hareide is forced to make a change. Oscar Lewicki is not able to carry on due to injury. He is replaced by Erdal Rakip (Malmo FF)."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "injury",
            "description": "Anton Tinnerholm (Malmo FF) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "injury",
            "description": "Oscar Lewicki (Malmo FF) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 06:48",
            "label": "",
            "description": "Marlos (Shakhtar) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "1 - 04:53",
            "label": "",
            "description": "The ball falls to Darijo Srna (Shakhtar) on the edge of the box, but his shot goes well wide of the goal."
        },
        {
            "gameTime": "1 - 04:13",
            "label": "",
            "description": "Marcio Azevedo (Shakhtar) sends a chip pass into the box, but Johan Wiland is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 02:56",
            "label": "",
            "description": "Darijo Srna (Shakhtar) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 02:01",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) receives a well played pass inside the penalty area and shoots. He sends the ball into orbit."
        },
        {
            "gameTime": "1 - 01:09",
            "label": "",
            "description": "A nice lofted cross finds Bernard (Shakhtar) unmarked. He takes an excellent touch and gets in a shot that goes towards the middle of the net. An easy save for the goalkeeper, though."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Shakhtar Donetsk will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ovidiu Hategan was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. Shakhtar Donetsk were dominant and more threatening of the two sides. It was a fairly one sided match. The home side played long passes and crosses into the box, while the away team's main priority was a flawless defence."
        }
    ],
    "gameAwayTeam": "Malmo FF",
    "gameDate": "03/11/2015 - 22:45",
    "gameHomeTeam": "Shakhtar Donetsk",
    "gameScore": "4 - 0"
}