{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2017-01-21 - 17-30 SV Werder Bremen 1 - 2 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a very watchable match. Great goals and there was plenty of action at both ends of the pitch. No regrets about following this game. The away side dominated this game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        },
        {
            "gameTime": "2 - 48:36",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 47:35",
            "label": "",
            "description": "Robert Bauer (Werder Bremen) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 45:42",
            "label": "",
            "description": "Max Kruse (Werder Bremen) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "2 - 45:15",
            "label": "",
            "description": "The game is interrupted as Ousmane Dembele (Dortmund) is flagged offside."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 42:22",
            "label": "corner",
            "description": "Max Kruse (Werder Bremen) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 41:35",
            "label": "corner",
            "description": "Max Kruse (Werder Bremen) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 41:17",
            "label": "",
            "description": "Fin Bartels (Werder Bremen) passes the ball into the box but an opposing player clears. Now SV Werder Bremen have a corner."
        },
        {
            "gameTime": "2 - 39:36",
            "label": "",
            "description": "Andre Schurrle (Dortmund) takes a good first touch from a cross and fires a powerful low shot from the edge of the box towards the right post. The goalkeeper, though, is ready and denies him with a brilliant save."
        },
        {
            "gameTime": "2 - 38:36",
            "label": "y-card",
            "description": "Santiago Garcia (Werder Bremen) is booked after bringing down an opponent. Daniel Siebert had an easy decision to make."
        },
        {
            "gameTime": "2 - 37:06",
            "label": "attendance",
            "description": "The attendance is 42100."
        },
        {
            "gameTime": "2 - 34:23",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Florian Kainz (Werder Bremen) for Clemens Fritz."
        },
        {
            "gameTime": "2 - 30:20",
            "label": "y-card",
            "description": "Thomas Delaney (Werder Bremen) has tested the patience of referee Daniel Siebert and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 29:43",
            "label": "",
            "description": "What an opportunity! Christian Pulisic (Dortmund) squanders a huge opportunity as he latches on to a perfect cross from the wing. He produces a bullet header from around the penalty spot which goes just wide of the left post!"
        },
        {
            "gameTime": "2 - 25:59",
            "label": "soccer-ball",
            "description": "Goal! Lukasz Piszczek (Dortmund) pounced on a loose ball inside the box and beats the goalkeeper with a shot into the middle of the net. He makes it 1:2."
        },
        {
            "gameTime": "2 - 25:13",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "2 - 24:46",
            "label": "substitution",
            "description": "Substitution. Raphael Guerreiro (Dortmund) receives a signal from the referee and is now allowed to enter the pitch as Gonzalo Castro walks off."
        },
        {
            "gameTime": "2 - 24:41",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to substitute Gonzalo Castro and he is replaced by Raphael Guerreiro (Dortmund)."
        },
        {
            "gameTime": "2 - 24:30",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Marco Reus departs the field of play to be replaced by Ousmane Dembele (Dortmund)."
        },
        {
            "gameTime": "2 - 23:39",
            "label": "",
            "description": "Marco Reus (Dortmund) latched on to a lofted pass inside the box, but his header misses to the right of the target."
        },
        {
            "gameTime": "2 - 20:52",
            "label": "",
            "description": "Andre Schurrle (Dortmund) latches on to an accurate cross inside the box and quickly shoots, but unluckily for him one of his own teammates gets in the way of the ball and blocks the shot."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "corner",
            "description": "Marco Reus (Dortmund) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 17:45",
            "label": "",
            "description": "Andre Schurrle (Dortmund) tries to pass the ball into the penalty area but it's blocked. The referee points to the corner flag and Dortmund will take a corner."
        },
        {
            "gameTime": "2 - 13:02",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Clemens Fritz, who plays a vital role in the build up. He squares it to Fin Bartels (Werder Bremen), who beats Roman Weidenfeller with a brilliant shot into the bottom right corner. 1:1."
        },
        {
            "gameTime": "2 - 12:47",
            "label": "",
            "description": "Marco Reus (Dortmund) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Felix Wiedwald is alert and denies him."
        },
        {
            "gameTime": "2 - 08:42",
            "label": "",
            "description": "Marco Reus (Dortmund) will take the free kick."
        },
        {
            "gameTime": "2 - 08:30",
            "label": "",
            "description": "Daniel Siebert blows the whistle, Nikolas Moisander (Werder Bremen) is penalised for a foul. That's a free kick to Dortmund."
        },
        {
            "gameTime": "2 - 05:18",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) takes the free kick and unleashes a strong shot from mid range. Unfortunately for him, the ball curls inches over the crossbar. What a squandered chance!"
        },
        {
            "gameTime": "2 - 04:15",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) fires a volley towards goal from the edge of the penalty box and forces the goalkeeper to make a brilliant save."
        },
        {
            "gameTime": "2 - 03:06",
            "label": "",
            "description": "A cross by Andre Schurrle (Dortmund) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "2 - 00:26",
            "label": "substitution",
            "description": "Thomas Tuchel decides to make a substitution. Marcel Schmelzer will be replaced by Erik Durm (Dortmund)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. Neither team has really been able to control the flow of the game. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 48:09",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Daniel Siebert has ended it."
        },
        {
            "gameTime": "1 - 47:39",
            "label": "",
            "description": "What a great touch by Robert Bauer (Werder Bremen)! He picks up a precise pass inside the box and immediately produces a shot towards the net. Unfortunately for him, his bullet only crashes against the crossbar."
        },
        {
            "gameTime": "1 - 46:41",
            "label": "",
            "description": "Lamine Ludovic Sane (Werder Bremen) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 46:02",
            "label": "",
            "description": "Marco Reus (Dortmund) receives a precise pass and is given time inside the box to send a promising strike towards the bottom right corner. Felix Wiedwald guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 45:39",
            "label": "",
            "description": "Max Kruse (Werder Bremen) commits a foul and Daniel Siebert immediately signals a free kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 42:51",
            "label": "y-card",
            "description": "Yellow card. Andre Schurrle (Dortmund) goes into the book for a bad tackle on his opponent."
        },
        {
            "gameTime": "1 - 42:15",
            "label": "",
            "description": "Close effort! Andre Schurrle (Dortmund) takes the resulting free kick from a promising distance, but he sends it narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 41:15",
            "label": "substitution",
            "description": "Here comes a substitution. Felix Wiedwald (Werder Bremen) is brought on as a substitute for Claudio Pizarro."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "",
            "description": "Marco Reus (Dortmund) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 39:24",
            "label": "injury",
            "description": "Marco Reus (Dortmund) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 38:39",
            "label": "r-card",
            "description": "Jaroslav Drobny (Werder Bremen) makes an ugly tackle on his opponent and is sent off by the referee!"
        },
        {
            "gameTime": "1 - 37:13",
            "label": "",
            "description": "Christian Pulisic (Dortmund) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 36:33",
            "label": "",
            "description": "It looks like Clemens Fritz (Werder Bremen) saw red with that tackle. Daniel Siebert won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 34:24",
            "label": "",
            "description": "Nikolas Moisander (Werder Bremen) clutches his head in despair after blowing a huge opportunity! He receives the ball after the free kick and takes good first touch to unleash a low shot from close range, but Roman Weidenfeller makes a nice save."
        },
        {
            "gameTime": "1 - 33:07",
            "label": "",
            "description": "Thomas Delaney (Werder Bremen) unleasheaThomas Delaney (Werder Bremen) unleashes a beautiful mid range volley low to the middle of the goal, but his effort is thwarted by the keeper, and the score remains the same.s a beautiful mid range volley low to the middle of the goal, but his effort is thwarted by the keeper, and the score doesn't change."
        },
        {
            "gameTime": "1 - 30:15",
            "label": "corner",
            "description": "Max Kruse (Werder Bremen) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 28:34",
            "label": "",
            "description": "Max Kruse (Werder Bremen) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 26:23",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Serge Gnabry leaves the pitch and Milos Veljkovic (Werder Bremen) comes on."
        },
        {
            "gameTime": "1 - 24:33",
            "label": "corner",
            "description": "Marco Reus (Dortmund) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 24:25",
            "label": "",
            "description": "Andre Schurrle (Dortmund) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. Dortmund have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 21:09",
            "label": "",
            "description": "Max Kruse (Werder Bremen) is caught offside!"
        },
        {
            "gameTime": "1 - 18:11",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Robert Bauer (Werder Bremen) was quite harsh and Daniel Siebert didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 17:20",
            "label": "",
            "description": "Fin Bartels (Werder Bremen) latches on to an accurate pass on the edge of the box and produces a ferocious strike towards the left post, but his shot is well held by the goalkeeper."
        },
        {
            "gameTime": "1 - 14:39",
            "label": "",
            "description": "Felix Wiedwald pulls off a decent save! Andre Schurrle (Dortmund) attempts to head home after a precise cross into the box. He aims his header towards the middle of the net, but the effort is kept out."
        },
        {
            "gameTime": "1 - 12:04",
            "label": "",
            "description": "Andre Schurrle (Dortmund) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 11:18",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) connects with the corner kick around the penalty spot, but steers his header inches over the bar."
        },
        {
            "gameTime": "1 - 11:02",
            "label": "corner",
            "description": "Marco Reus (Dortmund) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 10:43",
            "label": "",
            "description": "Marco Reus (Dortmund) gets on the end of a pass and produces a promising first time shot towards the right side of the goal. His effort is blocked by Felix Wiedwald with a brilliant diving save! Dortmund have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 08:47",
            "label": "",
            "description": "Andre Schurrle (Dortmund) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 05:51",
            "label": "corner",
            "description": "The resulting corner from Marco Reus (Dortmund) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 05:26",
            "label": "",
            "description": "Marco Reus (Dortmund) fails to find any of his teammates inside the box as his pass is blocked. The ball goes out of play. Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 04:15",
            "label": "soccer-ball",
            "description": "Andre Schurrle (Dortmund) makes a great solo run and pulls the trigger from inside the box, beating Felix Wiedwald with a strike into the left side of the goal. He makes it 0:1."
        },
        {
            "gameTime": "1 - 01:15",
            "label": "",
            "description": "Thomas Delaney (Werder Bremen) brings down his opponent with a very late tackle."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Dortmund will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Daniel Siebert will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ousmane Dembele has the most assists (11) for Dortmund this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "SV Werder Bremen scored at least one goal in each of their last 15 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a very watchable match. Great goals and there was plenty of action at both ends of the pitch. No regrets about following this game. The away side dominated this game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "21/01/2017 - 17:30",
    "gameHomeTeam": "SV Werder Bremen",
    "gameScore": "1 - 2"
}