{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-10-17 - 17-00 Chelsea 2 - 0 Aston Villa/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. It was an even match on the whole, with both sides enjoying spells in the ascendancy. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        },
        {
            "gameTime": "2 - 48:57",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 48:35",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Chelsea."
        },
        {
            "gameTime": "2 - 47:12",
            "label": "",
            "description": "Joleon Lescott (Aston Villa) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "substitution",
            "description": "Today's match ends for Willian who will be replaced by Loic Remy (Chelsea)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "The cross into the penalty area from Jack Grealish (Aston Villa) needed to be more accurate in order to create a goal scoring opportunity for his team. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "2 - 44:41",
            "label": "",
            "description": "Ramires (Chelsea) sends a chip pass into the box, but Brad Guzan is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 44:27",
            "label": "",
            "description": "Eden Hazard (Chelsea) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 44:10",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Cesc Fabregas (Chelsea)."
        },
        {
            "gameTime": "2 - 43:55",
            "label": "",
            "description": "Diego Costa (Chelsea) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 42:23",
            "label": "",
            "description": "Eden Hazard (Chelsea) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 41:49",
            "label": "",
            "description": "The game is interrupted. Idrissa Gueye (Aston Villa) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did. Free kick. Chelsea will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 39:54",
            "label": "y-card",
            "description": "Jack Grealish (Aston Villa) has received a yellow card for his foul."
        },
        {
            "gameTime": "2 - 39:40",
            "label": "",
            "description": "Ashley Westwood (Aston Villa) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "2 - 39:15",
            "label": "corner",
            "description": "Carles Gil (Aston Villa) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "",
            "description": "The ball is cleared after Adama Traore (Aston Villa) attempted to dribble past an opposing player. The ball goes out for a corner. Aston Villa can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 37:51",
            "label": "substitution",
            "description": "Here's the change. Pedro leaves the pitch and Eden Hazard (Chelsea) comes on as a substitute."
        },
        {
            "gameTime": "2 - 37:15",
            "label": "",
            "description": "Micah Richards (Aston Villa) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "2 - 36:31",
            "label": "",
            "description": "Carles Gil (Aston Villa) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 35:40",
            "label": "",
            "description": "Chance! Cesc Fabregas (Chelsea) comes within inches of scoring after picking up a pass from Willian, but his shot from inside the box flashes inches wide of the left post."
        },
        {
            "gameTime": "2 - 34:09",
            "label": "attendance",
            "description": "The attendance for today's match is 41596."
        },
        {
            "gameTime": "2 - 32:49",
            "label": "",
            "description": "Pedro (Chelsea) collects an inch perfect pass and strikes the ball from far out, but his shot is blocked."
        },
        {
            "gameTime": "2 - 32:31",
            "label": "corner",
            "description": "Ashley Westwood (Aston Villa) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 32:10",
            "label": "",
            "description": "Rudy Gestede (Aston Villa) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play. Aston Villa will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 31:20",
            "label": "",
            "description": "Willian (Chelsea) is able to continue to play."
        },
        {
            "gameTime": "2 - 30:39",
            "label": "injury",
            "description": "Willian (Chelsea) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 29:56",
            "label": "",
            "description": "Ramires (Chelsea) brings down his opponent with a very late tackle."
        },
        {
            "gameTime": "2 - 28:59",
            "label": "y-card",
            "description": "Willian (Chelsea) says something out of turn to the referee and is shown a yellow card."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "",
            "description": "Rudy Gestede (Aston Villa) latched on to the corner and struck a fine header from the edge of the box, but it went way wide of the left post."
        },
        {
            "gameTime": "2 - 27:29",
            "label": "corner",
            "description": "Ashley Westwood (Aston Villa) will take the corner."
        },
        {
            "gameTime": "2 - 27:15",
            "label": "",
            "description": "Adama Traore (Aston Villa) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. Aston Villa have a corner."
        },
        {
            "gameTime": "2 - 26:54",
            "label": "",
            "description": "Aston Villa seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "corner",
            "description": "The corner from Ashley Westwood (Aston Villa) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 26:02",
            "label": "",
            "description": "Joleon Lescott (Aston Villa) receives the ball inside the box from the resulting free kick, but fails to score as his shot is blocked by one of the defenders. The referee points to the corner flag. It's a corner to Aston Villa."
        },
        {
            "gameTime": "2 - 25:18",
            "label": "",
            "description": "Pedro (Chelsea) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. Aston Villa have a free kick."
        },
        {
            "gameTime": "2 - 24:10",
            "label": "",
            "description": "Half chance! Willian (Chelsea) plays a pass into the box, but Brad Guzan reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 22:59",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Adama Traore (Aston Villa) comes onto the pitch for Jordan Ayew."
        },
        {
            "gameTime": "2 - 22:44",
            "label": "",
            "description": "Jordan Amavi (Aston Villa) feels very aggrieved after the referee stops play for a foul that he commits while heading towards goal with the ball."
        },
        {
            "gameTime": "2 - 21:38",
            "label": "",
            "description": "Alan Hutton (Aston Villa) produces a poor pass. He attempts to get the ball into the box but it's hacked away."
        },
        {
            "gameTime": "2 - 21:20",
            "label": "",
            "description": "Jordan Amavi (Aston Villa) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "",
            "description": "Jordan Amavi (Aston Villa) is disappointed with himself because he got into a good area but produced a poor cross. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "2 - 18:09",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Jordan Amavi (Aston Villa) will replace Kieran Richardson."
        },
        {
            "gameTime": "2 - 17:32",
            "label": "",
            "description": "A pass by Cesc Fabregas (Chelsea) ends up in no man's land, and the attacking effort comes to an end. The ball goes out of play and Aston Villa will have a goal kick."
        },
        {
            "gameTime": "2 - 16:52",
            "label": "y-card",
            "description": "Kieran Richardson (Aston Villa) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 15:33",
            "label": "",
            "description": "Jack Grealish (Aston Villa) skips past his man but can't keep the ball in play. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "2 - 14:51",
            "label": "",
            "description": "Diego Costa (Chelsea) wins the ball near the penalty spot and unleashes a header towards the middle of the goal, but Brad Guzan is alert and denies him."
        },
        {
            "gameTime": "2 - 13:48",
            "label": "",
            "description": "Pedro (Chelsea) latches on to an accurate pass inside the box and immediately unleashes a shot towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 13:28",
            "label": "",
            "description": "Pedro (Chelsea) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "2 - 12:45",
            "label": "",
            "description": "Diego Costa (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 10:15",
            "label": "funfact",
            "description": "9:8 – this is the total number of shots produced by both teams."
        },
        {
            "gameTime": "2 - 08:35",
            "label": "soccer-ball-own",
            "description": "Alan Hutton (Aston Villa) scores an own goal! No one would like to be in his position right now."
        },
        {
            "gameTime": "2 - 07:06",
            "label": "",
            "description": "The ball is cleared after Willian (Chelsea) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 06:01",
            "label": "",
            "description": "Aston Villa are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 04:32",
            "label": "",
            "description": "Diego Costa (Chelsea) makes a driving run into the box but he cannot work any space for a shot. The ball goes out of play and Aston Villa will have a goal kick."
        },
        {
            "gameTime": "2 - 03:34",
            "label": "y-card",
            "description": "Jordan Ayew (Aston Villa) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 02:24",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 01:37",
            "label": "",
            "description": "Jack Grealish (Aston Villa) makes a good run with the ball into the box, but mishits his shot as it goes well wide of the right post."
        },
        {
            "gameTime": "2 - 00:55",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Cesar Azpilicueta (Chelsea), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 00:29",
            "label": "substitution",
            "description": "The need to improve in the second half has brought about a change. Ruben Loftus Cheek comes off for Nemanja Matic (Chelsea)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We can hope that the managers will be able to motivate the players and stir them to improve their performance for after the half time break. We haven't seen really exciting football in the previous 45 minutes. Even first half from both sides, and they've both had chances. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 46:13",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:57",
            "label": "",
            "description": "A pass from Diego Costa (Chelsea) is intercepted by Brad Guzan and the move breaks down."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:10",
            "label": "",
            "description": "Ramires (Chelsea) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "1 - 43:13",
            "label": "",
            "description": "Diego Costa (Chelsea) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 42:55",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "1 - 42:19",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Cesar Azpilicueta (Chelsea)."
        },
        {
            "gameTime": "1 - 40:18",
            "label": "",
            "description": "Half chance! Jack Grealish (Aston Villa) plays a pass into the box, but Asmir Begovic reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "",
            "description": "Ashley Westwood (Aston Villa) releases a powerful first time effort from the edge of the box which goes in the direction of the left hand post, but the keeper leaps like a salmon to deny him. Excellent goalkeeping!"
        },
        {
            "gameTime": "1 - 38:52",
            "label": "",
            "description": "Ramires (Chelsea) makes a slide tackle, but referee Roger East blows for a foul. A free kick has been awarded to Aston Villa."
        },
        {
            "gameTime": "1 - 38:22",
            "label": "",
            "description": "Willian (Chelsea) stands over the free kick and opts to take it himself, but it is straight at Brad Guzan."
        },
        {
            "gameTime": "1 - 37:29",
            "label": "",
            "description": "Micah Richards (Aston Villa) was holding his opponent and can be glad he didn't receive a yellow card. Chelsea are awarded the free kick."
        },
        {
            "gameTime": "1 - 36:33",
            "label": "",
            "description": "Pedro (Chelsea) trips an opposition player and Roger East signals a foul."
        },
        {
            "gameTime": "1 - 35:45",
            "label": "",
            "description": "Great teamplay by Chelsea as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 33:11",
            "label": "soccer-ball",
            "description": "Goal! It's a catastrophic error from the opponent which has gifted a chance to Diego Costa (Chelsea), who rolls the ball into the back of the net from close range. 1:0."
        },
        {
            "gameTime": "1 - 32:47",
            "label": "",
            "description": "John Terry (Chelsea) shows good awareness deep inside the box as he latches on to a cross from the resulting free kick. He jumps high but his towering header lacks accuracy and flies well over the crossbar."
        },
        {
            "gameTime": "1 - 32:16",
            "label": "",
            "description": "Alan Hutton (Aston Villa) commits a rough foul. Roger East stops the game and makes a call. Chelsea are awarded a free kick."
        },
        {
            "gameTime": "1 - 31:34",
            "label": "",
            "description": "Rudy Gestede (Aston Villa) squandered a big chance from inside the box, firing his volley narrowly over the bar. What a waste. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 30:35",
            "label": "",
            "description": "Kurt Zouma (Chelsea) unleashes a shot from a mid range free kick that crashes into the defensive wall. The opposition's goalkeeper set it up perfectly."
        },
        {
            "gameTime": "1 - 29:51",
            "label": "",
            "description": "Joleon Lescott (Aston Villa) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Roger East blows for the foul but keeps his cards in his pocket on this occasion. Another situation results in a direct free kick for Chelsea."
        },
        {
            "gameTime": "1 - 29:38",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 29:12",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee points to the corner flag and Chelsea will take a corner."
        },
        {
            "gameTime": "1 - 28:29",
            "label": "",
            "description": "Referee Roger East sees the trip by Ashley Westwood (Aston Villa) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 27:53",
            "label": "",
            "description": "Pedro (Chelsea) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "1 - 27:13",
            "label": "",
            "description": "A long pass, executed by Ramires (Chelsea), missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 26:00",
            "label": "",
            "description": "The Chelsea players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 24:30",
            "label": "",
            "description": "Half chance! Kurt Zouma (Chelsea) plays a pass into the box, but Brad Guzan reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 23:01",
            "label": "",
            "description": "Jordan Ayew (Aston Villa) stands over the resultant free kick from mid range, but his shot goes just over the crossbar. It could have been a fantastic goal! The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 22:05",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) makes a rough challenge and the referee blows for a foul. Aston Villa earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 21:45",
            "label": "",
            "description": "A promising cross into the box is nearly received by the lurking Rudy Gestede (Aston Villa), but one of the defending players cuts it out to avert the threat."
        },
        {
            "gameTime": "1 - 20:59",
            "label": "",
            "description": "A pass by Abdul Baba Rahman (Chelsea) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 19:50",
            "label": "",
            "description": "Jack Grealish (Aston Villa) races towards goal but the defender gets back well to make a challenge. It's a throw in for Aston Villa."
        },
        {
            "gameTime": "1 - 19:16",
            "label": "",
            "description": "Roger East blows his whistle and signals a foul after Kieran Richardson (Aston Villa) brought his opponent down. It's a free kick to Chelsea, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 18:28",
            "label": "",
            "description": "Roger East interrupts the game for a tactical foul by Ruben Loftus Cheek (Chelsea)."
        },
        {
            "gameTime": "1 - 17:08",
            "label": "",
            "description": "Diego Costa (Chelsea) is in a clear offside position and the referee blows his whistle after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 16:34",
            "label": "",
            "description": "Neat passing move from Aston Villa in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 15:38",
            "label": "",
            "description": "Jack Grealish (Aston Villa) latches on to an accurate pass into the box and immediately unleashes a low shot goalwards. His effort is well saved by the keeper."
        },
        {
            "gameTime": "1 - 15:21",
            "label": "corner",
            "description": "Brad Guzan comes off his line to intercept the corner from Willian (Chelsea)."
        },
        {
            "gameTime": "1 - 14:39",
            "label": "",
            "description": "The ball is cleared after Diego Costa (Chelsea) attempted to dribble past an opposing player. The referee and his assistant both point at the corner flag. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 13:48",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 11:01",
            "label": "",
            "description": "Nice individual effort by Alan Hutton (Aston Villa). He gets all the way through to the keeper and hits a low drive to the bottom right corner, but Asmir Begovic does a good job to anticipate the direction of the ball and keeps it out."
        },
        {
            "gameTime": "1 - 10:08",
            "label": "",
            "description": "Jordan Ayew (Aston Villa) skips past his man but can't keep the ball in play. The ball has crossed the sideline. Chelsea are taking a throw in."
        },
        {
            "gameTime": "1 - 09:18",
            "label": "",
            "description": "Alan Hutton (Aston Villa) sends a cross into the box, but Asmir Begovic comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 07:54",
            "label": "",
            "description": "A pass by Cesc Fabregas (Chelsea) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 07:17",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 06:49",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. The ball goes behind for a corner. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 06:26",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 05:27",
            "label": "",
            "description": "Carles Gil (Aston Villa) takes the responsibility and fires a first time shot from about 25 metres out, but he doesn't hit the ball properly and it flies high over the crossbar. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "1 - 05:20",
            "label": "",
            "description": "Ashley Westwood (Aston Villa) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 04:25",
            "label": "",
            "description": "Ramires (Chelsea) fouls an opponent. At least that's what referee Roger East signals. Aston Villa win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 02:23",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 01:22",
            "label": "",
            "description": "The Chelsea players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Aston Villa will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Roger East."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. It was an even match on the whole, with both sides enjoying spells in the ascendancy. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        }
    ],
    "gameAwayTeam": "Aston Villa",
    "gameDate": "17/10/2015 - 17:00",
    "gameHomeTeam": "Chelsea",
    "gameScore": "2 - 0"
}