{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2016-04-16 - 19-30 Bayern Munich 3 - 0 Schalke/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. Bayern Munich were better today and displayed masterful control and movement. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        },
        {
            "gameTime": "2 - 45:21",
            "label": "whistle",
            "description": "Tobias Welz is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 45:10",
            "label": "",
            "description": "The free kick is delivered by Dennis Aogo (Schalke) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "2 - 44:17",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) tackles a bit over zealously and Tobias Welz blows for a foul. Schalke will take a free kick near the side line."
        },
        {
            "gameTime": "2 - 43:39",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 42:18",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 39:35",
            "label": "attendance",
            "description": "The attendance for today's match is 75000."
        },
        {
            "gameTime": "2 - 38:12",
            "label": "",
            "description": "Max Meyer (Schalke) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "",
            "description": "Bayern Munich are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 36:17",
            "label": "substitution",
            "description": "Andre Breitenreiter has decided to make a change. Alessandro Schopf (Schalke) replaces Maxim Choupo Moting."
        },
        {
            "gameTime": "2 - 34:50",
            "label": "",
            "description": "Leroy Sane (Schalke) looks very eager to impress, does well to beat his man and force a cross into the box, where one of his teammates gets his head on the ball, but it's too easy for the keeper. (in this sentence the player crosses and heads his own cross! So I created a different scenario)."
        },
        {
            "gameTime": "2 - 33:57",
            "label": "",
            "description": "Younes Belhanda (Schalke) has a great chance inside the six yard box, shoots low to the middle of the goal, but Manuel Neuer pulls off an exquisite save to deny him."
        },
        {
            "gameTime": "2 - 32:47",
            "label": "substitution",
            "description": "It's time for a substitution. Sebastian Rode (Bayern Munich) comes on in place of Arturo Vidal."
        },
        {
            "gameTime": "2 - 31:54",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Schalke was in an offside position."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "soccer-ball",
            "description": "Goal! Franck Ribery puts the ball on a plate for Arturo Vidal (Bayern Munich), who scores with a simple close range finish. It's 3:0."
        },
        {
            "gameTime": "2 - 26:57",
            "label": "corner",
            "description": "Franck Ribery (Bayern Munich) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 26:36",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) creates himself some space on the edge of the box and unleashes a strong shot which is blocked by a defender. The ball is out of play and Bayern Munich manage to earn a corner."
        },
        {
            "gameTime": "2 - 24:56",
            "label": "",
            "description": "Maxim Choupo Moting (Schalke) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 23:58",
            "label": "substitution",
            "description": "Younes Belhanda (Schalke) joins the action as a substitute, replacing Johannes Geis."
        },
        {
            "gameTime": "2 - 23:52",
            "label": "substitution",
            "description": "Andre Breitenreiter prepares a substitution. Klaas Jan Huntelaar is replaced by Max Meyer (Schalke)."
        },
        {
            "gameTime": "2 - 22:57",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Douglas Costa walks off the pitch to be replaced by Franck Ribery (Bayern Munich)."
        },
        {
            "gameTime": "2 - 22:11",
            "label": "",
            "description": "Leroy Sane (Schalke) rises high to head a nice lofted cross low towards the middle of the goal. Unfortunately for him, his close range effort lacks pace and Manuel Neuer makes a comfortable save."
        },
        {
            "gameTime": "2 - 21:26",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 21:07",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) races towards goal but the defender gets back well to make a challenge. Bayern Munich will take a corner kick."
        },
        {
            "gameTime": "2 - 19:32",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Rafinha finds Robert Lewandowski (Bayern Munich), who jumps highest and steers a close range header to the middle in the countermovement of the keeper. His effort was both strong and precise, and Ralf Fahrmann had no chance of stopping that. 0:0."
        },
        {
            "gameTime": "2 - 18:33",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) sends a killer pass through the opponent's defence in an effort to find a space for Robert Lewandowski, who is lurking close to the offside line. Robert Lewandowski (Bayern Munich) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "2 - 17:21",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Joshua Kimmich (Bayern Munich) is coming onto the pitch as Mehdi Benatia cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 16:46",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 15:20",
            "label": "",
            "description": "Bayern Munich decide to take a short pass from the free kick and the attacking effort continues."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "",
            "description": "Roman Neustadter (Schalke) trips an opposition player and Tobias Welz signals a foul. Bayern Munich get a free kick."
        },
        {
            "gameTime": "2 - 13:58",
            "label": "",
            "description": "Schalke are ruled offside."
        },
        {
            "gameTime": "2 - 13:42",
            "label": "corner",
            "description": "Johannes Geis (Schalke) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 13:13",
            "label": "",
            "description": "Maxim Choupo Moting (Schalke) received a clever through ball which could have put him in a promising position, but the defence was alert to the danger. Corner kick. Schalke will have an opportunity."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "2 - 12:30",
            "label": "",
            "description": "The linesman raises his flag for offside before Douglas Costa (Bayern Munich) heads on."
        },
        {
            "gameTime": "2 - 10:30",
            "label": "",
            "description": "Bayern Munich enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 08:38",
            "label": "soccer-ball",
            "description": "GOAL! Arturo Vidal meets a cross inside the box and heads the ball across the goal, where Robert Lewandowski (Bayern Munich) lurks and pokes it into the back of the net. 1:0."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes a short corner kick."
        },
        {
            "gameTime": "2 - 07:51",
            "label": "",
            "description": "A cross into the box from Kingsley Coman (Bayern Munich) is cleared. The referee signals a corner kick to Bayern Munich."
        },
        {
            "gameTime": "2 - 06:26",
            "label": "",
            "description": "Good team movement sets up Arturo Vidal (Bayern Munich) on the edge of the box, but he slices the ball narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 05:53",
            "label": "funfact",
            "description": "The percentage of ball possession is – 63:37."
        },
        {
            "gameTime": "2 - 04:53",
            "label": "",
            "description": "The goalkeeper dives to deny Mario Gotze (Bayern Munich), whose promising shot was aimed towards the left post."
        },
        {
            "gameTime": "2 - 03:53",
            "label": "",
            "description": "Maxim Choupo Moting (Schalke) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play and Bayern Munich will have a goal kick."
        },
        {
            "gameTime": "2 - 02:58",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) launches a cross from the corner, but Ralf Fahrmann is alert to thwart the effort."
        },
        {
            "gameTime": "2 - 02:40",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) fires the ball at goal from inside the area, but it's well blocked. The ball is out of play. A goal scoring opportunity from a corner for Bayern Munich."
        },
        {
            "gameTime": "2 - 01:26",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) attempts to score from 25 metres out, but his decent effort low towards the middle of the target is stopped by Ralf Fahrmann. It didn't really trouble him."
        },
        {
            "gameTime": "2 - 00:45",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) whips a long ball in from the free kick which is intercepted by Ralf Fahrmann."
        },
        {
            "gameTime": "2 - 00:31",
            "label": "",
            "description": "Johannes Geis (Schalke) was too fierce in his attempt to get the ball from his opponent and Tobias Welz blows for a foul. Bayern Munich are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Tobias Welz blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. Bayern Munich were controlling the game for most of the first half. The home players have grown in confidence and started to string some passes together. The visiting side have relied on their defence and counter attacks."
        },
        {
            "gameTime": "1 - 45:05",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 42:40",
            "label": "",
            "description": "A cross is clipped into the penalty area by Douglas Costa (Bayern Munich) but poses no threat."
        },
        {
            "gameTime": "1 - 41:51",
            "label": "",
            "description": "A crossfield pass from Sascha Riether (Schalke) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 40:45",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 39:43",
            "label": "",
            "description": "Rafinha (Bayern Munich) and Mario Gotze matched up again to find some space for an unmarked teammate."
        },
        {
            "gameTime": "1 - 38:25",
            "label": "",
            "description": "Bayern Munich are seeing far more of the ball now."
        },
        {
            "gameTime": "1 - 37:09",
            "label": "",
            "description": "Rafinha (Bayern Munich) robs an opponent of the ball and explodes in anger when Tobias Welz blows for a foul."
        },
        {
            "gameTime": "1 - 36:09",
            "label": "",
            "description": "The referee blows his whistle for a foul after Junior Caicara (Schalke) overruns the ball during an attack and makes an aggressive challenge on his opponent."
        },
        {
            "gameTime": "1 - 35:40",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) sends a long ball in, but Ralf Fahrmann comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 34:54",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 33:24",
            "label": "",
            "description": "Tobias Welz blows his whistle and it's Maxim Choupo Moting (Schalke) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 32:37",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) had a good opportunity when he latched on to a cross from the wing, but his header wasn't accurate at all and the ball went well wide of the left post."
        },
        {
            "gameTime": "1 - 31:42",
            "label": "",
            "description": "Klaas Jan Huntelaar (Schalke) rises high to head a nice lofted cross towards the roof of the net. Unfortunately for him, his close range effort lacks pace and Manuel Neuer makes a comfortable save."
        },
        {
            "gameTime": "1 - 31:16",
            "label": "corner",
            "description": "Dennis Aogo (Schalke) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 30:43",
            "label": "",
            "description": "Klaas Jan Huntelaar (Schalke) receives a clever long through ball and finds himself in a promising position inside the box, but the defence is alert to the danger and clears. The linesman makes the right call and Schalke will have a corner."
        },
        {
            "gameTime": "1 - 29:25",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 28:56",
            "label": "",
            "description": "What a save from Ralf Fahrmann! Robert Lewandowski (Bayern Munich) jumps high to meet a cross and glances a promising header from close range, but the goalkeeper pulls off a brilliant stop to keep it out. Bayern Munich get a corner."
        },
        {
            "gameTime": "1 - 27:41",
            "label": "",
            "description": "Foul! Mehdi Benatia (Bayern Munich) is penalised for pulling back his opponent. That's a free kick to Schalke. The free kick is taken short by Schalke."
        },
        {
            "gameTime": "1 - 27:28",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 25:29",
            "label": "",
            "description": "Bayern Munich are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error."
        },
        {
            "gameTime": "1 - 24:18",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) did his best to latch on to a crossfield pass, but it was too long and it goes out of play. The linesman signals a throw in for Schalke."
        },
        {
            "gameTime": "1 - 22:46",
            "label": "",
            "description": "The foul by Juan Bernat (Bayern Munich) was seen by Tobias Welz who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 21:58",
            "label": "",
            "description": "A cross from Douglas Costa (Bayern Munich) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 20:42",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 19:51",
            "label": "",
            "description": "David Alaba (Bayern Munich) displays his superb passing ability after picking out Kingsley Coman with a fine lofted pass to continue their attacking move."
        },
        {
            "gameTime": "1 - 18:31",
            "label": "corner",
            "description": "The resulting corner from Douglas Costa (Bayern Munich) is cleared."
        },
        {
            "gameTime": "1 - 17:49",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) breaks into the penalty area but his shot is blocked. The ball is out of play and the linesman points at the corner flag. Corner to Bayern Munich."
        },
        {
            "gameTime": "1 - 16:27",
            "label": "",
            "description": "Maxim Choupo Moting (Schalke) has an effort from distance but it's blocked."
        },
        {
            "gameTime": "1 - 15:49",
            "label": "",
            "description": "The linesman signals that Douglas Costa (Bayern Munich) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 14:01",
            "label": "",
            "description": "Rafinha (Bayern Munich) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 13:06",
            "label": "",
            "description": "Bayern Munich move the ball around well as they wait for an opportunity to shoot, but the attack is halted as they lose possession."
        },
        {
            "gameTime": "1 - 11:51",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "1 - 09:41",
            "label": "",
            "description": "Pierre Emile Hojbjerg (Schalke) picks up a pass, lines up a shot and strikes from 23 metres out, but Manuel Neuer thwarts the effort which is headed to the bottom left corner."
        },
        {
            "gameTime": "1 - 08:22",
            "label": "",
            "description": "Mehdi Benatia (Bayern Munich) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 06:51",
            "label": "",
            "description": "Bayern Munich control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "Junior Caicara (Schalke) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 04:34",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) is penalised for holding. Tobias Welz signals a set piece."
        },
        {
            "gameTime": "1 - 03:27",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 02:49",
            "label": "",
            "description": "Referee Tobias Welz sees the trip by Dennis Aogo (Schalke) and doesn't hesitate to blow his whistle. There is a free kick near the sideline to Bayern Munich."
        },
        {
            "gameTime": "1 - 01:34",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) makes space inside the box for a shot, but his effort goes just wide of the right post."
        },
        {
            "gameTime": "1 - 01:30",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 01:13",
            "label": "",
            "description": "The Bayern Munich players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Schalke will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Tobias Welz is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. Bayern Munich were better today and displayed masterful control and movement. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        }
    ],
    "gameAwayTeam": "Schalke",
    "gameDate": "16/04/2016 - 19:30",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "3 - 0"
}