{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-10-24 - 17-00 West Ham 2 - 1 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The hosts were superior today. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 50:43",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 49:39",
            "label": "y-card",
            "description": "Jonathan Moss shows a yellow card to John Obi Mikel (Chelsea), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 47:18",
            "label": "attendance",
            "description": "The attendance for today's match is 34977."
        },
        {
            "gameTime": "2 - 46:22",
            "label": "",
            "description": "Willian (Chelsea) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 46:01",
            "label": "substitution",
            "description": "The substitution has been made. Angelo Ogbonna (West Ham) has replaced Mark Noble."
        },
        {
            "gameTime": "2 - 45:14",
            "label": "",
            "description": "Jonathan Moss blows his whistle after Diafra Sakho (West Ham) kicks an opponent's legs instead of the ball. Chelsea have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 43:21",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 12:9."
        },
        {
            "gameTime": "2 - 42:32",
            "label": "",
            "description": "What a poor attempt! Pedro Obiang (West Ham) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "2 - 41:57",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 41:35",
            "label": "",
            "description": "Mark Noble (West Ham) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. West Ham have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 41:27",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 41:14",
            "label": "substitution",
            "description": "Substitution. Abdul Baba Rahman (Chelsea) has come on for Cesar Azpilicueta."
        },
        {
            "gameTime": "2 - 40:40",
            "label": "",
            "description": "The ball is cleared after Cheikhou Kouyate (West Ham) attempted to dribble past an opposing player. The referee and one of his assistants signal for a corner kick to West Ham."
        },
        {
            "gameTime": "2 - 39:35",
            "label": "",
            "description": "Willian (Chelsea) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 39:09",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Andrew Carroll (West Ham). Jonathan Moss saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "2 - 36:55",
            "label": "substitution",
            "description": "Here is a change. Ramires is going off and Jose Mourinho gives the last tactical orders to Falcao (Chelsea)."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "substitution",
            "description": "That will be all from Manuel Lanzini who is being replaced by the fresh legs of Pedro Obiang (West Ham)."
        },
        {
            "gameTime": "2 - 36:15",
            "label": "y-card",
            "description": "Willian (Chelsea) is booked."
        },
        {
            "gameTime": "2 - 34:55",
            "label": "",
            "description": "Willian (Chelsea) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "2 - 33:44",
            "label": "soccer-ball",
            "description": "Andrew Carroll (West Ham) jumps for a cross and plants a perfect header inside the left post."
        },
        {
            "gameTime": "2 - 32:49",
            "label": "",
            "description": "Manuel Lanzini (West Ham) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "2 - 32:28",
            "label": "",
            "description": "Ramires (Chelsea) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "2 - 32:07",
            "label": "corner",
            "description": "The corner from Dimitri Payet (West Ham) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 31:08",
            "label": "",
            "description": "Aaron Cresswell (West Ham) swings a cross into the box, but it's far too close to Asmir Begovic, who smothers the ball."
        },
        {
            "gameTime": "2 - 29:27",
            "label": "",
            "description": "The cross into the penalty area from Dimitri Payet (West Ham) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "2 - 28:43",
            "label": "y-card",
            "description": "Cheikhou Kouyate (West Ham) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 27:22",
            "label": "",
            "description": "The game is pretty dull as West Ham are just passing the ball from player to player. Nothing lasts forever, though, and they finally make a mistake, allowing the opposition to pick up the ball."
        },
        {
            "gameTime": "2 - 24:01",
            "label": "",
            "description": "Dimitri Payet (West Ham) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "2 - 23:03",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Andrew Carroll (West Ham) replaces Mauro Zarate."
        },
        {
            "gameTime": "2 - 22:39",
            "label": "",
            "description": "One of the players from West Ham times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 22:18",
            "label": "",
            "description": "Dimitri Payet (West Ham) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "2 - 19:47",
            "label": "",
            "description": "The linesman raises his flag. Diego Costa (Chelsea) is adjudged offside."
        },
        {
            "gameTime": "2 - 19:40",
            "label": "",
            "description": "Willian (Chelsea) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 18:57",
            "label": "",
            "description": "Carl Jenkinson (West Ham) fouls an opponent. At least that's what referee Jonathan Moss signals. That's a free kick to Chelsea."
        },
        {
            "gameTime": "2 - 16:35",
            "label": "injury",
            "description": "Ramires (Chelsea) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 15:57",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 15:23",
            "label": "",
            "description": "Aaron Cresswell (West Ham) tries to slide the ball through to a teammate but it's well blocked by a defender. West Ham will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 14:07",
            "label": "",
            "description": "Mauro Zarate (West Ham) unleashes a powerful first time volley towards goal, but his effort is blocked after the goalkeeper uses his agility to make a save."
        },
        {
            "gameTime": "2 - 12:46",
            "label": "",
            "description": "Willian (Chelsea) whips a long ball in from the free kick which is intercepted by Adrian."
        },
        {
            "gameTime": "2 - 10:54",
            "label": "soccer-ball",
            "description": "Gary Cahill (Chelsea) scores from the corner kick. The ball slipped through the box to Gary Cahill (Chelsea) and he slotted it past the goalkeeper."
        },
        {
            "gameTime": "2 - 10:13",
            "label": "corner",
            "description": "Willian (Chelsea) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 10:05",
            "label": "",
            "description": "A cross from Eden Hazard (Chelsea) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "",
            "description": "Mark Noble (West Ham) is flagged for offside."
        },
        {
            "gameTime": "2 - 07:34",
            "label": "",
            "description": "A pass by Aaron Cresswell (West Ham) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 07:11",
            "label": "",
            "description": "Jonathan Moss blows his whistle and it's Diego Costa (Chelsea) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 05:24",
            "label": "",
            "description": "Eden Hazard (Chelsea) sends a chip pass into the box, but Adrian is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 04:42",
            "label": "",
            "description": "A crossfield pass from Carl Jenkinson (West Ham) fails to find any of his teammates. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "2 - 04:00",
            "label": "",
            "description": "Ramires (Chelsea) trips an opponent with a slide tackle. Jonathan Moss stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "2 - 01:59",
            "label": "",
            "description": "Diego Costa (Chelsea) is adjudged offside."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Cesc Fabregas is replaced by John Obi Mikel (Chelsea)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "There was certainly plenty of action during that opening 45 minutes. It has been a tight contest so far. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 47:31",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:47",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Dimitri Payet (West Ham), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:30",
            "label": "y-card",
            "description": "The main referee, Jonathan Moss, is apparently not going to tolerate any discussions. Cesc Fabregas (Chelsea) is given a yellow card for dissent."
        },
        {
            "gameTime": "1 - 44:25",
            "label": "y-card",
            "description": "Diego Costa (Chelsea) is booked for saying more than Jonathan Moss was willing to tolerate."
        },
        {
            "gameTime": "1 - 43:14",
            "label": "yr-card",
            "description": "Jonathan Moss blows his whistle and Nemanja Matic (Chelsea) is shown a second yellow card for his foul. His manager will not be pleased. He has lot of time to think about it as he walks off."
        },
        {
            "gameTime": "1 - 41:53",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) has a goal ruled out for offside!"
        },
        {
            "gameTime": "1 - 41:34",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 41:13",
            "label": "",
            "description": "West Ham are just stroking the ball across the park now, but the defence is doing very well breaking up their possession. The ball is out of play. A goal scoring opportunity from a corner for West Ham."
        },
        {
            "gameTime": "1 - 38:25",
            "label": "",
            "description": "Dimitri Payet slides a brilliant pass into Manuel Lanzini (West Ham), but his shot from inside the box goes a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 37:43",
            "label": "",
            "description": "Eden Hazard (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 35:50",
            "label": "",
            "description": "James Collins (West Ham) latches on to a well placed cross from the free kick on the edge of the box and attempts to surprise the goalkeeper with a quick header towards the net. Unfortunately for him, the keeper was quicker and denies him."
        },
        {
            "gameTime": "1 - 34:48",
            "label": "y-card",
            "description": "Nemanja Matic (Chelsea) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Jonathan Moss ignores the protests."
        },
        {
            "gameTime": "1 - 34:40",
            "label": "",
            "description": "Kurt Zouma (Chelsea) darts to the edge of the box to meet the ball from the free kick and sends a header towards the right post. One of the defending players gets in its way and blocks it."
        },
        {
            "gameTime": "1 - 34:06",
            "label": "corner",
            "description": "Corner kick. Cesc Fabregas (Chelsea) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 33:56",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 32:32",
            "label": "",
            "description": "Willian (Chelsea) produces a mid range free kick and sends a daisy cutter towards the left post, but the goalkeeper makes a good save and stops his effort."
        },
        {
            "gameTime": "1 - 31:23",
            "label": "",
            "description": "A player from West Ham commits a rough challenge. Jonathan Moss blows for a foul and keeps the game under control. Chelsea are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 30:19",
            "label": "corner",
            "description": "The corner from Cesc Fabregas is intercepted by Adrian (West Ham)."
        },
        {
            "gameTime": "1 - 29:50",
            "label": "",
            "description": "Ramires (Chelsea) sends the ball into the box from the side of the pitch, but his cross is blocked. Chelsea get a corner."
        },
        {
            "gameTime": "1 - 28:23",
            "label": "",
            "description": "Ramires (Chelsea) looks to break free, but his touch lets him down and he loses the ball. The ball is off of the pitch and it's a goal kick for West Ham."
        },
        {
            "gameTime": "1 - 27:40",
            "label": "",
            "description": "The Chelsea players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 24:51",
            "label": "",
            "description": "Ramires (Chelsea) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies into the stands."
        },
        {
            "gameTime": "1 - 24:15",
            "label": "",
            "description": "The free kick from long range, taken by West Ham, is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 23:46",
            "label": "y-card",
            "description": "Today's referee Jonathan Moss rightly decides to book Cesar Azpilicueta (Chelsea) for his harsh tackle."
        },
        {
            "gameTime": "1 - 23:03",
            "label": "",
            "description": "Chelsea are ruled offside."
        },
        {
            "gameTime": "1 - 22:11",
            "label": "",
            "description": "Dimitri Payet (West Ham) sends a long ball in, but Asmir Begovic comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 21:29",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play."
        },
        {
            "gameTime": "1 - 20:39",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) and Diego Costa try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 20:16",
            "label": "",
            "description": "Carl Jenkinson (West Ham) unleashed a powerful long range strike, but the ball was blocked by a defender on its way."
        },
        {
            "gameTime": "1 - 19:06",
            "label": "",
            "description": "Mark Noble (West Ham) attempts a long crossfield pass, but the defence does well to intercept the ball. The ball has crossed the sideline. West Ham are taking a throw in."
        },
        {
            "gameTime": "1 - 16:54",
            "label": "soccer-ball",
            "description": "Goal! Mauro Zarate (West Ham) picks up the ball from a rebound and from the edge of the box he unleashes a low shot into the bottom right corner. Asmir Begovic is unable to keep the ball out of the net. It's 1:0."
        },
        {
            "gameTime": "1 - 16:50",
            "label": "corner",
            "description": "The corner from Dimitri Payet (West Ham) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 16:07",
            "label": "",
            "description": "Dimitri Payet (West Ham) stands over the free kick and opts to take it himself, sending it towards the top of net only for Asmir Begovic to dive and make a save. The linesman makes the right call and West Ham will have a corner."
        },
        {
            "gameTime": "1 - 15:02",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again. West Ham earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 14:00",
            "label": "",
            "description": "Diego Costa (Chelsea) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball goes well wide of the left post."
        },
        {
            "gameTime": "1 - 13:28",
            "label": "corner",
            "description": "Willian (Chelsea) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "1 - 13:23",
            "label": "",
            "description": "Diego Costa (Chelsea) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 12:07",
            "label": "",
            "description": "Willian (Chelsea) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 10:48",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 10:22",
            "label": "",
            "description": "Aaron Cresswell (West Ham) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The referee signals a corner kick to West Ham."
        },
        {
            "gameTime": "1 - 09:44",
            "label": "",
            "description": "Ramires (Chelsea) sends a long ball in, but Adrian comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 08:35",
            "label": "",
            "description": "Diego Costa (Chelsea) latches onto a lofted pass on the edge of the penalty box and unleashes a volley towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 07:13",
            "label": "",
            "description": "The linesman raises his flag for offside before Dimitri Payet (West Ham) heads on."
        },
        {
            "gameTime": "1 - 05:04",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Dimitri Payet (West Ham) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "1 - 03:01",
            "label": "",
            "description": "Chelsea take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 02:48",
            "label": "",
            "description": "Jonathan Moss blows his whistle for a foul after Diafra Sakho (West Ham) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 01:20",
            "label": "",
            "description": "Manuel Lanzini (West Ham) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Chelsea will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jonathan Moss was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The hosts were superior today. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "24/10/2015 - 17:00",
    "gameHomeTeam": "West Ham",
    "gameScore": "2 - 1"
}