{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-15 - 21-45 PSV 2 - 1 Manchester United/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The visitors played the better football overall. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 48:03",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:48",
            "label": "",
            "description": "Memphis Depay (Manchester United) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 46:20",
            "label": "",
            "description": "Luciano Narsingh (PSV) plays a through ball but overhits it. The ball is off of the pitch and it's a goal kick for Manchester United."
        },
        {
            "gameTime": "2 - 45:30",
            "label": "",
            "description": "Memphis Depay (Manchester United) receives the ball from the set piece on the edge of the box, but fails to score because his shot is blocked."
        },
        {
            "gameTime": "2 - 45:22",
            "label": "",
            "description": "Mata (Manchester United) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "2 - 45:17",
            "label": "",
            "description": "Stijn Schaars (PSV) touches the ball with his hand. Manchester United are awarded the free kick."
        },
        {
            "gameTime": "2 - 45:10",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 45:03",
            "label": "",
            "description": "Marouane Fellaini (Manchester United) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender. Manchester United have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:40",
            "label": "",
            "description": "Bastian Schweinsteiger (Manchester United) takes a short free kick."
        },
        {
            "gameTime": "2 - 44:18",
            "label": "",
            "description": "Stijn Schaars (PSV) makes a reckless foul in order to win the ball from his opponent. Nicola Rizzoli has a clear sight of it and blows his whistle. Free kick. Manchester United will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 42:33",
            "label": "",
            "description": "Marouane Fellaini (Manchester United) unleashes a shot from 25 metres out but is unable to find the target and it goes well wide of the left post."
        },
        {
            "gameTime": "2 - 42:17",
            "label": "",
            "description": "Antonio Valencia (Manchester United) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 40:26",
            "label": "substitution",
            "description": "Louis van Gaal has decided to introduce fresh legs, with Antonio Valencia (Manchester United) replacing Ashley Young."
        },
        {
            "gameTime": "2 - 40:09",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Maxime Lestienne departs the field of play to be replaced by Jurgen Locadia (PSV)."
        },
        {
            "gameTime": "2 - 39:29",
            "label": "",
            "description": "Anthony Martial (Manchester United) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 38:13",
            "label": "",
            "description": "What a big chance! Luuk de Jong (PSV) picks up an inch perfect pass inside the box and skies the ball well over the bar."
        },
        {
            "gameTime": "2 - 37:15",
            "label": "",
            "description": "Maxime Lestienne (PSV) shoots from the edge of the penalty area. The ball travels towards the target, but David de Gea easily deals with the threat."
        },
        {
            "gameTime": "2 - 36:47",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 6:17."
        },
        {
            "gameTime": "2 - 35:36",
            "label": "",
            "description": "Chance! Anthony Martial (Manchester United) was in a good position inside the box, but he couldn't connect with the pass as it was overhit."
        },
        {
            "gameTime": "2 - 34:53",
            "label": "corner",
            "description": "Maxime Lestienne (PSV) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 34:28",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Maxime Lestienne (PSV), is intercepted by the opposition's defence. Now PSV have a corner."
        },
        {
            "gameTime": "2 - 32:36",
            "label": "",
            "description": "Anthony Martial (Manchester United) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 31:02",
            "label": "",
            "description": "Daley Blind (Manchester United) sends over a cross, but he can't find any teammate inside the box. Poor delivery. The ball is off of the pitch and it's a goal kick for PSV."
        },
        {
            "gameTime": "2 - 29:59",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Marouane Fellaini (Manchester United) will replace Ander Herrera."
        },
        {
            "gameTime": "2 - 28:14",
            "label": "",
            "description": "Ashley Young (Manchester United) bursts into the box and pulls the trigger, but he can't beat the goalkeeper. He directed his shot towards the middle of the goal, but one of the defenders reacted brilliantly to block it."
        },
        {
            "gameTime": "2 - 26:40",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Memphis Depay (Manchester United), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 26:24",
            "label": "substitution",
            "description": "Problems for Phillip Cocu as Andres Guardado is not able to play anymore. His injury is too serious and Stijn Schaars (PSV) replaces him."
        },
        {
            "gameTime": "2 - 25:39",
            "label": "y-card",
            "description": "The main referee, Nicola Rizzoli, is apparently not going to tolerate any discussions. Jeffrey Bruma (PSV) is given a yellow card for dissent."
        },
        {
            "gameTime": "2 - 25:31",
            "label": "corner",
            "description": "The referee blows his whistle, Manchester United are awarded a corner kick."
        },
        {
            "gameTime": "2 - 24:54",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Matteo Darmian (Manchester United)."
        },
        {
            "gameTime": "2 - 24:28",
            "label": "",
            "description": "A cross from Matteo Darmian (Manchester United) fails to reach the box as the defence clears the ball away to safety. Manchester United will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 24:10",
            "label": "",
            "description": "Andres Guardado (PSV) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 22:05",
            "label": "injury",
            "description": "Andres Guardado (PSV) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 21:47",
            "label": "y-card",
            "description": "Nicola Rizzoli shows a yellow card to Chris Smalling (Manchester United) for a tough tackle."
        },
        {
            "gameTime": "2 - 20:48",
            "label": "",
            "description": "Memphis Depay (Manchester United) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "2 - 19:51",
            "label": "",
            "description": "Memphis Depay (Manchester United) latches on to a brilliant through ball in a promising position, but one of the defenders is alert to the danger and dispossess him."
        },
        {
            "gameTime": "2 - 19:29",
            "label": "",
            "description": "Ashley Young (Manchester United) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender."
        },
        {
            "gameTime": "2 - 19:06",
            "label": "",
            "description": "Ander Herrera (Manchester United) receives a pass and tries his luck with a shot from 20 metres out. Jeroen Zoet pulls off a comfortable save to stop the effort going into the middle of the goal."
        },
        {
            "gameTime": "2 - 18:28",
            "label": "",
            "description": "Joshua Brenet (PSV) fashions a shot from the edge of the box after receiving an accurate pass. David de Gea makes a stunning save to stop the effort from flying into the right side of the goal."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 15:48",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) hammered the ball from a long range free kick only into the defensive wall."
        },
        {
            "gameTime": "2 - 15:16",
            "label": "",
            "description": "Manchester United have a free kick."
        },
        {
            "gameTime": "2 - 14:46",
            "label": "y-card",
            "description": "A yellow card for a tackle by Hector Moreno (PSV). Nicola Rizzoli doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 13:35",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "2 - 11:24",
            "label": "soccer-ball",
            "description": "Maxime Lestienne launches a beautiful lofted cross into the box, where Luciano Narsingh (PSV) rises high to head the ball into the right side of the goal and beyond the goalkeeper. 1:1."
        },
        {
            "gameTime": "2 - 09:28",
            "label": "y-card",
            "description": "Santiago Arias (PSV) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Nicola Rizzoli didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 07:37",
            "label": "",
            "description": "Ashley Young (Manchester United) was too forceful with his tackle and Nicola Rizzoli interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 06:52",
            "label": "corner",
            "description": "Luciano Narsingh (PSV) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 06:25",
            "label": "",
            "description": "Santiago Arias (PSV) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. It will be a corner kick for PSV."
        },
        {
            "gameTime": "2 - 05:42",
            "label": "",
            "description": "Memphis Depay (Manchester United) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Jeroen Zoet was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 04:47",
            "label": "",
            "description": "Ashley Young (Manchester United) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 03:56",
            "label": "",
            "description": "Manchester United are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "2 - 02:35",
            "label": "",
            "description": "Marcos Rojo (Manchester United) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 01:40",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 01:17",
            "label": "",
            "description": "Anthony Martial (Manchester United) looks to break free, but an opposing player clears the ball away. Manchester United force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 53:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. The visitors were superior in their performance through the first half. They were more active and precise. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 53:02",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 51:45",
            "label": "",
            "description": "Ashley Young (Manchester United) connects with a pass inside the box, but his effort goes well wide of the left post."
        },
        {
            "gameTime": "1 - 50:27",
            "label": "",
            "description": "Ashley Young (Manchester United) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 48:34",
            "label": "",
            "description": "Manchester United keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 46:45",
            "label": "soccer-ball",
            "description": "The corner from Maxime Lestienne goes into a dangerous area and finds Hector Moreno (PSV), who outjumps the defence and glances a header into the back of the net. 1:1."
        },
        {
            "gameTime": "1 - 46:21",
            "label": "corner",
            "description": "Maxime Lestienne (PSV) will take a corner kick."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "",
            "description": "Maxime Lestienne (PSV) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The referee points to the corner flag and PSV will take a corner."
        },
        {
            "gameTime": "1 - 45:16",
            "label": "",
            "description": "The free kick into the penalty area from Hector Moreno (PSV) is cleared."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 8 min. of added time."
        },
        {
            "gameTime": "1 - 44:44",
            "label": "",
            "description": "Ashley Young (Manchester United) brings his opponent down. Nicola Rizzoli has a clear vision and blows his whistle for a foul. A free kick to PSV."
        },
        {
            "gameTime": "1 - 44:20",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Memphis Depay (Manchester United) takes it short."
        },
        {
            "gameTime": "1 - 43:39",
            "label": "",
            "description": "Chris Smalling (Manchester United) runs with the ball towards the keeper and pulls the trigger from close range, but Jeroen Zoet anticipates his intention and makes an amazing save to stop the shot going into the middle of the target. The ball is out of play. A goal scoring opportunity from a corner for Manchester United."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "Chance! Memphis Depay (Manchester United) comes within inches of scoring after picking up a pass from Mata, but his shot from inside the box flashes inches wide of the right post."
        },
        {
            "gameTime": "1 - 42:12",
            "label": "",
            "description": "Joshua Brenet (PSV) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "soccer-ball",
            "description": "Memphis Depay (Manchester United) displays great tekkers inside the box leading to a fantastic goal, leaving the goalkeeper stranded."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "",
            "description": "Mata (Manchester United) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety."
        },
        {
            "gameTime": "1 - 39:14",
            "label": "",
            "description": "Maxime Lestienne (PSV) unleashes a shot, but his effort isn't precise at all and it flies well wide of the left post."
        },
        {
            "gameTime": "1 - 38:06",
            "label": "",
            "description": "Maxime Lestienne (PSV) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 37:39",
            "label": "",
            "description": "Anthony Martial (Manchester United) launches himself at the ball from the free kick and produces a header which lacks accuracy, sending it just wide of the right post."
        },
        {
            "gameTime": "1 - 37:27",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) will take the free kick."
        },
        {
            "gameTime": "1 - 36:18",
            "label": "",
            "description": "Joshua Brenet (PSV) commits a rough foul. Nicola Rizzoli stops the game and makes a call. Manchester United win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 35:08",
            "label": "",
            "description": "Daley Blind (Manchester United) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "1 - 34:18",
            "label": "",
            "description": "Bastian Schweinsteiger (Manchester United) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "1 - 33:37",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 33:21",
            "label": "",
            "description": "The ball is cleared after Daley Blind (Manchester United) attempted to dribble past an opposing player. The referee and his assistant both point at the corner flag. Manchester United will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 32:26",
            "label": "",
            "description": "An attempted cross from Ashley Young (Manchester United) is cleared."
        },
        {
            "gameTime": "1 - 30:49",
            "label": "",
            "description": "Maxime Lestienne (PSV) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 29:49",
            "label": "",
            "description": "Flag goes up against Luciano Narsingh (PSV) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 28:05",
            "label": "",
            "description": "Bastian Schweinsteiger (Manchester United) sends a long ball in, but Jeroen Zoet comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 26:59",
            "label": "",
            "description": "Nicola Rizzoli couldn't ignore the rough tackle by Ander Herrera (Manchester United) and blew his whistle."
        },
        {
            "gameTime": "1 - 26:17",
            "label": "",
            "description": "The Manchester United players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 23:59",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 23:45",
            "label": "substitution",
            "description": "Louis van Gaal is forced to make a change. Luke Shaw is not able to carry on due to injury. He is replaced by Marcos Rojo (Manchester United)."
        },
        {
            "gameTime": "1 - 14:30",
            "label": "injury",
            "description": "The game is interrupted now, Luke Shaw (Manchester United) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 14:20",
            "label": "",
            "description": "Luke Shaw (Manchester United) races towards goal but the defender gets back well to make a challenge. Corner kick. Manchester United will have an opportunity."
        },
        {
            "gameTime": "1 - 13:17",
            "label": "",
            "description": "The referee blows his whistle after Luciano Narsingh (PSV) does a good impression of a basketball player and handles the ball."
        },
        {
            "gameTime": "1 - 12:46",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 12:23",
            "label": "",
            "description": "Matteo Darmian (Manchester United) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee points to the corner flag. It's a corner to Manchester United."
        },
        {
            "gameTime": "1 - 11:01",
            "label": "",
            "description": "Luciano Narsingh (PSV) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 10:30",
            "label": "",
            "description": "Ashley Young (Manchester United) fails to pick a body out in the box with an over hit cross to the back post. The ball is off of the pitch and it's a goal kick for PSV."
        },
        {
            "gameTime": "1 - 09:58",
            "label": "corner",
            "description": "Memphis Depay (Manchester United) works the corner short."
        },
        {
            "gameTime": "1 - 09:41",
            "label": "",
            "description": "Ashley Young (Manchester United) flights in the cross, but the defender is alert and clears to safety. The ball goes out for a corner. Manchester United can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 08:43",
            "label": "",
            "description": "Nicola Rizzoli blows for a foul after Ander Herrera (Manchester United) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 07:26",
            "label": "",
            "description": "Some neat passing and movement from PSV as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 06:12",
            "label": "",
            "description": "Half chance! Memphis Depay (Manchester United) plays a pass into the box, but Jeroen Zoet reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 04:17",
            "label": "",
            "description": "Ashley Young (Manchester United) skips past his man but can't keep the ball in play. The ball goes out of play and PSV will have a goal kick."
        },
        {
            "gameTime": "1 - 02:18",
            "label": "",
            "description": "It looks like Anthony Martial (Manchester United) saw red with that tackle. Nicola Rizzoli won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 01:51",
            "label": "",
            "description": "Maxime Lestienne (PSV) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Manchester United will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Nicola Rizzoli will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The visitors played the better football overall. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Manchester United",
    "gameDate": "15/09/2015 - 21:45",
    "gameHomeTeam": "PSV",
    "gameScore": "2 - 1"
}