{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-05-06 - 19-00 Napoli 3 - 1 Cagliari/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:09",
            "label": "whistle",
            "description": "Piero Giacomelli is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 46:51",
            "label": "soccer-ball",
            "description": "Diego Farias (Cagliari) received a delightful pass inside the box before slotting the ball past the goalkeeper. What a brilliant finish!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:25",
            "label": "",
            "description": "Ambitious effort from Diego Farias (Cagliari). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well wide of the right post."
        },
        {
            "gameTime": "2 - 41:13",
            "label": "",
            "description": "Jose Callejon (Napoli) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Rafael was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 36:11",
            "label": "",
            "description": "Emanuele Giaccherini (Napoli) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "2 - 33:26",
            "label": "substitution",
            "description": "Substitution. Emanuele Giaccherini (Napoli) has come on for Lorenzo Insigne."
        },
        {
            "gameTime": "2 - 32:25",
            "label": "substitution",
            "description": "Marco Sau will be replaced by Diego Farias (Cagliari)."
        },
        {
            "gameTime": "2 - 31:40",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to make a change. Arkadiusz Milik (Napoli) replaces Dries Mertens."
        },
        {
            "gameTime": "2 - 28:01",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) releases a promising shot from the free kick from around 25 metres out. The ball goes towards the middle of the goal, but the goalkeeper makes a save and denies him."
        },
        {
            "gameTime": "2 - 25:20",
            "label": "substitution",
            "description": "A substitution has been made. Nicola Murru is replaced by Paolo Farago (Cagliari)."
        },
        {
            "gameTime": "2 - 24:30",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 24:19",
            "label": "",
            "description": "Jose Callejon (Napoli) wastes a good opportunity as his pass into the box is blocked by the defence. The referee points to the corner flag and Napoli will take a corner."
        },
        {
            "gameTime": "2 - 23:34",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to introduce fresh legs, with Marko Rog (Napoli) replacing Marek Hamsik."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Artur Ionita leaves the pitch and Joao Pedro (Cagliari) comes on."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "soccer-ball",
            "description": "It's 3:0! Dries Mertens feeds Lorenzo Insigne (Napoli) inside the box, who is unmarked and buries the ball in the top right corner."
        },
        {
            "gameTime": "2 - 20:27",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 19:27",
            "label": "",
            "description": "Raul Albiol (Napoli) leaps high to connect with a well taken corner kick and heads towards the top of the net. Rafael is alert and pulls off a great save to deflect the ball onto the bar. Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 19:04",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 18:38",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) has an effort from distance but it's blocked. The linesman makes the right call and Napoli will have a corner."
        },
        {
            "gameTime": "2 - 12:12",
            "label": "",
            "description": "Jose Callejon (Napoli) latches on to a lofted pass and strikes the ball! His attempt flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 11:05",
            "label": "corner",
            "description": "The resulting corner from Faouzi Ghoulam (Napoli) is cleared by the defence."
        },
        {
            "gameTime": "2 - 10:43",
            "label": "",
            "description": "Dries Mertens (Napoli) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Napoli earn a corner."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Piotr Zielinski (Napoli) was quite harsh and Piero Giacomelli didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 07:07",
            "label": "corner",
            "description": "A dangerous looking corner kick from Marek Hamsik (Napoli) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 06:46",
            "label": "",
            "description": "Dries Mertens (Napoli) misses a good chance to score. An inch perfect cross into the box finds Dries Mertens (Napoli) who rises for a header, but sends the ball well over the bar. The referee blows his whistle, Napoli are awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:23",
            "label": "corner",
            "description": "Nicolo Barella (Cagliari) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 04:00",
            "label": "soccer-ball",
            "description": "Goal! Dries Mertens (Napoli) collects a pass and without hesitation fires an unstoppable shot into the bottom left corner."
        },
        {
            "gameTime": "2 - 02:39",
            "label": "injury",
            "description": "Fabio Pisacane (Cagliari) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:11",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "",
            "description": "The resulting free kick from 24 metres out taken by Marco Borriello (Cagliari) was blocked by the defensive wall, which was perfectly positioned by the goalkeeper."
        },
        {
            "gameTime": "1 - 45:17",
            "label": "",
            "description": "Cagliari are awarded a free kick on the edge of the box."
        },
        {
            "gameTime": "1 - 44:15",
            "label": "",
            "description": "Dries Mertens (Napoli) goes on a mazy run through the defence and gets within shooting range inside the box, but his low effort to the middle of the target is thwarted by Rafael."
        },
        {
            "gameTime": "1 - 42:07",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 41:49",
            "label": "",
            "description": "Marek Hamsik (Napoli) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee and one of his assistants signal for a corner kick to Napoli."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "",
            "description": "Piero Giacomelli blows his whistle and signals a foul after Simone Padoin (Cagliari) brought his opponent down."
        },
        {
            "gameTime": "1 - 36:33",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "1 - 35:55",
            "label": "corner",
            "description": "Nicolo Barella (Cagliari) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 35:21",
            "label": "",
            "description": "Marco Sau (Cagliari) received a clever through ball which could have put him in a promising position, but the defence was alert to the danger. Now Cagliari have a corner."
        },
        {
            "gameTime": "1 - 34:26",
            "label": "",
            "description": "What a chance for Piotr Zielinski (Napoli) as he produced a stunning snap shot from the edge of the box! The goalkeeper was a bit lucky as the ball went just wide of the right post."
        },
        {
            "gameTime": "1 - 33:06",
            "label": "",
            "description": "The game is interrupted as Lorenzo Insigne (Napoli) is flagged offside."
        },
        {
            "gameTime": "1 - 30:50",
            "label": "",
            "description": "Lovely skill from Marek Hamsik (Napoli) as he gets away from defenders and unleashes a shot from 45 metres out, but his effort goes just over the bar."
        },
        {
            "gameTime": "1 - 29:35",
            "label": "",
            "description": "That was close by Dries Mertens (Napoli)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the right post."
        },
        {
            "gameTime": "1 - 28:21",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) is afforded space inside the box after collecting a pass, but the chance is wasted as his shot goes harmlessly over the crossbar. The ball is off of the pitch and it's a goal kick for Cagliari."
        },
        {
            "gameTime": "1 - 24:41",
            "label": "",
            "description": "Marco Borriello (Cagliari) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the bottom right corner. Pepe Reina has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 21:50",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) creates some space for himself to pick up a pass on the edge of the box and unleashes a decent strike which goes a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 20:34",
            "label": "",
            "description": "Jose Callejon (Napoli) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 18:41",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) gets on the end of a good pass and from mid range he unleashes a decent strike, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 15:34",
            "label": "",
            "description": "Jose Callejon (Napoli) attempted to pick out a free teammate inside the box, but Rafael comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) fails to deliver a decent cross from the corner and the ball goes out of play."
        },
        {
            "gameTime": "1 - 11:48",
            "label": "",
            "description": "Jose Callejon (Napoli) tries to send a pass but it's blocked. Napoli will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 08:55",
            "label": "",
            "description": "An unsuccessful long range effort by Dries Mertens (Napoli) after he collected a pass and unleashed his shot. He attempted to surprise the goalkeeper, who easily stopped his shot."
        },
        {
            "gameTime": "1 - 08:18",
            "label": "",
            "description": "Marek Hamsik (Napoli) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "1 - 07:11",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) is adjudged offside."
        },
        {
            "gameTime": "1 - 07:00",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Lorenzo Insigne (Napoli). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "1 - 03:59",
            "label": "",
            "description": "Jorginho (Napoli) fashions a shot from the edge of the box after receiving an accurate pass. Rafael makes a comfortable save to stop the effort from flying into the middle of the goal."
        },
        {
            "gameTime": "1 - 02:00",
            "label": "soccer-ball",
            "description": "What a magnificent finish! Dries Mertens (Napoli) wonderfully times his run onto a cross and thunders the ball from deep inside the box into the left side of the net!"
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Napoli will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Piero Giacomelli is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "2:1 has been the most common result for Cagliari this season. 6 of their matches finished with this score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last 5 games between these two teams have been goal rich, with an average of 3.8 goals per game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Piero Giacomelli is looking at his watch and immediately ends this match."
        }
    ],
    "gameAwayTeam": "Cagliari",
    "gameDate": "06/05/2017 - 19:00",
    "gameHomeTeam": "Napoli",
    "gameScore": "3 - 1"
}