{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/france_ligue-1/2016-2017/2017-04-30 - 22-00 Nice 3 - 1 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:28",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 47:30",
            "label": "r-card",
            "description": "Angel Di Maria (Paris SG) makes a horror tackle on his opponent and the referee sends him off!"
        },
        {
            "gameTime": "2 - 46:12",
            "label": "soccer-ball",
            "description": "It's a goal! Anastasios Donis (Nice) gets on the end of a pass and it allows him to finish into an empty net with a close range header. The score has changed to 3:1."
        },
        {
            "gameTime": "2 - 44:30",
            "label": "r-card",
            "description": "Thiago Motta (Paris SG) knows that the game is over for him after receiving a red card from the referee for fouling his opponent!"
        },
        {
            "gameTime": "2 - 41:55",
            "label": "",
            "description": "Pereira Ricardo (Nice) makes a strong challenge and Ruddy Buquet blows for a foul. It's a free kick to Paris SG, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "2 - 39:34",
            "label": "",
            "description": "Lucas (Paris SG) decides to try his luck with a first time bullet of a shot. Unfortunately for him, he doesn't hit the ball perfectly and his effort ends well wide of the left post."
        },
        {
            "gameTime": "2 - 38:59",
            "label": "substitution",
            "description": "Lucien Favre prepares a substitution. Vincent Koziello is replaced by Mounir Obbadi (Nice)."
        },
        {
            "gameTime": "2 - 38:57",
            "label": "",
            "description": "A rebound falls at the feet of Thomas Meunier (Paris SG), who unleashes a shot from long range towards the goal. However, his effort is poor and it flies well wide of the right post."
        },
        {
            "gameTime": "2 - 38:09",
            "label": "",
            "description": "Thomas Meunier (Paris SG) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 35:13",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Paris SG was in an offside position."
        },
        {
            "gameTime": "2 - 34:51",
            "label": "corner",
            "description": "The corner by Angel Di Maria (Paris SG) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "2 - 34:36",
            "label": "",
            "description": "Angel Di Maria (Paris SG) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him. Paris SG get a corner."
        },
        {
            "gameTime": "2 - 32:42",
            "label": "substitution",
            "description": "Here is a change. Julian Draxler is going off and Unai Emery Etxegoien gives the last tactical orders to Lucas (Paris SG)."
        },
        {
            "gameTime": "2 - 32:26",
            "label": "substitution",
            "description": "We are about to witness a substitution. Mickael Le Bihan (Nice) is replacing Mario Balotelli."
        },
        {
            "gameTime": "2 - 31:08",
            "label": "",
            "description": "Marquinhos (Paris SG) wastes a huge opportunity. He attempts to knock a rebound into the middle of the goal with a delicate header, but Yoan Cardinale dives to keep the ball from hitting the net."
        },
        {
            "gameTime": "2 - 30:13",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 29:49",
            "label": "substitution",
            "description": "Problems for Lucien Favre as Valentin Eysseric is not able to play anymore. His injury is too serious and Anastasios Donis (Nice) replaces him."
        },
        {
            "gameTime": "2 - 27:12",
            "label": "",
            "description": "Edinson Cavani (Paris SG) climbs high to connect with a cross near the penalty spot but plants a header high over the bar."
        },
        {
            "gameTime": "2 - 25:37",
            "label": "",
            "description": "Thomas Meunier (Paris SG) gets to the rebound on the edge of the penalty area and fires a shot towards the bottom right corner, but Yoan Cardinale gets a hand to it and keeps it out."
        },
        {
            "gameTime": "2 - 25:06",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 19:58",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Serge Aurier walks off the pitch to be replaced by Adrien Rabiot (Paris SG)."
        },
        {
            "gameTime": "2 - 19:00",
            "label": "soccer-ball",
            "description": "Goal! Thiago Silva gets up really well from the corner and heads the ball into the six yard box where Marquinhos (Paris SG) glances a header into the net. 2:1."
        },
        {
            "gameTime": "2 - 18:55",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 17:31",
            "label": "",
            "description": "Jean Michael Seri (Nice) stands over the free kick and opts to take it himself, but it is straight at Kevin Trapp."
        },
        {
            "gameTime": "2 - 13:59",
            "label": "y-card",
            "description": "Edinson Cavani (Paris SG) picks up a yellow card."
        },
        {
            "gameTime": "2 - 13:23",
            "label": "y-card",
            "description": "Julian Draxler (Paris SG) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 12:13",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 11:54",
            "label": "",
            "description": "Julian Draxler (Paris SG) races towards goal but the defender gets back well to make a challenge. The ball goes out of play and Paris SG have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 09:32",
            "label": "",
            "description": "Serge Aurier (Paris SG) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 08:42",
            "label": "corner",
            "description": "The resulting corner from Angel Di Maria (Paris SG) comes to nothing."
        },
        {
            "gameTime": "2 - 06:58",
            "label": "y-card",
            "description": "Yellow card! It's like Thomas Meunier (Paris SG) was asking for a caution with his behaviour. Ruddy Buquet agrees and books him."
        },
        {
            "gameTime": "2 - 05:11",
            "label": "",
            "description": "Edinson Cavani (Paris SG) is caught offside by the linesman and it looks like it is the right decision despite being a very close call."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "soccer-ball",
            "description": "A piece of footballing magic! Pereira Ricardo (Nice) collected a precise pass and fired a shot towards the top left corner, bouncing in off the post. The goalkeeper was helpless."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Unai Emery Etxegoien decided to make a change. Maxwell is replaced by Thomas Meunier (Paris SG)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 40:22",
            "label": "y-card",
            "description": "Ruddy Buquet shows a yellow card to Jean Michael Seri (Nice), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 38:45",
            "label": "corner",
            "description": "Jean Michael Seri (Nice) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 38:43",
            "label": "",
            "description": "Arnaud Souquet (Nice) misses a good chance to score. An inch perfect cross into the box finds Arnaud Souquet (Nice) who rises for a header, but sends the ball well over the bar. Nice force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 33:07",
            "label": "",
            "description": "Angel Di Maria (Paris SG) receives a quality pass and releases a rocket of a shot from distance, but his amazing effort goes just wide of the right post. The goalkeeper probably wouldn't have saved this one."
        },
        {
            "gameTime": "1 - 32:02",
            "label": "",
            "description": "Thiago Silva (Paris SG) pulls the shirt of his opponent and the referee stops play for a foul."
        },
        {
            "gameTime": "1 - 25:31",
            "label": "soccer-ball",
            "description": "Mario Balotelli (Nice) takes a great first touch to control a killer pass on the edge of the box and drills a shot into the bottom left corner in trademark fashion."
        },
        {
            "gameTime": "1 - 20:13",
            "label": "y-card",
            "description": "Henrique Dalbert (Nice) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Ruddy Buquet didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "1 - 20:00",
            "label": "",
            "description": "Mario Balotelli (Nice) wins the ball inside the goal area from the resulting set piece and unleashes a shot which sails high over the bar."
        },
        {
            "gameTime": "1 - 19:23",
            "label": "",
            "description": "Poor challenge! Edinson Cavani (Paris SG) is penalised for tripping and Ruddy Buquet blows his whistle. Nice win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 16:35",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Angel Di Maria (Paris SG), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 16:05",
            "label": "",
            "description": "Maxwell (Paris SG) slides a pass forward, but one of the defenders cuts it out. Paris SG win a corner."
        },
        {
            "gameTime": "1 - 11:47",
            "label": "",
            "description": "Julian Draxler (Paris SG) fails to find a teammate across the pitch with a long ball. The ball is off of the pitch and it's a goal kick for Nice."
        },
        {
            "gameTime": "1 - 09:40",
            "label": "corner",
            "description": "Jean Michael Seri (Nice) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 09:23",
            "label": "",
            "description": "Dalbert Henrique (Nice) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. The ball goes out of play. Nice are awarded a corner kick."
        },
        {
            "gameTime": "1 - 08:20",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 08:03",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The referee blows his whistle, Paris SG are awarded a corner kick."
        },
        {
            "gameTime": "1 - 06:52",
            "label": "",
            "description": "A cross from Maxwell (Paris SG) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 04:47",
            "label": "",
            "description": "Angel Di Maria (Paris SG) produces a ferocious strike from the edge of the box. His dangerous low effort towards the middle of the goal is blocked by Yoan Cardinale, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 01:50",
            "label": "",
            "description": "Maxwell (Paris SG) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Thiago Motta (Paris SG) has a shot blocked, it rebounds back to him, but even on his second attempt he cannot hit the target. His effort goes well wide."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Paris SG will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ruddy Buquet is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's the end of the match."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "30/04/2017 - 22:00",
    "gameHomeTeam": "Nice",
    "gameScore": "3 - 1"
}