{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-05-21 - 21-00 Malaga 0 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:10",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 46:29",
            "label": "",
            "description": "Charles (Malaga) is adjudged offside."
        },
        {
            "gameTime": "2 - 45:38",
            "label": "corner",
            "description": "Malaga take a short corner kick."
        },
        {
            "gameTime": "2 - 45:19",
            "label": "",
            "description": "A cross from Chory Castro (Malaga) fails to reach the box as the defence clears the ball away to safety. Malaga win a corner."
        },
        {
            "gameTime": "2 - 45:17",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:34",
            "label": "",
            "description": "Great touch by Chory Castro (Malaga) as he receives a precise pass deep in the box. He rips a snap shot and the ball bounces off the goalkeeper's gloves and hits the post."
        },
        {
            "gameTime": "2 - 43:23",
            "label": "",
            "description": "Marcelo (Real Madrid) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box into the stands."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 42:41",
            "label": "",
            "description": "Luka Modric (Real Madrid) collects a great pass inside the box and misses a golden opportunity. His low drive is headed for the bottom right corner, but the goalkeeper pulls off a marvellous diving save and denies him. The referee points to the corner flag and Real Madrid will take a corner."
        },
        {
            "gameTime": "2 - 42:19",
            "label": "",
            "description": "Idriss Carlos Kameni makes a brilliant save! Alvaro Morata (Real Madrid) easily weaves through the defence and unleashes a shot from just outside of the box. His effort goes towards the bottom right corner but is saved by the keeper!"
        },
        {
            "gameTime": "2 - 40:41",
            "label": "",
            "description": "Marcelo (Real Madrid) jinks his way past two defenders and from the edge of the box has an effort which goes just over the bar."
        },
        {
            "gameTime": "2 - 40:19",
            "label": "attendance",
            "description": "The attendance for today's match is 27855."
        },
        {
            "gameTime": "2 - 39:38",
            "label": "",
            "description": "Charles (Malaga) receives a lofted pass from out wide and shoots from close range, but the ball flies way past the left hand post."
        },
        {
            "gameTime": "2 - 33:54",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 33:11",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) races towards goal but the defender gets back well to make a challenge. The linesman points to the corner flag, Real Madrid are going to take it."
        },
        {
            "gameTime": "2 - 31:51",
            "label": "corner",
            "description": "The resulting set piece from Malaga is comfortably intercepted by one of the defending players."
        },
        {
            "gameTime": "2 - 31:24",
            "label": "",
            "description": "Pablo Fornals (Malaga) takes a first time shot from the edge of the box, but his effort is well blocked by the defender. The referee blows his whistle, Malaga are awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:56",
            "label": "corner",
            "description": "Duda (Malaga) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 30:15",
            "label": "corner",
            "description": "Duda (Malaga) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 27:35",
            "label": "substitution",
            "description": "Substitution. Alvaro Morata (Real Madrid) on for Karim Benzema."
        },
        {
            "gameTime": "2 - 26:49",
            "label": "substitution",
            "description": "Jose Miguel Gonzalez decides to make a substitution. Jony will be replaced by Duda (Malaga)."
        },
        {
            "gameTime": "2 - 25:36",
            "label": "",
            "description": "GOAL DISALLOWED! Controversy and anger as Karim Benzema (Real Madrid) has a goal ruled out, incredibly, for offside."
        },
        {
            "gameTime": "2 - 23:53",
            "label": "substitution",
            "description": "It will be a substitution. Charles (Malaga) is ready to enter the pitch as Sandro Ramirez walks off."
        },
        {
            "gameTime": "2 - 23:38",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 20:56",
            "label": "substitution",
            "description": "Substitution. Casemiro walks off the pitch and Mateo Kovacic (Real Madrid) comes on as a substitute."
        },
        {
            "gameTime": "2 - 20:45",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to introduce fresh legs, with James Rodriguez (Real Madrid) replacing Isco."
        },
        {
            "gameTime": "2 - 15:42",
            "label": "corner",
            "description": "Sandro Ramirez (Malaga) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 14:12",
            "label": "substitution",
            "description": "Chory Castro (Malaga) joins the action as a substitute, replacing Keko."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "",
            "description": "Ignacio Camacho (Malaga) wins the ball near the penalty spot and unleashes a header towards the left post, but Keylor Navas is alert and denies him."
        },
        {
            "gameTime": "2 - 13:18",
            "label": "corner",
            "description": "Malaga get a corner."
        },
        {
            "gameTime": "2 - 12:52",
            "label": "",
            "description": "Keko (Malaga) latches on to a precise pass and one on one with the keeper slams the ball towards the middle of the goal. Keylor Navas is alert, though, and makes an easy save to deny him."
        },
        {
            "gameTime": "2 - 11:39",
            "label": "y-card",
            "description": "Jony (Malaga) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 10:28",
            "label": "y-card",
            "description": "Idriss Carlos Kameni (Malaga) is shown a deserved yellow card for saying too much to the referee."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 09:59",
            "label": "soccer-ball",
            "description": "Goal! Karim Benzema (Real Madrid) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball into the middle of the net. It's 0:2."
        },
        {
            "gameTime": "2 - 07:46",
            "label": "corner",
            "description": "The corner kick from Toni Kroos (Real Madrid) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 07:10",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 05:57",
            "label": "injury",
            "description": "Cristiano Ronaldo (Real Madrid) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:16",
            "label": "",
            "description": "Karim Benzema (Real Madrid) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 40:06",
            "label": "",
            "description": "Jony sends a terrific cross into the box. Keko (Malaga) gets on the end of it but his header from the centre of the box goes just wide of the left post."
        },
        {
            "gameTime": "1 - 38:00",
            "label": "",
            "description": "What a chance that is! Keko (Malaga) displays good awareness near the penalty spot to get on the end of a cross, but he sends his header narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 37:50",
            "label": "corner",
            "description": "Malaga work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "1 - 37:11",
            "label": "corner",
            "description": "Sandro Ramirez (Malaga) whips in a cross from the corner, but Keylor Navas is well positioned and punches the ball away. Good work from Malaga as they win a corner."
        },
        {
            "gameTime": "1 - 36:55",
            "label": "",
            "description": "Jony (Malaga) delivers a promising cross into the box, but it's cleared. Now Malaga have a corner."
        },
        {
            "gameTime": "1 - 35:56",
            "label": "",
            "description": "Toni Kroos (Real Madrid) collects a pass on the edge of the box and unleashes a low drive to the middle, but Idriss Carlos Kameni makes a save."
        },
        {
            "gameTime": "1 - 33:38",
            "label": "",
            "description": "Idriss Carlos Kameni pulls off a superb save! He leapt to block the shot Cristiano Ronaldo (Real Madrid) fired on target after a rebound. His effort from inside the box flew straight towards the middle of the goal, but was stopped by the goalkeeper."
        },
        {
            "gameTime": "1 - 29:54",
            "label": "corner",
            "description": "Jony (Malaga) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 29:40",
            "label": "",
            "description": "Keko (Malaga) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The referee signals a corner kick to Malaga."
        },
        {
            "gameTime": "1 - 27:45",
            "label": "",
            "description": "Toni Kroos (Real Madrid) latches onto a lofted pass on the edge of the penalty box and unleashes a volley towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 24:49",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) misses a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball floats high over the crossbar!"
        },
        {
            "gameTime": "1 - 24:39",
            "label": "corner",
            "description": "The resulting corner from Toni Kroos (Real Madrid) is cleared by the defence."
        },
        {
            "gameTime": "1 - 24:00",
            "label": "",
            "description": "Marcelo (Real Madrid) flights in the cross, but the defender is alert and clears to safety. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 21:17",
            "label": "",
            "description": "Sandro Ramirez (Malaga) stands over the free kick and opts to take it himself, sending it towards the top left corner only for Keylor Navas to dive and make a save."
        },
        {
            "gameTime": "1 - 19:34",
            "label": "",
            "description": "Malaga have a free kick."
        },
        {
            "gameTime": "1 - 18:44",
            "label": "",
            "description": "Pablo Fornals (Malaga) was trying to get to the ball but clattered into the legs of the opponent as well. Ricardo de Burgos Bengoetxea blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 14:22",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 13:51",
            "label": "",
            "description": "Karim Benzema (Real Madrid) wastes a huge opportunity! He receives a precise cross inside the penalty area and releases a quick shot that sails towards the left post. His effort, however, lacks power and the goalkeeper dives to make a stunning save. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "1 - 12:38",
            "label": "",
            "description": "Keylor Navas makes a brilliant save! Sandro Ramirez (Malaga) easily weaves through the defence and unleashes a shot from just outside of the box. His effort goes towards the bottom left corner but is saved by the keeper!"
        },
        {
            "gameTime": "1 - 11:16",
            "label": "",
            "description": "A precise low pass is received by Jony (Malaga), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well over the bar."
        },
        {
            "gameTime": "1 - 10:55",
            "label": "",
            "description": "Isco (Real Madrid) gets on the ball and beats an opponent, but his run is stopped by the referee Ricardo de Burgos Bengoetxea who sees an offensive foul."
        },
        {
            "gameTime": "1 - 07:36",
            "label": "",
            "description": "The free kick from long range, taken by Malaga, is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 07:20",
            "label": "",
            "description": "A free kick from around the half way line will be taken by Malaga."
        },
        {
            "gameTime": "1 - 04:56",
            "label": "",
            "description": "Danilo (Real Madrid) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 01:52",
            "label": "soccer-ball",
            "description": "Goal! Isco provides Cristiano Ronaldo (Real Madrid) with a nice pass inside the box. It allows him to finish with a strike into the middle of the goal. 0:1."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Real Madrid will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ricardo de Burgos Bengoetxea will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Cristiano Ronaldo is the biggest threat to an opponent! He has already scored 24 goals and is top scorer in this Real Madrid team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid have gone 7 consecutive matches without a draw."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "19 The number of Malaga matches with less than 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "21/05/2017 - 21:00",
    "gameHomeTeam": "Malaga",
    "gameScore": "0 - 2"
}