{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-09-24 - 19-30 Arsenal 3 - 0 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The home team had more of the game. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 48:15",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Mesut Ozil (Arsenal), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 44:44",
            "label": "",
            "description": "Olivier Giroud (Arsenal) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. Arsenal have a corner."
        },
        {
            "gameTime": "2 - 42:37",
            "label": "",
            "description": "Pedro (Chelsea) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "2 - 39:58",
            "label": "",
            "description": "Close! Olivier Giroud (Arsenal) picks up the ball in space and from inside the penalty area sends a shot inches wide of the left post."
        },
        {
            "gameTime": "2 - 39:42",
            "label": "corner",
            "description": "Pedro (Chelsea) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 39:28",
            "label": "",
            "description": "Petr Cech is a nightmare for the offensive players! Michy Batshuayi (Chelsea) meets a cross on the edge of the penalty area, takes a good first touch and fires a rocket of a shot towards the bottom left corner, but the goalkeeper produces a wonderful save. The linesman makes the right call and Chelsea will have a corner."
        },
        {
            "gameTime": "2 - 37:07",
            "label": "y-card",
            "description": "Diego Costa (Chelsea) was probably a bit loose with his words to Michael Oliver, who decides to show him a yellow."
        },
        {
            "gameTime": "2 - 36:41",
            "label": "",
            "description": "Pedro (Chelsea) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "2 - 36:30",
            "label": "",
            "description": "Granit Xhaka (Arsenal) pulls the jersey of one of the opposition players and Michael Oliver blows his whistle for a foul. Chelsea earn a free kick."
        },
        {
            "gameTime": "2 - 33:33",
            "label": "substitution",
            "description": "Arsene Wenger has decided to substitute Alexis Sanchez and he is replaced by Olivier Giroud (Arsenal)."
        },
        {
            "gameTime": "2 - 31:43",
            "label": "",
            "description": "Granit Xhaka (Arsenal) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies into the stands."
        },
        {
            "gameTime": "2 - 30:37",
            "label": "",
            "description": "Mesut Ozil (Arsenal) is in a clear offside position and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 29:26",
            "label": "",
            "description": "One of the players from Arsenal times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 29:19",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) will take a corner kick."
        },
        {
            "gameTime": "2 - 29:02",
            "label": "",
            "description": "Hector Bellerin (Arsenal) whips a promising cross into the box, but the opposition's defence intercepts the ball. Arsenal will take a corner kick."
        },
        {
            "gameTime": "2 - 25:53",
            "label": "substitution",
            "description": "The substitution has been made. Michy Batshuayi (Chelsea) has replaced Eden Hazard."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "substitution",
            "description": "Here is a change. Willian is going off and Antonio Conte gives the last tactical orders to Pedro (Chelsea)."
        },
        {
            "gameTime": "2 - 24:48",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 23:50",
            "label": "substitution",
            "description": "Kieran Gibbs (Arsenal) joins the action as a substitute, replacing Alex Iwobi."
        },
        {
            "gameTime": "2 - 23:36",
            "label": "",
            "description": "What a sweet touch by Theo Walcott (Arsenal) as he collects a pass deep inside the box and decides to go for goal. It's on target but easy for Thibaut Courtois to hold. Arsenal have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 21:38",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "2 - 18:43",
            "label": "",
            "description": "The Chelsea players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 15:32",
            "label": "",
            "description": "Petr Cech doesn't have to worry about that one. Cesar Azpilicueta puts a cross in towards Diego Costa (Chelsea), who is unable to keep his header on target from the centre of the box. He sends the ball well wide of the left post."
        },
        {
            "gameTime": "2 - 12:44",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 12:31",
            "label": "",
            "description": "Mesut Ozil (Arsenal) gets on the end of a pass on the edge of the box but his shot is blocked. The ball is out of play and Arsenal manage to earn a corner."
        },
        {
            "gameTime": "2 - 09:49",
            "label": "substitution",
            "description": "It is time for a substitution. Marcos Alonso (Chelsea) is on for Cesc Fabregas."
        },
        {
            "gameTime": "2 - 09:26",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Chelsea was in an offside position."
        },
        {
            "gameTime": "2 - 07:52",
            "label": "",
            "description": "Theo Walcott (Arsenal) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 07:05",
            "label": "",
            "description": "Mesut Ozil (Arsenal) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 04:57",
            "label": "",
            "description": "Michael Oliver has a clear sight and sees a foul from Diego Costa (Chelsea)."
        },
        {
            "gameTime": "2 - 01:23",
            "label": "",
            "description": "Alex Iwobi (Arsenal) is caught offside!"
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Michael Oliver starts the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. The home side is dominant and dictating the tempo of the game, mainly because of their work rate and accurate passing. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 47:02",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 46:33",
            "label": "",
            "description": "Eden Hazard (Chelsea) looks furious with himself after spurning a great chance. He pounces on the rebound around the penalty spot and drags a shot well wide of the right post."
        },
        {
            "gameTime": "1 - 46:11",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) crosses the ball into the box from a free kick, but Petr Cech reads it well and gathers the ball."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Theo Walcott (Arsenal) is penalised after knocking an opponent down. Chelsea have a free kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:30",
            "label": "",
            "description": "David Luiz (Chelsea) brings his opponent down with a tackle and Michael Oliver blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 39:43",
            "label": "soccer-ball",
            "description": "It's a goal! Mesut Ozil (Arsenal) scores with a brilliant shot into the right side of the goal after being released inside the box by a superb lofted pass from Alexis Sanchez. The score is 3:0."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "",
            "description": "Wow, what an escape. Diego Costa (Chelsea) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "1 - 34:30",
            "label": "",
            "description": "Theo Walcott (Arsenal) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 31:41",
            "label": "substitution",
            "description": "Arsene Wenger is forced to make a change. Francis Coquelin is unable to continue due to injury, Granit Xhaka (Arsenal) comes on."
        },
        {
            "gameTime": "1 - 30:48",
            "label": "corner",
            "description": "The corner kick from Mesut Ozil (Arsenal) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 30:43",
            "label": "",
            "description": "The free kick from the edge of the box is taken by Alexis Sanchez (Arsenal), but he hits it straight in the defensive wall. Arsenal have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 30:09",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 27:18",
            "label": "y-card",
            "description": "Today's referee Michael Oliver rightly decides to book Branislav Ivanovic (Chelsea) for his harsh tackle."
        },
        {
            "gameTime": "1 - 25:38",
            "label": "corner",
            "description": "The resulting corner from Santi Cazorla (Arsenal) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 25:16",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) launches an inaccurate corner kick into the penalty area. The referee points to the corner flag. It's a corner to Arsenal."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "",
            "description": "Hector Bellerin (Arsenal) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender. The referee points to the corner flag and Arsenal will take a corner."
        },
        {
            "gameTime": "1 - 23:55",
            "label": "",
            "description": "This shall not pass! Eden Hazard (Chelsea) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 22:10",
            "label": "",
            "description": "Flag goes up against Alexis Sanchez (Arsenal) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 20:57",
            "label": "",
            "description": "CHANCE! Eden Hazard finds Willian (Chelsea) with a sweet pass, but he can't find the target as his effort from inside the box goes just wide of the left post!"
        },
        {
            "gameTime": "1 - 18:50",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) receives a pass and unleashes a shot which goes well wide of the right post."
        },
        {
            "gameTime": "1 - 17:27",
            "label": "",
            "description": "Arsenal are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 13:41",
            "label": "soccer-ball",
            "description": "What a goal! Hector Bellerin plays it to Theo Walcott (Arsenal), who finds himself unmarked inside the box and slots a first time shot past Thibaut Courtois. 2:0."
        },
        {
            "gameTime": "1 - 10:29",
            "label": "soccer-ball",
            "description": "Goal! The ball breaks to Alexis Sanchez (Arsenal) after some poor defending, he finds himself one on one with the goalkeeper and calmly puts the ball into the back of the net! He makes it 1:0."
        },
        {
            "gameTime": "1 - 09:30",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 08:58",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. The referee and one of his assistants signal for a corner kick to Arsenal."
        },
        {
            "gameTime": "1 - 05:53",
            "label": "",
            "description": "Willian (Chelsea) crosses the ball from the free kick, but it goes out of play."
        },
        {
            "gameTime": "1 - 04:55",
            "label": "",
            "description": "Michael Oliver blows his whistle after Laurent Koscielny (Arsenal) kicks an opponent's legs instead of the ball. Chelsea are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 04:42",
            "label": "",
            "description": "That was a nice football moment. Santi Cazorla (Arsenal) receives an amazing defence splitting low pass on the edge of the box and blasts the ball towards the left post. Thibaut Courtois guesses his intention and dives superbly to deny him with a remarkable save!"
        },
        {
            "gameTime": "1 - 03:12",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 02:13",
            "label": "",
            "description": "Nacho Monreal (Arsenal) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The referee blows his whistle, Arsenal are awarded a corner kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Chelsea will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Michael Oliver is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most prolific goal scorer for Chelsea is Diego Costa with 14 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Chelsea scored at least one goal in each of their last 10 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alexis Sanchez from Arsenal will look to add to his goal tally, he has netted 3 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The home team had more of the game. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "24/09/2016 - 19:30",
    "gameHomeTeam": "Arsenal",
    "gameScore": "3 - 0"
}