{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2016-10-14 - 21-30 Dortmund 1 - 1 Hertha Berlin/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The home side dominated today's game. The tactic of the home side was slow build up play and the away side was creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "2 - 48:58",
            "label": "whistle",
            "description": "Patrick Ittrich is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:19",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Alexander Esswein departs the field of play to be replaced by Maximilian Mittelstadt (Hertha Berlin)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:47",
            "label": "r-card",
            "description": "We have witnessed a sending off! Valentin Stocker (Hertha Berlin) is given a red card for his dangerous challenge. Patrick Ittrich's decision is final."
        },
        {
            "gameTime": "2 - 42:50",
            "label": "y-card",
            "description": "Yellow card! It's like Sami Allagui (Hertha Berlin) was asking for a caution with his behaviour. Patrick Ittrich agrees and books him."
        },
        {
            "gameTime": "2 - 41:20",
            "label": "attendance",
            "description": "The attendance is 80800."
        },
        {
            "gameTime": "2 - 38:22",
            "label": "r-card",
            "description": "The game is interrupted by the referee. He pulls out a red card and sends Emre Mor (Dortmund) off."
        },
        {
            "gameTime": "2 - 38:11",
            "label": "y-card",
            "description": "The foul by Sebastian Langkamp (Hertha Berlin) is worthy of a card and a yellow is duly shown by Patrick Ittrich."
        },
        {
            "gameTime": "2 - 35:30",
            "label": "substitution",
            "description": "Pal Dardai decides to make a substitution. Vedad Ibisevic will be replaced by Sami Allagui (Hertha Berlin)."
        },
        {
            "gameTime": "2 - 34:59",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Ousmane Dembele sprays a pass out to Pierre Emerick Aubameyang (Dortmund), and he has an easy job to slot the ball into an empty net. The score is 1:1."
        },
        {
            "gameTime": "2 - 33:39",
            "label": "",
            "description": "Emre Mor (Dortmund) has a sight of goal and shoots from distance, but Rune Jarstein is equal to it."
        },
        {
            "gameTime": "2 - 32:02",
            "label": "substitution",
            "description": "Substitution. Allan Rodrigues de Souza (Hertha Berlin) on for Per Skjelbred."
        },
        {
            "gameTime": "2 - 31:11",
            "label": "penalty-missed",
            "description": "Rune Jarstein anticipates the direction of the penalty by Pierre Emerick Aubameyang (Dortmund). He attempted to put the ball inside the right post, but the goalkeeper was there in time to deny him."
        },
        {
            "gameTime": "2 - 30:51",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 30:12",
            "label": "penalty",
            "description": "Genki Haraguchi (Hertha Berlin) handles the ball inside the box. Joy for one side, despair for the other as the referee gives a penalty to Dortmund!"
        },
        {
            "gameTime": "2 - 29:11",
            "label": "",
            "description": "Emre Mor (Dortmund) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 28:28",
            "label": "injury",
            "description": "Emre Mor (Dortmund) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 25:47",
            "label": "substitution",
            "description": "The substitution has been made. Joo Ho Park (Dortmund) has replaced Marcel Schmelzer."
        },
        {
            "gameTime": "2 - 24:10",
            "label": "",
            "description": "Felix Passlack (Dortmund) sends a teasing cross into the area, but Rune Jarstein intercepts the ball."
        },
        {
            "gameTime": "2 - 21:59",
            "label": "",
            "description": "What a huge opportunity! Pierre Emerick Aubameyang (Dortmund) attempts to beat the goalkeeper with a close range strike towards the roof of the net. The amazing Rune Jarstein deserves an ovation from the fans as he pulls off a spectacular save and pushes the ball onto the bar."
        },
        {
            "gameTime": "2 - 20:33",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 20:04",
            "label": "",
            "description": "Rune Jarstein pulls off a great save to deny Pierre Emerick Aubameyang (Dortmund), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal. Dortmund force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 18:59",
            "label": "y-card",
            "description": "Ousmane Dembele (Dortmund) is punished with a yellow card for violating the rules."
        },
        {
            "gameTime": "2 - 18:41",
            "label": "y-card",
            "description": "Alexander Esswein (Hertha Berlin) infringed the rules and goes into the book. Patrick Ittrich pulls out a yellow card."
        },
        {
            "gameTime": "2 - 17:46",
            "label": "",
            "description": "Genki Haraguchi (Hertha Berlin) has a great chance to score from deep inside the box! He creates some space for the shot, but blazes it high over the crossbar. Very bad attempt."
        },
        {
            "gameTime": "2 - 16:18",
            "label": "corner",
            "description": "The resulting corner from Emre Mor (Dortmund) comes to nothing."
        },
        {
            "gameTime": "2 - 16:03",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) collects a pass and has an effort from distance to the left side of the goal, but Rune Jarstein answers with a superb save to deny him. Dortmund get a corner."
        },
        {
            "gameTime": "2 - 14:34",
            "label": "substitution",
            "description": "Thomas Tuchel prepares a substitution. Mario Gotze is replaced by Shinji Kagawa (Dortmund)."
        },
        {
            "gameTime": "2 - 14:28",
            "label": "substitution",
            "description": "The manager makes a subsitution with Ousmane Dembele (Dortmund) coming on for Sebastian Rode."
        },
        {
            "gameTime": "2 - 12:57",
            "label": "corner",
            "description": "Mario Gotze (Dortmund) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 12:43",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play and Dortmund manage to earn a corner."
        },
        {
            "gameTime": "2 - 10:29",
            "label": "",
            "description": "Valentin Stocker (Hertha Berlin) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 09:09",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Genki Haraguchi (Hertha Berlin) sacrificed accuracy for power, and thus his attempt went well wide of the right post."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "",
            "description": "Poorly taken free kick by Marcel Schmelzer (Dortmund) from mid range. He unleashes a strong shot, but it goes well wide of the right post. What a miskick!"
        },
        {
            "gameTime": "2 - 07:32",
            "label": "y-card",
            "description": "A yellow card for a tackle by John Brooks (Hertha Berlin). Patrick Ittrich doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 05:12",
            "label": "soccer-ball",
            "description": "Goal! Vedad Ibisevic displays great vision and sends a pass to Valentin Stocker (Hertha Berlin), who shows brilliant composure inside the box to bury the ball inside the right post. The score is 0:1."
        },
        {
            "gameTime": "2 - 03:36",
            "label": "",
            "description": "Mitchell Weiser (Hertha Berlin) makes an overly aggressive challenge and Patrick Ittrich blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 01:40",
            "label": "",
            "description": "Emre Mor (Dortmund) makes a good run with the ball into the box, but mishits his shot as it goes high over the bar."
        },
        {
            "gameTime": "2 - 01:06",
            "label": "",
            "description": "A cross from Mario Gotze (Dortmund) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Patrick Ittrich blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. The hosts are enjoying a clear advantage over the opposition. The home team tries to prevail using combination football, while the away teams uses mostly counter attacks."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 43:25",
            "label": "",
            "description": "Mario Gotze (Dortmund) is caught offside!"
        },
        {
            "gameTime": "1 - 42:38",
            "label": "corner",
            "description": "Mario Gotze (Dortmund) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 42:24",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) tries to pass the ball into the penalty area but it's blocked. The ball goes out for a corner. Dortmund can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 41:03",
            "label": "",
            "description": "Sebastian Rode (Dortmund) breaks past challenges inside the box, but puts too much pace on his pass to Emre Mor."
        },
        {
            "gameTime": "1 - 40:01",
            "label": "",
            "description": "Christian Pulisic (Dortmund) sends a cross into the box, but Rune Jarstein comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 37:59",
            "label": "",
            "description": "Christian Pulisic (Dortmund) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 34:43",
            "label": "funfact",
            "description": "The number of shots on goal at present is 6:2."
        },
        {
            "gameTime": "1 - 31:09",
            "label": "",
            "description": "Alexander Esswein (Hertha Berlin) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just over the crossbar."
        },
        {
            "gameTime": "1 - 28:48",
            "label": "",
            "description": "Valentin Stocker (Hertha Berlin) connects with a cross and has an effort on goal from the edge of the box, but it ends somewhere in row Z."
        },
        {
            "gameTime": "1 - 26:25",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Mario Gotze (Dortmund)."
        },
        {
            "gameTime": "1 - 26:12",
            "label": "",
            "description": "Emre Mor (Dortmund) sends the ball into the box from the side of the pitch, but his cross is blocked. Dortmund force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 25:47",
            "label": "",
            "description": "Per Skjelbred (Hertha Berlin) jumps into a tackle and Patrick Ittrich blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 24:51",
            "label": "",
            "description": "Valentin Stocker (Hertha Berlin) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 22:03",
            "label": "",
            "description": "Emre Mor (Dortmund) gives away a foul for a clumsy challenge. Referee Patrick Ittrich saw the whole situation."
        },
        {
            "gameTime": "1 - 19:48",
            "label": "",
            "description": "Christian Pulisic (Dortmund) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "1 - 18:25",
            "label": "y-card",
            "description": "Patrick Ittrich shows the yellow card to Niklas Stark (Hertha Berlin) for a heavy challenge."
        },
        {
            "gameTime": "1 - 16:49",
            "label": "",
            "description": "What a chance that is! Alexander Esswein (Hertha Berlin) finds himself in a promising position after receiving a pass on the edge of the box. His attempt goes just over the bar."
        },
        {
            "gameTime": "1 - 16:15",
            "label": "",
            "description": "Marvin Plattenhardt (Hertha Berlin) smashes the ball towards goal from the edge of the penalty box, but it fails to bother the goalkeeper as it hits the defensive wall."
        },
        {
            "gameTime": "1 - 15:08",
            "label": "",
            "description": "Felix Passlack (Dortmund) commits a rough challenge and Patrick Ittrich blows his whistle for a foul. Hertha Berlin are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 14:06",
            "label": "",
            "description": "The linesman raises his flag for offside before Pierre Emerick Aubameyang (Dortmund) heads on."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) is adjudged offside."
        },
        {
            "gameTime": "1 - 11:05",
            "label": "",
            "description": "The referee blows his whistle for a foul after Alexander Esswein (Hertha Berlin) overruns the ball during an attack and makes an aggressive challenge on his opponent."
        },
        {
            "gameTime": "1 - 08:16",
            "label": "",
            "description": "Vedad Ibisevic (Hertha Berlin) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "1 - 06:03",
            "label": "",
            "description": "Emre Mor (Dortmund) finds some space inside the box and latches on to a brilliant cross, but he wastes his chance as his shot goes way wide of the left post."
        },
        {
            "gameTime": "1 - 05:30",
            "label": "",
            "description": "John Brooks (Hertha Berlin) should know this behaviour is beyond the rules. He was too careless with his challenge and left Patrick Ittrich no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 03:58",
            "label": "",
            "description": "Mario Gotze (Dortmund) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hertha Berlin will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Patrick Ittrich will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Vedad Ibisevic is the leading goal scorer for Hertha Berlin with 8 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gonzalo Castro from Dortmund is in good form this season, he's assisted in a goal 4 times."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang looks sharp as he's the top goal scorer for Dortmund with 23 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The home side dominated today's game. The tactic of the home side was slow build up play and the away side was creating their opportunities using lightning fast counter attacks."
        }
    ],
    "gameAwayTeam": "Hertha Berlin",
    "gameDate": "14/10/2016 - 21:30",
    "gameHomeTeam": "Dortmund",
    "gameScore": "1 - 1"
}