{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-09-12 - 21-30 Atl. Madrid 1 - 2 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. Barcelona had more of the game and were superior. Their manager will certainly be the happier of the two managers. The hosts tried to catch the opposition off guard and hit them on the break. The visiting side kept the ball at their feet and the main intention was to produce that final killer pass."
        },
        {
            "gameTime": "2 - 47:11",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 46:25",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 45:07",
            "label": "",
            "description": "A pass from Luis Suarez (Barcelona) is intercepted by Jan Oblak and the move breaks down."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:15",
            "label": "",
            "description": "Lionel Messi (Barcelona) lines up the resulting free kick from the edge of the box, but he produces a poor shot that goes high over the bar. The ball could have snow on it when it returns!"
        },
        {
            "gameTime": "2 - 43:18",
            "label": "y-card",
            "description": "The foul by Jose Maria Gimenez (Atl. Madrid) is worthy of a card and a yellow is duly shown by Antonio Mateu Lahoz."
        },
        {
            "gameTime": "2 - 41:59",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 41:40",
            "label": "",
            "description": "Sergi Roberto (Barcelona) serves up a nice cross, but the defence clears the danger. Barcelona have a corner."
        },
        {
            "gameTime": "2 - 40:44",
            "label": "",
            "description": "Neymar races towards the box before laying off to Lionel Messi (Barcelona), who picks it up but blazes a shot well over the bar from the edge of the box."
        },
        {
            "gameTime": "2 - 39:45",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) sprays a pass out to Luciano Vietto, but he can't beat his man inside the box."
        },
        {
            "gameTime": "2 - 38:12",
            "label": "",
            "description": "A nice lofted cross finds Jackson Martinez (Atl. Madrid) unmarked. He takes an excellent touch and gets in a shot that goes towards the middle of the net. An easy save for the goalkeeper, though."
        },
        {
            "gameTime": "2 - 37:06",
            "label": "attendance",
            "description": "The attendance for today's match is 53491."
        },
        {
            "gameTime": "2 - 35:12",
            "label": "substitution",
            "description": "Substitution. Luciano Vietto (Atl. Madrid) receives a signal from the referee and is now allowed to enter the pitch as Gabi walks off."
        },
        {
            "gameTime": "2 - 34:04",
            "label": "corner",
            "description": "Neymar (Barcelona) is heading toward the corner flag to take the set piece. Neymar (Barcelona) shows his incredible technical ability by sending the ball into free space and Lionel Messi latches onto his pass."
        },
        {
            "gameTime": "2 - 33:38",
            "label": "",
            "description": "Jan Oblak pulls off a great save to deny Luis Suarez (Barcelona), who makes himself some space inside the box and unleashes a quick low drive to the bottom left corner. Barcelona force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 31:44",
            "label": "soccer-ball",
            "description": "It's 1:2! Luis Suarez feeds Lionel Messi (Barcelona) inside the box, who is unmarked and buries the ball in the bottom right corner."
        },
        {
            "gameTime": "2 - 29:11",
            "label": "",
            "description": "That's a well taken pass by Tiago (Atl. Madrid). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 28:24",
            "label": "",
            "description": "A promising cross into the box is nearly received by the lurking Yannick Carrasco (Atl. Madrid), but one of the defending players cuts it out to avert the threat."
        },
        {
            "gameTime": "2 - 27:35",
            "label": "",
            "description": "Good defending. Lionel Messi (Barcelona) tries to find Neymar inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 25:55",
            "label": "",
            "description": "Lionel Messi (Barcelona) plays a one two with Luis Suarez, but the move breaks down."
        },
        {
            "gameTime": "2 - 23:57",
            "label": "",
            "description": "Juanfran (Atl. Madrid) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 23:23",
            "label": "",
            "description": "Marc Andre ter Stegen makes a save to deny the long range effort from Yannick Carrasco (Atl. Madrid) towards the middle of the goal."
        },
        {
            "gameTime": "2 - 22:30",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "",
            "description": "Lionel Messi (Barcelona) latches on to a pass inside the box and strikes the ball to the middle of the goal, but one of the defending players makes a goal line clearance."
        },
        {
            "gameTime": "2 - 21:47",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 21:06",
            "label": "",
            "description": "The ball is cleared after Luis Suarez (Barcelona) attempted to dribble past an opposing player. Barcelona will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 19:58",
            "label": "",
            "description": "Antonio Mateu Lahoz blows his whistle and signals a foul after Jackson Martinez (Atl. Madrid) brought his opponent down."
        },
        {
            "gameTime": "2 - 19:10",
            "label": "",
            "description": "Jan Oblak doesn't have to worry about this one. Rafinha plays a pass into the feet of Luis Suarez (Barcelona), who is unable to find the target as his effort from inside the box goes well wide of the right post."
        },
        {
            "gameTime": "2 - 16:14",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Jackson Martinez (Atl. Madrid) is coming onto the pitch as Fernando Torres cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 16:02",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 15:48",
            "label": "",
            "description": "Sergi Roberto (Barcelona) sends a lofted cross into the box which is headed clear. The referee signals a corner kick to Barcelona."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "substitution",
            "description": "Diego Simeone has decided to make a change. Yannick Carrasco (Atl. Madrid) replaces Oliver Torres."
        },
        {
            "gameTime": "2 - 14:37",
            "label": "substitution",
            "description": "The substitution is prepared. Lionel Messi (Barcelona) joins the action as a substitute, replacing Ivan Rakitic."
        },
        {
            "gameTime": "2 - 13:40",
            "label": "",
            "description": "Juanfran (Atl. Madrid) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 13:33",
            "label": "",
            "description": "A long pass, executed by Tiago (Atl. Madrid), missed the precision to reach his teammates."
        },
        {
            "gameTime": "2 - 12:31",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "2 - 11:22",
            "label": "",
            "description": "Andres Iniesta (Barcelona) swings a cross into the box, but it's far too close to Jan Oblak, who smothers the ball."
        },
        {
            "gameTime": "2 - 09:46",
            "label": "soccer-ball",
            "description": "Neymar (Barcelona) takes a wonderful free kick and curls the ball into the top left corner with an absolutely phenomenal strike!"
        },
        {
            "gameTime": "2 - 08:41",
            "label": "",
            "description": "Barcelona earn a free kick. Antoine Griezmann (Atl. Madrid) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "2 - 05:59",
            "label": "soccer-ball",
            "description": "Tiago plays a neat ball into the path of Fernando Torres (Atl. Madrid), who makes room for a shot and sends in a low drive which bounces in off the left post! 1:0."
        },
        {
            "gameTime": "2 - 05:50",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) sends a chip pass into the box, but Jan Oblak is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 05:21",
            "label": "",
            "description": "The Barcelona players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 03:42",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Fernando Torres (Atl. Madrid), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 00:28",
            "label": "",
            "description": "Oliver Torres (Atl. Madrid) goes close to scoring with a shot from inside the box, but he drags his effort wide of the right post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. Barcelona have arguably been the better of the two sides in the first half. The home team's main weapon is fast counter attacks, while the away side attempts to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:07",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:26",
            "label": "",
            "description": "Koke (Atl. Madrid) sends a cross into the box, but Marc Andre ter Stegen comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 43:49",
            "label": "y-card",
            "description": "Antonio Mateu Lahoz shows a yellow card to Andres Iniesta (Barcelona) for a tough tackle."
        },
        {
            "gameTime": "1 - 42:31",
            "label": "y-card",
            "description": "A yellow card for a tackle by Filipe Luis (Atl. Madrid). Antonio Mateu Lahoz doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 40:57",
            "label": "",
            "description": "Jordi Alba (Barcelona) clips a neat ball into the box in the direction of Neymar, but he can't get on the end of the pass."
        },
        {
            "gameTime": "1 - 40:13",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Gabi (Atl. Madrid). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball is out of play. Atl. Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 38:29",
            "label": "",
            "description": "Neymar (Barcelona) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "1 - 36:43",
            "label": "",
            "description": "Sergi Roberto (Barcelona) blows an opportunity as he sends a rebound from just outside of the box narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 36:33",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 35:15",
            "label": "corner",
            "description": "The corner from Ivan Rakitic (Barcelona) is cleared away by the defence. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 34:55",
            "label": "",
            "description": "Luis Suarez (Barcelona) looks to break free, but an opposing player clears the ball away. The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 34:37",
            "label": "",
            "description": "Neymar (Barcelona) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 32:16",
            "label": "",
            "description": "Juanfran (Atl. Madrid) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "",
            "description": "Luis Suarez (Barcelona) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "",
            "description": "Luis Suarez (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 27:28",
            "label": "substitution",
            "description": "Luis Enrique is forced to make a change. Thomas Vermaelen is not able to carry on due to injury. He is replaced by Jeremy Mathieu (Barcelona)."
        },
        {
            "gameTime": "1 - 27:16",
            "label": "",
            "description": "Filipe Luis (Atl. Madrid) latched on to a cross on the edge of the box, but his strike isn't accurate at all and the ball goes way wide of the left post."
        },
        {
            "gameTime": "1 - 26:38",
            "label": "",
            "description": "Neymar (Barcelona) tries to find Luis Suarez, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 24:08",
            "label": "",
            "description": "OFF THE BAR! Luis Suarez (Barcelona) finds some space to meet the corner kick and unleashes a shot that only crashes against the bar!"
        },
        {
            "gameTime": "1 - 23:39",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner."
        },
        {
            "gameTime": "1 - 23:23",
            "label": "",
            "description": "Andres Iniesta (Barcelona) fails to send a pass into the box as his effort is cut out. Barcelona have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 22:43",
            "label": "",
            "description": "Gabi (Atl. Madrid) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again."
        },
        {
            "gameTime": "1 - 21:44",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends a teasing cross into the area, but Jan Oblak intercepts the ball."
        },
        {
            "gameTime": "1 - 20:57",
            "label": "",
            "description": "Juanfran (Atl. Madrid) pulls the jersey of one of the opposition players and Antonio Mateu Lahoz blows his whistle for a foul. Barcelona are awarded a free kick."
        },
        {
            "gameTime": "1 - 19:33",
            "label": "",
            "description": "Jordi Alba (Barcelona) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 17:55",
            "label": "y-card",
            "description": "Oliver Torres (Atl. Madrid) is booked after bringing down an opponent. Antonio Mateu Lahoz had an easy decision to make."
        },
        {
            "gameTime": "1 - 16:50",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) sends in a shot from a promising distance after a precise pass. His effort goes inches over the crossbar."
        },
        {
            "gameTime": "1 - 16:20",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) finds himself in an offside position and the referee stops play after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 14:40",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 14:11",
            "label": "",
            "description": "Jan Oblak pulls off a great save to deny Ivan Rakitic (Barcelona) after receiving a precise defence splitting pass. The effort is headed for the top right corner, but the goalkeeper dives superbly to stop it. Definitely the best save of this match so far! The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "1 - 13:15",
            "label": "",
            "description": "Gabi (Atl. Madrid) gives away a foul for a clumsy challenge. Referee Antonio Mateu Lahoz saw the whole situation. Barcelona get a free kick."
        },
        {
            "gameTime": "1 - 12:43",
            "label": "",
            "description": "The ball is cleared after Antoine Griezmann (Atl. Madrid) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 11:22",
            "label": "",
            "description": "Jordi Alba (Barcelona) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 09:46",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Koke (Atl. Madrid)."
        },
        {
            "gameTime": "1 - 07:49",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) forces a pass into the box, but Marc Andre ter Stegen is alert and does a great job to rob him of the ball."
        },
        {
            "gameTime": "1 - 07:05",
            "label": "",
            "description": "Juanfran (Atl. Madrid) trips an opponent with a slide tackle. Antonio Mateu Lahoz stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 06:05",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "",
            "description": "Luis Suarez (Barcelona) races towards goal but the defender gets back well to make a challenge. The ball is out of play and the linesman points at the corner flag. Corner to Barcelona."
        },
        {
            "gameTime": "1 - 05:12",
            "label": "",
            "description": "Neymar (Barcelona) and Luis Suarez attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 02:44",
            "label": "",
            "description": "A pass by Ivan Rakitic (Barcelona) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 02:15",
            "label": "",
            "description": "Barcelona have a free kick. Filipe Luis (Atl. Madrid) trips an opposition player and Antonio Mateu Lahoz signals a foul."
        },
        {
            "gameTime": "1 - 00:54",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) makes room to connect with a cross, but his strike from the penalty spot isn't accurate at all and the ball goes well over the bar."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Antonio Mateu Lahoz."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Here is Barcelona's form from their latest matches: Espanyol (5:0), Betis (2:0), Gijon (6:0), Dep. La Coruna (8:0)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Atl. Madrid have completed the new signings: Filipe Luis (Chelsea), Stefan Savic (Fiorentina)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. Barcelona had more of the game and were superior. Their manager will certainly be the happier of the two managers. The hosts tried to catch the opposition off guard and hit them on the break. The visiting side kept the ball at their feet and the main intention was to produce that final killer pass."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "12/09/2015 - 21:30",
    "gameHomeTeam": "Atl. Madrid",
    "gameScore": "1 - 2"
}