{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-24 - 22-45 FC Porto 0 - 2 Dyn. Kiev/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. There wasn't any evident superiority by either side today. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 48:07",
            "label": "whistle",
            "description": "Carlos Velasco is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "",
            "description": "CHANCE! Andre (FC Porto) has a shot from inside the box which is deflected and crashes against the crossbar!"
        },
        {
            "gameTime": "2 - 46:38",
            "label": "",
            "description": "Carlos Velasco has a clear sight and sees a foul from Pablo Osvaldo (FC Porto)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "",
            "description": "Lukasz Teodorczyk (Dynamo Kiev) commits a foul and Carlos Velasco immediately signals a free kick."
        },
        {
            "gameTime": "2 - 41:55",
            "label": "corner",
            "description": "Younes Belhanda (Dynamo Kiev) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 41:42",
            "label": "",
            "description": "Vitaliy Buyalskyy (Dynamo Kiev) serves up a nice cross, but the defence clears the danger. The ball is out of play and Dyn. Kiev manage to earn a corner."
        },
        {
            "gameTime": "2 - 40:05",
            "label": "substitution",
            "description": "Sergiy Rebrov has decided to substitute Junior Moraes and he is replaced by Lukasz Teodorczyk (Dynamo Kiev)."
        },
        {
            "gameTime": "2 - 38:52",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and departs the field of play to be replaced by Vitaliy Buyalskyy (Dynamo Kiev)."
        },
        {
            "gameTime": "2 - 36:18",
            "label": "",
            "description": "It wasn't the best example of how to strike the ball. Andre (FC Porto) unleashed a first time shot from the edge of the box that went high over the crossbar."
        },
        {
            "gameTime": "2 - 35:29",
            "label": "corner",
            "description": "Younes Belhanda (Dynamo Kiev) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 35:15",
            "label": "",
            "description": "Younes Belhanda (Dynamo Kiev) looks to break free, but an opposing player clears the ball away. The referee points to the corner flag. It's a corner to Dyn. Kiev."
        },
        {
            "gameTime": "2 - 33:10",
            "label": "",
            "description": "Andre (FC Porto) sends a cross into the box, but Oleksandr Shovkovsky comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 32:27",
            "label": "substitution",
            "description": "Substitution. Derlis Gonzalez walks off the pitch and Younes Belhanda (Dynamo Kiev) comes on as a substitute."
        },
        {
            "gameTime": "2 - 31:03",
            "label": "",
            "description": "Derlis Gonzalez (Dynamo Kiev) gets on the ball and beats an opponent, but his run is stopped by the referee Carlos Velasco who sees an offensive foul."
        },
        {
            "gameTime": "2 - 29:23",
            "label": "corner",
            "description": "Cristian Tello (FC Porto) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 29:13",
            "label": "",
            "description": "Vincent Aboubakar (FC Porto) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance. The linesman points to the corner flag, FC Porto are going to take it."
        },
        {
            "gameTime": "2 - 27:43",
            "label": "funfact",
            "description": "Total attempts – 9:17."
        },
        {
            "gameTime": "2 - 25:18",
            "label": "",
            "description": "Andriy Yarmolenko (Dynamo Kiev) sends a teasing cross into the area, but Iker Casillas intercepts the ball."
        },
        {
            "gameTime": "2 - 23:21",
            "label": "y-card",
            "description": "Carlos Velasco shows a yellow card to for a tough tackle."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "substitution",
            "description": "Julen Lopetegui has decided to make a change. Jesus Manuel Corona (FC Porto) replaces Gianelli Imbula Wanga."
        },
        {
            "gameTime": "2 - 21:53",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Pablo Osvaldo (FC Porto) for Yacine Brahimi."
        },
        {
            "gameTime": "2 - 21:14",
            "label": "",
            "description": "Derlis Gonzalez (Dynamo Kiev) collects a pass and has an effort from 30 metres out, but it flies just wide of the right post."
        },
        {
            "gameTime": "2 - 20:28",
            "label": "",
            "description": "Yacine Brahimi (FC Porto) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 18:35",
            "label": "soccer-ball",
            "description": "Derlis Gonzalez (Dynamo Kiev) makes a great solo run and pulls the trigger from inside the box, beating Iker Casillas with a strike into the middle of the goal. He makes it 0:2."
        },
        {
            "gameTime": "2 - 16:11",
            "label": "",
            "description": "Denys Garmash (Dynamo Kiev) picks up a precise pass deep inside the box, but his strike is saved by the keeper."
        },
        {
            "gameTime": "2 - 15:47",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) dances his way past two defending players and gets to the edge of the box from where he unleashes a shot that goes well wide of the right post."
        },
        {
            "gameTime": "2 - 14:57",
            "label": "",
            "description": "Cristian Tello (FC Porto) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Oleksandr Shovkovsky guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 13:35",
            "label": "",
            "description": "Bruno Martins Indi (FC Porto) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "2 - 11:27",
            "label": "",
            "description": "FC Porto seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 08:49",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) reacts well and displays good awareness near the penalty spot to get on the end of a cross from the free kick. He jumps high and produces a header which goes well wide of the left post."
        },
        {
            "gameTime": "2 - 08:36",
            "label": "",
            "description": "Sergiy Rybalka (Dynamo Kiev) takes a direct free kick."
        },
        {
            "gameTime": "2 - 07:53",
            "label": "",
            "description": "Miguel Layun (FC Porto) makes a slide tackle, but referee Carlos Velasco blows for a foul. Dyn. Kiev have a free kick."
        },
        {
            "gameTime": "2 - 06:57",
            "label": "",
            "description": "Cristian Tello (FC Porto) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity!"
        },
        {
            "gameTime": "2 - 06:39",
            "label": "",
            "description": "Good defending. Yacine Brahimi (FC Porto) tries to find Vincent Aboubakar inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 04:33",
            "label": "corner",
            "description": "Miguel Layun (FC Porto) takes the corner kick, but Oleksandr Shovkovsky reads it well and stops the effort."
        },
        {
            "gameTime": "2 - 04:21",
            "label": "",
            "description": "Ruben Neves (FC Porto) tries to send a pass but it's blocked. The ball goes out of play and FC Porto have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 02:03",
            "label": "",
            "description": "Andriy Yarmolenko (Dynamo Kiev) attempts to find one of his teammates with a free kick, but the defence is well positioned and clears the ball away from danger."
        },
        {
            "gameTime": "2 - 01:38",
            "label": "",
            "description": "Gianelli Imbula Wanga (FC Porto) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. Dyn. Kiev win a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Julen Lopetegui has decided to make a substitution during the half time break. Andre (FC Porto) comes on the pitch for Maximiliano Pereira."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game. It hasn't been very exciting show so far. The visiting team dominated the first half in most aspects of the game, but the hosts will surely attempt to turn the situation in their favour. The home team makes a lot of passes and attempts to maintain possession. The same goes for the away side."
        },
        {
            "gameTime": "1 - 46:04",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Carlos Velasco has ended it."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "",
            "description": "Maximiliano Pereira (FC Porto) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:45",
            "label": "corner",
            "description": "Andriy Yarmolenko (Dynamo Kiev) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 43:00",
            "label": "",
            "description": "Andriy Yarmolenko (Dynamo Kiev) goes on a mazy run, skips past two defenders and pulls the trigger in front of the keeper. Iker Casillas makes a great save to stop the effort going into the top of the net. Dyn. Kiev have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 42:29",
            "label": "",
            "description": "Maximiliano Pereira (FC Porto) swings a cross into the box, but it's far too close to Oleksandr Shovkovsky, who smothers the ball."
        },
        {
            "gameTime": "1 - 39:47",
            "label": "",
            "description": "Oleksandr Shovkovsky receives ovations from the crowd. He manages to block a first time effort from Ruben Neves (FC Porto), whose strike from the edge of the box was headed towards the left side of the goal."
        },
        {
            "gameTime": "1 - 39:24",
            "label": "corner",
            "description": "Miguel Layun (FC Porto) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 39:11",
            "label": "",
            "description": "Vincent Aboubakar (FC Porto) latches on to a pin point through ball, but one of the defending players dispossess him. Brilliant defending. FC Porto have a corner."
        },
        {
            "gameTime": "1 - 37:57",
            "label": "y-card",
            "description": "Denys Garmash (Dynamo Kiev) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "soccer-ball",
            "description": "Andriy Yarmolenko (Dynamo Kiev) sends Iker Casillas the wrong way and fires the penalty into the middle of the goal!"
        },
        {
            "gameTime": "1 - 34:56",
            "label": "",
            "description": "Andriy Yarmolenko (Dynamo Kiev) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 34:40",
            "label": "penalty",
            "description": "Carlos Velasco blows his whistle and signals a foul after Gianelli Imbula Wanga (FC Porto) brought his opponent down. Dyn. Kiev have been awarded a penalty kick!"
        },
        {
            "gameTime": "1 - 31:40",
            "label": "",
            "description": "A cross from Andriy Yarmolenko (Dynamo Kiev) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 28:16",
            "label": "",
            "description": "Denys Garmash (Dynamo Kiev) latches on to a superb cross into the box and hits the right post with his header. A stroke of luck for the goalkeeper! Junior Moraes (Dynamo Kiev) is furious with himself as he misses a golden opportunity from inside the six yard box. He sends a rebound a few inches wide of the left post."
        },
        {
            "gameTime": "1 - 25:08",
            "label": "corner",
            "description": "The resulting corner, taken by Andriy Yarmolenko (Dynamo Kiev), comes to nothing."
        },
        {
            "gameTime": "1 - 24:41",
            "label": "",
            "description": "Derlis Gonzalez (Dynamo Kiev) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the roof of the net, but Iker Casillas was alert and the score remains the same. The ball is out of play. Dyn. Kiev win a corner kick."
        },
        {
            "gameTime": "1 - 24:05",
            "label": "",
            "description": "Andriy Yarmolenko (Dynamo Kiev) is adjudged offside."
        },
        {
            "gameTime": "1 - 23:25",
            "label": "corner",
            "description": "Andriy Yarmolenko (Dynamo Kiev) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 23:03",
            "label": "",
            "description": "This shall not pass! Sergiy Rybalka (Dynamo Kiev) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. The ball goes out of play. Dyn. Kiev are awarded a corner kick."
        },
        {
            "gameTime": "1 - 22:05",
            "label": "",
            "description": "Cristian Tello (FC Porto) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 20:13",
            "label": "",
            "description": "Derlis Gonzalez (Dynamo Kiev) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the right post."
        },
        {
            "gameTime": "1 - 17:50",
            "label": "",
            "description": "Yacine Brahimi (FC Porto) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 15:46",
            "label": "",
            "description": "FC Porto control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 12:49",
            "label": "",
            "description": "Yacine Brahimi (FC Porto) unleashes a shot from 25 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 11:33",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) was too fierce in his attempt to get the ball from his opponent and Carlos Velasco blows for a foul."
        },
        {
            "gameTime": "1 - 09:04",
            "label": "",
            "description": "Iker Casillas blocks a long range effort from Derlis Gonzalez (Dynamo Kiev) towards the middle of the goal."
        },
        {
            "gameTime": "1 - 06:07",
            "label": "",
            "description": "Danilo Pereira (FC Porto) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "1 - 05:40",
            "label": "corner",
            "description": "Miguel Layun (FC Porto) will take a corner kick."
        },
        {
            "gameTime": "1 - 05:29",
            "label": "",
            "description": "Yacine Brahimi (FC Porto) sends a pass into the box, but his attempt is thwarted and cleared. FC Porto force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 03:50",
            "label": "",
            "description": "The ball is cleared after Yacine Brahimi (FC Porto) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 02:03",
            "label": "",
            "description": "Gianelli Imbula Wanga (FC Porto) collects a pass and strikes from about 20 metres out. It's a poor attempt which flies well wide of the right post."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "FC Porto will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Carlos Velasco."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. There wasn't any evident superiority by either side today. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Dyn. Kiev",
    "gameDate": "24/11/2015 - 22:45",
    "gameHomeTeam": "FC Porto",
    "gameScore": "0 - 2"
}