{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-02-27 - 18-00 Southampton 1 - 2 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:50",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The away side dominated the game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        },
        {
            "gameTime": "2 - 49:46",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 47:53",
            "label": "",
            "description": "The linesman raises his flag for offside before Sadio Mane (Southampton) heads on."
        },
        {
            "gameTime": "2 - 47:32",
            "label": "substitution",
            "description": "A substitution has been made. Eden Hazard is replaced by Nemanja Matic (Chelsea)."
        },
        {
            "gameTime": "2 - 46:40",
            "label": "",
            "description": "Sadio Mane (Southampton) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 43:40",
            "label": "substitution",
            "description": "Ronald Koeman decides to make a substitution. Matt Targett will be replaced by James Ward Prowse (Southampton)."
        },
        {
            "gameTime": "2 - 43:32",
            "label": "soccer-ball",
            "description": "Branislav Ivanovic (Chelsea) outjumps the defenders inside the six yard box to meet the corner and scores with a header into the middle of the goal. The keeper had no chance to react. The score is now 1:2."
        },
        {
            "gameTime": "2 - 43:25",
            "label": "corner",
            "description": "Willian (Chelsea) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 42:47",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. The referee blows his whistle, Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "",
            "description": "gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "2 - 40:30",
            "label": "",
            "description": "Graziano Pelle (Southampton) found himself in a promising position. He ran towards the goal and unleashed a shot from just outside the penalty area which went towards the middle of the goal, but the goalkeeper was ready and made a decent save."
        },
        {
            "gameTime": "2 - 40:05",
            "label": "",
            "description": "Oscar (Chelsea) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Fraser Forster was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "",
            "description": "Eden Hazard (Chelsea) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 36:33",
            "label": "",
            "description": "Willian (Chelsea) makes a good run with the ball, but his shot from the edge of the penalty area goes just wide of the right post. Terrific solo effort, though."
        },
        {
            "gameTime": "2 - 33:22",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Charlie Austin as he is replaced by Sadio Mane (Southampton)."
        },
        {
            "gameTime": "2 - 32:55",
            "label": "corner",
            "description": "The resulting corner from Cesc Fabregas (Chelsea) is cleared."
        },
        {
            "gameTime": "2 - 32:35",
            "label": "",
            "description": "Diego Costa (Chelsea) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. Chelsea have a corner."
        },
        {
            "gameTime": "2 - 29:59",
            "label": "soccer-ball",
            "description": "Brilliant finish! Cesc Fabregas (Chelsea) perfectly collected a pass on the edge of the penalty area from Diego Costa, then produced a nice strike into the right side of the goal. The score is 1:1."
        },
        {
            "gameTime": "2 - 28:29",
            "label": "",
            "description": "Martin Atkinson blows his whistle and it's Willian (Chelsea) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 26:24",
            "label": "",
            "description": "Charlie Austin (Southampton) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 23:48",
            "label": "substitution",
            "description": "Ronald Koeman is forced to make an unplanned substitution as Shane Long suffers an injury and Graziano Pelle (Southampton) comes on."
        },
        {
            "gameTime": "2 - 22:42",
            "label": "injury",
            "description": "The game is interrupted now, Shane Long (Southampton) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 22:10",
            "label": "",
            "description": "Virgil Van Dijk (Southampton) jumps inside the box to meet the resulting corner and steers his header into the roof of the net, but the goalkeeper pulls off an astonishing save to deny him."
        },
        {
            "gameTime": "2 - 22:01",
            "label": "corner",
            "description": "Ryan Bertrand (Southampton) will take the corner."
        },
        {
            "gameTime": "2 - 21:17",
            "label": "",
            "description": "A lofted cross from Shane Long (Southampton) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The ball goes behind for a corner. Southampton will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 20:24",
            "label": "",
            "description": "The game is interrupted as Gary Cahill (Chelsea) is flagged offside."
        },
        {
            "gameTime": "2 - 19:41",
            "label": "y-card",
            "description": "Today's referee Martin Atkinson rightly decides to book Jordy Clasie (Southampton) for his harsh tackle."
        },
        {
            "gameTime": "2 - 18:44",
            "label": "y-card",
            "description": "Ryan Bertrand (Southampton) sees a yellow card from Martin Atkinson after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 17:39",
            "label": "y-card",
            "description": "Martin Atkinson shows a yellow card to Diego Costa (Chelsea) for a tough tackle."
        },
        {
            "gameTime": "2 - 17:18",
            "label": "",
            "description": "Oriol Romeu (Southampton) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 13:43",
            "label": "",
            "description": "Diego Costa (Chelsea) gets on the end of a cross from Eden Hazard, but his shot goes a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "",
            "description": "It wasn't the best example of how to strike the ball. Cesar Azpilicueta (Chelsea) unleashed a first time shot from the edge of the box that went high over the crossbar."
        },
        {
            "gameTime": "2 - 12:42",
            "label": "",
            "description": "A cross into the box from is cleared."
        },
        {
            "gameTime": "2 - 11:14",
            "label": "",
            "description": "Steven Davis (Southampton) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "2 - 10:27",
            "label": "",
            "description": "Martin Atkinson blows for a foul after John Obi Mikel (Chelsea) was too aggressive in the battle for the ball. Southampton earn a free kick."
        },
        {
            "gameTime": "2 - 09:40",
            "label": "",
            "description": "Matt Targett (Southampton) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 07:31",
            "label": "",
            "description": "John Obi Mikel (Chelsea) covers his face with his hands after wasting a glorious chance. The ball rebounded to him but his close range header went a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 07:17",
            "label": "corner",
            "description": "Willian (Chelsea) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 06:37",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) wastes a good opportunity as his pass into the box is blocked by the defence. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:21",
            "label": "",
            "description": "Eden Hazard (Chelsea) skips perfectly past challenges but misdirects his shot from the edge of the box. The ball flies a few yards over the bar."
        },
        {
            "gameTime": "2 - 05:01",
            "label": "attendance",
            "description": "The attendance is 31688."
        },
        {
            "gameTime": "2 - 04:06",
            "label": "",
            "description": "Oscar (Chelsea) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 03:11",
            "label": "",
            "description": "Shane Long (Southampton) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 02:25",
            "label": "",
            "description": "Alves Cedric (Southampton) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "2 - 01:09",
            "label": "",
            "description": "Jordy Clasie (Southampton) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "2 - 00:09",
            "label": "substitution",
            "description": "Guus Hiddink makes a half time substitution. Kenedy (Chelsea) comes on in place of Abdul Baba Rahman."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "",
            "description": "Both sides have been very active in the first half, providing the fans with an exciting show. The game is quite balanced. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 46:01",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:11",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "",
            "description": "Oscar (Chelsea) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. Chelsea have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 43:58",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 43:29",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) flights in the cross, but the defender is alert and clears to safety. Chelsea earn a corner."
        },
        {
            "gameTime": "1 - 41:30",
            "label": "soccer-ball",
            "description": "Goal! A mistake from the defence gifted a chance to a lurking Shane Long (Southampton), who keeps his cool and rolls the ball into the net from close range. 1:0."
        },
        {
            "gameTime": "1 - 41:06",
            "label": "",
            "description": "Eden Hazard (Chelsea) wastes a big chance! He unleashes a shot from the edge of the box and it goes narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 39:58",
            "label": "",
            "description": "A through ball from John Obi Mikel (Chelsea) fails to reach Eden Hazard as one of the defending players reacts brilliantly to intercept the effort. If the pass had been produced a little bit earlier, Eden Hazard could have got into a promising position."
        },
        {
            "gameTime": "1 - 38:43",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 37:28",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 37:11",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Chelsea."
        },
        {
            "gameTime": "1 - 33:31",
            "label": "",
            "description": "Diego Costa (Chelsea) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 32:09",
            "label": "",
            "description": "The linesman raises his flag. Charlie Austin (Southampton) is adjudged offside."
        },
        {
            "gameTime": "1 - 30:29",
            "label": "",
            "description": "Good team movement sets up Charlie Austin (Southampton) on the edge of the box, but he slices the ball narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 29:39",
            "label": "",
            "description": "Diego Costa (Chelsea) takes a shot after receiving a good pass, but his effort from the edge of the box goes just over the crossbar."
        },
        {
            "gameTime": "1 - 29:25",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 26:57",
            "label": "",
            "description": "Oscar (Chelsea) latches on to a precise defence splitting pass and drills a nice strike from a promising distance towards the middle of the goal. Fraser Forster has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 26:34",
            "label": "",
            "description": "Shane Long (Southampton) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 23:42",
            "label": "corner",
            "description": "The resulting corner from Steven Davis (Southampton) comes to nothing."
        },
        {
            "gameTime": "1 - 23:01",
            "label": "",
            "description": "Charlie Austin (Southampton) sends a cross into the box, but the opposition's defence quickly intercepts the ball. Southampton have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 22:46",
            "label": "corner",
            "description": "Ryan Bertrand (Southampton) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 22:04",
            "label": "",
            "description": "The ball is cleared after Alves Cedric (Southampton) attempted to dribble past an opposing player. The ball goes out of play. Southampton are awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:45",
            "label": "corner",
            "description": "Oscar (Chelsea) launches a cross from the corner, but Fraser Forster is alert to thwart the effort."
        },
        {
            "gameTime": "1 - 20:20",
            "label": "",
            "description": "Eden Hazard (Chelsea) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders. The referee and his assistant both point at the corner flag. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 19:57",
            "label": "",
            "description": "Alves Cedric (Southampton) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 18:34",
            "label": "y-card",
            "description": "Steven Davis (Southampton) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Martin Atkinson didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "1 - 17:01",
            "label": "corner",
            "description": "Steven Davis (Southampton) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 16:46",
            "label": "",
            "description": "Jordy Clasie (Southampton) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender. The ball is out of play. Southampton win a corner kick."
        },
        {
            "gameTime": "1 - 16:29",
            "label": "corner",
            "description": "Steven Davis (Southampton) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 16:11",
            "label": "",
            "description": "Ryan Bertrand (Southampton) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee signals a corner kick to Southampton."
        },
        {
            "gameTime": "1 - 15:23",
            "label": "",
            "description": "A pass into the penalty area from Cesc Fabregas (Chelsea) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 14:19",
            "label": "",
            "description": "Diego Costa (Chelsea) sent a pass onto Cesar Azpilicueta, who didn't get a chance to finish."
        },
        {
            "gameTime": "1 - 12:16",
            "label": "",
            "description": "Charlie Austin (Southampton) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 12:05",
            "label": "",
            "description": "Alves Cedric (Southampton) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 11:07",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 10:44",
            "label": "corner",
            "description": "The corner from Willian (Chelsea) is cleared away by the defence. The ball is out of play and Chelsea manage to earn a corner."
        },
        {
            "gameTime": "1 - 10:26",
            "label": "",
            "description": "Oscar (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Now Chelsea have a corner."
        },
        {
            "gameTime": "1 - 09:34",
            "label": "",
            "description": "Shane Long (Southampton) has a big opportunity to score! He climbs highest deep inside the penalty box and strikes a powerful header towards the goal. Next time he should aim better as his effort flies narrowly over the bar."
        },
        {
            "gameTime": "1 - 09:20",
            "label": "corner",
            "description": "Steven Davis (Southampton) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 09:02",
            "label": "",
            "description": "Steven Davis (Southampton) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The ball is out of play and the linesman points at the corner flag. Corner to Southampton."
        },
        {
            "gameTime": "1 - 08:42",
            "label": "corner",
            "description": "Steven Davis (Southampton) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 08:10",
            "label": "",
            "description": "Alves Cedric (Southampton) serves up a nice cross, but the defence clears the danger. The referee points to the corner flag. It's a corner to Southampton."
        },
        {
            "gameTime": "1 - 06:33",
            "label": "substitution",
            "description": "Guus Hiddink is forced to make a change. Pedro is not able to carry on due to injury. He is replaced by Oscar (Chelsea)."
        },
        {
            "gameTime": "1 - 05:31",
            "label": "injury",
            "description": "Pedro (Chelsea) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 04:57",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) swings a cross into the box, but it's far too close to Fraser Forster, who smothers the ball."
        },
        {
            "gameTime": "1 - 04:26",
            "label": "",
            "description": "Eden Hazard (Chelsea) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 03:53",
            "label": "",
            "description": "Ryan Bertrand (Southampton) clips a neat ball into the box in the direction of Charlie Austin, but he can't get on the end of the pass."
        },
        {
            "gameTime": "1 - 01:37",
            "label": "",
            "description": "Neat passing move from Chelsea in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 00:10",
            "label": "",
            "description": "The players are out at last! Southampton will take the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Martin Atkinson."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The away side dominated the game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "27/02/2016 - 18:00",
    "gameHomeTeam": "Southampton",
    "gameScore": "1 - 2"
}