{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2014-2015/2015-05-02 - 19-00 Atl. Madrid 0 - 0 Ath Bilbao/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The game was quite balanced and neither team had any obvious advantage. Both sides attempted to create scoring opportunities mostly with long balls."
        },
        {
            "gameTime": "2 - 48:10",
            "label": "whistle",
            "description": "That's it for today, Santiago Jaime Latre has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 47:55",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 47:16",
            "label": "yr-card",
            "description": "An infringement by Unai Bustinza (Ath Bilbao) results in a yellow card and as it's the second time today, he also sees a red and is dismissed by Santiago Jaime Latre."
        },
        {
            "gameTime": "2 - 46:13",
            "label": "",
            "description": "Miranda (Atl. Madrid) finds some space inside the box and produces a first time shot that goes high over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "2 - 45:51",
            "label": "",
            "description": "The flag is raised and Inaki Williams (Ath Bilbao) is offside again, not for the first time today."
        },
        {
            "gameTime": "2 - 45:26",
            "label": "",
            "description": "Inaki Williams (Ath Bilbao) is flagged for offside."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:44",
            "label": "",
            "description": "A crossfield pass from Unai Bustinza (Ath Bilbao) fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 44:01",
            "label": "",
            "description": "Santiago Jaime Latre has a clear sight and sees a foul from Miranda (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 43:16",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) climbs high to connect with a cross near the penalty spot but plants a header high over the bar."
        },
        {
            "gameTime": "2 - 42:39",
            "label": "",
            "description": "The free kick is delivered by Koke (Atl. Madrid) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "2 - 42:16",
            "label": "",
            "description": "Unai Bustinza (Ath Bilbao) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision! Atl. Madrid get a free kick."
        },
        {
            "gameTime": "2 - 42:01",
            "label": "substitution",
            "description": "Here's the change. Tiago leaves the pitch and Saul Niguez (Atl. Madrid) comes on as a substitute."
        },
        {
            "gameTime": "2 - 40:58",
            "label": "y-card",
            "description": "Diego Godin (Atl. Madrid) is booked for saying more than Santiago Jaime Latre was willing to tolerate."
        },
        {
            "gameTime": "2 - 40:16",
            "label": "",
            "description": "Mario Mandzukic (Atl. Madrid) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "2 - 39:06",
            "label": "",
            "description": "Arda Turan (Atl. Madrid) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 38:28",
            "label": "substitution",
            "description": "The substitution is prepared. Carlos Gurpegi (Ath Bilbao) joins the action as a substitute, replacing Ander Iturraspe."
        },
        {
            "gameTime": "2 - 37:01",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Inaki Williams (Ath Bilbao) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 36:30",
            "label": "",
            "description": "Koke (Atl. Madrid) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "2 - 35:54",
            "label": "y-card",
            "description": "Aymeric Laporte (Ath Bilbao) receives a yellow card from the referee for a foul that he committed a little earlier. It's a free kick to Atl. Madrid in a dangerous position."
        },
        {
            "gameTime": "2 - 35:08",
            "label": "",
            "description": "A pass by Unai Lopez (Ath Bilbao) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "2 - 32:49",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 32:31",
            "label": "injury",
            "description": "Diego Godin (Atl. Madrid) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 30:55",
            "label": "y-card",
            "description": "Unai Bustinza (Ath Bilbao) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "",
            "description": "Ath Bilbao seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 28:02",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 27:34",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Iago Herrerin. The ball goes out of play and Atl. Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 26:32",
            "label": "",
            "description": "Gabi (Atl. Madrid) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "2 - 26:00",
            "label": "y-card",
            "description": "A yellow card for a tackle by Mikel San Jose (Ath Bilbao). Santiago Jaime Latre doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 25:16",
            "label": "",
            "description": "Tiago (Atl. Madrid) has a goal ruled out for offside!"
        },
        {
            "gameTime": "2 - 24:25",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 24:18",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders. The referee signals a corner kick to Atl. Madrid."
        },
        {
            "gameTime": "2 - 23:58",
            "label": "",
            "description": "Koke (Atl. Madrid) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 23:33",
            "label": "",
            "description": "Unai Bustinza (Ath Bilbao) makes a rough challenge and the referee blows for a foul. A free kick is awarded to Atl. Madrid."
        },
        {
            "gameTime": "2 - 22:35",
            "label": "",
            "description": "Iago Herrerin displays his ability to read the game and clears the danger after Antoine Griezmann (Atl. Madrid) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "2 - 21:32",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Sola departs the field of play to be replaced by Guillermo (Ath Bilbao)."
        },
        {
            "gameTime": "2 - 20:04",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance."
        },
        {
            "gameTime": "2 - 18:45",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 18:20",
            "label": "",
            "description": "Juanfran (Atl. Madrid) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. Atl. Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 18:02",
            "label": "corner",
            "description": "Koke (Atl. Madrid) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 17:23",
            "label": "",
            "description": "Mario Mandzukic (Atl. Madrid) sprays a pass out to Arda Turan, but he can't beat his man to get to the ball. The referee and his assistant both point at the corner flag. Atl. Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 17:03",
            "label": "",
            "description": "The referee and the linesman both signal a throw in for Ath Bilbao."
        },
        {
            "gameTime": "2 - 15:52",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) sends a teasing cross into the area, but Iago Herrerin intercepts the ball."
        },
        {
            "gameTime": "2 - 15:02",
            "label": "",
            "description": "Santiago Jaime Latre blows his whistle. Sola (Ath Bilbao) commits a foul after dangerous play."
        },
        {
            "gameTime": "2 - 13:52",
            "label": "",
            "description": "Xabier Etxeita (Ath Bilbao) gets to the ball from the resulting corner but blazes it well over the bar."
        },
        {
            "gameTime": "2 - 13:34",
            "label": "corner",
            "description": "Unai Lopez (Ath Bilbao) takes the corner."
        },
        {
            "gameTime": "2 - 12:59",
            "label": "",
            "description": "Sola (Ath Bilbao) tries to slide the ball through to a teammate but it's well blocked by a defender. It will be a corner kick for Ath Bilbao."
        },
        {
            "gameTime": "2 - 12:32",
            "label": "substitution",
            "description": "Andoni Iraola is substituted due to injury. Ernesto Valverde Tejedor gives a chance to Unai Lopez (Ath Bilbao)."
        },
        {
            "gameTime": "2 - 11:28",
            "label": "injury",
            "description": "Andoni Iraola (Ath Bilbao) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 10:59",
            "label": "substitution",
            "description": "Here is a change. Raul Garcia is going off and Diego Simeone gives the last tactical orders to Mario Mandzukic (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 10:53",
            "label": "substitution",
            "description": "Substitution. Arda Turan (Atl. Madrid) has come on for Fernando Torres."
        },
        {
            "gameTime": "2 - 09:30",
            "label": "",
            "description": "CHANCE! Sola (Ath Bilbao) fires just wide of the right post from inside the box after running onto a splendid pass from Mikel San Jose."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "",
            "description": "Unai Bustinza (Ath Bilbao) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 08:08",
            "label": "attendance",
            "description": "The attendance is 48452."
        },
        {
            "gameTime": "2 - 07:44",
            "label": "",
            "description": "Raul Garcia (Atl. Madrid) gives away a foul for a clumsy challenge. Referee Santiago Jaime Latre saw the whole situation."
        },
        {
            "gameTime": "2 - 06:44",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 05:53",
            "label": "corner",
            "description": "Koke (Atl. Madrid) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 05:31",
            "label": "",
            "description": "Raul Garcia (Atl. Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball. Atl. Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 05:21",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "2 - 04:19",
            "label": "",
            "description": "Raul Garcia (Atl. Madrid) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 03:04",
            "label": "",
            "description": "Koke (Atl. Madrid) attempts to find one of his teammates with a cross from the resultant free kick, but he fails to hit the ball properly and sends it off the pitch."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "",
            "description": "Aymeric Laporte (Ath Bilbao) makes a reckless foul in order to win the ball from his opponent. Santiago Jaime Latre has a clear sight of it and blows his whistle. Atl. Madrid are awarded the free kick."
        },
        {
            "gameTime": "2 - 01:39",
            "label": "",
            "description": "Mikel Rico (Ath Bilbao) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Not a lot happening in the first half, it hasn't been the best game so far in terms of quality. Both teams are unsuccessfully trying to control the game and it's pretty even so far. Both sides have adopted a tactic known as kick and rush football."
        },
        {
            "gameTime": "1 - 46:14",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Santiago Jaime Latre has ended it."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "Xabier Etxeita (Ath Bilbao) makes a slide tackle, but referee Santiago Jaime Latre blows for a foul."
        },
        {
            "gameTime": "1 - 42:27",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Antoine Griezmann (Atl. Madrid) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "1 - 41:37",
            "label": "corner",
            "description": "Koke (Atl. Madrid) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 40:32",
            "label": "y-card",
            "description": "The main referee, Santiago Jaime Latre, is apparently not going to tolerate any discussions. Fernando Torres (Atl. Madrid) is given a yellow card for dissent."
        },
        {
            "gameTime": "1 - 40:30",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) received a clever through ball which could have put him in a promising position, but the defence was alert to the danger. Now Atl. Madrid have a corner."
        },
        {
            "gameTime": "1 - 40:05",
            "label": "",
            "description": "Raul Garcia (Atl. Madrid) rises highest from the corner to head at goal, but his low effort towards the middle of the goal is comfortably saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 40:03",
            "label": "corner",
            "description": "Koke (Atl. Madrid) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "",
            "description": "Raul Garcia (Atl. Madrid) fails to find any of his teammates inside the box as his pass is blocked. The ball is out of play. Atl. Madrid win a corner kick."
        },
        {
            "gameTime": "1 - 38:56",
            "label": "corner",
            "description": "The corner from Koke (Atl. Madrid) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "",
            "description": "Good clearance! Juanfran (Atl. Madrid) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him. The referee blows his whistle, Atl. Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 37:46",
            "label": "",
            "description": "Dangerous play by Inaki Williams (Ath Bilbao). Santiago Jaime Latre blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 35:34",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Ander Iturraspe (Ath Bilbao) sacrificed accuracy for power, and thus his attempt went well wide of the right post."
        },
        {
            "gameTime": "1 - 34:40",
            "label": "",
            "description": "Raul Garcia (Atl. Madrid) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "",
            "description": "Sola (Ath Bilbao) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 33:20",
            "label": "injury",
            "description": "The game is interrupted now, Sola (Ath Bilbao) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 32:07",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 31:24",
            "label": "",
            "description": "The linesman raises his flag. Juanfran (Atl. Madrid) is adjudged offside."
        },
        {
            "gameTime": "1 - 29:43",
            "label": "",
            "description": "Oscar de Marcos (Ath Bilbao) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 27:55",
            "label": "",
            "description": "Juanfran (Atl. Madrid) was too fierce in his attempt to get the ball from his opponent and Santiago Jaime Latre blows for a foul."
        },
        {
            "gameTime": "1 - 27:25",
            "label": "",
            "description": "Raul Garcia (Atl. Madrid) produces a long range strike, but he only hits one of his own teammates standing in its way."
        },
        {
            "gameTime": "1 - 26:11",
            "label": "",
            "description": "Andoni Iraola (Ath Bilbao) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 25:04",
            "label": "",
            "description": "The ball is cleared after Oscar de Marcos (Ath Bilbao) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 22:54",
            "label": "",
            "description": "Inaki Williams (Ath Bilbao) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball."
        },
        {
            "gameTime": "1 - 22:17",
            "label": "",
            "description": "Ander Iturraspe (Ath Bilbao) makes a rough challenge and Santiago Jaime Latre blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 21:27",
            "label": "",
            "description": "The ball is behind the touchline and Atl. Madrid will take a throw in."
        },
        {
            "gameTime": "1 - 19:43",
            "label": "",
            "description": "Raul Garcia (Atl. Madrid) finds himself unmarked on the edge of the box, but he drags his shot just wide of the right post."
        },
        {
            "gameTime": "1 - 18:37",
            "label": "",
            "description": "Raul Garcia (Atl. Madrid) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 18:02",
            "label": "",
            "description": "Unai Bustinza (Ath Bilbao) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 16:54",
            "label": "",
            "description": "What a poor attempt! Sola (Ath Bilbao) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "1 - 15:13",
            "label": "",
            "description": "The linesman raises his flag for offside before Antoine Griezmann (Atl. Madrid) heads on."
        },
        {
            "gameTime": "1 - 14:55",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "1 - 14:43",
            "label": "corner",
            "description": "The goalkeeper punched the ball away after Koke (Atl. Madrid) took the corner."
        },
        {
            "gameTime": "1 - 13:56",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Juanfran (Atl. Madrid). The linesman makes the right call and Atl. Madrid will have a corner."
        },
        {
            "gameTime": "1 - 12:44",
            "label": "",
            "description": "Sola (Ath Bilbao) makes a strong challenge and Santiago Jaime Latre blows for a foul."
        },
        {
            "gameTime": "1 - 12:05",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "1 - 11:35",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) crosses the ball forward but it is intercepted."
        },
        {
            "gameTime": "1 - 10:40",
            "label": "",
            "description": "It's a throw in for Atl. Madrid."
        },
        {
            "gameTime": "1 - 09:22",
            "label": "",
            "description": "Unai Bustinza (Ath Bilbao) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 07:52",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) didn't hesitate to knock his opponent down with a harsh sliding tackle. Santiago Jaime Latre could probably show him a yellow, but he only goes with blowing the whistle for a foul."
        },
        {
            "gameTime": "1 - 05:31",
            "label": "",
            "description": "Mikel San Jose (Ath Bilbao) connects with the corner kick around the penalty spot, but steers his header just wide of the right post."
        },
        {
            "gameTime": "1 - 05:18",
            "label": "corner",
            "description": "Andoni Iraola (Ath Bilbao) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 05:02",
            "label": "",
            "description": "Good clearance! Inaki Williams (Ath Bilbao) receives a brilliant short pass and finds himself in a good position inside the box, but he's robbed of the ball by one of the defending players. The ball is out of play. Ath Bilbao will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 04:22",
            "label": "",
            "description": "Inaki Williams (Ath Bilbao) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 03:33",
            "label": "",
            "description": "Tiago (Atl. Madrid) was too forceful with his tackle and Santiago Jaime Latre interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 01:44",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 00:57",
            "label": "",
            "description": "Koke (Atl. Madrid) attempts to surprise the keeper with a nice shot, but it lacks accuracy and goes well wide of the right post."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Ath Bilbao will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Santiago Jaime Latre was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The game was quite balanced and neither team had any obvious advantage. Both sides attempted to create scoring opportunities mostly with long balls."
        }
    ],
    "gameAwayTeam": "Ath Bilbao",
    "gameDate": "02/05/2015 - 19:00",
    "gameHomeTeam": "Atl. Madrid",
    "gameScore": "0 - 0"
}