{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-10-26 - 21-45 Napoli 2 - 0 Empoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. This has been a real cat and mouse game, with the hosts coming out on top. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        },
        {
            "gameTime": "2 - 49:08",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:52",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "2 - 46:40",
            "label": "corner",
            "description": "Daniele Croce (Empoli) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 45:19",
            "label": "corner",
            "description": "Napoli didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:43",
            "label": "",
            "description": "Jose Callejon (Napoli) latches on to a cross on the edge of the box and fires a shot at goal, but his effort was blocked by one of the defenders. The ball is out of play. Napoli win a corner kick."
        },
        {
            "gameTime": "2 - 44:00",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner."
        },
        {
            "gameTime": "2 - 43:47",
            "label": "",
            "description": "Jose Callejon (Napoli) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "corner",
            "description": "Jose Callejon (Napoli) will take the corner."
        },
        {
            "gameTime": "2 - 39:31",
            "label": "corner",
            "description": "Federico Dimarco (Empoli) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 37:36",
            "label": "y-card",
            "description": "Maurizio Mariani shows a yellow card to Andres Tello (Empoli) for his blatant foul."
        },
        {
            "gameTime": "2 - 35:49",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Vlad Chiriches (Napoli) was set free in the area by Marek Hamsik and made no mistake with a lovely finish into the left side of the net. 2:0."
        },
        {
            "gameTime": "2 - 35:30",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 32:32",
            "label": "substitution",
            "description": "Here is a change. Cristian Maggio is going off and Maurizio Sarri gives the last tactical orders to Elseid Hysaj (Napoli)."
        },
        {
            "gameTime": "2 - 31:13",
            "label": "corner",
            "description": "Empoli have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "2 - 30:53",
            "label": "",
            "description": "Manuel Pucciarelli (Empoli) produces a ferocious strike from the edge of the box. His dangerous effort towards the right post is blocked by Pepe Reina, who pulls off a superb save to keep the ball out of the net. The ball goes out for a corner. Empoli can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 29:22",
            "label": "corner",
            "description": "Daniele Croce (Empoli) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 28:32",
            "label": "",
            "description": "Dries Mertens (Napoli) receives a precise pass and threatens the keeper with a long range shot. His attempt goes miles wide of the left post."
        },
        {
            "gameTime": "2 - 26:47",
            "label": "substitution",
            "description": "Amadou Diawara (Napoli) joins the action as a substitute, replacing Jorginho."
        },
        {
            "gameTime": "2 - 25:36",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Marek Hamsik (Napoli) will replace Allan."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "substitution",
            "description": "Substitution. Marcel Buchel will be replaced by Daniele Croce (Empoli)."
        },
        {
            "gameTime": "2 - 21:29",
            "label": "substitution",
            "description": "Giovanni Martusciello has decided to substitute Levan Mchedlidze and he is replaced by Massimo Maccarone (Empoli)."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "",
            "description": "Some great controlled play and passing from Napoli. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 14:10",
            "label": "",
            "description": "Dries Mertens (Napoli) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 12:50",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 12:11",
            "label": "",
            "description": "Jorginho (Napoli) produces a ferocious strike from the edge of the box. His dangerous effort towards the roof of the net is blocked by Lukasz Skorupski, who pulls off a superb save to keep the ball out of the net. The ball goes out of play. Napoli are awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:44",
            "label": "corner",
            "description": "Empoli fail to score from a corner as Pepe Reina (Napoli) leaps to collect the ball."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "substitution",
            "description": "A substitution has been made. Rade Krunic is replaced by Andres Tello (Empoli)."
        },
        {
            "gameTime": "2 - 09:40",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "2 - 08:52",
            "label": "",
            "description": "Allan (Napoli) receives a pass and fires a shot in from long range, but it's blocked. The ball is out of play. Napoli will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 07:00",
            "label": "y-card",
            "description": "Dries Mertens (Napoli) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 06:00",
            "label": "soccer-ball",
            "description": "Goal! After receiving a sweet pass, Dries Mertens (Napoli) unleashes a shot straight into the bottom left corner. Good team effort!"
        },
        {
            "gameTime": "2 - 04:39",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "2 - 03:09",
            "label": "corner",
            "description": "Empoli quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 02:43",
            "label": "",
            "description": "Levan Mchedlidze (Empoli) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. The ball goes out of play and Empoli have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:05",
            "label": "",
            "description": "Napoli enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. The hosts were superior in their performance in the first half. They were more active and precise. The visitors have been very flat and lacked creativity in their attack. Let's see if they change something in the second period."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 43:27",
            "label": "corner",
            "description": "Lorenzo Insigne (Napoli) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 43:00",
            "label": "",
            "description": "What a sweet touch by Jose Callejon (Napoli) as he collects a pass deep inside the box and decides to go for goal. It's on target but easy for Lukasz Skorupski to hold. The ball goes out of play. Napoli are awarded a corner kick."
        },
        {
            "gameTime": "1 - 42:34",
            "label": "",
            "description": "Napoli seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "corner",
            "description": "Jose Callejon (Napoli) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) is first to latch onto the rebound inside the penalty area. He sends a promising shot towards the bottom left corner, but it is denied by the goalkeeper who pulls off a superb save. The referee points to the corner flag. It's a corner to Napoli."
        },
        {
            "gameTime": "1 - 39:28",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) receives a lofted pass and is given time inside the box to unleash a shot goalwards. The ball is directed to the bottom left corner, but it lacks power and Lukasz Skorupski pulls off a comfortable save to thwart the effort."
        },
        {
            "gameTime": "1 - 38:15",
            "label": "",
            "description": "Close! Lorenzo Insigne (Napoli) stands over the resulting free kick from around 31 metres out and his shot goes just wide of the left post!"
        },
        {
            "gameTime": "1 - 37:21",
            "label": "y-card",
            "description": "Giuseppe Bellusci (Empoli) is punished with a yellow card for violating the rules."
        },
        {
            "gameTime": "1 - 37:01",
            "label": "",
            "description": "Jorginho (Napoli) takes the free kick from a long way out but the defender manages to get it clear."
        },
        {
            "gameTime": "1 - 35:14",
            "label": "",
            "description": "Maurizio Mariani blows his whistle and it's Marcel Buchel (Empoli) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 34:37",
            "label": "",
            "description": "Jose Callejon (Napoli) attempts to convert a lofted cross as he jumps high and heads the ball down to the middle of the goal. Lukasz Skorupski shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net."
        },
        {
            "gameTime": "1 - 31:45",
            "label": "",
            "description": "Dries Mertens (Napoli) is furious with himself as he misses a golden opportunity from inside the six yard box. He sends a rebound a few inches wide of the left post."
        },
        {
            "gameTime": "1 - 31:07",
            "label": "",
            "description": "Dries Mertens (Napoli) wriggles into space inside the box with excellent ball control, but his effort on goal is well blocked."
        },
        {
            "gameTime": "1 - 28:59",
            "label": "",
            "description": "Allan (Napoli) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 27:36",
            "label": "",
            "description": "What a poor attempt! Lorenzo Insigne (Napoli) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes yards wide of the left post."
        },
        {
            "gameTime": "1 - 27:05",
            "label": "",
            "description": "Pepe Reina displays his ability to read the game and clears the danger after Manuel Pucciarelli (Empoli) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "1 - 25:25",
            "label": "",
            "description": "The free kick from long range, taken by Napoli, is overhit and the ball goes out of play."
        },
        {
            "gameTime": "1 - 24:05",
            "label": "",
            "description": "Maurizio Mariani blows his whistle. Giuseppe Bellusci (Empoli) commits a foul after dangerous play. Napoli have a free kick."
        },
        {
            "gameTime": "1 - 21:40",
            "label": "corner",
            "description": "The referee awards a corner and Jose Callejon (Napoli) goes over to take it."
        },
        {
            "gameTime": "1 - 20:58",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) unleashes a powerful shot towards goal from a mid range free kick, but the ball is blocked by the defensive wall. Napoli earn a corner."
        },
        {
            "gameTime": "1 - 20:09",
            "label": "",
            "description": "A player from Empoli commits an attacking foul. The referee blows his whistle. Napoli have been awarded a free kick."
        },
        {
            "gameTime": "1 - 19:23",
            "label": "",
            "description": "One of the defending players blocks a long range shot which was unleashed by Lorenzo Insigne (Napoli)."
        },
        {
            "gameTime": "1 - 17:55",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes a short corner kick."
        },
        {
            "gameTime": "1 - 17:11",
            "label": "",
            "description": "Allan (Napoli) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The linesman makes the right call and Napoli will have a corner."
        },
        {
            "gameTime": "1 - 16:36",
            "label": "corner",
            "description": "Rade Krunic (Empoli) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "1 - 16:06",
            "label": "corner",
            "description": "Riccardo Saponara (Empoli) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 14:15",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) picks up a pass and hits the ball towards goal, but he can't generate enough power to trouble Lukasz Skorupski."
        },
        {
            "gameTime": "1 - 12:46",
            "label": "",
            "description": "Good clearance! Dries Mertens (Napoli) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him."
        },
        {
            "gameTime": "1 - 11:26",
            "label": "",
            "description": "Jose Callejon (Napoli) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "1 - 11:08",
            "label": "",
            "description": "Cristian Maggio (Napoli) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "1 - 10:00",
            "label": "",
            "description": "Empoli are showing great team chemistry. They are passing the ball around seamlessly but finally one of the defending players makes an interception."
        },
        {
            "gameTime": "1 - 08:03",
            "label": "",
            "description": "Jorginho (Napoli) trips an opposition player and Maurizio Mariani signals a foul."
        },
        {
            "gameTime": "1 - 07:29",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) weaves his way through opponents and strikes the ball from the edge of the area, but it's blocked by a defender."
        },
        {
            "gameTime": "1 - 06:02",
            "label": "",
            "description": "Riccardo Saponara (Empoli) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 02:03",
            "label": "",
            "description": "Assane Diousse (Empoli) sends in a cross from a long range free kick. However, his effort lacks accuracy and the ball sails off the pitch."
        },
        {
            "gameTime": "1 - 00:14",
            "label": "",
            "description": "Empoli will kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Maurizio Mariani."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Already 6 Empoli matches finished 0:0, it's their most frequent result this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli have already won 9 points from their home matches this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dries Mertens has already scored 10 goals and he is the top goal scorer for Napoli in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. This has been a real cat and mouse game, with the hosts coming out on top. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        }
    ],
    "gameAwayTeam": "Empoli",
    "gameDate": "26/10/2016 - 21:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "2 - 0"
}