{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2016-11-26 - 17-30 Eintracht Frankfurt 2 - 1 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. The away team was superior on the pitch today. The home team attempted to leave the opposition defence outnumbered and hit them on the break. The visitors tried to keep the ball on the ground and play a passing game."
        },
        {
            "gameTime": "2 - 50:28",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 49:54",
            "label": "y-card",
            "description": "Marcel Schmelzer (Dortmund) receives a yellow card."
        },
        {
            "gameTime": "2 - 48:31",
            "label": "substitution",
            "description": "Substitution. Marco Fabian makes way for Branimir Hrgota (Eintracht Frankfurt)."
        },
        {
            "gameTime": "2 - 47:24",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) creates a good chance for himself and goes for goal from mid range, but he fails to change the score as his effort deflects away off the bar."
        },
        {
            "gameTime": "2 - 45:44",
            "label": "y-card",
            "description": "It's a yellow card for Lukas Hradecky (Eintracht Frankfurt)."
        },
        {
            "gameTime": "2 - 45:17",
            "label": "",
            "description": "Marco Reus (Dortmund) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:44",
            "label": "y-card",
            "description": "Mijat Gacinovic (Eintracht Frankfurt) is booked after bringing down an opponent. Wolfgang Stark had an easy decision to make."
        },
        {
            "gameTime": "2 - 44:30",
            "label": "",
            "description": "Mijat Gacinovic (Eintracht Frankfurt) commits a foul after bringing down his opponent with a slide tackle. Dortmund have a free kick."
        },
        {
            "gameTime": "2 - 43:21",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 40:09",
            "label": "attendance",
            "description": "The attendance is 51500."
        },
        {
            "gameTime": "2 - 39:37",
            "label": "corner",
            "description": "Marco Fabian (Eintracht Frankfurt) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 39:05",
            "label": "",
            "description": "Haris Seferovic (Eintracht Frankfurt) tries to slide the ball through to a teammate but it's well blocked by a defender. Good work from Eintracht Frankfurt as they win a corner."
        },
        {
            "gameTime": "2 - 38:14",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 36:57",
            "label": "substitution",
            "description": "Substitution. Szabolcs Huszti will be replaced by Aymen Barkok (Eintracht Frankfurt)."
        },
        {
            "gameTime": "2 - 36:15",
            "label": "corner",
            "description": "Marco Reus (Dortmund) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "2 - 35:52",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) crosses the ball into the box, but one of the defending players averts the threat. The ball goes behind for a corner. Dortmund will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 33:29",
            "label": "soccer-ball",
            "description": "Brilliant finish! Haris Seferovic (Eintracht Frankfurt) perfectly collected a pass on the edge of the penalty area from Szabolcs Huszti, then produced a nice strike into the bottom left corner. The score is 2:1."
        },
        {
            "gameTime": "2 - 31:58",
            "label": "soccer-ball",
            "description": "It's a goal! Pierre Emerick Aubameyang (Dortmund) makes it 1:1. He jumped highest to connect with a perfect cross from Ousmane Dembele and planted his close range header into the bottom right corner. Lukas Hradecky was helpless."
        },
        {
            "gameTime": "2 - 28:50",
            "label": "y-card",
            "description": "Gonzalo Castro (Dortmund) is the one who receives a yellow card."
        },
        {
            "gameTime": "2 - 26:23",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "2 - 26:00",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "2 - 25:18",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Alexander Meier as he is replaced by Haris Seferovic (Eintracht Frankfurt)."
        },
        {
            "gameTime": "2 - 19:54",
            "label": "y-card",
            "description": "Wolfgang Stark shows a yellow card to Sokratis (Dortmund) for his blatant foul."
        },
        {
            "gameTime": "2 - 17:04",
            "label": "corner",
            "description": "Eintracht Frankfurt take a short corner kick."
        },
        {
            "gameTime": "2 - 16:48",
            "label": "",
            "description": "Alexander Meier (Eintracht Frankfurt) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. Eintracht Frankfurt force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 16:32",
            "label": "",
            "description": "Timothy Chandler (Eintracht Frankfurt) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 14:20",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) takes a short corner kick."
        },
        {
            "gameTime": "2 - 14:15",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) tries to send a pass but it's blocked. Dortmund have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 12:59",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Ousmane Dembele (Dortmund) comes onto the pitch so that Andre Schurrle can be given a rest."
        },
        {
            "gameTime": "2 - 12:45",
            "label": "substitution",
            "description": "Thomas Tuchel prepares a substitution. Adrian Ramos is replaced by Marco Reus (Dortmund)."
        },
        {
            "gameTime": "2 - 12:15",
            "label": "substitution",
            "description": "Here comes a substitution. Julian Weigl is given a rest as he is replaced by Sebastian Rode (Dortmund)."
        },
        {
            "gameTime": "2 - 11:22",
            "label": "",
            "description": "Mijat Gacinovic (Eintracht Frankfurt) feels very aggrieved after the referee stops play for a foul that he commits while in possession of the ball."
        },
        {
            "gameTime": "2 - 06:21",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) tries to find Gonzalo Castro, but he puts too much power on the pass."
        },
        {
            "gameTime": "2 - 03:35",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Dortmund."
        },
        {
            "gameTime": "2 - 00:59",
            "label": "soccer-ball",
            "description": "Goal! Timothy Chandler displays great vision and sends a pass to Szabolcs Huszti (Eintracht Frankfurt), who shows brilliant composure inside the box to bury the ball into the top of the net. The score is 1:0."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "There has not been much to choose between the sides after an absorbing 45 minutes. Let's hope they can continue in the same vein in the second period. The visitors dominated that half and looked more dangerous in attack. The home players attempt to beat the opposition's defence using mostly counter attacks. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 48:25",
            "label": "y-card",
            "description": "Marco Fabian (Eintracht Frankfurt) makes a bad challenge and receives a yellow card. The referee had no doubt."
        },
        {
            "gameTime": "1 - 48:10",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:37",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "1 - 44:12",
            "label": "",
            "description": "Jesus Vallejo (Eintracht Frankfurt) commits a foul and Wolfgang Stark immediately signals a free kick."
        },
        {
            "gameTime": "1 - 41:18",
            "label": "corner",
            "description": "Andre Schurrle (Dortmund) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 41:03",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. The ball goes out of play. Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 39:36",
            "label": "corner",
            "description": "The resulting corner from Szabolcs Huszti (Eintracht Frankfurt) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 38:38",
            "label": "",
            "description": "Mijat Gacinovic (Eintracht Frankfurt) fails to find any of his teammates inside the box as his pass is blocked. The linesman points to the corner flag, Eintracht Frankfurt are going to take it."
        },
        {
            "gameTime": "1 - 38:01",
            "label": "",
            "description": "A promising cross into the box is nearly received by the lurking Pierre Emerick Aubameyang (Dortmund), but one of the defending players cuts it out to avert the threat."
        },
        {
            "gameTime": "1 - 36:16",
            "label": "",
            "description": "Szabolcs Huszti (Eintracht Frankfurt) picks up a pass and hits the ball towards the top of the net, but he can't generate enough power to trouble Roman Weidenfeller."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Michael Hector (Eintracht Frankfurt) was quite harsh and Wolfgang Stark didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 33:29",
            "label": "",
            "description": "Adrian Ramos (Dortmund) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 28:46",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) and his stunning dribble! He zig zags through the defence and gets in front of the keeper. He faints to shoot and then suddenly strikes goalwards, but his effort misses the target by a whisker. Very unlucky for Pierre Emerick Aubameyang (Dortmund). This could have been a legendary goal."
        },
        {
            "gameTime": "1 - 26:43",
            "label": "",
            "description": "Andre Schurrle (Dortmund) is caught offside, but it was a really close call."
        },
        {
            "gameTime": "1 - 25:58",
            "label": "",
            "description": "Andre Schurrle swings the cross over. Adrian Ramos (Dortmund) gets his head to it but it goes just wide of the left post."
        },
        {
            "gameTime": "1 - 24:57",
            "label": "",
            "description": "Timothy Chandler (Eintracht Frankfurt) sends a cross into the box, but Roman Weidenfeller comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 24:08",
            "label": "",
            "description": "Eintracht Frankfurt produce a short pass from the free kick."
        },
        {
            "gameTime": "1 - 23:56",
            "label": "",
            "description": "Adrian Ramos (Dortmund) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Wolfgang Stark with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 23:16",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "1 - 19:57",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) almost finds himself in a very promising position, but he is flagged offside by the linesman."
        },
        {
            "gameTime": "1 - 18:37",
            "label": "",
            "description": "Makoto Hasebe (Eintracht Frankfurt) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 18:11",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) stands over the free kick and opts to take it himself, but it is straight at Lukas Hradecky."
        },
        {
            "gameTime": "1 - 17:06",
            "label": "injury",
            "description": "Makoto Hasebe (Eintracht Frankfurt) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "1 - 16:56",
            "label": "",
            "description": "Makoto Hasebe (Eintracht Frankfurt) commits an ugly tackle on his opponent, but there is no caution from the referee. A free kick has been awarded to Dortmund."
        },
        {
            "gameTime": "1 - 16:21",
            "label": "",
            "description": "Lukas Hradecky pulls off a great save to deny Andre Schurrle (Dortmund), who makes himself some space inside the box and unleashes a quick shot to the right side of the goal."
        },
        {
            "gameTime": "1 - 13:57",
            "label": "",
            "description": "Lukas Hradecky gets a well deserved ovation! Andre Schurrle (Dortmund) produces a decent first time strike towards the left post, but the goalkeeper is positioned well to block it. Nice goalkeeping skills."
        },
        {
            "gameTime": "1 - 12:23",
            "label": "",
            "description": "Andre Schurrle (Dortmund) attempts to release Marcel Schmelzer with a through ball, but his effort is thwarted by one of the defending players."
        },
        {
            "gameTime": "1 - 11:25",
            "label": "corner",
            "description": "Mario Gotze (Dortmund) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 11:15",
            "label": "",
            "description": "Adrian Ramos (Dortmund) looks to break free, but an opposing player clears the ball away. The ball is out of play and the linesman points at the corner flag. Corner to Dortmund."
        },
        {
            "gameTime": "1 - 10:29",
            "label": "",
            "description": "Bastian Oczipka (Eintracht Frankfurt) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 09:01",
            "label": "",
            "description": "A cross is whipped into the box by Matthias Ginter (Dortmund) and Pierre Emerick Aubameyang controls it well. He lines up the ball, but one of the defenders produces a timely intervention."
        },
        {
            "gameTime": "1 - 08:42",
            "label": "",
            "description": "Dortmund seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 07:12",
            "label": "",
            "description": "Sokratis (Dortmund) breaks past challenges inside the box, but puts too much pace on his pass to Pierre Emerick Aubameyang."
        },
        {
            "gameTime": "1 - 06:37",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Andre Schurrle (Dortmund)."
        },
        {
            "gameTime": "1 - 06:10",
            "label": "",
            "description": "Andre Schurrle (Dortmund) bursts into the box and pulls the trigger, but he can't beat the goalkeeper. He directed his daisy cutter towards the left post, but one of the defenders reacted brilliantly to block it. The referee and one of his assistants signal for a corner kick to Dortmund."
        },
        {
            "gameTime": "1 - 04:55",
            "label": "",
            "description": "Timothy Chandler (Eintracht Frankfurt) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 02:46",
            "label": "corner",
            "description": "Szabolcs Huszti (Eintracht Frankfurt) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 02:13",
            "label": "",
            "description": "The ball is cleared after Bastian Oczipka (Eintracht Frankfurt) attempted to dribble past an opposing player. Eintracht Frankfurt get a corner."
        },
        {
            "gameTime": "1 - 01:05",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Wolfgang Stark is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "4:1 This was the result of the last match between Dortmund and B. Monchengladbach."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang have rippled the net 15x and is the top scorer for Dortmund this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Eintracht Frankfurt will be looking to keep their unbeaten run of 5 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. The away team was superior on the pitch today. The home team attempted to leave the opposition defence outnumbered and hit them on the break. The visitors tried to keep the ball on the ground and play a passing game."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "26/11/2016 - 17:30",
    "gameHomeTeam": "Eintracht Frankfurt",
    "gameScore": "2 - 1"
}