{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-05-07 - 21-45 AC Milan 1 - 4 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:35",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "substitution",
            "description": "Here comes a substitution. Gustavo Gomez (AC Milan) is brought on as a substitute for Jose Sosa."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "soccer-ball",
            "description": "Daniele De Rossi (AS Roma) takes the penalty and scores! He buries the ball into the bottom the right corner!"
        },
        {
            "gameTime": "2 - 41:52",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "r-card",
            "description": "Gabriel Paletta (AC Milan) earns a red card for his challenge."
        },
        {
            "gameTime": "2 - 40:56",
            "label": "penalty",
            "description": "Gabriel Paletta (AC Milan) commits a rough foul. Nicola Rizzoli stops the game and makes a call. It's a penalty! What an opportunity to score for AS Roma."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "substitution",
            "description": "Luciano Spalletti decides to make a substitution. Edin Dzeko will be replaced by Bruno Peres (AS Roma)."
        },
        {
            "gameTime": "2 - 36:34",
            "label": "corner",
            "description": "Clement Grenier (AS Roma) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 36:15",
            "label": "",
            "description": "Mohamed Salah (AS Roma) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders. The linesman points to the corner flag, AS Roma are going to take it."
        },
        {
            "gameTime": "2 - 32:35",
            "label": "soccer-ball",
            "description": "What a beauty from just outside the box! Stephan El Shaarawy (AS Roma) lashed the ball with incredible pace and power into the top right corner."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "y-card",
            "description": "The referee shows the yellow card to Lucas Ocampos (AC Milan)."
        },
        {
            "gameTime": "2 - 30:38",
            "label": "soccer-ball",
            "description": "Goal! Lucas Ocampos finds Mario Pasalic (AC Milan) with a headed pass and the latter glances a header past the goalkeeper to make it 1:2."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "corner",
            "description": "Suso (AC Milan) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "2 - 26:30",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Clement Grenier (AS Roma) comes onto the pitch for Radja Nainggolan."
        },
        {
            "gameTime": "2 - 25:25",
            "label": "injury",
            "description": "Radja Nainggolan (AS Roma) is down injured and the referee stops play so that he can receive medical treatment."
        },
        {
            "gameTime": "2 - 23:44",
            "label": "substitution",
            "description": "Vincenzo Montella prepares a substitution. Leonel Vangioni is replaced by Lucas Ocampos (AC Milan)."
        },
        {
            "gameTime": "2 - 21:08",
            "label": "",
            "description": "Edin Dzeko (AS Roma) smashes the ball towards goal from the edge of the penalty box, but his effort flies just a few inches wide of the right post."
        },
        {
            "gameTime": "2 - 18:02",
            "label": "y-card",
            "description": "Konstantinos Manolas (AS Roma) gets a yellow card."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "y-card",
            "description": "Andrea Bertolacci (AC Milan) receives a yellow card."
        },
        {
            "gameTime": "2 - 14:31",
            "label": "substitution",
            "description": "Substitution. Diego Perotti did his best and is replaced by Stephan El Shaarawy (AS Roma)."
        },
        {
            "gameTime": "2 - 13:46",
            "label": "y-card",
            "description": "Gianluca Lapadula (AC Milan) is penalised."
        },
        {
            "gameTime": "2 - 08:12",
            "label": "",
            "description": "AC Milan couldn't find the way to score from a long range free kick as Wojciech Szczesny (AS Roma) leaped high and intercepted a cross."
        },
        {
            "gameTime": "2 - 07:45",
            "label": "",
            "description": "Poor challenge! Mohamed Salah (AS Roma) is penalised for tripping and Nicola Rizzoli blows his whistle. AC Milan have a free kick."
        },
        {
            "gameTime": "2 - 06:51",
            "label": "corner",
            "description": "Suso (AC Milan) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 06:39",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) wastes a good opportunity as his pass into the box is blocked by the defence. AC Milan force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 02:52",
            "label": "y-card",
            "description": "Leonel Vangioni (AC Milan) receives a yellow card."
        },
        {
            "gameTime": "2 - 01:25",
            "label": "corner",
            "description": "Jose Sosa (AC Milan) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 01:06",
            "label": "",
            "description": "Andrea Bertolacci (AC Milan) tries to send a pass but it's blocked. AC Milan earn a corner."
        },
        {
            "gameTime": "2 - 00:30",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Vincenzo Montella gives a chance to Andrea Bertolacci (AC Milan) and Matias Fernandez is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:18",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:47",
            "label": "corner",
            "description": "The resulting corner, taken by Leandro Paredes (AS Roma), comes to nothing."
        },
        {
            "gameTime": "1 - 44:34",
            "label": "",
            "description": "Edin Dzeko (AS Roma) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. The ball goes out for a corner. AS Roma can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 44:14",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Leandro Paredes (AS Roma). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 44:01",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. Good work from AS Roma as they win a corner."
        },
        {
            "gameTime": "1 - 41:24",
            "label": "",
            "description": "Suso (AC Milan) commits a rough challenge and Nicola Rizzoli blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 40:40",
            "label": "corner",
            "description": "Gerard Deulofeu (AC Milan) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 40:33",
            "label": "",
            "description": "Gerard Deulofeu (AC Milan) fails to find any of his teammates inside the box as his pass is blocked. The ball is out of play. AC Milan will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 36:24",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Suso (AC Milan)."
        },
        {
            "gameTime": "1 - 36:12",
            "label": "",
            "description": "AC Milan are enjoying possession, but one of the opposition players steps in to end the sequence. AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 35:52",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Leandro Paredes (AS Roma) takes it short."
        },
        {
            "gameTime": "1 - 35:40",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Juan Jesus (AS Roma). AS Roma force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 31:09",
            "label": "corner",
            "description": "Gerard Deulofeu (AC Milan) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "1 - 30:55",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The referee blows his whistle, AC Milan are awarded a corner kick."
        },
        {
            "gameTime": "1 - 27:47",
            "label": "soccer-ball",
            "description": "Edin Dzeko (AS Roma) connects with the ball from the resulting corner and places a powerful header past the stranded goalkeeper and into the roof of the net. The opposing players are staring at each other, unable to understand what happened. Who will take the blame for that one? Edin Dzeko (AS Roma) has a reason to celebrate!"
        },
        {
            "gameTime": "1 - 27:40",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) will take a corner kick."
        },
        {
            "gameTime": "1 - 25:11",
            "label": "",
            "description": "Nicola Rizzoli blows his whistle. Konstantinos Manolas (AS Roma) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 22:41",
            "label": "corner",
            "description": "Gerard Deulofeu (AC Milan) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 22:19",
            "label": "",
            "description": "Suso (AC Milan) had a good opportunity from long range. His shot was directed towards the right side of the goal, but Wojciech Szczesny was alert and made a comfortable save. Corner kick. AC Milan will have an opportunity."
        },
        {
            "gameTime": "1 - 21:02",
            "label": "",
            "description": "Edin Dzeko (AS Roma) wastes a golden opportunity from inside the six yard box after firing the ball a few inches over the crossbar."
        },
        {
            "gameTime": "1 - 17:50",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 17:42",
            "label": "",
            "description": "AS Roma play a few nice passes from player to player, but their possession doesn't last long as an opposition player intercepts a pass. AS Roma get a corner."
        },
        {
            "gameTime": "1 - 16:39",
            "label": "",
            "description": "Diego Perotti (AS Roma) unleashes a superb shot from distance, forcing a beautiful save out of the keeper. His attempt went towards the right side of the target, but Gianluigi Donnarumma leapt like a salmon and punched the ball onto the post and away."
        },
        {
            "gameTime": "1 - 14:38",
            "label": "corner",
            "description": "Gerard Deulofeu (AC Milan) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 14:21",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) blasts the ball from just outside the box, but his attempt is blocked by the defender. The ball goes behind for a corner. AC Milan will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 13:50",
            "label": "",
            "description": "A pass by Edin Dzeko (AS Roma) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 11:28",
            "label": "",
            "description": "Mohamed Salah (AS Roma) finds space on the edge of the box, but his wild shot goes high over the bar."
        },
        {
            "gameTime": "1 - 10:30",
            "label": "corner",
            "description": "Gerard Deulofeu (AC Milan) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 10:22",
            "label": "",
            "description": "Jose Sosa (AC Milan) hammers the ball from far out, but his shot is blocked by an opposition player. The referee points to the corner flag. It's a corner to AC Milan."
        },
        {
            "gameTime": "1 - 09:21",
            "label": "",
            "description": "Edin Dzeko (AS Roma) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Nicola Rizzoli with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 07:41",
            "label": "soccer-ball",
            "description": "Goal 0:1! Edin Dzeko (AS Roma) gets a shot away from the edge of the box and scores into the top right corner. Mohamed Salah provided an assist for the goal."
        },
        {
            "gameTime": "1 - 05:53",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 05:01",
            "label": "injury",
            "description": "Looks like Konstantinos Manolas (AS Roma) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 04:14",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) shows too much aggression while trying to break free from his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and AS Roma will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Nicola Rizzoli."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The AS Roma players have rippled the net at least once in their last 17 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko is the leading goal scorer for AS Roma with 25 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Already 7 AC Milan matches finished 1:0, it's their most frequent result this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "07/05/2017 - 21:45",
    "gameHomeTeam": "AC Milan",
    "gameScore": "1 - 4"
}