{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-08-20 - 19-00 AS Roma 4 - 0 Udinese/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The game wasn't exhilarating, but it wasn't totally boring either. There were a few nice moments from both sides. The home side were superior in this game. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        },
        {
            "gameTime": "2 - 48:05",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 47:21",
            "label": "",
            "description": "A clumsy foul by Bruno Peres (AS Roma) and Marco Di Bello blows his whistle. Udinese are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 46:44",
            "label": "",
            "description": "That's a well taken pass by Adalberto Penaranda (Udinese). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 45:32",
            "label": "",
            "description": "AS Roma seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:10",
            "label": "",
            "description": "Kevin Strootman (AS Roma) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 43:36",
            "label": "",
            "description": "Poor challenge! Adalberto Penaranda (Udinese) is penalised for tripping and Marco Di Bello blows his whistle. A free kick has been awarded to AS Roma."
        },
        {
            "gameTime": "2 - 42:01",
            "label": "",
            "description": "Adalberto Penaranda (Udinese) trips an opponent with a slide tackle. Marco Di Bello stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "2 - 41:32",
            "label": "funfact",
            "description": "25:11 – the total goal attempt statistics."
        },
        {
            "gameTime": "2 - 40:27",
            "label": "",
            "description": "A precise low pass is received by Mohamed Salah (AS Roma), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the left post."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Mohamed Salah (AS Roma) and he fired home from close range. The score is 4:0."
        },
        {
            "gameTime": "2 - 38:10",
            "label": "",
            "description": "Mohamed Salah (AS Roma) picks up a lofted cross inside the box and fires a quick shot to the middle of the goal. His promising effort is kept out by Orestis Karnezis, who pulls off a stunning save!"
        },
        {
            "gameTime": "2 - 36:58",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Radja Nainggolan is the provider as he slips the ball to Edin Dzeko (AS Roma) who simply steers it home from close range. It's 3:0."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "corner",
            "description": "Mohamed Salah (AS Roma) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 36:18",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. AS Roma earn a corner."
        },
        {
            "gameTime": "2 - 35:19",
            "label": "corner",
            "description": "Francesco Lodi (Udinese) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 35:01",
            "label": "",
            "description": "The ball is cleared after Duvan Zapata (Udinese) attempted to dribble past an opposing player. It will be a corner kick for Udinese."
        },
        {
            "gameTime": "2 - 34:35",
            "label": "substitution",
            "description": "Substitution. Konstantinos Manolas makes way for Federico Fazio (AS Roma)."
        },
        {
            "gameTime": "2 - 33:27",
            "label": "substitution",
            "description": "Giuseppe Iachini has decided to introduce fresh legs, with Francesco Lodi (Udinese) replacing Seko Fofana."
        },
        {
            "gameTime": "2 - 32:32",
            "label": "",
            "description": "A pass by Mohamed Salah (AS Roma) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 32:28",
            "label": "",
            "description": "Ali Adnan (Udinese) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "substitution",
            "description": "A substitution has been made. Emerson is replaced by Juan Jesus (AS Roma)."
        },
        {
            "gameTime": "2 - 29:59",
            "label": "soccer-ball",
            "description": "Diego Perotti (AS Roma) sends Orestis Karnezis the wrong way and fires the penalty into the middle of the goal!"
        },
        {
            "gameTime": "2 - 29:57",
            "label": "",
            "description": "Diego Perotti (AS Roma) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 29:56",
            "label": "penalty",
            "description": "Badu (Udinese) trips an opposition player and Marco Di Bello signals a foul. PENALTY to AS Roma!"
        },
        {
            "gameTime": "2 - 28:31",
            "label": "",
            "description": "The players claim that Bruno Peres (AS Roma) handled the ball and it seems they are right. Udinese are awarded a free kick."
        },
        {
            "gameTime": "2 - 27:44",
            "label": "corner",
            "description": "Emil Hallfredsson (Udinese) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 27:03",
            "label": "",
            "description": "Silvan Widmer (Udinese) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. The linesman makes the right call and Udinese will have a corner."
        },
        {
            "gameTime": "2 - 26:06",
            "label": "",
            "description": "Adalberto Penaranda (Udinese) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 25:28",
            "label": "",
            "description": "The AS Roma players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 24:38",
            "label": "",
            "description": "Bruno Peres (AS Roma) fires the ball on goal but sends it into orbit."
        },
        {
            "gameTime": "2 - 23:47",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) wastes a great chance as he climbs high around the penalty spot to connect with a cross from the resulting free kick. He produces a header which goes just wide of the right post."
        },
        {
            "gameTime": "2 - 22:58",
            "label": "",
            "description": "One of the Udinese players unfairly tackled his opponent and conceded a foul. AS Roma earn a free kick."
        },
        {
            "gameTime": "2 - 22:50",
            "label": "substitution",
            "description": "Rodrigo De Paul goes off the pitch and Adalberto Penaranda (Udinese) comes on."
        },
        {
            "gameTime": "2 - 21:00",
            "label": "corner",
            "description": "The ball goes out of play and Udinese have been awarded a corner kick. Wojciech Szczesny leaps to intercept the corner kick from Rodrigo De Paul (Udinese)."
        },
        {
            "gameTime": "2 - 19:36",
            "label": "soccer-ball",
            "description": "Diego Perotti (AS Roma) makes no mistake from the penalty spot after waiting for Orestis Karnezis to move before slotting the ball low into the middle of the goal!"
        },
        {
            "gameTime": "2 - 19:30",
            "label": "",
            "description": "Diego Perotti (AS Roma) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 18:50",
            "label": "y-card",
            "description": "Danilo (Udinese) is punished with the yellow card."
        },
        {
            "gameTime": "2 - 18:32",
            "label": "penalty",
            "description": "Danilo (Udinese) fouls an opponent. At least that's what referee Marco Di Bello signals. AS Roma are awarded a penalty! The opposing players are protesting, but the referee had an easy decision to make."
        },
        {
            "gameTime": "2 - 17:05",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "",
            "description": "Mohamed Salah (AS Roma) makes space inside the box for a shot, but his effort goes just wide of the left post."
        },
        {
            "gameTime": "2 - 15:31",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 14:52",
            "label": "",
            "description": "Mohamed Salah (AS Roma) whips in the resulting set piece but it's cleared. Now AS Roma have a corner."
        },
        {
            "gameTime": "2 - 14:10",
            "label": "",
            "description": "One of the Udinese players tripped an opponent and conceded a foul. That's a free kick to AS Roma."
        },
        {
            "gameTime": "2 - 13:38",
            "label": "",
            "description": "AS Roma control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 11:59",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to make a change. Diego Perotti (AS Roma) replaces Stephan El Shaarawy."
        },
        {
            "gameTime": "2 - 11:50",
            "label": "",
            "description": "Gabriele Angella (Udinese) reacts well and displays good awareness inside the box to get on the end of the resulting corner kick. He fails to direct the ball into the net as it flies narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 11:42",
            "label": "corner",
            "description": "Rodrigo De Paul (Udinese) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 11:36",
            "label": "",
            "description": "Silvan Widmer (Udinese) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. The referee blows his whistle, Udinese are awarded a corner kick."
        },
        {
            "gameTime": "2 - 10:56",
            "label": "",
            "description": "Silvan Widmer (Udinese) is unable to feed an accurate cross into the box. The referee signals a corner kick to Udinese."
        },
        {
            "gameTime": "2 - 10:14",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) swings a cross into the box, but it's far too close to Orestis Karnezis, who smothers the ball."
        },
        {
            "gameTime": "2 - 08:16",
            "label": "",
            "description": "CHANCE! Edin Dzeko (AS Roma) goes very close! He gathers a cross inside the box and fires a low shot to the bottom left corner, but Orestis Karnezis produces an excellent save."
        },
        {
            "gameTime": "2 - 07:58",
            "label": "corner",
            "description": "Mohamed Salah (AS Roma) whips in a cross from the corner, but Orestis Karnezis is well positioned and punches the ball away."
        },
        {
            "gameTime": "2 - 06:40",
            "label": "corner",
            "description": "Mohamed Salah (AS Roma) takes the corner but it's cleared. The referee points to the corner flag. It's a corner to AS Roma."
        },
        {
            "gameTime": "2 - 06:22",
            "label": "substitution",
            "description": "The manager has been forced to make a substitution and the injured Thomas Heurtaux leaves the pitch to be replaced by Gabriele Angella (Udinese)."
        },
        {
            "gameTime": "2 - 05:39",
            "label": "injury",
            "description": "Thomas Heurtaux (Udinese) is writhing in pain and can now receive medical treatment after the referee decides to stop play."
        },
        {
            "gameTime": "2 - 04:53",
            "label": "",
            "description": "Mohamed Salah (AS Roma) tries to send a low pass into the box, but it's blocked and cleared. The ball is out of play. AS Roma will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 04:11",
            "label": "",
            "description": "Good movement by Emerson (AS Roma), but he can't find any of his teammates as the cross is poor. The ball is off of the pitch and it's a goal kick for Udinese."
        },
        {
            "gameTime": "2 - 03:41",
            "label": "y-card",
            "description": "A yellow card for a tackle by Samir (Udinese). Marco Di Bello doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 02:49",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) had a good opportunity when he latched on to a cross from the wing, but his strike wasn't accurate at all and the ball went well over the bar."
        },
        {
            "gameTime": "2 - 01:57",
            "label": "",
            "description": "A pass from Bruno Peres (AS Roma) is intercepted by Orestis Karnezis and the move breaks down."
        },
        {
            "gameTime": "2 - 00:29",
            "label": "",
            "description": "Bruno Peres (AS Roma) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Marco Di Bello starts the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The supporters are far from satisfied with this tedious game. The players will have to try much harder to provide them with worthy entertainment. The home team were mostly in control in the first half. The home side are keeping possession of the ball with some short passes, while the visitors are waiting to open up their defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 46:10",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:55",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) finds some space inside the box and latches on to a brilliant cross, but he wastes his chance as his shot goes way wide of the left post."
        },
        {
            "gameTime": "1 - 45:15",
            "label": "",
            "description": "Bruno Peres (AS Roma) sends a teasing cross into the area, but Orestis Karnezis intercepts the ball."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "",
            "description": "A pass by Ali Adnan (Udinese) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 44:09",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety."
        },
        {
            "gameTime": "1 - 43:01",
            "label": "",
            "description": "Orestis Karnezis makes a superb save to deny a header which was nodded by Edin Dzeko (AS Roma) after a cross from the side."
        },
        {
            "gameTime": "1 - 42:32",
            "label": "corner",
            "description": "Mohamed Salah (AS Roma) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 42:08",
            "label": "",
            "description": "Mohamed Salah (AS Roma) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. The ball goes out for a corner. AS Roma can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 41:34",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) receives a fine cross inside the box and attempts to score a goal, but his shot flies just wide of the right post."
        },
        {
            "gameTime": "1 - 41:02",
            "label": "corner",
            "description": "Mohamed Salah (AS Roma) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 40:38",
            "label": "",
            "description": "Mohamed Salah (AS Roma) looks to break free, but an opposing player clears the ball away. The ball goes behind for a corner. AS Roma will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 40:00",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "",
            "description": "The ball is cleared after Konstantinos Manolas (AS Roma) attempted to dribble past an opposing player. AS Roma have a corner."
        },
        {
            "gameTime": "1 - 38:45",
            "label": "",
            "description": "Leandro Paredes (AS Roma) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "1 - 38:18",
            "label": "",
            "description": "Marco Di Bello blows his whistle after Ali Adnan (Udinese) kicks an opponent's legs instead of the ball. It's a free kick to AS Roma, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 37:17",
            "label": "",
            "description": "Marco Di Bello has a clear sight and sees a foul from Seko Fofana (Udinese)."
        },
        {
            "gameTime": "1 - 36:59",
            "label": "",
            "description": "An attempted cross from Radja Nainggolan (AS Roma) is cleared."
        },
        {
            "gameTime": "1 - 36:26",
            "label": "",
            "description": "Excellent touch by Rodrigo De Paul (Udinese)! He latches on to a precise pass on the edge of the box but miskicks and the ball goes well wide of the right post. Poor effort."
        },
        {
            "gameTime": "1 - 36:06",
            "label": "",
            "description": "Kevin Strootman (AS Roma) and Edin Dzeko attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 34:35",
            "label": "",
            "description": "The linesman raises his flag. Edin Dzeko (AS Roma) is adjudged offside."
        },
        {
            "gameTime": "1 - 34:02",
            "label": "corner",
            "description": "Rodrigo De Paul (Udinese) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 33:47",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Silvan Widmer (Udinese). Corner kick. Udinese will have an opportunity."
        },
        {
            "gameTime": "1 - 32:38",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) attempts to score with a first time shot from the edge of the box. His effort towards the middle of the goal is saved by Orestis Karnezis."
        },
        {
            "gameTime": "1 - 32:23",
            "label": "",
            "description": "Neat passing move from AS Roma in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 31:33",
            "label": "",
            "description": "Samir (Udinese) commits a foul and Marco Di Bello immediately signals a free kick."
        },
        {
            "gameTime": "1 - 30:34",
            "label": "",
            "description": "Edin Dzeko (AS Roma) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the left post."
        },
        {
            "gameTime": "1 - 30:05",
            "label": "",
            "description": "Emerson (AS Roma) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 29:34",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) works the corner short."
        },
        {
            "gameTime": "1 - 29:14",
            "label": "",
            "description": "Emerson (AS Roma) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. The ball is out of play and the linesman points at the corner flag. Corner to AS Roma."
        },
        {
            "gameTime": "1 - 28:26",
            "label": "",
            "description": "Mohamed Salah (AS Roma) is penalised for a foul. Marco Di Bello had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 27:58",
            "label": "",
            "description": "Ali Adnan (Udinese) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 27:27",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball goes well wide of the left post."
        },
        {
            "gameTime": "1 - 26:53",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 26:35",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) shoots from outside the box, but his effort is blocked. The ball is out of play. A goal scoring opportunity from a corner for AS Roma."
        },
        {
            "gameTime": "1 - 26:21",
            "label": "",
            "description": "Kevin Strootman (AS Roma) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 25:40",
            "label": "",
            "description": "The foul by Edin Dzeko (AS Roma) was seen by Marco Di Bello who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 25:18",
            "label": "",
            "description": "Seko Fofana (Udinese) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 24:25",
            "label": "",
            "description": "Silvan Widmer (Udinese) sends the ball into the penalty area from a throw in as if it's a corner kick."
        },
        {
            "gameTime": "1 - 24:14",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 23:01",
            "label": "",
            "description": "A cross is clipped into the penalty area by Mohamed Salah (AS Roma) but poses no threat. The ball goes out of play and Udinese will have a goal kick."
        },
        {
            "gameTime": "1 - 22:33",
            "label": "",
            "description": "The linesman raises his flag for offside before Duvan Zapata (Udinese) heads on."
        },
        {
            "gameTime": "1 - 22:14",
            "label": "",
            "description": "Silvan Widmer (Udinese) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "1 - 21:11",
            "label": "",
            "description": "Bruno Peres (AS Roma) probably spotted the goalkeeper off his line, but he misdirected his long range shot as it went a few yards wide of the right post."
        },
        {
            "gameTime": "1 - 20:29",
            "label": "",
            "description": "Silvan Widmer (Udinese) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 19:46",
            "label": "",
            "description": "Edin Dzeko (AS Roma) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety."
        },
        {
            "gameTime": "1 - 18:30",
            "label": "",
            "description": "Ali Adnan (Udinese) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 17:52",
            "label": "",
            "description": "Duvan Zapata (Udinese) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 17:10",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) brings his opponent down with a tackle and Marco Di Bello blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 15:05",
            "label": "",
            "description": "Edin Dzeko (AS Roma) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies just over the crossbar."
        },
        {
            "gameTime": "1 - 13:40",
            "label": "corner",
            "description": "Emerson (AS Roma) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 13:02",
            "label": "",
            "description": "Edin Dzeko (AS Roma) sends a lofted cross into the box which is headed clear. Good work from AS Roma as they win a corner."
        },
        {
            "gameTime": "1 - 12:32",
            "label": "",
            "description": "Emil Hallfredsson (Udinese) brings his opponent down. Marco Di Bello has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 11:52",
            "label": "",
            "description": "Mohamed Salah (AS Roma) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 10:59",
            "label": "",
            "description": "A cross by Mohamed Salah (AS Roma) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor. The ball is off of the pitch and it's a goal kick for Udinese."
        },
        {
            "gameTime": "1 - 09:47",
            "label": "",
            "description": "Bruno Peres (AS Roma) takes the ball on and fires in a shot from 25 metres out. Orestis Karnezis stops the effort which is headed to the left post."
        },
        {
            "gameTime": "1 - 09:32",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "1 - 08:20",
            "label": "",
            "description": "Mohamed Salah (AS Roma) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance."
        },
        {
            "gameTime": "1 - 07:44",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 06:43",
            "label": "",
            "description": "Bruno Peres (AS Roma) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 04:41",
            "label": "",
            "description": "Bruno Peres (AS Roma) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 03:21",
            "label": "",
            "description": "A pass by Stephan El Shaarawy (AS Roma) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 02:35",
            "label": "",
            "description": "Rodrigo De Paul (Udinese) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 01:54",
            "label": "",
            "description": "Seko Fofana (Udinese) was trying to get to the ball but clattered into the legs of the opponent as well. Marco Di Bello blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 01:23",
            "label": "",
            "description": "AS Roma enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Udinese will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Marco Di Bello."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "is the latest signing for Udinese."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma have completed a big transfer by signing ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The game wasn't exhilarating, but it wasn't totally boring either. There were a few nice moments from both sides. The home side were superior in this game. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        }
    ],
    "gameAwayTeam": "Udinese",
    "gameDate": "20/08/2016 - 19:00",
    "gameHomeTeam": "AS Roma",
    "gameScore": "4 - 0"
}