{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-12-05 - 20-30 Chelsea 0 - 1 Bournemouth/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "It was an entertaining 90 minutes of football. Both sides had good opportunities. There wasn't any significant dominance by either side in this game. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 49:31",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 48:15",
            "label": "",
            "description": "Diego Costa (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 47:28",
            "label": "corner",
            "description": "Matt Ritchie (Bournemouth) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 47:11",
            "label": "",
            "description": "Matt Ritchie (Bournemouth) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. The ball is out of play and the linesman points at the corner flag. Corner to Bournemouth."
        },
        {
            "gameTime": "2 - 45:05",
            "label": "",
            "description": "Bertrand Traore (Chelsea) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:24",
            "label": "",
            "description": "Simon Francis (Bournemouth) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "2 - 43:43",
            "label": "",
            "description": "Adam Smith (Bournemouth) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 41:19",
            "label": "corner",
            "description": "Chelsea have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "2 - 40:56",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball goes behind for a corner. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 39:02",
            "label": "",
            "description": "Matt Ritchie (Bournemouth) picks up a pass and fires a powerful long range shot which goes painfully close to the left post."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "substitution",
            "description": "Jose Mourinho has decided to substitute Cesc Fabregas and he is replaced by Loic Remy (Chelsea)."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "substitution",
            "description": "Here's the change. Abdul Baba Rahman leaves the pitch and Bertrand Traore (Chelsea) comes on as a substitute."
        },
        {
            "gameTime": "2 - 36:59",
            "label": "soccer-ball",
            "description": "Glenn Murray (Bournemouth) finds some space inside the box and powers his header past the goalkeeper, giving him no chance."
        },
        {
            "gameTime": "2 - 36:13",
            "label": "corner",
            "description": "Junior Stanislas (Bournemouth) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 36:12",
            "label": "",
            "description": "Dan Gosling (Bournemouth) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Good work from Bournemouth as they win a corner."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "substitution",
            "description": "That will be all from Joshua King who is being replaced by the fresh legs of Glenn Murray (Bournemouth)."
        },
        {
            "gameTime": "2 - 32:40",
            "label": "corner",
            "description": "Willian (Chelsea) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "",
            "description": "Artur Boruc earns applause from the crowd! He dives superbly to deny a dangerous first time effort from the edge of the six yard box. Diego Costa (Chelsea) was the player who tested the keeper's reflexes. Nice goalkeeping skills. The ball goes out of play and Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:32",
            "label": "",
            "description": "Pedro (Chelsea) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender."
        },
        {
            "gameTime": "2 - 30:01",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 29:24",
            "label": "",
            "description": "Harry Arter (Bournemouth) knocks his opponent down with an over the top tackle."
        },
        {
            "gameTime": "2 - 28:06",
            "label": "injury",
            "description": "The game is interrupted now, Junior Stanislas (Bournemouth) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 27:26",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "2 - 25:13",
            "label": "",
            "description": "Joshua King (Bournemouth) gets on the ball and beats an opponent, but his run is stopped by the referee Mike Jones who sees an offensive foul."
        },
        {
            "gameTime": "2 - 22:10",
            "label": "corner",
            "description": "The resulting corner from Cesc Fabregas (Chelsea) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 21:58",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) flights in the cross, but the defender is alert and clears to safety. Chelsea have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 21:19",
            "label": "",
            "description": "Matt Ritchie (Bournemouth) commits a rough foul. Mike Jones stops the game and makes a call."
        },
        {
            "gameTime": "2 - 19:53",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner kick, but Artur Boruc reads it well and stops the effort."
        },
        {
            "gameTime": "2 - 19:31",
            "label": "",
            "description": "Nemanja Matic (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee blows his whistle, Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 18:52",
            "label": "",
            "description": "Charlie Daniels (Bournemouth) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 17:51",
            "label": "y-card",
            "description": "Diego Costa (Chelsea) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Mike Jones ignores the protests."
        },
        {
            "gameTime": "2 - 16:55",
            "label": "",
            "description": "Diego Costa (Chelsea) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 14:35",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) sends a long ball in, but Artur Boruc comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 13:01",
            "label": "",
            "description": "Pedro (Chelsea) attempts to find Kurt Zouma, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "2 - 12:19",
            "label": "corner",
            "description": "Willian (Chelsea) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 12:03",
            "label": "",
            "description": "Eden Hazard (Chelsea) serves up a nice cross, but the defence clears the danger. The ball goes out for a corner. Chelsea can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "",
            "description": "This was a piece of cake for Artur Boruc. Branislav Ivanovic (Chelsea) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 10:34",
            "label": "corner",
            "description": "Willian (Chelsea) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 10:19",
            "label": "",
            "description": "Diego Costa (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Chelsea force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 09:04",
            "label": "",
            "description": "Nemanja Matic (Chelsea) blows a huge opportunity! He latches on to a perfect cross from the wing into the penalty area, but sends a bullet header narrowly over the crossbar!"
        },
        {
            "gameTime": "2 - 08:39",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 07:40",
            "label": "",
            "description": "Pedro (Chelsea) produces a dangerous lofted cross into the box which is intercepted. The referee and one of his assistants signal for a corner kick to Chelsea."
        },
        {
            "gameTime": "2 - 06:00",
            "label": "",
            "description": "Willian (Chelsea) strikes a shot towards goal from the edge of the penalty box, but it flies just wide of the left post."
        },
        {
            "gameTime": "2 - 02:47",
            "label": "corner",
            "description": "Artur Boruc comes off his line to intercept the corner from Willian (Chelsea)."
        },
        {
            "gameTime": "2 - 02:26",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. Now Chelsea have a corner."
        },
        {
            "gameTime": "2 - 01:23",
            "label": "",
            "description": "Matt Ritchie (Bournemouth) smashes the ball towards goal from the edge of the penalty box, but his effort flies just a few inches wide of the right post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Jose Mourinho has decided to make a substitution during the half time break. Diego Costa (Chelsea) comes on the pitch for Oscar."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "The fans can't complain about what they have been seeing so far on the pitch as both sides are playing highly attractive football. Neither side has gained the upper hand as yet. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 48:01",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 46:20",
            "label": "",
            "description": "Pedro (Chelsea) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 45:52",
            "label": "",
            "description": "Junior Stanislas (Bournemouth) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:03",
            "label": "",
            "description": "Joshua King (Bournemouth) is able to continue to play."
        },
        {
            "gameTime": "1 - 43:22",
            "label": "injury",
            "description": "Joshua King (Bournemouth) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 42:48",
            "label": "",
            "description": "Oscar (Chelsea) receives a precise pass and is given time inside the box to send a promising strike towards the left post. Artur Boruc guesses his intentions and denies him with a fine save."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "",
            "description": "Oscar (Chelsea) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 40:35",
            "label": "corner",
            "description": "Pedro (Chelsea) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 40:06",
            "label": "",
            "description": "Pedro (Chelsea) has a good chance to score with a mid range attempt after collecting a pass. He aims for the right side of the goal, but he can't generate enough power to trouble Artur Boruc. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 39:15",
            "label": "",
            "description": "That's a well taken pass by Joshua King (Bournemouth). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "1 - 38:40",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) commits a rough challenge and Mike Jones blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 36:30",
            "label": "",
            "description": "Willian (Chelsea) sends a lofted pass into the penalty area from a free kick, but the opposition's defence manages to control all the attacking players and thwart the threat."
        },
        {
            "gameTime": "1 - 35:38",
            "label": "",
            "description": "Half chance! Joshua King (Bournemouth) plays a pass into the box, but Thibaut Courtois reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 34:26",
            "label": "",
            "description": "Eden Hazard (Chelsea) dribbled past his opponents before finding himself in a great position to strike. His attempt from just outside of the box went towards the right side of the goal, but it wasn't dangerous and Artur Boruc made a comfortable save."
        },
        {
            "gameTime": "1 - 32:47",
            "label": "",
            "description": "Good touch by Nemanja Matic (Chelsea) as he receives a great pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, the effort misses the net and flies well wide to the right."
        },
        {
            "gameTime": "1 - 30:57",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Adam Smith (Bournemouth)."
        },
        {
            "gameTime": "1 - 29:41",
            "label": "corner",
            "description": "Matt Ritchie (Bournemouth) takes a short corner kick."
        },
        {
            "gameTime": "1 - 28:59",
            "label": "",
            "description": "Dan Gosling (Bournemouth) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders. Bournemouth have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 28:34",
            "label": "",
            "description": "Junior Stanislas (Bournemouth) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 26:51",
            "label": "corner",
            "description": "Willian (Chelsea) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 26:39",
            "label": "",
            "description": "Willian (Chelsea) sends a pass into the box, but his attempt is thwarted and cleared. Chelsea earn a corner."
        },
        {
            "gameTime": "1 - 22:28",
            "label": "y-card",
            "description": "Mike Jones shows the yellow card to Andrew Surman (Bournemouth) for a heavy challenge."
        },
        {
            "gameTime": "1 - 21:00",
            "label": "y-card",
            "description": "Mike Jones has issued a yellow card to Pedro (Chelsea)."
        },
        {
            "gameTime": "1 - 18:37",
            "label": "",
            "description": "Eden Hazard (Chelsea) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "1 - 18:11",
            "label": "",
            "description": "The ball is cleared after Adam Smith (Bournemouth) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 17:01",
            "label": "",
            "description": "Gary Cahill (Chelsea) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 15:46",
            "label": "injury",
            "description": "Gary Cahill (Chelsea) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 14:52",
            "label": "corner",
            "description": "Matt Ritchie (Bournemouth) swings in a cross from the corner, but Thibaut Courtois reads it well and gathers the ball."
        },
        {
            "gameTime": "1 - 14:37",
            "label": "",
            "description": "Joshua King (Bournemouth) picks up a precise pass deep inside the box, but his strike is saved by the keeper. Corner kick. Bournemouth will have an opportunity."
        },
        {
            "gameTime": "1 - 13:58",
            "label": "",
            "description": "Poor challenge! Pedro (Chelsea) is penalised for tripping and Mike Jones blows his whistle."
        },
        {
            "gameTime": "1 - 11:56",
            "label": "",
            "description": "Joshua King (Bournemouth) has a shot blocked from inside the box."
        },
        {
            "gameTime": "1 - 11:55",
            "label": "",
            "description": "What a wasted opportunity by Junior Stanislas (Bournemouth)! He creates some space for himself inside the penalty box and unleashes a decent strike towards the middle of the net, but Thibaut Courtois makes a comfortable save to thwart him."
        },
        {
            "gameTime": "1 - 09:49",
            "label": "",
            "description": "Junior Stanislas (Bournemouth) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 08:05",
            "label": "",
            "description": "Mike Jones blows his whistle and signals a foul after Oscar (Chelsea) brought his opponent down."
        },
        {
            "gameTime": "1 - 07:24",
            "label": "",
            "description": "Eden Hazard (Chelsea) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 06:23",
            "label": "",
            "description": "Junior Stanislas (Bournemouth) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "1 - 05:59",
            "label": "",
            "description": "Willian (Chelsea) sends a teasing cross into the area, but Artur Boruc intercepts the ball."
        },
        {
            "gameTime": "1 - 05:37",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 05:15",
            "label": "",
            "description": "Willian (Chelsea) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. The linesman points to the corner flag, Chelsea are going to take it."
        },
        {
            "gameTime": "1 - 04:12",
            "label": "",
            "description": "Junior Stanislas (Bournemouth) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 02:58",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 01:38",
            "label": "",
            "description": "Eden Hazard (Chelsea) receives a great pass inside the box and misses a golden chance. The goalkeeper pulls off a stunning save."
        },
        {
            "gameTime": "1 - 00:10",
            "label": "",
            "description": "The players are on the pitch and Chelsea will have the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Mike Jones."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an entertaining 90 minutes of football. Both sides had good opportunities. There wasn't any significant dominance by either side in this game. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Bournemouth",
    "gameDate": "05/12/2015 - 20:30",
    "gameHomeTeam": "Chelsea",
    "gameScore": "0 - 1"
}