{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-04 - 22-45 Bayern Munich 5 - 1 Arsenal/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Bayern Munich were dominant and more threatening of the two sides. It was a fairly one sided match. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        },
        {
            "gameTime": "2 - 48:00",
            "label": "whistle",
            "description": "Gianluca Rocchi is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:36",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) races towards goal but the defender gets back well to make a challenge. The linesman signals a throw in for Bayern Munich."
        },
        {
            "gameTime": "2 - 45:50",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:59",
            "label": "soccer-ball",
            "description": "Goal 5:1! Thomas Muller (Bayern Munich) gets a shot away from the edge of the box and scores into the bottom right corner. Douglas Costa provided an assist for the goal."
        },
        {
            "gameTime": "2 - 43:15",
            "label": "",
            "description": "Mathieu Debuchy (Arsenal) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 41:37",
            "label": "substitution",
            "description": "Here is a change. Santi Cazorla is going off and Arsene Wenger gives the last tactical orders to Calum Chambers (Arsenal)."
        },
        {
            "gameTime": "2 - 40:31",
            "label": "",
            "description": "Bayern Munich are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "",
            "description": "Mesut Ozil (Arsenal) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 39:29",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Alex Iwobi (Arsenal) for Olivier Giroud."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Douglas Costa (Bayern Munich) takes it short."
        },
        {
            "gameTime": "2 - 38:33",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) bursts into the box and latches on to a pin point long through ball, but one of the defenders steps in to clear the ball to safety. Bayern Munich force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 37:23",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 36:56",
            "label": "",
            "description": "Neat passing move from Bayern Munich in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 35:35",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) meets a cross inside the box, but his header is blocked by an opposing player."
        },
        {
            "gameTime": "2 - 33:43",
            "label": "corner",
            "description": "The resulting corner, taken by Mesut Ozil (Arsenal), comes to nothing."
        },
        {
            "gameTime": "2 - 33:30",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee points to the corner flag and Arsenal will take a corner."
        },
        {
            "gameTime": "2 - 31:59",
            "label": "",
            "description": "Francis Coquelin sprays a pass out to Santi Cazorla (Arsenal), but he produces a poor effort from inside the box which goes high over the bar."
        },
        {
            "gameTime": "2 - 31:25",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "2 - 30:28",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "2 - 29:42",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) is caught offside!"
        },
        {
            "gameTime": "2 - 29:13",
            "label": "funfact",
            "description": "The percentage of ball possession is – 66:34."
        },
        {
            "gameTime": "2 - 28:54",
            "label": "",
            "description": "Bayern Munich enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 27:51",
            "label": "corner",
            "description": "Arjen Robben (Bayern Munich) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 27:33",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) takes a wonderful touch after collecting a pass inside the box. He steers his shot goalwards, but the keeper produces a decent save! The ball is out of play. Bayern Munich win a corner kick."
        },
        {
            "gameTime": "2 - 26:50",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 25:41",
            "label": "substitution",
            "description": "Today's match ends for Robert Lewandowski who will be replaced by Arturo Vidal (Bayern Munich)."
        },
        {
            "gameTime": "2 - 25:02",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 23:52",
            "label": "soccer-ball",
            "description": "It's a goal! Olivier Giroud (Arsenal) scores with a brilliant shot into the middle of the goal after being released inside the box by a superb lofted pass from Alexis Sanchez. The score is now 3:0."
        },
        {
            "gameTime": "2 - 23:30",
            "label": "",
            "description": "Mathieu Debuchy (Arsenal) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "2 - 22:55",
            "label": "corner",
            "description": "Bayern Munich take a short corner kick."
        },
        {
            "gameTime": "2 - 22:43",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Mehdi Benatia (Bayern Munich) is coming onto the pitch as Jerome Boateng cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 22:17",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The ball is out of play. A goal scoring opportunity from a corner for Bayern Munich."
        },
        {
            "gameTime": "2 - 21:53",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) and Arjen Robben matched up again to find some space for an unmarked teammate."
        },
        {
            "gameTime": "2 - 20:08",
            "label": "",
            "description": "Mesut Ozil (Arsenal) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 19:23",
            "label": "",
            "description": "Mesut Ozil (Arsenal) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 19:09",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation. Arsenal are awarded the free kick."
        },
        {
            "gameTime": "2 - 18:42",
            "label": "",
            "description": "Gianluca Rocchi blows his whistle. Thomas Muller (Bayern Munich) commits a foul after dangerous play."
        },
        {
            "gameTime": "2 - 17:28",
            "label": "",
            "description": "Olivier Giroud (Arsenal) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 15:15",
            "label": "funfact",
            "description": "The current number of shots on goal is 13:2."
        },
        {
            "gameTime": "2 - 14:02",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Bayern Munich."
        },
        {
            "gameTime": "2 - 13:15",
            "label": "substitution",
            "description": "Arsene Wenger prepares a substitution. Joel Campbell is replaced by Kieran Gibbs (Arsenal)."
        },
        {
            "gameTime": "2 - 11:55",
            "label": "",
            "description": "Santi Cazorla (Arsenal) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Manuel Neuer guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 09:55",
            "label": "soccer-ball",
            "description": "Goal! Arjen Robben (Bayern Munich) finds himself some space inside the box to get on the end of a pass from David Alaba, then sends the ball into the roof of the net. 4:0."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Kingsley Coman will be replaced by Arjen Robben (Bayern Munich)."
        },
        {
            "gameTime": "2 - 08:54",
            "label": "",
            "description": "Olivier Giroud (Arsenal) gives away a foul for a clumsy challenge. Referee Gianluca Rocchi saw the whole situation."
        },
        {
            "gameTime": "2 - 07:34",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 07:14",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 06:52",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) goes on a mazy run and tries his luck with a mid range strike, but one of the defending players steps in and makes a block. The ball goes out of play. Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "2 - 06:27",
            "label": "",
            "description": "The Arsenal players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 04:45",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "2 - 04:22",
            "label": "",
            "description": "Olivier Giroud (Arsenal) and Alexis Sanchez combine well with a quick one two and their attacking move continues."
        },
        {
            "gameTime": "2 - 03:02",
            "label": "",
            "description": "The Bayern Munich players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession."
        },
        {
            "gameTime": "2 - 02:05",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 01:46",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) tries to send a pass but it's blocked. The ball goes out of play. Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:22",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Xabi Alonso (Bayern Munich). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. It was a fairly one sided opening 45 minutes, with Bayern Munich much the better side better so far. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 46:02",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:42",
            "label": "soccer-ball",
            "description": "David Alaba (Bayern Munich) scores a splendid goal as he finishes his great individual effort with a venomous shot from around 18 metres out into the top right corner. Take a bow son. The score is now 3:0."
        },
        {
            "gameTime": "1 - 42:39",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Xabi Alonso (Bayern Munich)."
        },
        {
            "gameTime": "1 - 42:04",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) is the one to unleash a good effort towards the roof of the net. His shot, however, is saved by the goalkeeper. What a save! The ball goes behind for a corner. Bayern Munich will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 42:03",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 41:23",
            "label": "",
            "description": "Mathieu Debuchy (Arsenal) commits a foul and Gianluca Rocchi immediately signals a free kick."
        },
        {
            "gameTime": "1 - 40:18",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Petr Cech guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 39:33",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "1 - 37:57",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) hammers the ball towards goal from long range, but one of the defenders reacts brilliantly to block the shot."
        },
        {
            "gameTime": "1 - 37:28",
            "label": "",
            "description": "Bayern Munich slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "1 - 35:55",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 35:32",
            "label": "",
            "description": "The ball is cleared after Robert Lewandowski (Bayern Munich) attempted to dribble past an opposing player. Bayern Munich earn a corner."
        },
        {
            "gameTime": "1 - 34:39",
            "label": "",
            "description": "David Alaba (Bayern Munich) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The ball is out of play. Bayern Munich will take a throw in."
        },
        {
            "gameTime": "1 - 34:10",
            "label": "",
            "description": "The Bayern Munich players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 33:08",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 32:50",
            "label": "",
            "description": "A lofted cross from David Alaba (Bayern Munich) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 31:28",
            "label": "",
            "description": "CLOSE! Douglas Costa (Bayern Munich) shows off his amazing skills with a solo run to the edge of the box before fashioning a shot that goes inches wide of the left post!"
        },
        {
            "gameTime": "1 - 28:42",
            "label": "soccer-ball",
            "description": "Goal! Thomas Muller (Bayern Munich) picks up the ball inside the box, finds himself in a good position and fires in a shot which is deflected past Petr Cech. He makes it 2:0."
        },
        {
            "gameTime": "1 - 28:40",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) has a shot blocked from inside the box."
        },
        {
            "gameTime": "1 - 26:46",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Mesut Ozil (Arsenal). Bayern Munich have been awarded a free kick. The free kick is taken short by Bayern Munich."
        },
        {
            "gameTime": "1 - 26:20",
            "label": "",
            "description": "Arsenal keep the ball well and push forward with purpose, but here comes an interception from the opposition."
        },
        {
            "gameTime": "1 - 24:53",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 23:53",
            "label": "y-card",
            "description": "The foul by Joel Campbell (Arsenal) is worthy of a card and a yellow is duly shown by Gianluca Rocchi. There is a free kick near the sideline to Bayern Munich."
        },
        {
            "gameTime": "1 - 22:07",
            "label": "",
            "description": "A brilliant through ball from Douglas Costa (Bayern Munich) as he picks out Philipp Lahm, who darted into free space to take the pass. Philipp Lahm (Bayern Munich) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "1 - 21:10",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 20:34",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 19:49",
            "label": "",
            "description": "A pass into the penalty area from Philipp Lahm (Bayern Munich) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 19:09",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) plays a through ball but overhits it. The ball is behind the touchline and Arsenal will take a throw in."
        },
        {
            "gameTime": "1 - 17:46",
            "label": "",
            "description": "Flag goes up against Thiago Alcantara (Bayern Munich) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 17:33",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) works the corner short."
        },
        {
            "gameTime": "1 - 17:18",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) fails to send a pass into the box as his effort is cut out. The referee blows his whistle, Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:30",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 15:47",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) blows a good opportunity. He has a lot of space around him and fires a terrific shot from the edge of the box towards the right side of the goal, but the goalkeeper makes a brilliant save and stops this one! The referee signals a corner kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 14:57",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) picks up a pass on the edge of the box and manages to get a powerful shot away, forcing the goalkeeper to scramble to his left and palm the ball away."
        },
        {
            "gameTime": "1 - 14:41",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 13:38",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 10:59",
            "label": "y-card",
            "description": "Mesut Ozil (Arsenal) kept talking out of turn to the referee until Gianluca Rocchi lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "1 - 10:58",
            "label": "",
            "description": "Goal, no wait. Gianluca Rocchi blows his whistle for handball and Mesut Ozil (Arsenal) can't celebrate. Disallowed goal."
        },
        {
            "gameTime": "1 - 09:53",
            "label": "soccer-ball",
            "description": "Thiago Alcantara launches a beautiful lofted cross into the box, where Robert Lewandowski (Bayern Munich) rises high to head the ball into the right side of the goal and beyond the goalkeeper. 1:0."
        },
        {
            "gameTime": "1 - 08:50",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) attempts to surprise the keeper with a nice shot, but it lacks accuracy and goes well wide of the right post."
        },
        {
            "gameTime": "1 - 07:16",
            "label": "",
            "description": "Arsenal players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 06:31",
            "label": "",
            "description": "David Alaba (Bayern Munich) tries his luck with a low long range effort after receiving a precise pass, but Petr Cech has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 05:07",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) sends a cross in and finds Robert Lewandowski inside the box, but one of the defenders steps in and clears the danger."
        },
        {
            "gameTime": "1 - 04:25",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) sends a teasing cross into the area, but Petr Cech intercepts the ball."
        },
        {
            "gameTime": "1 - 03:56",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Joel Campbell (Arsenal) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "",
            "description": "Bayern Munich seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 02:19",
            "label": "",
            "description": "Olivier Giroud (Arsenal) is unable to feed a through ball into the path of his teammates."
        },
        {
            "gameTime": "1 - 01:12",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) races towards goal but the defender gets back well to make a challenge. The referee and the linesman both signal a throw in for Arsenal."
        },
        {
            "gameTime": "1 - 00:27",
            "label": "",
            "description": "Olivier Giroud (Arsenal) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the left post."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Arsenal will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Gianluca Rocchi."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Bayern Munich were dominant and more threatening of the two sides. It was a fairly one sided match. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        }
    ],
    "gameAwayTeam": "Arsenal",
    "gameDate": "04/11/2015 - 22:45",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "5 - 1"
}