{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-02-25 - 22-45 Arsenal 1 - 3 Monaco/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. There wasn't any evident superiority by either side today. The home side attempted to create scoring opportunities mostly with long balls, while the opposition focused on counter attacks to breach the home side's defences."
        },
        {
            "gameTime": "2 - 49:47",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 48:43",
            "label": "soccer-ball",
            "description": "Yannick Carrasco (Monaco) finishes his beautiful individual effort with a superb strike from inside the box. David Ospina is just a bystander as the ball flies off the post into the bottom left corner. The score is 1:3."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "",
            "description": "Yannick Carrasco (Monaco) stands over the free kick and opts to take it himself, sending it towards the right post only for David Ospina to dive and make a save."
        },
        {
            "gameTime": "2 - 46:55",
            "label": "",
            "description": "Tomas Rosicky (Arsenal) gives away a foul for a clumsy challenge. Referee Deniz Aytekin saw the whole situation. Free kick. Monaco will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 46:26",
            "label": "y-card",
            "description": "Joao Moutinho (Monaco) is punished with a yellow card for violating the rules."
        },
        {
            "gameTime": "2 - 45:32",
            "label": "soccer-ball",
            "description": "The ball rebounds and arrives at the feet of Alex Oxlade Chamberlain (Arsenal) just outside the box. He doesn't think twice and fires a brilliant shot inside the right post. His attempt was beyond the reach of Danijel Subasic, so the score changes to 0:2."
        },
        {
            "gameTime": "2 - 45:28",
            "label": "",
            "description": "An attempted cross from Laurent Koscielny (Arsenal) is cleared."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Alexis Sanchez (Arsenal) takes it short."
        },
        {
            "gameTime": "2 - 44:49",
            "label": "corner",
            "description": "Alexis Sanchez (Arsenal) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety. Now Arsenal have a corner."
        },
        {
            "gameTime": "2 - 44:40",
            "label": "",
            "description": "Mesut Ozil (Arsenal) fails to find any of his teammates inside the box as his pass is blocked. The linesman points to the corner flag, Arsenal are going to take it."
        },
        {
            "gameTime": "2 - 43:55",
            "label": "",
            "description": "Yannick Carrasco (Monaco) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but David Ospina is alert and denies him."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "funfact",
            "description": "Here's the latest number of offsides – 0:5."
        },
        {
            "gameTime": "2 - 41:41",
            "label": "y-card",
            "description": "The referee Deniz Aytekin awards Mesut Ozil (Arsenal) a yellow card."
        },
        {
            "gameTime": "2 - 40:25",
            "label": "corner",
            "description": "A dangerous looking corner kick from Mesut Ozil (Arsenal) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 40:07",
            "label": "",
            "description": "Theo Walcott (Arsenal) sends a low pass from outside the box to Santi Cazorla. He lines up a shot, but the defence intercepts at the last moment. Arsenal force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 38:54",
            "label": "substitution",
            "description": "Anthony Martial comes off the pitch to be replaced by Bernardo Silva (Monaco)."
        },
        {
            "gameTime": "2 - 36:55",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) meets a fine cross on the edge of the box from the resulting corner kick and shoots. His shot flies just wide of the left post."
        },
        {
            "gameTime": "2 - 36:40",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 36:38",
            "label": "substitution",
            "description": "Here is a change. Nabil Dirar is going off and Leonardo Jardim gives the last tactical orders to Layvin Kurzawa (Monaco)."
        },
        {
            "gameTime": "2 - 36:04",
            "label": "substitution",
            "description": "Today's match ends for Santi Cazorla who will be replaced by Tomas Rosicky (Arsenal)."
        },
        {
            "gameTime": "2 - 35:16",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) and Santi Cazorla attempt to exchange short two yard passes, but the opposition's defence intercepts the ball. The referee points to the corner flag and Arsenal will take a corner."
        },
        {
            "gameTime": "2 - 33:07",
            "label": "",
            "description": "Monaco are happy to keep the ball as they wait for gaps in defence to open up. However, an opposing player steps in and clears."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "attendance",
            "description": "The attendance is 59868."
        },
        {
            "gameTime": "2 - 31:57",
            "label": "",
            "description": "Anthony Martial (Monaco) tested David Ospina with a strike from just outside the box, but the effort is saved."
        },
        {
            "gameTime": "2 - 30:06",
            "label": "substitution",
            "description": "We are about to witness a substitution. Yannick Carrasco (Monaco) is replacing Dimitar Berbatov."
        },
        {
            "gameTime": "2 - 29:09",
            "label": "",
            "description": "Theo Walcott (Arsenal) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is off of the pitch and it's a goal kick for Monaco."
        },
        {
            "gameTime": "2 - 28:19",
            "label": "y-card",
            "description": "A yellow card for a tackle by Hector Bellerin (Arsenal). Deniz Aytekin doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 28:02",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "2 - 26:51",
            "label": "",
            "description": "Arsenal control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "",
            "description": "Santi Cazorla (Arsenal) sees the run of Theo Walcott and tries to slip the ball to him, but Danijel Subasic sees the danger and gathers."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "substitution",
            "description": "A substitution has been made. Francis Coquelin is replaced by Alex Oxlade Chamberlain (Arsenal)."
        },
        {
            "gameTime": "2 - 21:52",
            "label": "",
            "description": "Hector Bellerin (Arsenal) was too forceful with his tackle and Deniz Aytekin interrupted the game to signal a free kick. A free kick is awarded to Monaco."
        },
        {
            "gameTime": "2 - 18:58",
            "label": "",
            "description": "Danny Welbeck (Arsenal) gets a shot in from close range, but it's unluckily blocked by one of his teammates."
        },
        {
            "gameTime": "2 - 18:52",
            "label": "",
            "description": "Theo Walcott (Arsenal) makes contact with a cross and strikes a shot that lacks the power to find the back of the net, but the goalkeeper still has to make a good save to keep his effort out."
        },
        {
            "gameTime": "2 - 18:24",
            "label": "",
            "description": "Nabil Dirar (Monaco) attempts to find Dimitar Berbatov with a delicate little through ball from inside the box, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "2 - 17:20",
            "label": "",
            "description": "Deniz Aytekin blows the whistle, Nabil Dirar (Monaco) is penalised for a foul. Arsenal try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "2 - 16:35",
            "label": "",
            "description": "Joao Moutinho (Monaco) latches on to an accurate pass on the edge of the box and immediately unleashes a shot which is wide of the mark."
        },
        {
            "gameTime": "2 - 16:19",
            "label": "corner",
            "description": "Joao Moutinho (Monaco) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 15:39",
            "label": "",
            "description": "Anthony Martial (Monaco) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at David Ospina. The ball is out of play. Monaco will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 14:35",
            "label": "substitution",
            "description": "Here comes a substitution. Olivier Giroud (Arsenal) has had enough and is replaced by Theo Walcott (Arsenal)."
        },
        {
            "gameTime": "2 - 14:15",
            "label": "",
            "description": "Wallace (Monaco) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 12:51",
            "label": "injury",
            "description": "The game is interrupted now, Wallace (Monaco) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 12:45",
            "label": "",
            "description": "Danny Welbeck (Arsenal) commits a rough challenge and Deniz Aytekin blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 12:12",
            "label": "",
            "description": "Olivier Giroud (Arsenal) strikes the rebound, but it goes well over the bar."
        },
        {
            "gameTime": "2 - 11:36",
            "label": "",
            "description": "Great touch by Alexis Sanchez (Arsenal) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "2 - 08:50",
            "label": "",
            "description": "Anthony Martial (Monaco) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 07:58",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Dimitar Berbatov (Monaco) was set free in the area by Anthony Martial and made no mistake with a lovely finish into the left side of the net. 0:2."
        },
        {
            "gameTime": "2 - 06:16",
            "label": "",
            "description": "Olivier Giroud (Arsenal) leaps high deep inside the box to meet a beautiful cross from the resultant free kick. He glances a header goalwards, but it's not accurate at all and goes well wide of the left post."
        },
        {
            "gameTime": "2 - 05:21",
            "label": "",
            "description": "An opponent rises to his feet after being downed by . Deniz Aytekin saw the sliding tackle and blows for a foul. Arsenal will look to benefit from a promising free kick near the touchline."
        },
        {
            "gameTime": "2 - 04:27",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 03:52",
            "label": "",
            "description": "Olivier Giroud (Arsenal) plays a one two with Olivier Giroud, but the move breaks down."
        },
        {
            "gameTime": "2 - 03:16",
            "label": "",
            "description": "Nabil Dirar (Monaco) is penalised for holding. Deniz Aytekin signals a set piece. Arsenal produce a short pass from the free kick."
        },
        {
            "gameTime": "2 - 02:18",
            "label": "",
            "description": "Per Mertesacker (Arsenal) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 00:38",
            "label": "",
            "description": "CHANCE! Olivier Giroud (Arsenal) fires just wide of the right post from inside the box after running onto a splendid pass from Alexis Sanchez."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The performance of both teams has been far from perfect so far and is unlikely to have satisfied the fans. Both teams are unsuccessfully trying to control the game and it's pretty even so far. Long balls and crosses are the strongest weapons of the home team. The away team tries to find the weakness in the opposition's defence using mainly rapid counter attacks."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:40",
            "label": "",
            "description": "Santi Cazorla (Arsenal) sends in a cross from a free kick from just outside the box, trying to find one of his teammates deep inside the penalty area. The goalkeeper displays great anticipation and collects the ball."
        },
        {
            "gameTime": "1 - 45:14",
            "label": "",
            "description": "A mid range free kick is awarded to Arsenal out wide and from this angle a cross into the box is likely."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "",
            "description": "Close! Olivier Giroud (Arsenal) picks up the ball in space and from inside the penalty area sends a shot inches wide of the right post."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "y-card",
            "description": "Deniz Aytekin shows a yellow card to Elderson (Monaco) for a tough tackle."
        },
        {
            "gameTime": "1 - 42:35",
            "label": "",
            "description": "Deniz Aytekin blows his whistle for a foul after Joao Moutinho (Monaco) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 41:26",
            "label": "y-card",
            "description": "Deniz Aytekin shows a yellow card to Francis Coquelin (Arsenal), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 40:02",
            "label": "",
            "description": "Olivier Giroud (Arsenal) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball sails well over the bar!"
        },
        {
            "gameTime": "1 - 37:12",
            "label": "soccer-ball",
            "description": "GOAL 0:1! Geoffrey Kondogbia (Monaco) unleashes a shot from distance, which is deflected past David Ospina. He had no chance of stopping it as the ball rapidly changed its direction."
        },
        {
            "gameTime": "1 - 36:20",
            "label": "",
            "description": "Olivier Giroud (Arsenal) receives a well played pass inside the penalty area and shoots. He sends the ball into orbit."
        },
        {
            "gameTime": "1 - 35:03",
            "label": "",
            "description": "Anthony Martial sends a lofted pass into the box, Joao Moutinho (Monaco) shows good awareness to connect with it but blazes his shot high over the crossbar."
        },
        {
            "gameTime": "1 - 33:23",
            "label": "",
            "description": "Hector Bellerin (Arsenal) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball goes out of play and Monaco will have a goal kick."
        },
        {
            "gameTime": "1 - 31:52",
            "label": "",
            "description": "Close! Alexis Sanchez (Arsenal) picks up the ball in space and from inside the penalty area sends a shot narrowly over the bar."
        },
        {
            "gameTime": "1 - 29:54",
            "label": "",
            "description": "Mesut Ozil (Arsenal) and Alexis Sanchez try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 27:51",
            "label": "",
            "description": "Santi Cazorla (Arsenal) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 27:15",
            "label": "",
            "description": "Anthony Martial (Monaco) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 26:22",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) sends a precise pass into the box, but Mesut Ozil loses the one on one with the defender."
        },
        {
            "gameTime": "1 - 25:05",
            "label": "corner",
            "description": "The corner from Mesut Ozil (Arsenal) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 24:43",
            "label": "",
            "description": "A cross from the free kick is whipped in by Santi Cazorla (Arsenal), but one of the defenders steps in and averts the threat. The linesman makes the right call and Arsenal will have a corner."
        },
        {
            "gameTime": "1 - 24:16",
            "label": "",
            "description": "Geoffrey Kondogbia (Monaco) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Deniz Aytekin blows for the foul but keeps his cards in his pocket on this occasion. Arsenal are awarded a free kick."
        },
        {
            "gameTime": "1 - 23:44",
            "label": "",
            "description": "Olivier Giroud (Arsenal) leaps highest to meet the resulting corner and attempts to head home, but the effort goes harmlessly wide of the left post."
        },
        {
            "gameTime": "1 - 23:33",
            "label": "corner",
            "description": "Alexis Sanchez (Arsenal) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 22:15",
            "label": "",
            "description": "Arsenal are happy showing off their ball keeping skills and that is only interrupted when the defender steps in. The ball goes out of play. Arsenal are awarded a corner kick."
        },
        {
            "gameTime": "1 - 21:30",
            "label": "",
            "description": "Aymen Abdennour (Monaco) sends a cross into the box, but David Ospina comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 20:13",
            "label": "",
            "description": "Deniz Aytekin has a clear sight and sees a foul from Nabil Dirar (Monaco)."
        },
        {
            "gameTime": "1 - 20:02",
            "label": "",
            "description": "Dimitar Berbatov receives a sweet cross inside the box from Almamy Toure (Monaco), but one of the defenders rushes in bravely to intercept the move."
        },
        {
            "gameTime": "1 - 18:57",
            "label": "",
            "description": "Joao Moutinho (Monaco) unleashes a shot, but it's well wide of the left hand post."
        },
        {
            "gameTime": "1 - 18:20",
            "label": "",
            "description": "Hector Bellerin (Arsenal) fouls an opponent. At least that's what referee Deniz Aytekin signals."
        },
        {
            "gameTime": "1 - 18:01",
            "label": "",
            "description": "The Arsenal players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 15:57",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Dimitar Berbatov (Monaco) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "1 - 15:15",
            "label": "",
            "description": "Dangerous play by Olivier Giroud (Arsenal). Deniz Aytekin blows his whistle for a foul. Monaco are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 14:49",
            "label": "",
            "description": "The game is interrupted as Dimitar Berbatov (Monaco) is flagged offside."
        },
        {
            "gameTime": "1 - 14:39",
            "label": "",
            "description": "Monaco are awarded a free kick near the side line and the players make their way into the box for the inevitable cross."
        },
        {
            "gameTime": "1 - 14:20",
            "label": "",
            "description": "Olivier Giroud (Arsenal) makes an overly aggressive challenge and Deniz Aytekin blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 13:18",
            "label": "",
            "description": "Elderson (Monaco) fizzes over a cross which doesn't cause any problems. The linesman signals a throw in for Arsenal."
        },
        {
            "gameTime": "1 - 12:30",
            "label": "",
            "description": "Santi Cazorla (Arsenal) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "1 - 12:07",
            "label": "",
            "description": "Aymen Abdennour (Monaco) makes a rough challenge and Deniz Aytekin blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 11:01",
            "label": "corner",
            "description": "Alexis Sanchez (Arsenal) works the corner short."
        },
        {
            "gameTime": "1 - 10:49",
            "label": "",
            "description": "Mesut Ozil (Arsenal) races towards goal but the defender gets back well to make a challenge. Arsenal will take a corner kick."
        },
        {
            "gameTime": "1 - 07:55",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 07:19",
            "label": "",
            "description": "Dimitar Berbatov (Monaco) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 06:28",
            "label": "",
            "description": "Danny Welbeck (Arsenal) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 05:20",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 04:45",
            "label": "",
            "description": "Hector Bellerin (Arsenal) crosses the ball into the box, but one of the defending players averts the threat. The ball is out of play and the linesman points at the corner flag. Corner to Arsenal."
        },
        {
            "gameTime": "1 - 04:07",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) passes the ball onto Danny Welbeck, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 03:27",
            "label": "",
            "description": "The ball is cleared after Nabil Dirar (Monaco) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 02:32",
            "label": "",
            "description": "Mesut Ozil (Arsenal) and Danny Welbeck attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 01:29",
            "label": "",
            "description": "Ambitious effort from Danny Welbeck (Arsenal). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well over the bar."
        },
        {
            "gameTime": "1 - 00:40",
            "label": "",
            "description": "Laurent Koscielny (Arsenal) attempts to send a pass but the effort is blocked. The ball is behind the touchline and Arsenal will take a throw in."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Arsenal will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Deniz Aytekin will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. There wasn't any evident superiority by either side today. The home side attempted to create scoring opportunities mostly with long balls, while the opposition focused on counter attacks to breach the home side's defences."
        }
    ],
    "gameAwayTeam": "Monaco",
    "gameDate": "25/02/2015 - 22:45",
    "gameHomeTeam": "Arsenal",
    "gameScore": "1 - 3"
}