{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-04-02 - 21-45 Granada CF 1 - 4 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:19",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 46:33",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 45:57",
            "label": "soccer-ball",
            "description": "It's a goal! Alcacer Paco plays a lovely pass into the box and finds Neymar (Barcelona). He tries his luck from close range and coolly strikes the ball into the back of the net. 1:4."
        },
        {
            "gameTime": "2 - 43:52",
            "label": "corner",
            "description": "Neymar (Barcelona) will take a corner kick."
        },
        {
            "gameTime": "2 - 41:16",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Ivan Rakitic departs the field of play to be replaced by Carles Alena (Barcelona)."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Ivan Rakitic (Barcelona) tries his luck from the edge of the box and his shot takes a deflection and goes past the stranded Guillermo Ochoa. He makes it 1:3."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "yr-card",
            "description": "Uche Agbo (Granada CF) makes a bad challenge and is given a second yellow card which means he's off."
        },
        {
            "gameTime": "2 - 35:50",
            "label": "corner",
            "description": "Corner kick. Andreas Pereira (Granada CF) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 33:08",
            "label": "y-card",
            "description": "The referee shows the yellow card to Uche Agbo (Granada CF)."
        },
        {
            "gameTime": "2 - 32:22",
            "label": "substitution",
            "description": "Today's match ends for Gaston Silva who will be replaced by Isaac Cuenca (Granada CF)."
        },
        {
            "gameTime": "2 - 31:11",
            "label": "y-card",
            "description": "Santiago Jaime Latre shows a yellow card to Ivan Rakitic (Barcelona) for a tough tackle."
        },
        {
            "gameTime": "2 - 30:52",
            "label": "corner",
            "description": "The resulting corner, taken by Neymar (Barcelona), comes to nothing."
        },
        {
            "gameTime": "2 - 25:34",
            "label": "corner",
            "description": "Neymar (Barcelona) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 25:18",
            "label": "corner",
            "description": "Neymar (Barcelona) steps up to take the corner, but the ball just sails in among the defenders. Barcelona get a corner."
        },
        {
            "gameTime": "2 - 25:09",
            "label": "",
            "description": "Neymar (Barcelona) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net. Barcelona have a corner."
        },
        {
            "gameTime": "2 - 21:33",
            "label": "substitution",
            "description": "It will be a substitution. Andres Iniesta (Barcelona) is ready to enter the pitch as Andre Gomes walks off."
        },
        {
            "gameTime": "2 - 21:01",
            "label": "corner",
            "description": "Neymar (Barcelona) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 20:31",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Neymar (Barcelona), but one of the defenders gets it clear. The ball is out of play. Barcelona will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 20:17",
            "label": "",
            "description": "That was a nice football moment. Ivan Rakitic (Barcelona) receives an amazing defence splitting low pass on the edge of the box and blasts the ball towards the roof of the net. Guillermo Ochoa guesses his intention and dives superbly to deny him with a remarkable save! The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "2 - 18:56",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Alcacer Paco (Barcelona) was set free in the area by Luis Suarez and made no mistake with a lovely finish into the right side of the net. 1:2."
        },
        {
            "gameTime": "2 - 14:25",
            "label": "y-card",
            "description": "Jordi Alba (Barcelona) gets booked for the first time in this match."
        },
        {
            "gameTime": "2 - 13:13",
            "label": "y-card",
            "description": "The game is interrupted because of a yellow card that is shown to David Lomban (Granada CF)."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "substitution",
            "description": "Lucas Alcaraz has decided to substitute Artem Kravets and he is replaced by Adrian Ramos (Granada CF)."
        },
        {
            "gameTime": "2 - 09:45",
            "label": "",
            "description": "Neymar (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 04:50",
            "label": "soccer-ball",
            "description": "Matthieu Saunier plays a neat ball into the path of Jeremie Boga (Granada CF), who makes room for a shot and sends in a low drive which bounces in off the left post! 1:1."
        },
        {
            "gameTime": "2 - 01:00",
            "label": "",
            "description": "Alcacer Paco (Barcelona) decided to shoot after receiving a sweet pass. If it wasn't for Guillermo Ochoa's superb save the ball would have probably ended up in the bottom right corner."
        },
        {
            "gameTime": "2 - 00:12",
            "label": "substitution",
            "description": "There will be a change on the pitch for the second half. Lucas Alcaraz probably wasn't satisfied with the performance of Victorien Angban. He is replaced by Jeremie Boga (Granada CF)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:07",
            "label": "whistle",
            "description": "Santiago Jaime Latre has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:59",
            "label": "soccer-ball",
            "description": "Stunning strike! Luis Suarez (Barcelona) latches on to a precise through ball from Jordi Alba before unleashing an unstoppable shot into the back of the net from the edge of the area. Fantastic goal. The score is now 0:1."
        },
        {
            "gameTime": "1 - 43:24",
            "label": "",
            "description": "Neymar (Barcelona) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 41:35",
            "label": "",
            "description": "Sergi Roberto (Barcelona) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "",
            "description": "Barcelona are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 33:23",
            "label": "",
            "description": "Luis Suarez (Barcelona) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Guillermo Ochoa is alert and denies him."
        },
        {
            "gameTime": "1 - 31:40",
            "label": "",
            "description": "Alcacer Paco (Barcelona) finds himself with a great opportunity! He unleashes a shot from the edge of the box, which whizzes just wide of the left post!"
        },
        {
            "gameTime": "1 - 28:47",
            "label": "",
            "description": "The game is interrupted as Luis Suarez (Barcelona) is flagged offside."
        },
        {
            "gameTime": "1 - 27:57",
            "label": "y-card",
            "description": "Sergi Roberto (Barcelona) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Santiago Jaime Latre ignores the protests."
        },
        {
            "gameTime": "1 - 26:53",
            "label": "corner",
            "description": "Neymar (Barcelona) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 26:27",
            "label": "",
            "description": "Guillermo Ochoa pulls off a great save to deny Luis Suarez (Barcelona) after receiving a precise defence splitting pass. The effort is headed for the right side of the goal, but the goalkeeper dives superbly to stop it. Definitely the best save of this match so far! The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 25:29",
            "label": "",
            "description": "Neymar (Barcelona) gets on the end of a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Guillermo Ochoa pulls off an easy save."
        },
        {
            "gameTime": "1 - 23:48",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Neymar (Barcelona) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "1 - 23:47",
            "label": "",
            "description": "It should have been a goal! Alcacer Paco (Barcelona) fires a rocket of a shot but it only hits the crossbar!"
        },
        {
            "gameTime": "1 - 20:55",
            "label": "corner",
            "description": "Neymar (Barcelona) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "1 - 19:11",
            "label": "",
            "description": "Alcacer Paco (Barcelona) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 16:49",
            "label": "substitution",
            "description": "Rafinha is not able to continue due to his injury and will be replaced by Alcacer Paco (Barcelona)."
        },
        {
            "gameTime": "1 - 13:02",
            "label": "injury",
            "description": "Rafinha (Barcelona) picks up an injury."
        },
        {
            "gameTime": "1 - 11:11",
            "label": "",
            "description": "Litri (Granada CF) makes a good run with the ball into the box, but mishits his shot as it goes high over the bar."
        },
        {
            "gameTime": "1 - 08:15",
            "label": "corner",
            "description": "Neymar (Barcelona) sends over a poor, overhit cross from the corner kick and the ball goes out of play."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "",
            "description": "Neymar (Barcelona) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. Barcelona force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 04:08",
            "label": "",
            "description": "Rafinha (Barcelona) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 02:48",
            "label": "",
            "description": "Luis Suarez (Barcelona) is adjudged offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Granada CF will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Santiago Jaime Latre is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lionel Messi is the biggest threat to an opponent! He has already scored 25 goals and is top scorer in this Barcelona team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "4 number of games there were over 2.5 goals from the last 5 matches between these two teams."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "02/04/2017 - 21:45",
    "gameHomeTeam": "Granada CF",
    "gameScore": "1 - 4"
}