{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2017-02-14 - 22-45 Paris SG 4 - 0 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:03",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 48:05",
            "label": "corner",
            "description": "The resulting corner, taken by Neymar (Barcelona), comes to nothing."
        },
        {
            "gameTime": "2 - 47:41",
            "label": "",
            "description": "Neymar (Barcelona) looks to break free, but an opposing player clears the ball away. Barcelona will take a corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "",
            "description": "Neymar (Barcelona) fires the ball in from a mid range free kick, but it blazes over the bar."
        },
        {
            "gameTime": "2 - 44:31",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Adrien Rabiot (Paris SG). Szymon Marciniak saw the sliding tackle and blows for a foul. Barcelona have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 42:55",
            "label": "",
            "description": "Jordi Alba (Barcelona) makes an overly aggressive challenge and Szymon Marciniak blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 40:57",
            "label": "substitution",
            "description": "Substitution. Javier Pastore (Paris SG) has come on for Julian Draxler."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "",
            "description": "Samuel Umtiti (Barcelona) leaps high to meet a lofted pass inside the six yard box, but his header only flies onto the left post and away off it."
        },
        {
            "gameTime": "2 - 37:48",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 37:40",
            "label": "",
            "description": "Neymar (Barcelona) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 36:26",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) commits a rough foul. Szymon Marciniak stops the game and makes a call."
        },
        {
            "gameTime": "2 - 34:57",
            "label": "",
            "description": "The linesman raises his flag for offside before Neymar (Barcelona) heads on."
        },
        {
            "gameTime": "2 - 33:25",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Neymar (Barcelona), whose instinctive shot towards goal flashes inches wide of the right post."
        },
        {
            "gameTime": "2 - 31:21",
            "label": "",
            "description": "Neymar (Barcelona) takes a short free kick."
        },
        {
            "gameTime": "2 - 30:23",
            "label": "",
            "description": "Julian Draxler (Paris SG) commits an ugly tackle on his opponent, but there is no caution from the referee. Barcelona have a free kick."
        },
        {
            "gameTime": "2 - 28:57",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Rafinha (Barcelona) was quite harsh and Szymon Marciniak didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 28:37",
            "label": "",
            "description": "Sergi Roberto (Barcelona) covers his face with his hands after wasting a promising chance. He takes the rebound on the edge of the box but blazes the ball high over the crossbar."
        },
        {
            "gameTime": "2 - 28:22",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 27:58",
            "label": "",
            "description": "Marquinhos (Paris SG) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement. Barcelona are awarded a free kick."
        },
        {
            "gameTime": "2 - 26:50",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Ivan Rakitic (Barcelona) comes onto the pitch so that Andres Iniesta can be given a rest."
        },
        {
            "gameTime": "2 - 26:05",
            "label": "soccer-ball",
            "description": "Goal! Thomas Meunier plays in Edinson Cavani (Paris SG), who shows great determination to get to the ball before a couple of defenders. He shoots from inside the box into the right side of the net! Great finish 4:0."
        },
        {
            "gameTime": "2 - 23:58",
            "label": "substitution",
            "description": "Unai Emery Etxegoien is forced to make a change. Marco Verratti is unable to continue due to injury, Christopher Nkunku (Paris SG) comes on."
        },
        {
            "gameTime": "2 - 21:12",
            "label": "",
            "description": "Lucas (Paris SG) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Marc Andre ter Stegen was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 20:01",
            "label": "",
            "description": "Lucas (Paris SG) misses a good chance to score. An inch perfect cross into the box finds Lucas (Paris SG) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 19:15",
            "label": "",
            "description": "Flag goes up against Neymar (Barcelona) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 18:40",
            "label": "",
            "description": "Presnel Kimpembe (Paris SG) makes an unfair challenge by holding his opponent to prevent him from getting the ball. A free kick to Barcelona."
        },
        {
            "gameTime": "2 - 16:50",
            "label": "y-card",
            "description": "Szymon Marciniak shows a yellow card to Sergio Busquets (Barcelona) for his blatant foul."
        },
        {
            "gameTime": "2 - 15:41",
            "label": "substitution",
            "description": "Unai Emery has decided to introduce fresh legs, with Lucas (Paris SG) replacing Angel Di Maria."
        },
        {
            "gameTime": "2 - 15:04",
            "label": "",
            "description": "Angel Di Maria (Paris SG) fouls an opponent. At least that's what referee Szymon Marciniak signals. Barcelona win a free kick."
        },
        {
            "gameTime": "2 - 12:54",
            "label": "substitution",
            "description": "Andre Gomes comes off the pitch to be replaced by Rafinha (Barcelona)."
        },
        {
            "gameTime": "2 - 09:41",
            "label": "soccer-ball",
            "description": "Angel Di Maria (Paris SG) collects a good pass and blasts the ball from medium range into the top left corner, giving the goalkeeper no chance."
        },
        {
            "gameTime": "2 - 03:43",
            "label": "",
            "description": "Edinson Cavani (Paris SG) climbs high to connect with a cross near the penalty spot but plants a header well wide of the left post."
        },
        {
            "gameTime": "2 - 01:43",
            "label": "",
            "description": "Angel Di Maria (Paris SG) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 01:26",
            "label": "",
            "description": "Sergi Roberto (Barcelona) touches the ball with his hand. Paris SG will take a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:02",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:42",
            "label": "corner",
            "description": "The resulting corner from Angel Di Maria (Paris SG) is cleared."
        },
        {
            "gameTime": "1 - 44:12",
            "label": "",
            "description": "Angel Di Maria (Paris SG) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. Paris SG force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 39:40",
            "label": "soccer-ball",
            "description": "Goal! Marco Verratti plays in Julian Draxler (Paris SG), who shows great determination to get to the ball before a couple of defenders and from inside the box he shoots into the left side of the net! Great finish 2:0."
        },
        {
            "gameTime": "1 - 34:59",
            "label": "corner",
            "description": "The corner from Angel Di Maria (Paris SG) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 33:43",
            "label": "",
            "description": "Julian Draxler (Paris SG) unleashes a promising shot towards the left side of the goal after his wonderful solo run, but Marc Andre ter Stegen thwarts the effort with a fabulous save. The score remains the same. Paris SG have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 32:29",
            "label": "y-card",
            "description": "Andre Gomes (Barcelona) is booked after bringing down an opponent. Szymon Marciniak had an easy decision to make."
        },
        {
            "gameTime": "1 - 32:18",
            "label": "",
            "description": "Gerard Pique (Barcelona) was too fierce in his attempt to get the ball from his opponent and Szymon Marciniak blows for a foul."
        },
        {
            "gameTime": "1 - 27:37",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) works the corner short."
        },
        {
            "gameTime": "1 - 26:56",
            "label": "",
            "description": "Andre Gomes (Barcelona) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Kevin Trapp is alert and denies him. Barcelona earn a corner."
        },
        {
            "gameTime": "1 - 25:00",
            "label": "",
            "description": "Lionel Messi (Barcelona) attempts to curl the ball over the defensive wall from the free kick, but his effort fails to reach the goal."
        },
        {
            "gameTime": "1 - 24:22",
            "label": "",
            "description": "Thomas Meunier (Paris SG) was trying to get to the ball but clattered into the legs of the opponent as well. Szymon Marciniak blows his whistle for an infringement. Barcelona are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 22:33",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 21:58",
            "label": "",
            "description": "Luis Suarez (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play and Barcelona manage to earn a corner."
        },
        {
            "gameTime": "1 - 21:08",
            "label": "",
            "description": "Edinson Cavani (Paris SG) collects a pass on the edge of the box and unleashes a low drive to the middle, but Marc Andre ter Stegen makes a save."
        },
        {
            "gameTime": "1 - 17:57",
            "label": "soccer-ball",
            "description": "Angel Di Maria (Paris SG) smashes the ball from the resulting free kick and it sails into the top right corner. The goalkeeper merely turned his head. Absolutely amazing."
        },
        {
            "gameTime": "1 - 16:42",
            "label": "",
            "description": "Szymon Marciniak blows his whistle and signals a foul after Samuel Umtiti (Barcelona) brought his opponent down. Paris SG win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 10:34",
            "label": "",
            "description": "Marc Andre ter Stegen makes a sensational save to thwart a great chance. A rebound falls to Adrien Rabiot (Paris SG) on the edge of the box and he strikes goalwards, but the ball ends up in the keeper's gloves instead of the middle of the goal."
        },
        {
            "gameTime": "1 - 10:28",
            "label": "",
            "description": "Angel Di Maria (Paris SG) reacts well to latch onto a rebound inside the box, but his shot is well blocked."
        },
        {
            "gameTime": "1 - 10:24",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Marc Andre ter Stegen guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 09:38",
            "label": "",
            "description": "Luis Suarez (Barcelona) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 05:40",
            "label": "",
            "description": "Julian Draxler (Paris SG) struck the ball which rebounded to the edge of the box. His attempt went narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 05:20",
            "label": "",
            "description": "Edinson Cavani (Paris SG) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety."
        },
        {
            "gameTime": "1 - 03:55",
            "label": "",
            "description": "Lionel Messi (Barcelona) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "1 - 02:05",
            "label": "y-card",
            "description": "Adrien Rabiot (Paris SG) has tested the patience of referee Szymon Marciniak and goes into the book for a previous late challenge. It's a free kick to Barcelona in a dangerous position."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Paris SG will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Szymon Marciniak got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "14/02/2017 - 22:45",
    "gameHomeTeam": "Paris SG",
    "gameScore": "4 - 0"
}