{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-04-09 - 21-45 Lazio 0 - 3 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:55",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 46:56",
            "label": "soccer-ball",
            "description": "Goal 0:3! Piotr Zielinski laid the ball off to Lorenzo Insigne (Napoli), who shot from close range into the bottom left corner, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:09",
            "label": "y-card",
            "description": "The referee had an easy decision to make. A yellow card is given to Patric Gabarron (Lazio) for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 41:26",
            "label": "",
            "description": "It seems like Felipe Anderson (Lazio) is about to take a free kick. The goalkeeper has to be alert and careful how to position the defensive wall. This is the perfect distance for a direct shot."
        },
        {
            "gameTime": "2 - 40:52",
            "label": "y-card",
            "description": "Elseid Hysaj (Napoli) has tested the patience of referee Massimiliano Irrati and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 39:45",
            "label": "y-card",
            "description": "Piotr Zielinski (Napoli) is booked after bringing down an opponent. Massimiliano Irrati had an easy decision to make."
        },
        {
            "gameTime": "2 - 39:41",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the right post. The ball goes out of play and Lazio will have a goal kick."
        },
        {
            "gameTime": "2 - 37:49",
            "label": "substitution",
            "description": "Here is a change. Dries Mertens is going off and Maurizio Sarri gives the last tactical orders to Arkadiusz Milik (Napoli)."
        },
        {
            "gameTime": "2 - 33:45",
            "label": "substitution",
            "description": "Substitution. Marek Hamsik makes his way off the pitch and Marko Rog (Napoli) comes on as his replacement."
        },
        {
            "gameTime": "2 - 33:23",
            "label": "",
            "description": "Sergej Milinkovic Savic (Lazio) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar. The ball goes out of play and Napoli will have a goal kick."
        },
        {
            "gameTime": "2 - 28:45",
            "label": "y-card",
            "description": "Allan (Napoli) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Massimiliano Irrati didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "substitution",
            "description": "The manager makes a subsitution with Piotr Zielinski (Napoli) coming on for Jose Callejon."
        },
        {
            "gameTime": "2 - 27:35",
            "label": "corner",
            "description": "The resulting corner from Jose Callejon (Napoli) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 26:42",
            "label": "corner",
            "description": "Jose Callejon (Napoli) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 25:30",
            "label": "corner",
            "description": "The corner from Balde Keita (Lazio) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 25:23",
            "label": "",
            "description": "Wesley Hoedt (Lazio) is the first to arrive to a rebound inside the penalty area and unleashes a quick strike towards the bottom right corner that beats the keeper. One of the defenders, however, makes a goal line clearance."
        },
        {
            "gameTime": "2 - 24:52",
            "label": "corner",
            "description": "Felipe Anderson (Lazio) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 24:07",
            "label": "",
            "description": "Patric Gabarron (Lazio) makes a good run inside the box to meet a precise cross. He latches on to it and shoots, but the goalkeeper pulls off an excellent save. The linesman makes the right call and Lazio will have a corner."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "",
            "description": "Ciro Immobile (Lazio) is unable to control an accurate defence splitting pass properly and one of the defending players reacts well to rob him of the ball."
        },
        {
            "gameTime": "2 - 21:56",
            "label": "",
            "description": "Massimiliano Irrati blows his whistle and signals a foul after Jordan Lukaku (Lazio) brought his opponent down."
        },
        {
            "gameTime": "2 - 21:27",
            "label": "",
            "description": "That was close by Sergej Milinkovic Savic (Lazio)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post. The ball goes out of play and Napoli will have a goal kick."
        },
        {
            "gameTime": "2 - 18:53",
            "label": "",
            "description": "Allan (Napoli) skips past his man but can't keep the ball in play. The ball goes out of play and Lazio will have a goal kick."
        },
        {
            "gameTime": "2 - 15:17",
            "label": "",
            "description": "What a chance that is! Sergej Milinkovic Savic (Lazio) displays good awareness near the penalty spot to get on the end of a cross, but he sends his header just over the crossbar. The ball is off of the pitch and it's a goal kick for Napoli."
        },
        {
            "gameTime": "2 - 13:45",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Patric Gabarron (Lazio) for Dusan Basta."
        },
        {
            "gameTime": "2 - 13:28",
            "label": "",
            "description": "Jorginho (Napoli) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition. The ball goes out of play and Lazio will have a goal kick."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "y-card",
            "description": "Massimiliano Irrati shows a yellow card to Sergej Milinkovic Savic (Lazio) for his blatant foul."
        },
        {
            "gameTime": "2 - 07:30",
            "label": "",
            "description": "Balde Keita (Lazio) dribbles into the box, but Pepe Reina is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 06:48",
            "label": "substitution",
            "description": "Substitution. Bastos walks off the pitch and Wesley Hoedt (Lazio) comes on as a substitute."
        },
        {
            "gameTime": "2 - 06:22",
            "label": "substitution",
            "description": "Simone Inzaghi decides to make a substitution. Alessandro Murgia will be replaced by Balde Keita (Lazio)."
        },
        {
            "gameTime": "2 - 05:21",
            "label": "soccer-ball",
            "description": "Lorenzo Insigne (Napoli) meets a perfect cross from Allan deep inside the box and controls it with a nice first touch. He produces an accurate strike into the bottom right corner via the post. The score is 0:2."
        },
        {
            "gameTime": "2 - 04:51",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Ivan Strinic (Napoli). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 04:39",
            "label": "",
            "description": "Dries Mertens (Napoli) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders. The linesman points to the corner flag, Napoli are going to take it."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:51",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:13",
            "label": "",
            "description": "What a big chance! Lorenzo Insigne (Napoli) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post. The ball is off of the pitch and it's a goal kick for Lazio."
        },
        {
            "gameTime": "1 - 43:17",
            "label": "",
            "description": "Ciro Immobile (Lazio) unleashed a long range shot, but it misses narrowly over the bar. It could have been the goal of the month, at least."
        },
        {
            "gameTime": "1 - 42:06",
            "label": "",
            "description": "Dries Mertens (Napoli) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 40:31",
            "label": "",
            "description": "Jorginho (Napoli) brings an opponent down and Massimiliano Irrati interrupts the game."
        },
        {
            "gameTime": "1 - 36:17",
            "label": "",
            "description": "Napoli are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 32:54",
            "label": "",
            "description": "Jorginho (Napoli) sends a teasing cross into the area, but Thomas Strakosha intercepts the ball."
        },
        {
            "gameTime": "1 - 24:50",
            "label": "soccer-ball",
            "description": "Goal! Marek Hamsik puts the ball on a plate for Jose Callejon (Napoli), who scores with a simple close range finish. It's 0:1."
        },
        {
            "gameTime": "1 - 24:38",
            "label": "",
            "description": "Jose Callejon (Napoli) is penalised for a foul. Massimiliano Irrati had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 20:31",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 19:16",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Bastos (Lazio) was quite harsh and Massimiliano Irrati didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 19:12",
            "label": "",
            "description": "Foul! Bastos (Lazio) is penalised for pulling back his opponent."
        },
        {
            "gameTime": "1 - 16:30",
            "label": "",
            "description": "Dries Mertens (Napoli) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 13:52",
            "label": "",
            "description": "A neat pass is well received by Sergej Milinkovic Savic (Lazio), who is lurking on the edge of the box and strikes the ball on goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "1 - 13:01",
            "label": "",
            "description": "Jordan Lukaku (Lazio) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 05:24",
            "label": "corner",
            "description": "Alessandro Murgia (Lazio) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 05:15",
            "label": "",
            "description": "Ciro Immobile (Lazio) misses a good chance to score. An inch perfect cross into the box finds Ciro Immobile (Lazio) who rises for a header, but sends the ball well over the bar. Now Lazio have a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Massimiliano Irrati will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "9 The amount of away victories for Napoli."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most prolific goal scorer for Napoli is Dries Mertens with 20 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "15 The number of Lazio matches with less than 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "09/04/2017 - 21:45",
    "gameHomeTeam": "Lazio",
    "gameScore": "0 - 3"
}