{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-12-09 - 22-45 Benfica 0 - 0 Bayer Leverkusen/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. Neither of the teams could take the initiative and dominate today's game. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 50:50",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 49:25",
            "label": "",
            "description": "Nelson Oliveira (Benfica) was too forceful with his tackle and Aleksei Kulbakov interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 48:33",
            "label": "corner",
            "description": "The resulting corner from Anderson Talisca (Benfica) is cleared."
        },
        {
            "gameTime": "2 - 48:25",
            "label": "",
            "description": "Benfica keep the ball well and push forward with purpose, but here comes an interception from the opposition. The referee and his assistant both point at the corner flag. Benfica will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 47:35",
            "label": "",
            "description": "Sebastian Boenisch (Bayer Leverkusen) sends a cross into the box, but Artur comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 45:50",
            "label": "",
            "description": "Joao Teixeira (Benfica) receives a pass and fires a shot in from long range, but it's blocked."
        },
        {
            "gameTime": "2 - 45:15",
            "label": "yr-card",
            "description": "Aleksei Kulbakov blows his whistle and Omer Toprak (Bayer Leverkusen) is shown a second yellow card for his foul. His manager will not be pleased. He has lot of time to think about it as he walks off."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 5 min. of added time."
        },
        {
            "gameTime": "2 - 44:08",
            "label": "",
            "description": "The foul by Nelson Oliveira (Benfica) was seen by Aleksei Kulbakov who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 43:34",
            "label": "",
            "description": "Pizzi (Benfica) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "2 - 41:55",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Joao Teixeira (Benfica) is coming onto the pitch as Bebe cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 41:15",
            "label": "",
            "description": "Cesar (Benfica) was the quickest one to orientate himself inside the box and rose high to reach a fine corner kick. He fails to direct the ball past the goalkeeper as it flies narrowly over the bar."
        },
        {
            "gameTime": "2 - 41:01",
            "label": "corner",
            "description": "The referee and one of his assistants signal for a corner kick to Benfica."
        },
        {
            "gameTime": "2 - 40:44",
            "label": "",
            "description": "Bebe (Benfica) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 40:35",
            "label": "",
            "description": "Superb touch by Karim Bellarabi (Bayer Leverkusen) as he receives a precise pass into the box, but the goalkeeper stops the ball as it heads towards the top of the net. Brilliant save!"
        },
        {
            "gameTime": "2 - 39:23",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 38:48",
            "label": "",
            "description": "Anderson Talisca (Benfica) produces a ferocious strike from the edge of the box. His dangerous effort towards the bottom left corner is blocked by Bernd Leno, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "substitution",
            "description": "The substitution is prepared. Stefan Kiessling (Bayer Leverkusen) joins the action as a substitute, replacing Simon Rolfes."
        },
        {
            "gameTime": "2 - 36:43",
            "label": "",
            "description": "Anderson Talisca (Benfica) makes an overly aggressive challenge and Aleksei Kulbakov blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 35:03",
            "label": "",
            "description": "Anderson Talisca (Benfica) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 33:55",
            "label": "",
            "description": "Heung Min Son (Bayer Leverkusen) is caught offside!"
        },
        {
            "gameTime": "2 - 31:44",
            "label": "injury",
            "description": "The game is interrupted now, Anderson Talisca (Benfica) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 30:14",
            "label": "substitution",
            "description": "The substitution has been made. Nelson Oliveira (Benfica) has replaced Derley."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "",
            "description": "Emir Spahic (Bayer Leverkusen) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 29:37",
            "label": "",
            "description": "Simon Rolfes (Bayer Leverkusen) brings his opponent down with a tackle and Aleksei Kulbakov blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 28:11",
            "label": "injury",
            "description": "Emir Spahic (Bayer Leverkusen) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "Anderson Talisca (Benfica) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Bernd Leno was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 25:21",
            "label": "substitution",
            "description": "The manager makes a subsitution with Heung Min Son (Bayer Leverkusen) coming on for Josip Drmic."
        },
        {
            "gameTime": "2 - 25:13",
            "label": "",
            "description": "Gonzalo Castro (Bayer Leverkusen) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 23:36",
            "label": "injury",
            "description": "Gonzalo Castro (Bayer Leverkusen) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 21:43",
            "label": "corner",
            "description": "Pizzi (Benfica) takes the corner kick, but Bernd Leno reads it well and stops the effort."
        },
        {
            "gameTime": "2 - 21:18",
            "label": "",
            "description": "Ola John (Benfica) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The referee signals a corner kick to Benfica."
        },
        {
            "gameTime": "2 - 20:07",
            "label": "",
            "description": "Simon Rolfes (Bayer Leverkusen) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 18:57",
            "label": "",
            "description": "Good movement by Karim Bellarabi (Bayer Leverkusen), but he can't find any of his teammates as the cross is poor. It's a throw in for Benfica."
        },
        {
            "gameTime": "2 - 18:19",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Ola John (Benfica), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "substitution",
            "description": "That will be all from Lima who is being replaced by the fresh legs of Anderson Talisca (Benfica)."
        },
        {
            "gameTime": "2 - 16:34",
            "label": "",
            "description": "Wasted opportunity. Roberto Hilbert (Bayer Leverkusen) gets to the rebound inside the box and smashes the ball just wide of the right post."
        },
        {
            "gameTime": "2 - 14:43",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) makes a strong challenge and Aleksei Kulbakov blows for a foul."
        },
        {
            "gameTime": "2 - 12:21",
            "label": "",
            "description": "A precise low pass is received by Roberto Hilbert (Bayer Leverkusen), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the left post."
        },
        {
            "gameTime": "2 - 11:28",
            "label": "",
            "description": "Aleksei Kulbakov couldn't ignore the rough tackle by Bebe (Benfica) and blew his whistle."
        },
        {
            "gameTime": "2 - 07:57",
            "label": "",
            "description": "Wow, what an escape. Josip Drmic (Bayer Leverkusen) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "2 - 07:14",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) gets on the end of a pass and takes a low shot from the edge of the box which is straight at Artur, who makes a comfortable save."
        },
        {
            "gameTime": "2 - 04:23",
            "label": "",
            "description": "A pass by Karim Bellarabi (Bayer Leverkusen) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 02:56",
            "label": "",
            "description": "Josip Drmic (Bayer Leverkusen) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee and the linesman both signal a throw in for Bayer Leverkusen."
        },
        {
            "gameTime": "2 - 00:14",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) is unable to feed an accurate cross into the box. The ball goes out of play and Benfica will have a goal kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Roger Schmidt makes a half time substitution. Julian Brandt (Bayer Leverkusen) comes on in place of Robbie Kruse."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We are watching a run of the mill game with only a few moments to ignite the crowd. The players surely can surely perform better, they just need to motivate themselves. Even first half from both sides, and they've both had chances. Pass and move. The home side have played some possession football so far, while the visitors have been patient as they wait for the right moment to hit them on the break."
        },
        {
            "gameTime": "1 - 45:08",
            "label": "whistle",
            "description": "Aleksei Kulbakov has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 44:14",
            "label": "",
            "description": "Josip Drmic (Bayer Leverkusen) picks up a pass and unleashes a low shot towards goal, but he can't generate enough power to trouble Artur."
        },
        {
            "gameTime": "1 - 42:54",
            "label": "",
            "description": "What a chance that is! Bebe (Benfica) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 42:15",
            "label": "",
            "description": "Aleksei Kulbakov blows his whistle after Karim Bellarabi (Bayer Leverkusen) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 41:48",
            "label": "",
            "description": "Bebe (Benfica) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 41:02",
            "label": "",
            "description": "Lima (Benfica) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the right post."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "",
            "description": "Loris Benito (Benfica) makes a reckless foul in order to win the ball from his opponent. Aleksei Kulbakov has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 39:54",
            "label": "",
            "description": "The ball is cleared after Ola John (Benfica) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 39:19",
            "label": "",
            "description": "Neat passing move from Benfica in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 37:29",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 35:57",
            "label": "y-card",
            "description": "Bryan Cristante (Benfica) is booked after bringing down an opponent. Aleksei Kulbakov had an easy decision to make."
        },
        {
            "gameTime": "1 - 35:05",
            "label": "",
            "description": "Bebe (Benfica) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 34:44",
            "label": "",
            "description": "Bebe (Benfica) takes a mid range free kick, but his miskick only goes into the stands. Poor shot!"
        },
        {
            "gameTime": "1 - 32:45",
            "label": "",
            "description": "Foul! Karim Bellarabi (Bayer Leverkusen) is penalised for pulling back his opponent. A free kick has been awarded to Benfica."
        },
        {
            "gameTime": "1 - 31:55",
            "label": "y-card",
            "description": "Omer Toprak (Bayer Leverkusen) has tested the patience of referee Aleksei Kulbakov and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 31:16",
            "label": "",
            "description": "Josip Drmic (Bayer Leverkusen) goes on a weaving run through the defence and gets within shooting range but his effort is blocked."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 29:20",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) takes a short corner kick."
        },
        {
            "gameTime": "1 - 28:48",
            "label": "",
            "description": "Bayer Leverkusen are enjoying possession, but one of the opposition players steps in to end the sequence. Bayer Leverkusen have a corner."
        },
        {
            "gameTime": "1 - 28:05",
            "label": "",
            "description": "The linesman raises his flag for offside before Omer Toprak (Bayer Leverkusen) heads on."
        },
        {
            "gameTime": "1 - 27:53",
            "label": "corner",
            "description": "Ola John (Benfica) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 27:05",
            "label": "",
            "description": "Ola John (Benfica) looks to break free, but an opposing player clears the ball away. The linesman points to the corner flag, Benfica are going to take it."
        },
        {
            "gameTime": "1 - 26:38",
            "label": "corner",
            "description": "A dangerous looking corner kick from Pizzi (Benfica) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 26:15",
            "label": "",
            "description": "Lima (Benfica) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort. The referee points to the corner flag and Benfica will take a corner."
        },
        {
            "gameTime": "1 - 25:59",
            "label": "corner",
            "description": "Good work from Benfica as they win a corner."
        },
        {
            "gameTime": "1 - 25:54",
            "label": "",
            "description": "Bebe (Benfica) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 25:41",
            "label": "y-card",
            "description": "Aleksei Kulbakov shows a yellow card to Sebastian Boenisch (Bayer Leverkusen) for his blatant foul."
        },
        {
            "gameTime": "1 - 23:39",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Andre Almeida (Benfica)."
        },
        {
            "gameTime": "1 - 22:33",
            "label": "",
            "description": "Simon Rolfes (Bayer Leverkusen) peeled away from his marker and got on the end of the corner, but his fine header towards the right post is brilliantly saved by the diving goalkeeper."
        },
        {
            "gameTime": "1 - 22:16",
            "label": "corner",
            "description": "Bayer Leverkusen get a corner."
        },
        {
            "gameTime": "1 - 22:11",
            "label": "",
            "description": "Bayer Leverkusen are playing some nice combination football, sending it precisely from player to player, but a defender shows good anticipation and ends the move with a good block."
        },
        {
            "gameTime": "1 - 21:30",
            "label": "",
            "description": "Flag goes up against Robbie Kruse (Bayer Leverkusen) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 20:27",
            "label": "",
            "description": "Pizzi (Benfica) covers his face with his hands after wasting a promising chance. He takes the rebound on the edge of the box but blazes the ball high over the crossbar."
        },
        {
            "gameTime": "1 - 19:58",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Pizzi (Benfica) takes it short."
        },
        {
            "gameTime": "1 - 19:43",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Ola John (Benfica). Benfica will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 18:51",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) fires the ball in from a mid range free kick, but it blazes over the bar."
        },
        {
            "gameTime": "1 - 17:55",
            "label": "",
            "description": "Lisandro Lopez (Benfica) was too aggressive in his challenge. The referee blows his whistle. A free kick to Bayer Leverkusen."
        },
        {
            "gameTime": "1 - 17:03",
            "label": "",
            "description": "Lima (Benfica) is flagged for offside."
        },
        {
            "gameTime": "1 - 14:27",
            "label": "",
            "description": "Ola John (Benfica) was too fierce in his attempt to get the ball from his opponent and Aleksei Kulbakov blows for a foul."
        },
        {
            "gameTime": "1 - 13:45",
            "label": "",
            "description": "Ola John (Benfica) produces an attempt from the edge of the box which would have most likely endangered the goalkeeper, but one of the defending players blocked it, so we can only speculate about the outcome."
        },
        {
            "gameTime": "1 - 12:59",
            "label": "",
            "description": "Bryan Cristante (Benfica) attempts to find one of his teammates with a ball from a free kick outside the box. The goalkeeper climbs high above all the players in the box to intercept the cross and snuff out the opportunity."
        },
        {
            "gameTime": "1 - 12:46",
            "label": "",
            "description": "Aleksei Kulbakov blows for a foul after Omer Toprak (Bayer Leverkusen) was too aggressive in the battle for the ball. It's a free kick to Benfica, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 10:52",
            "label": "",
            "description": "Lima (Benfica) gets to a rebound in the six yard box and his effort smashes off the crossbar."
        },
        {
            "gameTime": "1 - 09:34",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 09:16",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. Bayer Leverkusen win a corner."
        },
        {
            "gameTime": "1 - 08:34",
            "label": "",
            "description": "Robbie Kruse (Bayer Leverkusen) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 07:51",
            "label": "",
            "description": "Gonzalo Castro (Bayer Leverkusen) clearly handles the ball, but he is surprised when the referee blows his whistle."
        },
        {
            "gameTime": "1 - 06:12",
            "label": "",
            "description": "Derley (Benfica) gives away a foul for a clumsy challenge. Referee Aleksei Kulbakov saw the whole situation."
        },
        {
            "gameTime": "1 - 05:16",
            "label": "",
            "description": "A pass from Robbie Kruse (Bayer Leverkusen) is intercepted by Artur and the move breaks down."
        },
        {
            "gameTime": "1 - 04:05",
            "label": "",
            "description": "Dangerous play by Emir Spahic (Bayer Leverkusen). Aleksei Kulbakov blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 03:09",
            "label": "",
            "description": "The game is interrupted. Bryan Cristante (Benfica) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "1 - 00:03",
            "label": "",
            "description": "The players are on the pitch and Benfica will have the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Aleksei Kulbakov."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. Neither of the teams could take the initiative and dominate today's game. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Bayer Leverkusen",
    "gameDate": "09/12/2014 - 22:45",
    "gameHomeTeam": "Benfica",
    "gameScore": "0 - 0"
}