{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2015-09-26 - 16-30 1. FSV Mainz 05 0 - 3 Bayern Munich/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The Bayern Munich fans must be pleased with the performance of their team. They were absolutely the better of the two sides. It's obvious that defence had the highest priority for the home side. The away team made a lot of passes and attempted to maintain possession."
        },
        {
            "gameTime": "2 - 45:08",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "David Alaba (Bayern Munich) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "corner",
            "description": "Kingsley Coman (Bayern Munich) takes a short corner kick."
        },
        {
            "gameTime": "2 - 44:23",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. The ball is out of play. Bayern Munich win a corner kick."
        },
        {
            "gameTime": "2 - 43:51",
            "label": "",
            "description": "Bayern Munich are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 41:53",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Xabi Alonso (Bayern Munich)."
        },
        {
            "gameTime": "2 - 41:06",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) misses a good chance to score. An inch perfect cross into the box finds Robert Lewandowski (Bayern Munich) who rises for a header, but sends the ball well over the bar. Bayern Munich will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 39:43",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Bayern Munich was in an offside position."
        },
        {
            "gameTime": "2 - 37:45",
            "label": "corner",
            "description": "Daniel Brosinski (Mainz) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 37:30",
            "label": "",
            "description": "Leon Balogun (Mainz) sends a pass into the box, but his attempt is thwarted and cleared. 1. FSV Mainz 05 get a corner."
        },
        {
            "gameTime": "2 - 36:07",
            "label": "",
            "description": "Jairo Samperio (Mainz) trips an opposition player and Bastian Dankert signals a foul."
        },
        {
            "gameTime": "2 - 35:33",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Leon Balogun (Mainz) comes onto the pitch so that Christian Clemens can be given a rest."
        },
        {
            "gameTime": "2 - 34:57",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 31:19",
            "label": "",
            "description": "Christian Clemens (Mainz) shows off his amazing technique to get in front of goal by himself. He pulls the trigger but sends the ball onto the crossbar. Nice run, but unlucky finish!"
        },
        {
            "gameTime": "2 - 27:45",
            "label": "",
            "description": "Christian Clemens (Mainz) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the left post."
        },
        {
            "gameTime": "2 - 27:33",
            "label": "corner",
            "description": "The corner kick from Christian Clemens (Mainz) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 27:20",
            "label": "substitution",
            "description": "Martin Schmidt prepares a substitution. Danny Latza is replaced by Christoph Moritz (Mainz)."
        },
        {
            "gameTime": "2 - 26:52",
            "label": "corner",
            "description": "Christian Clemens (Mainz) launches a cross from the corner, but Manuel Neuer is alert to thwart the effort. 1. FSV Mainz 05 win a corner."
        },
        {
            "gameTime": "2 - 26:26",
            "label": "",
            "description": "Yoshinori Muto (Mainz) latches onto a cross into the box from the wing and gets in a header. It went well towards the goal, but it was blocked by one of the defenders. 1. FSV Mainz 05 force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 24:18",
            "label": "substitution",
            "description": "A substitution has been made. Douglas Costa goes off and Mario Gotze (Bayern Munich) comes on."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "",
            "description": "The linesman raises his flag. Robert Lewandowski (Bayern Munich) is adjudged offside."
        },
        {
            "gameTime": "2 - 22:37",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Douglas Costa sprays a pass out to Kingsley Coman (Bayern Munich), and he has an easy job to slot the ball into an empty net. The score is 0:3."
        },
        {
            "gameTime": "2 - 21:51",
            "label": "substitution",
            "description": "Here is a change. Javi Martinez is going off and Pep Guardiola gives the last tactical orders to Jerome Boateng (Bayern Munich)."
        },
        {
            "gameTime": "2 - 21:44",
            "label": "substitution",
            "description": "Substitution. Yunus Malli did his best and is replaced by Jairo Samperio (Mainz)."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "soccer-ball",
            "description": "Robert Lewandowski (Bayern Munich) receives the ball inside the box, reacts quickly and without any problems fires the ball into the back of the net."
        },
        {
            "gameTime": "2 - 17:01",
            "label": "",
            "description": "Douglas Costa swings in an inviting cross that finds Kingsley Coman (Bayern Munich). He doesn't take advantage as his effort goes harmlessly wide of the right post."
        },
        {
            "gameTime": "2 - 15:05",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) drills a low shot from the edge of the box after a brilliant solo effort. The ball heads towards the right post, but the goalkeeper denies him with a fantastic save."
        },
        {
            "gameTime": "2 - 13:04",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the bottom left corner. Loris Karius has a clear sight of it makes a comfortable save."
        },
        {
            "gameTime": "2 - 12:43",
            "label": "substitution",
            "description": "Arturo Vidal (Bayern Munich) joins the action as a substitute, replacing Thomas Muller."
        },
        {
            "gameTime": "2 - 12:23",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 10:44",
            "label": "",
            "description": "Stefan Bell (Mainz) is penalised for holding. Bastian Dankert signals a set piece."
        },
        {
            "gameTime": "2 - 09:07",
            "label": "",
            "description": "A cross from Philipp Lahm (Bayern Munich) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 07:59",
            "label": "",
            "description": "Christian Clemens (Mainz) takes a long range free kick and whips it into the box. The goalkeeper reads it well and leaps high to intercept the ball."
        },
        {
            "gameTime": "2 - 05:01",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Kingsley Coman sends a superb cross into the box. Robert Lewandowski (Bayern Munich) latches on to it and from near the penalty spot powers a header inside the left post, leaving Loris Karius beaten. He displayed his eye for goal there excellent finish. The score is 0:1."
        },
        {
            "gameTime": "2 - 03:49",
            "label": "",
            "description": "Daniel Brosinski (Mainz) swings a cross into the box, but it's far too close to Manuel Neuer, who smothers the ball."
        },
        {
            "gameTime": "2 - 01:20",
            "label": "",
            "description": "Yoshinori Muto (Mainz) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. Great display from Bayern Munich so far, looking at stats you have to say that they were the better side during that opening 45 minutes. It's obvious that defence has the highest priority for the home side. The away team makes a lot of passes and attempts to maintain possession."
        },
        {
            "gameTime": "1 - 45:08",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "",
            "description": "A precise low pass is received by Kingsley Coman (Bayern Munich), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well over the bar."
        },
        {
            "gameTime": "1 - 44:06",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball."
        },
        {
            "gameTime": "1 - 42:03",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) commits a foul and Bastian Dankert immediately signals a free kick."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "",
            "description": "A pass by Kingsley Coman (Bayern Munich) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 40:04",
            "label": "",
            "description": "Loris Karius blocks a long range effort from Thomas Muller (Bayern Munich) towards the middle of the goal."
        },
        {
            "gameTime": "1 - 39:14",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) receives a pass and decides to smash the ball from long range. His poor effort sails well wide of the left post."
        },
        {
            "gameTime": "1 - 38:59",
            "label": "",
            "description": "Pablo De Blasis (Mainz) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 35:59",
            "label": "",
            "description": "Pablo De Blasis (Mainz) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 34:54",
            "label": "",
            "description": "What a wasted chance that is! An inch perfect cross into the box finds Kingsley Coman (Bayern Munich) who sends his header well wide of the left post."
        },
        {
            "gameTime": "1 - 33:57",
            "label": "corner",
            "description": "The corner from Xabi Alonso (Bayern Munich) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 33:22",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) picks up the ball, dribbles to the edge of the penalty area and unleashes a brilliant shot to the roof of the net, but is thwarted by a great save from Loris Karius. The ball is out of play. A goal scoring opportunity from a corner for Bayern Munich."
        },
        {
            "gameTime": "1 - 27:46",
            "label": "y-card",
            "description": "Julian Baumgartlinger (Mainz) makes it easy for the referee to show him a yellow card."
        },
        {
            "gameTime": "1 - 27:35",
            "label": "",
            "description": "Julian Baumgartlinger (Mainz) commits a rough foul. Bastian Dankert stops the game and makes a call."
        },
        {
            "gameTime": "1 - 27:20",
            "label": "",
            "description": "Yoshinori Muto (Mainz) and his stunning dribble! He zig zags through the defence and gets in front of the keeper. He faints to shoot and then suddenly strikes goalwards, but his effort misses the target by a whisker. Very unlucky for Yoshinori Muto (Mainz). This could have been a legendary goal."
        },
        {
            "gameTime": "1 - 26:36",
            "label": "y-card",
            "description": "Xabi Alonso (Bayern Munich) gives the referee no choice but to show him a yellow card."
        },
        {
            "gameTime": "1 - 26:22",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) fouls an opponent. At least that's what referee Bastian Dankert signals."
        },
        {
            "gameTime": "1 - 26:01",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) produces a poor pass. He attempts to get the ball into the box but it's hacked away."
        },
        {
            "gameTime": "1 - 23:42",
            "label": "",
            "description": "Loris Karius reacts well to deny a long range free kick from David Alaba (Bayern Munich) towards the middle of the goal."
        },
        {
            "gameTime": "1 - 22:56",
            "label": "",
            "description": "Danny Latza (Mainz) commits a rough challenge and Bastian Dankert blows his whistle for a foul. Another situation results in a direct free kick for Bayern Munich."
        },
        {
            "gameTime": "1 - 21:33",
            "label": "",
            "description": "Flag up against Pablo De Blasis (Mainz). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 20:33",
            "label": "penalty-missed",
            "description": "Thomas Muller (Bayern Munich) doesn't keep his cool and fails to convert the penalty. He skies the ball way over the bar and into the stands."
        },
        {
            "gameTime": "1 - 20:27",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 19:55",
            "label": "penalty",
            "description": "Bastian Dankert blows his whistle after Pablo De Blasis (Mainz) kicks an opponent's legs instead of the ball. It's a penalty to Bayern Munich! Let's see who's going to take it."
        },
        {
            "gameTime": "1 - 18:25",
            "label": "",
            "description": "Christian Clemens (Mainz) sends over a free kick from long range but the defence is alert."
        },
        {
            "gameTime": "1 - 17:56",
            "label": "",
            "description": "Bastian Dankert blows his whistle and signals a foul after Thiago Alcantara (Bayern Munich) brought his opponent down."
        },
        {
            "gameTime": "1 - 16:53",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 14:40",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 14:12",
            "label": "",
            "description": "A pass from Danny Latza (Mainz) is intercepted by Manuel Neuer and the move breaks down."
        },
        {
            "gameTime": "1 - 12:42",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 12:04",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 10:14",
            "label": "",
            "description": "Bastian Dankert blows his whistle and it's Kingsley Coman (Bayern Munich) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 08:59",
            "label": "",
            "description": "The resulting free kick from Thiago Alcantara (Bayern Munich) ends up in the gloves of the keeper."
        },
        {
            "gameTime": "1 - 07:58",
            "label": "",
            "description": "Niko Bungert (Mainz) commits an ugly tackle on his opponent, but there is no caution from the referee. Bayern Munich are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 07:06",
            "label": "",
            "description": "Bayern Munich hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 03:09",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) wins the ball from the resulting corner but blazes it well over the bar."
        },
        {
            "gameTime": "1 - 03:01",
            "label": "corner",
            "description": "Corner kick. Douglas Costa (Bayern Munich) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 02:55",
            "label": "",
            "description": "David Alaba (Bayern Munich) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Good work from Bayern Munich as they win a corner."
        },
        {
            "gameTime": "1 - 00:48",
            "label": "",
            "description": "Christian Clemens (Mainz) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "1. FSV Mainz 05 will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Bastian Dankert."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bayern Munich have already won at home 15x this season, while from away matches they have managed to win 13x."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Mainz have earned 50 points so far in the competition, of which 28 points earned at home."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Yunus Malli is Mainz's leading goal scorer with 11 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The Bayern Munich fans must be pleased with the performance of their team. They were absolutely the better of the two sides. It's obvious that defence had the highest priority for the home side. The away team made a lot of passes and attempted to maintain possession."
        }
    ],
    "gameAwayTeam": "Bayern Munich",
    "gameDate": "26/09/2015 - 16:30",
    "gameHomeTeam": "1. FSV Mainz 05",
    "gameScore": "0 - 3"
}