{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-12-05 - 18-00 Real Madrid 4 - 1 Getafe/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was an entertaining 90 minutes of football. Both sides had good opportunities. Real Madrid were dominant and more threatening of the two sides. It was a fairly one sided match. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        },
        {
            "gameTime": "2 - 47:09",
            "label": "whistle",
            "description": "Antonio Mateu Lahoz is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 45:01",
            "label": "",
            "description": "Pablo Sarabia (Getafe) receives a pass and tries his luck with a shot from 20 metres out. Keylor Navas pulls off a decent save to stop the effort going into the bottom right corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:26",
            "label": "",
            "description": "The game is interrupted as Cristiano Ronaldo (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "2 - 42:55",
            "label": "funfact",
            "description": "The ball possession at the moment is 62:38."
        },
        {
            "gameTime": "2 - 41:19",
            "label": "substitution",
            "description": "A substitution has been made. Pepe is replaced by Alvaro Arbeloa (Real Madrid)."
        },
        {
            "gameTime": "2 - 39:53",
            "label": "",
            "description": "Toni Kroos (Real Madrid) tries his luck with a low long range effort after receiving a precise pass, but Guaita has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 38:00",
            "label": "",
            "description": "Neat passing move from Real Madrid in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 35:08",
            "label": "corner",
            "description": "Pedro Leon (Getafe) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 34:42",
            "label": "",
            "description": "Angel Lafita (Getafe) looks to break free, but an opposing player clears the ball away. The ball goes behind for a corner. Getafe will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 34:22",
            "label": "substitution",
            "description": "Francisco Escriba has decided to make a change. Bernard Mensah (Getafe) replaces Victor Rodriguez."
        },
        {
            "gameTime": "2 - 33:42",
            "label": "",
            "description": "Alexis (Getafe) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 33:14",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 33:00",
            "label": "substitution",
            "description": "Substitution. Karim Benzema leaves the pitch and is replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 31:17",
            "label": "injury",
            "description": "Alexis (Getafe) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 31:05",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 30:58",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "",
            "description": "Pablo Sarabia (Getafe) is penalised for a foul. Antonio Mateu Lahoz had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 28:30",
            "label": "",
            "description": "Pedro Leon (Getafe) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 27:55",
            "label": "corner",
            "description": "Pedro Leon (Getafe) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 27:00",
            "label": "",
            "description": "Pedro Leon (Getafe) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The ball is out of play. A goal scoring opportunity from a corner for Getafe."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "soccer-ball",
            "description": "Alexis (Getafe) jumped highest inside the box to meet a perfectly executed corner kick by Pedro Leon. His header was precise and ended up inside the left post, leaving the goalkeeper flapping in the wind. The score is 4:1."
        },
        {
            "gameTime": "2 - 24:49",
            "label": "corner",
            "description": "Pedro Leon (Getafe) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "",
            "description": "Pablo Sarabia (Getafe) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee points to the corner flag. It's a corner to Getafe."
        },
        {
            "gameTime": "2 - 22:48",
            "label": "attendance",
            "description": "The attendance for today's match is 64897."
        },
        {
            "gameTime": "2 - 21:00",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "2 - 19:56",
            "label": "",
            "description": "James Rodriguez (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "2 - 19:39",
            "label": "",
            "description": "A fine lofted pass into the box, sent by James Rodriguez (Real Madrid), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 18:54",
            "label": "",
            "description": "The Real Madrid players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "substitution",
            "description": "Rafael Benitez has decided to introduce fresh legs, with Mateo Kovacic (Real Madrid) replacing Luka Modric."
        },
        {
            "gameTime": "2 - 16:50",
            "label": "substitution",
            "description": "Substitution. Maciel Wanderson is replaced by Pedro Leon (Getafe)."
        },
        {
            "gameTime": "2 - 14:53",
            "label": "",
            "description": "Luka Modric (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 14:00",
            "label": "",
            "description": "Cala (Getafe) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 12:25",
            "label": "",
            "description": "Pepe (Real Madrid) was too forceful with his tackle and Antonio Mateu Lahoz interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 10:42",
            "label": "",
            "description": "Danilo (Real Madrid) sends a teasing cross into the area, but Guaita intercepts the ball."
        },
        {
            "gameTime": "2 - 09:24",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) and Gareth Bale attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 08:21",
            "label": "",
            "description": "tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 06:53",
            "label": "",
            "description": "Danilo (Real Madrid) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "injury",
            "description": "Danilo (Real Madrid) picks up an injury."
        },
        {
            "gameTime": "2 - 03:24",
            "label": "",
            "description": "Karim Benzema (Real Madrid) takes a mid range shot, but it lacks accuracy and it goes way over the bar."
        },
        {
            "gameTime": "2 - 02:47",
            "label": "",
            "description": "Pablo Sarabia (Getafe) makes an overly aggressive challenge and Antonio Mateu Lahoz blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 00:02",
            "label": "substitution",
            "description": "Francisco Escriba has decided to make a substitution during the half time break. Stefan Scepovic (Getafe) comes on the pitch for Alvaro Vazquez."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Antonio Mateu Lahoz starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Up to now it has been an action packed game full of wonderful movements and opportunities. Real Madrid enjoyed superiority over the opposition in that first 45 minutes. The home side attempts to hold onto the ball for as long as possible, while the away side focuses on defending and lets the opposition keep possession."
        },
        {
            "gameTime": "1 - 45:03",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 43:26",
            "label": "",
            "description": "Gareth Bale (Real Madrid) decides to try his luck with a first time bullet of a shot. Unfortunately for him, he doesn't hit the ball perfectly and his effort ends well wide of the left post."
        },
        {
            "gameTime": "1 - 41:51",
            "label": "",
            "description": "Angel Lafita (Getafe) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 40:00",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 37:57",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Superb finishing from Cristiano Ronaldo (Real Madrid). Toni Kroos plays a fantastic through ball and finds Cristiano Ronaldo (Real Madrid), who reacts quickly to get in front of the goalkeeper and fire a close range shot into the bottom left corner. 4:0."
        },
        {
            "gameTime": "1 - 36:55",
            "label": "y-card",
            "description": "The referee had an easy decision to make. A yellow card is given to Danilo (Real Madrid) for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 34:58",
            "label": "soccer-ball",
            "description": "Goal 3:0! Cristiano Ronaldo laid the ball off to Gareth Bale (Real Madrid), who shot from close range into the bottom left corner, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "1 - 32:53",
            "label": "",
            "description": "Gareth Bale (Real Madrid) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Guaita was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 30:44",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) comes close as his long range free kick goes a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 29:50",
            "label": "",
            "description": "The game is interrupted. One of the players from Getafe is cautioned for aggressive play. Real Madrid are awarded a free kick."
        },
        {
            "gameTime": "1 - 28:39",
            "label": "",
            "description": "Angel Lafita (Getafe) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "1 - 28:20",
            "label": "",
            "description": "This shall not pass! Gareth Bale (Real Madrid) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 27:18",
            "label": "",
            "description": "Pablo Sarabia (Getafe) shoots from the edge of the penalty area. The ball travels towards the middle of the target, but Keylor Navas easily deals with the threat."
        },
        {
            "gameTime": "1 - 26:31",
            "label": "",
            "description": "James Rodriguez (Real Madrid) receives a reproachful look from his teammates after he attempted to surprise the goalkeeper with a shot from long distance. The ball flew far wide of the right post."
        },
        {
            "gameTime": "1 - 25:44",
            "label": "",
            "description": "Damian Suarez (Getafe) collects a wonderful lead pass and as he has a lot of space, smashes a terrific shot from long range. His shot goes painfully close to the crossbar!"
        },
        {
            "gameTime": "1 - 24:11",
            "label": "",
            "description": "James Rodriguez (Real Madrid) sends a cross into the box, but Guaita comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 23:29",
            "label": "",
            "description": "Pablo Sarabia (Getafe) tackles a bit over zealously and Antonio Mateu Lahoz blows for a foul."
        },
        {
            "gameTime": "1 - 22:43",
            "label": "",
            "description": "What an opportunity! Gareth Bale (Real Madrid) picked the ball up and fired a projectile of a shot from long range which threatened the goalkeeper. The shot went painfully close to the right post!"
        },
        {
            "gameTime": "1 - 21:26",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "1 - 21:00",
            "label": "",
            "description": "Real Madrid are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 18:00",
            "label": "",
            "description": "Karim Benzema (Real Madrid) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear."
        },
        {
            "gameTime": "1 - 15:55",
            "label": "soccer-ball",
            "description": "Karim Benzema (Real Madrid) latches on to a precise pass deep inside the box from Gareth Bale, and he beats the goalkeeper with a low accurate shot into the bottom left corner. He makes it 2:0."
        },
        {
            "gameTime": "1 - 14:14",
            "label": "",
            "description": "is penalised for holding. Antonio Mateu Lahoz signals a set piece."
        },
        {
            "gameTime": "1 - 13:49",
            "label": "",
            "description": "Luka Modric (Real Madrid) swings a cross into the box, but it's far too close to Guaita, who smothers the ball."
        },
        {
            "gameTime": "1 - 11:02",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 10:27",
            "label": "",
            "description": "Guaita makes a superb save to deny a header which was nodded towards the roof of the net by Karim Benzema (Real Madrid) after a cross from the side. The ball is out of play and Real Madrid manage to earn a corner."
        },
        {
            "gameTime": "1 - 08:32",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 07:51",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes the resulting free kick from 20 metres out. He attempts to send his effort into the right side of the goal, but Guaita is alert and keeps the ball out. The referee and his assistant both point at the corner flag. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 06:55",
            "label": "",
            "description": "Antonio Mateu Lahoz blows for a foul after Alexis (Getafe) was too aggressive in the battle for the ball. Real Madrid will take a free kick."
        },
        {
            "gameTime": "1 - 05:42",
            "label": "corner",
            "description": "Pablo Sarabia (Getafe) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 04:59",
            "label": "",
            "description": "Angel Lafita (Getafe) fails to send a pass into the box as his effort is cut out. Getafe earn a corner."
        },
        {
            "gameTime": "1 - 04:00",
            "label": "soccer-ball",
            "description": "Pepe sends a precise lofted cross into the box. Karim Benzema (Real Madrid) latches on to it and finishes with a quick low shot into the middle of the goal. The goalkeeper had no chance. The score changes to 1:0."
        },
        {
            "gameTime": "1 - 02:50",
            "label": "",
            "description": "The cross into the penalty area from needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Getafe will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Mateu Lahoz was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an entertaining 90 minutes of football. Both sides had good opportunities. Real Madrid were dominant and more threatening of the two sides. It was a fairly one sided match. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        }
    ],
    "gameAwayTeam": "Getafe",
    "gameDate": "05/12/2015 - 18:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "4 - 1"
}