{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2016-12-16 - 22-30 Hoffenheim 2 - 2 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. It was an even match on the whole, with both sides enjoying spells in the ascendancy. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "",
            "description": "Baris Atik (Hoffenheim) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "2 - 46:42",
            "label": "substitution",
            "description": "Today's match ends for Pierre Emerick Aubameyang who will be replaced by Mikel Merino (Dortmund)."
        },
        {
            "gameTime": "2 - 45:01",
            "label": "",
            "description": "Adrian Ramos (Dortmund) commits a rough foul. Benjamin Brand stops the game and makes a call."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:06",
            "label": "",
            "description": "A big opportunity is wasted by Andrej Kramaric (Hoffenheim), who makes a yard for himself and produces a mid range rocket of a shot towards the right side of the goal. Unfortunately for him, Roman Weidenfeller pulls off a fantastic save to stop the effort."
        },
        {
            "gameTime": "2 - 42:40",
            "label": "attendance",
            "description": "The attendance is 30150."
        },
        {
            "gameTime": "2 - 41:19",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) steps up and sends the mid range free kick miles over the bar. Strong but inaccurate shot."
        },
        {
            "gameTime": "2 - 40:47",
            "label": "y-card",
            "description": "Benjamin Brand shows a yellow card to Kevin Vogt (Hoffenheim) for a tough tackle."
        },
        {
            "gameTime": "2 - 40:17",
            "label": "y-card",
            "description": "Caution goes to Sebastian Rudy (Hoffenheim)."
        },
        {
            "gameTime": "2 - 39:29",
            "label": "",
            "description": "Jeremy Toljan (Hoffenheim) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "2 - 38:42",
            "label": "",
            "description": "Adrian Ramos (Dortmund) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Benjamin Brand with no other option than to blow for a foul."
        },
        {
            "gameTime": "2 - 37:15",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Christian Pulisic walks off the pitch to be replaced by Adrian Ramos (Dortmund)."
        },
        {
            "gameTime": "2 - 36:41",
            "label": "",
            "description": "Sebastian Rudy (Hoffenheim) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "2 - 35:11",
            "label": "",
            "description": "Mario Gotze (Dortmund) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "2 - 33:55",
            "label": "",
            "description": "Sandro Wagner (Hoffenheim) receives a pass and fires a shot in from long range, but it's blocked."
        },
        {
            "gameTime": "2 - 32:03",
            "label": "",
            "description": "Benjamin Brand interrupts the game for a tactical foul by Pavel Kaderabek (Hoffenheim)."
        },
        {
            "gameTime": "2 - 31:13",
            "label": "corner",
            "description": "Emre Mor (Dortmund) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 30:46",
            "label": "",
            "description": "Christian Pulisic (Dortmund) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The referee and his assistant both point at the corner flag. Dortmund will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 30:11",
            "label": "",
            "description": "Jeremy Toljan (Hoffenheim) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "2 - 27:48",
            "label": "",
            "description": "Mario Gotze (Dortmund) makes a strong challenge and Benjamin Brand blows for a foul."
        },
        {
            "gameTime": "2 - 27:07",
            "label": "",
            "description": "Jeremy Toljan (Hoffenheim) shoots from the edge of the penalty area. The ball travels towards the left side of the target, but Roman Weidenfeller easily deals with the threat."
        },
        {
            "gameTime": "2 - 25:24",
            "label": "corner",
            "description": "The resulting corner from Nadiem Amiri (Hoffenheim) is cleared."
        },
        {
            "gameTime": "2 - 24:56",
            "label": "",
            "description": "Pavel Kaderabek (Hoffenheim) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The referee signals a corner kick to Hoffenheim."
        },
        {
            "gameTime": "2 - 23:39",
            "label": "substitution",
            "description": "Ousmane Dembele is being substituted because of an injury. Thomas Tuchel sends Emre Mor (Dortmund) on the pitch."
        },
        {
            "gameTime": "2 - 21:23",
            "label": "injury",
            "description": "Ousmane Dembele (Dortmund) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 20:39",
            "label": "",
            "description": "Benjamin Brand couldn't ignore the rough tackle by Sebastian Rudy (Hoffenheim) and blew his whistle."
        },
        {
            "gameTime": "2 - 19:09",
            "label": "",
            "description": "The Hoffenheim players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 17:13",
            "label": "",
            "description": "Baris Atik (Hoffenheim) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 15:22",
            "label": "substitution",
            "description": "Substitution. Baris Atik (Hoffenheim) receives a signal from the referee and is now allowed to enter the pitch as Kerem Demirbay walks off."
        },
        {
            "gameTime": "2 - 14:16",
            "label": "injury",
            "description": "Ousmane Dembele (Dortmund) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 13:56",
            "label": "",
            "description": "Andrej Kramaric (Hoffenheim) is flagged for offside."
        },
        {
            "gameTime": "2 - 13:35",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 12:50",
            "label": "substitution",
            "description": "The substitution is prepared. Andrej Kramaric (Hoffenheim) joins the action as a substitute, replacing Mark Uth."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "y-card",
            "description": "Benjamin Brand shows a yellow card to Kerem Demirbay (Hoffenheim), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 11:33",
            "label": "",
            "description": "Benjamin Brand has a clear sight and sees a foul from Sven Bender (Dortmund)."
        },
        {
            "gameTime": "2 - 10:53",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "2 - 10:12",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. The ball is out of play and the linesman points at the corner flag. Corner to Dortmund."
        },
        {
            "gameTime": "2 - 09:15",
            "label": "",
            "description": "Pavel Kaderabek (Hoffenheim) thinks that he is fouled by his opponent, but the referee deems him to be the one who commits a foul and awards a free kick to the other team."
        },
        {
            "gameTime": "2 - 08:30",
            "label": "",
            "description": "Kerem Demirbay (Hoffenheim) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 07:35",
            "label": "",
            "description": "Dangerous play by Sandro Wagner (Hoffenheim). Benjamin Brand blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 05:35",
            "label": "",
            "description": "This was a piece of cake for Oliver Baumann. Pierre Emerick Aubameyang (Dortmund) found himself some space after latching on to a pass, but his strike only went low to the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 03:00",
            "label": "soccer-ball",
            "description": "GOAL! Pierre Emerick Aubameyang (Dortmund) collects a pass and from inside the box he lifts the ball over Oliver Baumann, who was off his line. What a finish that is! 2:2."
        },
        {
            "gameTime": "2 - 02:00",
            "label": "",
            "description": "Sandro Wagner (Hoffenheim) smashed a volley without hesitation from near the penalty spot, but it only rattled the right post!"
        },
        {
            "gameTime": "2 - 01:11",
            "label": "",
            "description": "Christian Pulisic (Dortmund) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "There was plenty of entertainment during the first 45 minutes. Hopefully more of the same in the second half. It's difficult to say if one side enjoyed any superiority over the other in the first half. The home team's main weapon is fast counter attacks, while the away side attempts to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:12",
            "label": "",
            "description": "Sandro Wagner (Hoffenheim) gets on the ball and beats an opponent, but his run is stopped by the referee Benjamin Brand who sees an offensive foul."
        },
        {
            "gameTime": "1 - 42:46",
            "label": "",
            "description": "Pavel Kaderabek (Hoffenheim) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 41:49",
            "label": "",
            "description": "What a chance that is! Sandro Wagner (Hoffenheim) displays good awareness near the penalty spot to get on the end of a cross from the free kick, but he steers his header narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 40:29",
            "label": "yr-card",
            "description": "Marco Reus (Dortmund) should have been more careful. He commits a bad foul, receives his second yellow card and is sent off!"
        },
        {
            "gameTime": "1 - 38:48",
            "label": "y-card",
            "description": "Benjamini Hubner (Hoffenheim) has tested the patience of referee Benjamin Brand and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 37:03",
            "label": "",
            "description": "Marco Reus (Dortmund) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 36:26",
            "label": "injury",
            "description": "Marco Reus (Dortmund) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 35:38",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 35:24",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety. Dortmund have a corner."
        },
        {
            "gameTime": "1 - 34:55",
            "label": "",
            "description": "Christian Pulisic (Dortmund) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 33:23",
            "label": "",
            "description": "Sven Bender (Dortmund) commits a foul after bringing down his opponent with a slide tackle."
        },
        {
            "gameTime": "1 - 32:07",
            "label": "",
            "description": "Sven Bender (Dortmund) trips an opposition player and Benjamin Brand signals a foul."
        },
        {
            "gameTime": "1 - 31:36",
            "label": "",
            "description": "Marco Reus clips a neat ball into the box towards Marcel Schmelzer (Dortmund), whose header from the centre of the box goes narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 30:53",
            "label": "",
            "description": "Benjamin Brand blows his whistle after Mark Uth (Hoffenheim) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 30:36",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) gets to the rebound and shoots, but the effort is blocked."
        },
        {
            "gameTime": "1 - 29:26",
            "label": "y-card",
            "description": "Niklas Sule (Hoffenheim) sees a yellow card from Benjamin Brand after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "y-card",
            "description": "A yellow card for a tackle by Marc Bartra (Dortmund). Benjamin Brand doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 26:51",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 26:22",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Christian Pulisic (Dortmund), is intercepted by the opposition's defence. The referee blows his whistle, Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 24:57",
            "label": "",
            "description": "Sebastian Rudy (Hoffenheim) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "1 - 24:38",
            "label": "",
            "description": "Matthias Ginter (Dortmund) plays a through ball which would have led to a great opportunity, if it hadn't been stopped by the defence."
        },
        {
            "gameTime": "1 - 23:42",
            "label": "",
            "description": "Mark Uth (Hoffenheim) gives away a foul for a clumsy challenge. Referee Benjamin Brand saw the whole situation."
        },
        {
            "gameTime": "1 - 22:37",
            "label": "",
            "description": "Sebastian Rudy (Hoffenheim) makes a driving run into the box but he cannot work any space for a shot."
        },
        {
            "gameTime": "1 - 19:42",
            "label": "soccer-ball",
            "description": "Goal! Nice headed pass by Benjamini Hubner to Sandro Wagner (Hoffenheim), who latches on to it and puts the ball into the back of the net with a fine header. 2:1."
        },
        {
            "gameTime": "1 - 19:20",
            "label": "corner",
            "description": "Corner kick. Sebastian Rudy (Hoffenheim) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 18:43",
            "label": "",
            "description": "Kerem Demirbay (Hoffenheim) has a good chance to score with a mid range attempt after collecting a pass. He aims for the right side of the goal, but he can't generate enough power to trouble Roman Weidenfeller. Good work from Hoffenheim as they win a corner."
        },
        {
            "gameTime": "1 - 17:49",
            "label": "",
            "description": "The linesman raises his flag. Marcel Schmelzer (Dortmund) is adjudged offside."
        },
        {
            "gameTime": "1 - 16:53",
            "label": "",
            "description": "The referee blows his whistle as Nadiem Amiri (Hoffenheim) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 15:19",
            "label": "",
            "description": "Benjamin Brand blows for a foul after Marc Bartra (Dortmund) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 14:57",
            "label": "",
            "description": "The free kick is taken by Marco Reus (Dortmund), but ball is cleared."
        },
        {
            "gameTime": "1 - 14:20",
            "label": "",
            "description": "The game is interrupted. Sandro Wagner (Hoffenheim) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "1 - 13:02",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Mario Gotze (Dortmund)."
        },
        {
            "gameTime": "1 - 12:48",
            "label": "",
            "description": "Dortmund seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 10:30",
            "label": "soccer-ball",
            "description": "It's in! Ousmane Dembele spots his teammate in a good position on the edge of the box and provides him with a nice pass. Mario Gotze (Dortmund) doesn't think twice and rifles a first time shot into the bottom right corner. The score is now 1:1."
        },
        {
            "gameTime": "1 - 08:59",
            "label": "y-card",
            "description": "Marco Reus (Dortmund) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Benjamin Brand ignores the protests."
        },
        {
            "gameTime": "1 - 07:54",
            "label": "",
            "description": "Benjamini Hubner (Hoffenheim) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 07:07",
            "label": "",
            "description": "Marc Bartra (Dortmund) jumps into a tackle and Benjamin Brand blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 06:21",
            "label": "",
            "description": "Marco Reus sprays a wonderful pass out to Pierre Emerick Aubameyang (Dortmund), who cannot get enough power or direction to cause Oliver Baumann problems and the goalkeeper is able to watch the ball go just wide of the right post."
        },
        {
            "gameTime": "1 - 05:40",
            "label": "",
            "description": "Matthias Ginter sends a terrific cross into the box. Marcel Schmelzer (Dortmund) gets on the end of it but his header from the centre of the box goes just over the bar."
        },
        {
            "gameTime": "1 - 04:53",
            "label": "",
            "description": "A lofted cross from Marco Reus (Dortmund) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 02:44",
            "label": "soccer-ball",
            "description": "Mark Uth (Hoffenheim) dribbles into the box and fires the ball inside the right post. The goalkeeper had no chance. Sensational solo goal."
        },
        {
            "gameTime": "1 - 02:20",
            "label": "",
            "description": "Matthias Ginter (Dortmund) is able to continue to play."
        },
        {
            "gameTime": "1 - 01:19",
            "label": "injury",
            "description": "The game is interrupted now, Matthias Ginter (Dortmund) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Benjamin Brand will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The best result this season for Dortmund was a 6:0 victory."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang from Dortmund will look to add to his goal tally, he has netted 15 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hoffenheim have already 10 home victories this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sandro Wagner is the leading goal scorer for Hoffenheim with 7 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. It was an even match on the whole, with both sides enjoying spells in the ascendancy. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "16/12/2016 - 22:30",
    "gameHomeTeam": "Hoffenheim",
    "gameScore": "2 - 2"
}