{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-10-22 - 19-30 Liverpool 2 - 1 West Brom/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. The hosts were superior today. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        },
        {
            "gameTime": "2 - 48:32",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 45:55",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to make a change. Divock Origi (Liverpool) replaces Sadio Mane."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 42:55",
            "label": "substitution",
            "description": "That's the end of the game for Philippe Coutinho, who is replaced by Lucas Leiva (Liverpool)."
        },
        {
            "gameTime": "2 - 42:54",
            "label": "y-card",
            "description": "Jordan Henderson (Liverpool) receives a yellow card."
        },
        {
            "gameTime": "2 - 41:59",
            "label": "attendance",
            "description": "The attendance is 53218."
        },
        {
            "gameTime": "2 - 41:25",
            "label": "",
            "description": "Hal Robson Kanu (West Brom) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 39:30",
            "label": "y-card",
            "description": "The referee gives a yellow card to James Morrison (West Brom)."
        },
        {
            "gameTime": "2 - 38:33",
            "label": "",
            "description": "Ben Foster pulls off a great save to deny Roberto Firmino (Liverpool), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "2 - 38:08",
            "label": "",
            "description": "Gareth McAuley (West Brom) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 35:34",
            "label": "soccer-ball",
            "description": "Gareth McAuley (West Brom) scores from the corner kick. The ball slipped through the box to Gareth McAuley (West Brom) and he slotted it past the goalkeeper."
        },
        {
            "gameTime": "2 - 35:32",
            "label": "corner",
            "description": "Chris Brunt (West Brom) will take the corner."
        },
        {
            "gameTime": "2 - 35:31",
            "label": "",
            "description": "Chris Brunt (West Brom) serves up a nice cross, but Loris Karius punches the ball away. Good work from West Brom as they win a corner."
        },
        {
            "gameTime": "2 - 34:26",
            "label": "corner",
            "description": "James Milner (Liverpool) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 33:57",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to substitute Adam Lallana and he is replaced by Georginio Wijnaldum (Liverpool)."
        },
        {
            "gameTime": "2 - 33:24",
            "label": "",
            "description": "Roberto Firmino (Liverpool) races towards goal but the defender gets back well to make a challenge. Liverpool force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 30:17",
            "label": "funfact",
            "description": "21:6 – the total goal attempt statistics."
        },
        {
            "gameTime": "2 - 27:01",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 26:48",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from James Milner (Liverpool). It will be a corner kick for Liverpool."
        },
        {
            "gameTime": "2 - 24:16",
            "label": "corner",
            "description": "Chris Brunt (West Brom) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 23:21",
            "label": "",
            "description": "The ball is cleared after Jose Rondon (West Brom) attempted to dribble past an opposing player. The ball goes behind for a corner. West Brom will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 20:42",
            "label": "",
            "description": "James Milner (Liverpool) unleashes a shot from the edge of the box, but it goes straight at Ben Foster."
        },
        {
            "gameTime": "2 - 20:14",
            "label": "",
            "description": "Wow, what an escape. Emre Can (Liverpool) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "2 - 19:21",
            "label": "substitution",
            "description": "Here comes a substitution. James McClean is given a rest as he is replaced by Hal Robson Kanu (West Brom)."
        },
        {
            "gameTime": "2 - 17:38",
            "label": "",
            "description": "Allan Nyom (West Brom) commits a rough challenge and Neil Swarbrick blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 14:50",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 14:37",
            "label": "",
            "description": "James Milner (Liverpool) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. The referee points to the corner flag. It's a corner to Liverpool."
        },
        {
            "gameTime": "2 - 12:40",
            "label": "",
            "description": "Dejan Lovren (Liverpool) rises above the defence and heads a precise cross towards the left post. His effort, however, is blocked by Ben Foster, who pulls off a stunning save!"
        },
        {
            "gameTime": "2 - 12:00",
            "label": "y-card",
            "description": "Today's referee Neil Swarbrick rightly decides to book James McClean (West Brom) for his harsh tackle."
        },
        {
            "gameTime": "2 - 11:39",
            "label": "",
            "description": "Roberto Firmino (Liverpool) misses a good chance to score. An inch perfect cross into the box finds Roberto Firmino (Liverpool) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 08:41",
            "label": "",
            "description": "Roberto Firmino (Liverpool) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 05:45",
            "label": "substitution",
            "description": "It's time for a substitution. James Morrison (West Brom) comes on in place of Matt Phillips."
        },
        {
            "gameTime": "2 - 04:48",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) sends a pass into the penalty area, but the opponent manages to cut it out."
        },
        {
            "gameTime": "2 - 03:58",
            "label": "",
            "description": "Ben Foster is alert and has a clear sight of a long through ball from Philippe Coutinho (Liverpool). Easy save!"
        },
        {
            "gameTime": "2 - 01:53",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 00:32",
            "label": "substitution",
            "description": "The game is over for Claudio Yacob. Chris Brunt (West Brom) comes on for the second half."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Neil Swarbrick blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have been witnesses to an ordinary game without many breathtaking situations, but there is still time for improvement in the second half. The home side were more active and dominant in the first half. The opposition found it tough to keep up. The home team is playing possession football and the away team is basing its game on a well organized defence."
        },
        {
            "gameTime": "1 - 45:55",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 42:09",
            "label": "y-card",
            "description": "Claudio Yacob (West Brom) gets a yellow card. The referee Neil Swarbrick made the right call."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "",
            "description": "Roberto Firmino (Liverpool) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 37:22",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the right post."
        },
        {
            "gameTime": "1 - 34:12",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Sadio Mane, who plays a vital role in the build up. He squares it to Philippe Coutinho (Liverpool), who beats Ben Foster with a brilliant shot into the bottom left corner. 2:0."
        },
        {
            "gameTime": "1 - 32:54",
            "label": "",
            "description": "Half chance! Nathaniel Clyne (Liverpool) plays a pass into the box, but Ben Foster reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 31:33",
            "label": "",
            "description": "Adam Lallana (Liverpool) controls the ball and sets off to face the goalkeeper, but deep inside the box the ball bounces up on the uneven surface and makes him miss the strike, sending the ball well over the goal."
        },
        {
            "gameTime": "1 - 29:57",
            "label": "funfact",
            "description": "The current number of corner kicks is 3:2."
        },
        {
            "gameTime": "1 - 26:31",
            "label": "",
            "description": "A cross by Nathaniel Clyne (Liverpool) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "1 - 25:45",
            "label": "",
            "description": "Liverpool keep the ball and are displaying some tiki taka style passing at the moment."
        },
        {
            "gameTime": "1 - 22:16",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "1 - 19:35",
            "label": "soccer-ball",
            "description": "It's a goal! Sadio Mane (Liverpool) scores with a brilliant shot into the left side of the goal after being released inside the box by a superb lofted pass from Roberto Firmino. The score is now 0:0."
        },
        {
            "gameTime": "1 - 17:37",
            "label": "",
            "description": "James Milner (Liverpool) misses a good chance to score. A perfect cross into the box finds James Milner (Liverpool) who rises for a header, but he sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 17:07",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "1 - 16:22",
            "label": "",
            "description": "Sadio Mane (Liverpool) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 13:50",
            "label": "",
            "description": "Matt Phillips (West Brom) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 09:01",
            "label": "",
            "description": "Roberto Firmino (Liverpool) is penalised for a foul. Neil Swarbrick had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 08:01",
            "label": "",
            "description": "Good movement by Craig Dawson (West Brom), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "1 - 05:46",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender."
        },
        {
            "gameTime": "1 - 05:03",
            "label": "",
            "description": "Jose Rondon (West Brom) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 02:04",
            "label": "",
            "description": "A cross from Adam Lallana (Liverpool) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and West Brom will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Neil Swarbrick is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last 3 West Brom matches ended in a tie."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool have not lost for 6 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sadio Mane is the leading goal scorer for Liverpool with 7 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. The hosts were superior today. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        }
    ],
    "gameAwayTeam": "West Brom",
    "gameDate": "22/10/2016 - 19:30",
    "gameHomeTeam": "Liverpool",
    "gameScore": "2 - 1"
}