{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-15 - 21-45 Paris SG 2 - 0 Malmo FF/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. The home side were superior in this game. The tactic of the home side was slow build up play, while the away team's main priority was a flawless defence."
        },
        {
            "gameTime": "2 - 47:43",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 47:20",
            "label": "",
            "description": "GOAL DISALLOWED! Controversy and anger as Edinson Cavani (Paris SG) has a goal ruled out, incredibly, for offside."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "corner",
            "description": "Ezequiel Lavezzi (Paris SG) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 46:25",
            "label": "",
            "description": "Johan Wiland makes a sensational save to thwart a great chance. A rebound falls to Ezequiel Lavezzi (Paris SG) on the edge of the box and he strikes goalwards, but the ball ends up in the keeper's gloves instead of the bottom left corner. Paris SG have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:53",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) collects a wonderful lead pass and creates some space to smash the ball goalwards from long range. His shot goes painfully close to the right post!"
        },
        {
            "gameTime": "2 - 44:08",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 43:14",
            "label": "",
            "description": "A pass from Markus Rosenberg (Malmo FF) is intercepted by Kevin Trapp and the move breaks down."
        },
        {
            "gameTime": "2 - 41:57",
            "label": "",
            "description": "Ezequiel Lavezzi (Paris SG) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 39:24",
            "label": "substitution",
            "description": "Age Hareide has decided to introduce fresh legs, with Erdal Rakip (Malmo FF) replacing Enoch Adu."
        },
        {
            "gameTime": "2 - 39:20",
            "label": "substitution",
            "description": "Substitution. Angel Di Maria will be replaced by Ezequiel Lavezzi (Paris SG)."
        },
        {
            "gameTime": "2 - 38:37",
            "label": "",
            "description": "Angel Di Maria (Paris SG) plays a through ball but overhits it."
        },
        {
            "gameTime": "2 - 37:07",
            "label": "",
            "description": "Angel Di Maria (Paris SG) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 36:36",
            "label": "",
            "description": "Edinson Cavani (Paris SG) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 35:49",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) sends a cross into the box, but Johan Wiland comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 34:44",
            "label": "",
            "description": "Johan Wiland makes a brilliant save! Angel Di Maria (Paris SG) easily weaves through the defence and unleashes a shot from just outside of the box. His effort goes towards the middle of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "2 - 33:40",
            "label": "",
            "description": "Nikola Djurdjic (Malmo FF) meets a delivery on the edge of the penalty area and shoots towards to the bottom left corner. He didn't put enough power into the effort, though, and Kevin Trapp pulls off an easy save."
        },
        {
            "gameTime": "2 - 32:16",
            "label": "",
            "description": "Thiago Silva (Paris SG) makes an overly aggressive challenge and Sergey Karasev blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 30:51",
            "label": "",
            "description": "Marco Verratti (Paris SG) collects a wonderful lead pass and creates some space to smash the ball goalwards from long range. His shot goes painfully wide of the left post!"
        },
        {
            "gameTime": "2 - 29:43",
            "label": "substitution",
            "description": "The game has come to an end for Zlatan Ibrahimovic. He has contributed as much as he could today. He will be replaced by the fresh legs of Javier Pastore (Paris SG)."
        },
        {
            "gameTime": "2 - 29:18",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 28:10",
            "label": "",
            "description": "Angel Di Maria (Paris SG) is having a lively performance. He is causing problems and wanting the ball at every opportunity."
        },
        {
            "gameTime": "2 - 26:11",
            "label": "funfact",
            "description": "Here's the current ball possession statistics for both teams – 69:31."
        },
        {
            "gameTime": "2 - 25:28",
            "label": "y-card",
            "description": "David Luiz (Paris SG) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 24:35",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "2 - 23:18",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Blaise Matuidi (Paris SG). Sergey Karasev saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "2 - 22:54",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 22:29",
            "label": "",
            "description": "David Luiz (Paris SG) wastes a great chance from the resulting corner. He times his header superbly when he leaps high to meet a precise cross, but can't aim better than into the middle of the goal, straight into the arms of the goalkeeper. The ball goes out for a corner. Paris SG can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 22:06",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 21:52",
            "label": "",
            "description": "Angel Di Maria (Paris SG) flights in the cross, but the defender is alert and clears to safety. The ball goes out of play and Paris SG have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 20:43",
            "label": "",
            "description": "Vladimir Rodic (Malmo FF) creates some space for himself to pick up a pass on the edge of the box and unleashes a decent strike which goes a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 19:52",
            "label": "y-card",
            "description": "The referee has issued a yellow card to Marco Verratti (Paris SG)."
        },
        {
            "gameTime": "2 - 19:35",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 18:40",
            "label": "y-card",
            "description": "Rasmus Bengtsson (Malmo FF) sees a yellow card from Sergey Karasev after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 18:39",
            "label": "",
            "description": "Edinson Cavani (Paris SG) latches on to a precise pass and one on one with the keeper slams the ball towards the left hand post. Johan Wiland is alert, though, and leaps like a salmon to deny him. Paris SG will take a corner kick."
        },
        {
            "gameTime": "2 - 15:16",
            "label": "soccer-ball",
            "description": "GOAL! Zlatan Ibrahimovic connects with a delightful cross and heads it towards Edinson Cavani (Paris SG), whose header goes past Johan Wiland. 2:0."
        },
        {
            "gameTime": "2 - 14:07",
            "label": "",
            "description": "David Luiz (Paris SG) is flagged for offside."
        },
        {
            "gameTime": "2 - 13:47",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) works the corner short."
        },
        {
            "gameTime": "2 - 13:21",
            "label": "",
            "description": "That was a nice football moment. Maxwell (Paris SG) receives an amazing defence splitting low pass on the edge of the box and blasts the ball towards the right post. Johan Wiland guesses his intention and dives superbly to deny him with a remarkable save! The referee signals a corner kick to Paris SG."
        },
        {
            "gameTime": "2 - 11:41",
            "label": "y-card",
            "description": "The foul by Enoch Adu (Malmo FF) is worthy of a card and a yellow is duly shown by Sergey Karasev."
        },
        {
            "gameTime": "2 - 09:29",
            "label": "",
            "description": "Enoch Adu (Malmo FF) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 08:31",
            "label": "corner",
            "description": "The corner from Yoshimar Yotun (Malmo FF) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 08:18",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) tries to send the ball in front of the goal, but the opposition's defence averts the threat. The referee points to the corner flag. It's a corner to Malmo FF."
        },
        {
            "gameTime": "2 - 07:31",
            "label": "",
            "description": "David Luiz (Paris SG) rises above the defence to meet the corner. His timing is good, but he arrows his header just a few inches wide of the right post."
        },
        {
            "gameTime": "2 - 07:22",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) will take the corner."
        },
        {
            "gameTime": "2 - 06:47",
            "label": "",
            "description": "Angel Di Maria (Paris SG) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the left hand post, but Johan Wiland was alert and the score remains the same. Corner kick. Paris SG will have an opportunity."
        },
        {
            "gameTime": "2 - 05:14",
            "label": "corner",
            "description": "Vladimir Rodic (Malmo FF) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 04:58",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The ball is out of play and Malmo FF manage to earn a corner."
        },
        {
            "gameTime": "2 - 04:25",
            "label": "",
            "description": "The ball is cleared after Zlatan Ibrahimovic (Paris SG) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 03:43",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) is caught offside!"
        },
        {
            "gameTime": "2 - 02:26",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 02:02",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 00:56",
            "label": "",
            "description": "Edinson Cavani (Paris SG) receives a reproachful look from Angel Di Maria. He latches on to his pass, but the effort from the edge of the box sails high over the crossbar."
        },
        {
            "gameTime": "2 - 00:13",
            "label": "substitution",
            "description": "Age Hareide makes a switch. Vladimir Rodic (Malmo FF) is coming on in place of Felipe Carvalho at the start of the second period."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "There was certainly plenty of action during that opening 45 minutes. The hosts are mostly controlling the match and making it pretty tough for the opposition to keep up. The tactic of the home side is slow build up play, while the away team's main priority is a flawless defence."
        },
        {
            "gameTime": "1 - 45:10",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 44:32",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 44:21",
            "label": "",
            "description": "The ball goes behind for a corner. Paris SG will have an opportunity to threaten the opposition's goal. Gregory van der Wiel (Paris SG) sends a teasing cross into the area, but Johan Wiland intercepts the ball."
        },
        {
            "gameTime": "1 - 41:22",
            "label": "",
            "description": "The free kick from a promising distance is taken by Zlatan Ibrahimovic (Paris SG), who fires in a direct effort inches over the crossbar. What a chance!"
        },
        {
            "gameTime": "1 - 40:29",
            "label": "",
            "description": "Kari Arnason (Malmo FF) pulls the shirt of his opponent and the referee stops play for a foul. Paris SG are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 39:43",
            "label": "",
            "description": "David Luiz (Paris SG) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 38:20",
            "label": "",
            "description": "Thiago Motta (Paris SG) jumps into a tackle and Sergey Karasev blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 36:54",
            "label": "",
            "description": "Angel Di Maria (Paris SG) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "1 - 36:12",
            "label": "",
            "description": "Kari Arnason (Malmo FF) gives away a foul for a clumsy challenge. Referee Sergey Karasev saw the whole situation."
        },
        {
            "gameTime": "1 - 35:09",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "1 - 34:45",
            "label": "",
            "description": "Angel Di Maria (Paris SG) tries to slide the ball through to a teammate but it's well blocked by a defender. Paris SG earn a corner."
        },
        {
            "gameTime": "1 - 34:26",
            "label": "corner",
            "description": "The resulting corner from Angel Di Maria (Paris SG) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 34:13",
            "label": "",
            "description": "Maxwell (Paris SG) fails to find any of his teammates inside the box as his pass is blocked. The referee and one of his assistants signal for a corner kick to Paris SG."
        },
        {
            "gameTime": "1 - 33:34",
            "label": "",
            "description": "Wasted opportunity. Nikola Djurdjic (Malmo FF) gets to the rebound inside the box and smashes the ball just wide of the right post."
        },
        {
            "gameTime": "1 - 32:44",
            "label": "",
            "description": "What a chance that is! Angel Di Maria (Paris SG) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 31:17",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 29:52",
            "label": "corner",
            "description": "The corner kick from Angel Di Maria (Paris SG) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "",
            "description": "Marco Verratti (Paris SG) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. Paris SG win a corner."
        },
        {
            "gameTime": "1 - 28:57",
            "label": "",
            "description": "Angel Di Maria (Paris SG) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 27:30",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) swings a cross into the box, but it's far too close to Johan Wiland, who smothers the ball."
        },
        {
            "gameTime": "1 - 27:08",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) brings down his opponent with a very late tackle."
        },
        {
            "gameTime": "1 - 25:46",
            "label": "",
            "description": "Sergey Karasev blows his whistle and it's Markus Rosenberg (Malmo FF) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 23:17",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "1 - 22:51",
            "label": "",
            "description": "The Paris SG players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 21:15",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 20:50",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Angel Di Maria (Paris SG). The referee points to the corner flag and Paris SG will take a corner."
        },
        {
            "gameTime": "1 - 19:54",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) makes contact with a cross and strikes a shot that lacks the power to find the back of the net, but the goalkeeper still has to make a good save to keep his effort out."
        },
        {
            "gameTime": "1 - 18:56",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) pounces on the rebound on the edge of the box but his wild shot goes high over the crossbar."
        },
        {
            "gameTime": "1 - 17:39",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Zlatan Ibrahimovic (Paris SG) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "1 - 16:56",
            "label": "",
            "description": "Jo Inge Berget (Malmo FF) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 15:59",
            "label": "",
            "description": "This was a piece of cake for Johan Wiland. Zlatan Ibrahimovic (Paris SG) found himself some space after latching on to a pass, but his strike only went towards the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "1 - 14:28",
            "label": "",
            "description": "What a wasted chance that is! A precise cross into the box found Zlatan Ibrahimovic (Paris SG), whose header floated just over the bar."
        },
        {
            "gameTime": "1 - 13:30",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 12:54",
            "label": "",
            "description": "Nikola Djurdjic (Malmo FF) makes a slide tackle, but referee Sergey Karasev blows for a foul."
        },
        {
            "gameTime": "1 - 12:10",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 10:29",
            "label": "",
            "description": "David Luiz (Paris SG) sends a long ball in, but Johan Wiland comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 08:17",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Blaise Matuidi (Paris SG) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 07:04",
            "label": "",
            "description": "The game is interrupted as Angel Di Maria (Paris SG) is flagged offside."
        },
        {
            "gameTime": "1 - 05:09",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) brings his opponent down with a tackle and Sergey Karasev blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 03:14",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Angel Di Maria (Paris SG) was set free in the area by Marco Verratti and made no mistake with a lovely finish into the top left corner. 1:0."
        },
        {
            "gameTime": "1 - 02:54",
            "label": "",
            "description": "Flag up against Zlatan Ibrahimovic (Paris SG). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 01:43",
            "label": "",
            "description": "Marco Verratti (Paris SG) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 00:49",
            "label": "corner",
            "description": "A dangerous looking corner kick from Angel Di Maria (Paris SG) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 00:34",
            "label": "",
            "description": "Angel Di Maria (Paris SG) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net. Paris SG force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 00:14",
            "label": "",
            "description": "Angel Di Maria (Paris SG) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Paris SG will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Sergey Karasev."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. The home side were superior in this game. The tactic of the home side was slow build up play, while the away team's main priority was a flawless defence."
        }
    ],
    "gameAwayTeam": "Malmo FF",
    "gameDate": "15/09/2015 - 21:45",
    "gameHomeTeam": "Paris SG",
    "gameScore": "2 - 0"
}