{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-10-30 - 17-00 Empoli 0 - 0 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The fans could demand a bit more entertainment for their money. This game was average. The visiting team was controlling the game most of the time. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 49:18",
            "label": "whistle",
            "description": "That's it for today, Marco Di Bello has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 49:15",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 48:47",
            "label": "",
            "description": "Great touch by Stephan El Shaarawy (AS Roma) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save! The referee and his assistant both point at the corner flag. AS Roma will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 47:53",
            "label": "y-card",
            "description": "Mohamed Salah (AS Roma) sees a yellow card. He should be more careful because one more challenge like that could result in a red card."
        },
        {
            "gameTime": "2 - 47:51",
            "label": "corner",
            "description": "The corner kick from Diego Perotti (AS Roma) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 47:03",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) gets on the end of a pass and produces a promising first time shot towards the left side of the goal. His effort is blocked by Lukasz Skorupski with a brilliant diving save! Corner kick. AS Roma will have an opportunity."
        },
        {
            "gameTime": "2 - 46:26",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) produces an awful long range shot that goes high and wide."
        },
        {
            "gameTime": "2 - 45:23",
            "label": "",
            "description": "Giuseppe Bellusci (Empoli) commits a foul and Marco Di Bello immediately signals a free kick."
        },
        {
            "gameTime": "2 - 44:59",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:54",
            "label": "corner",
            "description": "Manuel Pasqual (Empoli) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 43:53",
            "label": "",
            "description": "Manuel Pasqual (Empoli) wasted a huge opportunity! The fans already began to celebrate as he produced a shot from the edge of the box after a brilliant solo effort. The ball went straight towards the roof of the net, but Wojciech Szczesny made an astonishing save! The ball goes out for a corner. Empoli can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 42:52",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 42:34",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. AS Roma force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 42:02",
            "label": "",
            "description": "Bruno Peres (AS Roma) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 40:53",
            "label": "",
            "description": "Edin Dzeko (AS Roma) takes a rebound on the edge of the box and slams the ball well wide of the left post."
        },
        {
            "gameTime": "2 - 39:47",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from AS Roma."
        },
        {
            "gameTime": "2 - 38:48",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 38:26",
            "label": "",
            "description": "Andrea Costa (Empoli) weaves his way through opponents and strikes the ball from the edge of the area, but it's blocked by a defender. Empoli win a corner."
        },
        {
            "gameTime": "2 - 37:25",
            "label": "substitution",
            "description": "Substitution. Daniele De Rossi makes his way off the pitch and Diego Perotti (AS Roma) comes on as his replacement."
        },
        {
            "gameTime": "2 - 36:42",
            "label": "",
            "description": "Mohamed Salah (AS Roma) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 34:12",
            "label": "",
            "description": "Golden chance! Massimo Maccarone (Empoli) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the right post."
        },
        {
            "gameTime": "2 - 33:34",
            "label": "",
            "description": "Riccardo Saponara (Empoli) latches on to a pass on the edge of the box, but he can't get any power into the shot and fails to trouble Wojciech Szczesny."
        },
        {
            "gameTime": "2 - 33:04",
            "label": "",
            "description": "Edin Dzeko (AS Roma) tackles a bit over zealously and Marco Di Bello blows for a foul."
        },
        {
            "gameTime": "2 - 32:43",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 32:13",
            "label": "",
            "description": "A cross from a mid range free kick, taken by AS Roma, is intercepted by one of the defenders. AS Roma will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "y-card",
            "description": "Marco Di Bello shows a yellow card to Andres Tello (Empoli), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 29:33",
            "label": "substitution",
            "description": "Substitution. Assane Diousse did his best and is replaced by Marcel Buchel (Empoli)."
        },
        {
            "gameTime": "2 - 28:19",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) sends a cross into the box, but Lukasz Skorupski comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 26:23",
            "label": "",
            "description": "Bruno Peres (AS Roma) makes a good run with the ball, but his shot from the edge of the penalty area goes just wide of the right post. Terrific solo effort, though."
        },
        {
            "gameTime": "2 - 25:09",
            "label": "",
            "description": "Massimo Maccarone (Empoli) finds some space for a shot after collecting the ball and unleashes a rocket of a shot from long distance towards the net. The goalkeeper thwarts the effort."
        },
        {
            "gameTime": "2 - 24:57",
            "label": "",
            "description": "AS Roma are playing some nice combination football, sending it precisely from player to player, but a defender shows good anticipation and ends the move with a good block."
        },
        {
            "gameTime": "2 - 22:58",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to introduce fresh legs, with Juan Jesus (AS Roma) replacing Antonio Rudiger."
        },
        {
            "gameTime": "2 - 22:33",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Massimo Maccarone (Empoli) will replace Alberto Gilardino."
        },
        {
            "gameTime": "2 - 22:02",
            "label": "y-card",
            "description": "The whistle is blown for an infringement and Daniele De Rossi (AS Roma) receives a yellow card!"
        },
        {
            "gameTime": "2 - 21:48",
            "label": "y-card",
            "description": "A yellow coloured card is received by Alberto Gilardino (Empoli)."
        },
        {
            "gameTime": "2 - 20:34",
            "label": "",
            "description": "Edin Dzeko (AS Roma) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 19:08",
            "label": "",
            "description": "Riccardo Saponara (Empoli) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "2 - 18:03",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) jumps highest to head the ball from the resulting free kick on the edge of the box! A difficult position to score from and the keeper reacts coolly to make a comfortable save."
        },
        {
            "gameTime": "2 - 16:09",
            "label": "y-card",
            "description": "Assane Diousse (Empoli) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Marco Di Bello ignores the protests."
        },
        {
            "gameTime": "2 - 15:18",
            "label": "",
            "description": "AS Roma are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 13:06",
            "label": "corner",
            "description": "Empoli didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 12:47",
            "label": "",
            "description": "The ball is cleared after Daniele Croce (Empoli) attempted to dribble past an opposing player. The ball goes behind for a corner. Empoli will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 11:51",
            "label": "",
            "description": "The cross into the penalty area from Stephan El Shaarawy (AS Roma) needed to be more accurate in order to create a goal scoring opportunity for his team. The ball goes out of play and Empoli will have a goal kick."
        },
        {
            "gameTime": "2 - 10:53",
            "label": "",
            "description": "Mohamed Salah (AS Roma) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger."
        },
        {
            "gameTime": "2 - 09:53",
            "label": "substitution",
            "description": "Giovanni Martusciello prepares a substitution. Rade Krunic is replaced by Andres Tello (Empoli)."
        },
        {
            "gameTime": "2 - 07:41",
            "label": "substitution",
            "description": "Substitution. Emerson is replaced by Bruno Peres (AS Roma)."
        },
        {
            "gameTime": "2 - 05:54",
            "label": "",
            "description": "Manuel Pucciarelli (Empoli) should know this behaviour is beyond the rules. He was too careless with his challenge and left Marco Di Bello no option but to blow his whistle. Free kick. AS Roma will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 04:02",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) skips past his man but can't keep the ball in play. The ball goes out of play and Empoli will have a goal kick."
        },
        {
            "gameTime": "2 - 02:45",
            "label": "",
            "description": "Dangerous play by Edin Dzeko (AS Roma). Marco Di Bello blows his whistle for a foul. Empoli earn a free kick."
        },
        {
            "gameTime": "2 - 02:00",
            "label": "",
            "description": "Flag up against Mohamed Salah (AS Roma). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 00:32",
            "label": "",
            "description": "Empoli seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. The visitors played second fiddle to the home team in the first half. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 45:55",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:40",
            "label": "",
            "description": "Mohamed Salah (AS Roma) slaloms his way past challenges, but an opposing player does well to get the ball away. It's a throw in for AS Roma."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:26",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 41:59",
            "label": "",
            "description": "The AS Roma players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 39:45",
            "label": "",
            "description": "The free kick from long distance is taken by Manuel Pasqual (Empoli), who fires in a direct effort just wide of the right post. What a chance!"
        },
        {
            "gameTime": "1 - 39:13",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) makes a rough challenge and Marco Di Bello blows his whistle for a foul. Empoli will take a free kick."
        },
        {
            "gameTime": "1 - 37:02",
            "label": "",
            "description": "The Empoli players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession. The ball is behind the touchline and AS Roma will take a throw in."
        },
        {
            "gameTime": "1 - 35:53",
            "label": "",
            "description": "Leandro Paredes (AS Roma) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 34:56",
            "label": "y-card",
            "description": "A yellow card for a tackle by Manuel Pasqual (Empoli). Marco Di Bello doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 34:05",
            "label": "",
            "description": "Flag goes up against Mohamed Salah (AS Roma) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 33:46",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 33:17",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender. The ball is out of play and the linesman points at the corner flag. Corner to AS Roma."
        },
        {
            "gameTime": "1 - 32:58",
            "label": "",
            "description": "AS Roma produce a short pass from the free kick."
        },
        {
            "gameTime": "1 - 32:12",
            "label": "",
            "description": "Daniele Croce (Empoli) brings down his opponent with a very late tackle. AS Roma win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 31:41",
            "label": "",
            "description": "Neat passing move from AS Roma in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 29:57",
            "label": "y-card",
            "description": "Marco Di Bello shows a yellow card to Konstantinos Manolas (AS Roma) for a tough tackle."
        },
        {
            "gameTime": "1 - 28:27",
            "label": "",
            "description": "That's a well taken pass by Alberto Gilardino (Empoli). He unleashes a strike from the edge of the box, but blazes it high over the bar. The ball is off of the pitch and it's a goal kick for AS Roma."
        },
        {
            "gameTime": "1 - 27:05",
            "label": "",
            "description": "Empoli players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 25:36",
            "label": "corner",
            "description": "Empoli fail to score from a corner as Wojciech Szczesny (AS Roma) leaps to collect the ball."
        },
        {
            "gameTime": "1 - 25:14",
            "label": "",
            "description": "Riccardo Saponara (Empoli) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The linesman points to the corner flag, Empoli are going to take it."
        },
        {
            "gameTime": "1 - 24:34",
            "label": "",
            "description": "Edin Dzeko (AS Roma) misses a good chance to score. A perfect cross into the box finds Edin Dzeko (AS Roma) who rises for a header, but he sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 22:48",
            "label": "",
            "description": "A rebound falls at the feet of Radja Nainggolan (AS Roma), whose promising strike from long range flies a few inches wide of the left post! What a great effort!"
        },
        {
            "gameTime": "1 - 22:32",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 21:58",
            "label": "",
            "description": "Edin Dzeko (AS Roma) reacts well to latch onto a rebound inside the box, but his shot is well blocked. AS Roma have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 20:48",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) plays a through ball inside the box, but it's too strong and Lukasz Skorupski comes off his line to intercept."
        },
        {
            "gameTime": "1 - 19:21",
            "label": "",
            "description": "Leandro Paredes (AS Roma) unleashes a powerful shot towards goal from a mid range free kick, but the ball is blocked by the defensive wall."
        },
        {
            "gameTime": "1 - 18:21",
            "label": "",
            "description": "AS Roma have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 17:48",
            "label": "y-card",
            "description": "Marco Di Bello shows the yellow card to Giuseppe Bellusci (Empoli) for a heavy challenge."
        },
        {
            "gameTime": "1 - 16:10",
            "label": "",
            "description": "AS Roma are ruled offside."
        },
        {
            "gameTime": "1 - 15:55",
            "label": "",
            "description": "Mohamed Salah (AS Roma) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 15:02",
            "label": "",
            "description": "Mohamed Salah (AS Roma) tries to find Edin Dzeko, but he puts too much power on the through ball."
        },
        {
            "gameTime": "1 - 12:28",
            "label": "corner",
            "description": "Empoli quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "1 - 12:14",
            "label": "",
            "description": "Rade Krunic (Empoli) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball goes out of play. Empoli are awarded a corner kick."
        },
        {
            "gameTime": "1 - 10:52",
            "label": "y-card",
            "description": "Frederic Veseli (Empoli) sees a yellow card from Marco Di Bello after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 10:21",
            "label": "",
            "description": "Great teamplay by AS Roma as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 09:00",
            "label": "",
            "description": "Edin Dzeko (AS Roma) gets on the ball and beats an opponent, but his run is stopped by the referee Marco Di Bello who sees an offensive foul."
        },
        {
            "gameTime": "1 - 06:56",
            "label": "",
            "description": "Edin Dzeko (AS Roma) connects with a cross from the side, but produces a header which goes miles wide of the left post. The ball goes out of play and Empoli will have a goal kick."
        },
        {
            "gameTime": "1 - 06:41",
            "label": "",
            "description": "Frederic Veseli (Empoli) brings his opponent down with a tackle and Marco Di Bello blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 05:45",
            "label": "",
            "description": "Leandro Paredes (AS Roma) has a go from a long way out but it sails way over."
        },
        {
            "gameTime": "1 - 04:17",
            "label": "",
            "description": "A big opportunity is wasted by Mohamed Salah (AS Roma), who makes a yard for himself and produces a mid range rocket of a shot towards the left side of the goal. Unfortunately for him, Lukasz Skorupski pulls off a fantastic save to stop the effort."
        },
        {
            "gameTime": "1 - 03:38",
            "label": "",
            "description": "Manuel Pasqual (Empoli) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 02:58",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "1 - 02:26",
            "label": "",
            "description": "Daniele Croce (Empoli) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee and the linesman both signal a throw in for Empoli."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 01:01",
            "label": "",
            "description": "Lukasz Skorupski makes a superb save to deny a header which was nodded towards the roof of the net by Edin Dzeko (AS Roma) after a cross from the side. AS Roma earn a corner."
        },
        {
            "gameTime": "1 - 00:46",
            "label": "",
            "description": "The AS Roma players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Empoli will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Marco Di Bello."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko have rippled the net 12x and is the top scorer for AS Roma this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Empoli have not tasted victory over their past 7 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "7:24 That's the goals for and against record for Empoli."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans could demand a bit more entertainment for their money. This game was average. The visiting team was controlling the game most of the time. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "30/10/2016 - 17:00",
    "gameHomeTeam": "Empoli",
    "gameScore": "0 - 0"
}