{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-03-05 - 18-00 Chelsea 1 - 1 Stoke City/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 48:58",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 48:57",
            "label": "corner",
            "description": "Willian (Chelsea) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 48:51",
            "label": "",
            "description": "Willian (Chelsea) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. The ball is out of play. Chelsea win a corner kick."
        },
        {
            "gameTime": "2 - 47:22",
            "label": "",
            "description": "What terrific goalkeeping by Thibaut Courtois! Bojan Krkic (Stoke City) drills a shot only to the middle of the target, but with great power, forcing the keeper to pull off a difficult save."
        },
        {
            "gameTime": "2 - 45:17",
            "label": "",
            "description": "Oscar (Chelsea) leaps highest to meet the resulting set piece and sends his header way off target."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "substitution",
            "description": "Marko Arnautovic goes off the pitch and Stephen Ireland (Stoke City) comes on."
        },
        {
            "gameTime": "2 - 44:25",
            "label": "corner",
            "description": "Willian (Chelsea) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 44:17",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) strikes a bullet of a shot towards goal from distance and forces the goalkeeper to make a good save. Chelsea win a corner."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "substitution",
            "description": "Here is a change. Mame Diouf is going off and Mark Hughes gives the last tactical orders to Joselu (Stoke City)."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "soccer-ball",
            "description": "A wonderful header! Mame Diouf (Stoke City) leaps high for a rebound and nicely beats the goalkeeper."
        },
        {
            "gameTime": "2 - 38:09",
            "label": "",
            "description": "A cross by Abdul Baba Rahman (Chelsea) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "2 - 36:33",
            "label": "substitution",
            "description": "Substitution. Nemanja Matic makes his way off the pitch and Cesc Fabregas (Chelsea) comes on as his replacement."
        },
        {
            "gameTime": "2 - 35:47",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Jack Butland guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 35:29",
            "label": "",
            "description": "Willian (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 34:07",
            "label": "",
            "description": "Marko Arnautovic (Stoke City) serves up a nice cross, but Thibaut Courtois punches the ball away."
        },
        {
            "gameTime": "2 - 33:18",
            "label": "",
            "description": "Loic Remy (Chelsea) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 30:37",
            "label": "",
            "description": "Bojan Krkic (Stoke City) is caught offside!"
        },
        {
            "gameTime": "2 - 29:56",
            "label": "",
            "description": "Marko Arnautovic (Stoke City) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 29:37",
            "label": "substitution",
            "description": "Mark Hughes decides to make a substitution. Glenn Whelan will be replaced by Bojan Krkic (Stoke City)."
        },
        {
            "gameTime": "2 - 28:57",
            "label": "",
            "description": "Close! Willian (Chelsea) takes the resulting free kick from a promising positon, but his effort flies inches wide of the right post."
        },
        {
            "gameTime": "2 - 28:00",
            "label": "y-card",
            "description": "The foul by Glenn Whelan (Stoke City) is worthy of a card and a yellow is duly shown by Mark Clattenburg."
        },
        {
            "gameTime": "2 - 25:48",
            "label": "",
            "description": "Willian (Chelsea) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "2 - 25:36",
            "label": "attendance",
            "description": "The attendance is 41381."
        },
        {
            "gameTime": "2 - 24:46",
            "label": "",
            "description": "Marko Arnautovic (Stoke City) goes on a weaving run through the defence and gets within shooting range but his effort is blocked."
        },
        {
            "gameTime": "2 - 24:16",
            "label": "corner",
            "description": "Xherdan Shaqiri (Stoke City) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 23:54",
            "label": "",
            "description": "The resulting set piece from Marko Arnautovic (Stoke City) is successfully intercepted by the defender. The ball is out of play. Stoke City will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 22:38",
            "label": "substitution",
            "description": "Today's match ends for Bertrand Traore who will be replaced by Loic Remy (Chelsea)."
        },
        {
            "gameTime": "2 - 20:30",
            "label": "",
            "description": "The referee blows his whistle as Marc Muniesa (Stoke City) was too aggressive in his challenge."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 19:09",
            "label": "",
            "description": "Geoff Cameron (Stoke City) brings his opponent down with a tackle and Mark Clattenburg blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 17:52",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Ruben Loftus Cheek (Chelsea) for Eden Hazard."
        },
        {
            "gameTime": "2 - 16:51",
            "label": "",
            "description": "Gary Cahill (Chelsea) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Jack Butland is alert and denies him."
        },
        {
            "gameTime": "2 - 16:24",
            "label": "corner",
            "description": "Jack Butland leaps to collect the ball from the corner which was sent over by Willian (Chelsea)."
        },
        {
            "gameTime": "2 - 16:09",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance. Corner kick. Chelsea will have an opportunity."
        },
        {
            "gameTime": "2 - 15:42",
            "label": "",
            "description": "Willian (Chelsea) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The referee signals a corner kick to Chelsea."
        },
        {
            "gameTime": "2 - 15:26",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 15:09",
            "label": "",
            "description": "Willian (Chelsea) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender. Chelsea force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 14:53",
            "label": "corner",
            "description": "Xherdan Shaqiri (Stoke City) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 13:44",
            "label": "",
            "description": "A neat pass is well received by Xherdan Shaqiri (Stoke City), who is lurking on the edge of the box and strikes the ball towards the bottom right corner, but the goalkeeper makes an incredible save to block his shot. The referee points to the corner flag. It's a corner to Stoke City."
        },
        {
            "gameTime": "2 - 11:36",
            "label": "",
            "description": "Willian (Chelsea) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety."
        },
        {
            "gameTime": "2 - 10:26",
            "label": "",
            "description": "Good defending. Bertrand Traore (Chelsea) tries to find Willian inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 09:53",
            "label": "",
            "description": "Xherdan Shaqiri (Stoke City) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "2 - 07:56",
            "label": "y-card",
            "description": "Mark Clattenburg shows a yellow card to Erik Pieters (Stoke City) for a tough tackle."
        },
        {
            "gameTime": "2 - 07:16",
            "label": "",
            "description": "Some patient build up play from Stoke City as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 05:29",
            "label": "",
            "description": "A brilliant individual effort! Eden Hazard (Chelsea) tricks his way past challenges into the box and drags his shot narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 03:31",
            "label": "",
            "description": "A pass by Abdul Baba Rahman (Chelsea) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 02:32",
            "label": "",
            "description": "Marko Arnautovic (Stoke City) had a good chance to change the score. He ran towards the goal and unleashed a shot from just outside the penalty area which went straight towards the roof of the net, but the goalkeeper was ready and made an amazing save."
        },
        {
            "gameTime": "2 - 01:46",
            "label": "",
            "description": "The ball is cleared after Marko Arnautovic (Stoke City) attempted to dribble past an opposing player. The ball is behind the touchline and Chelsea will take a throw in."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. Even first half from both sides, and they've both had chances. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 46:58",
            "label": "whistle",
            "description": "Mark Clattenburg has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:30",
            "label": "y-card",
            "description": "Oscar (Chelsea) picks up a yellow card for a foul."
        },
        {
            "gameTime": "1 - 43:35",
            "label": "corner",
            "description": "Willian (Chelsea) will take the corner."
        },
        {
            "gameTime": "1 - 43:19",
            "label": "",
            "description": "Willian (Chelsea) races towards goal but the defender gets back well to make a challenge. Good work from Chelsea as they win a corner."
        },
        {
            "gameTime": "1 - 39:00",
            "label": "soccer-ball",
            "description": "Goal! Nemanja Matic tees up Bertrand Traore (Chelsea) on the edge of the box and he fires the ball into the left side of the goal. 1:0."
        },
        {
            "gameTime": "1 - 38:20",
            "label": "corner",
            "description": "Eden Hazard (Chelsea) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 38:19",
            "label": "",
            "description": "Oscar (Chelsea) blasts the ball from just outside the box, but his attempt is blocked by the defender. It will be a corner kick for Chelsea."
        },
        {
            "gameTime": "1 - 36:31",
            "label": "",
            "description": "CHANCE! Mame Diouf (Stoke City) connects with a cross but he cannot direct his shot on target."
        },
        {
            "gameTime": "1 - 36:12",
            "label": "",
            "description": "Eden Hazard (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 33:53",
            "label": "corner",
            "description": "The resulting corner from Willian (Chelsea) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 33:27",
            "label": "",
            "description": "Bertrand Traore (Chelsea) shoots the rebound towards the goal. His effort lacks pace and that allows the goalkeeper to pull off a stunning save. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 32:22",
            "label": "",
            "description": "Mame Diouf (Stoke City) tries to find Marko Arnautovic, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 31:16",
            "label": "",
            "description": "The linesman signals that Bertrand Traore (Chelsea) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 30:00",
            "label": "",
            "description": "Geoff Cameron (Stoke City) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "injury",
            "description": "The game is interrupted now, Geoff Cameron (Stoke City) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 20:00",
            "label": "corner",
            "description": "Xherdan Shaqiri (Stoke City) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "1 - 19:00",
            "label": "corner",
            "description": "Xherdan Shaqiri (Stoke City) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance. The ball is out of play and the linesman points at the corner flag. Corner to Stoke City."
        },
        {
            "gameTime": "1 - 14:49",
            "label": "",
            "description": "Xherdan Shaqiri (Stoke City) sends a teasing cross into the area, but Thibaut Courtois intercepts the ball."
        },
        {
            "gameTime": "1 - 08:55",
            "label": "",
            "description": "Gianelli Imbula Wanga (Stoke City) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "1 - 04:54",
            "label": "",
            "description": "The game is interrupted as Xherdan Shaqiri (Stoke City) is flagged offside."
        },
        {
            "gameTime": "1 - 04:18",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "1 - 02:43",
            "label": "",
            "description": "Ibrahim Afellay (Stoke City) found himself in a promising position. He ran towards the goal and unleashed a shot from just outside the penalty area which went towards the middle of the goal, but the goalkeeper was ready and made a decent save."
        },
        {
            "gameTime": "1 - 02:08",
            "label": "",
            "description": "Xherdan Shaqiri (Stoke City) swings a cross into the box, but it's far too close to Thibaut Courtois, who smothers the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Chelsea will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Mark Clattenburg."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "Stoke City",
    "gameDate": "05/03/2016 - 18:00",
    "gameHomeTeam": "Chelsea",
    "gameScore": "1 - 1"
}