{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-01-24 - 22-30 Betis 1 - 1 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. An impressive display from the visitors, they had the better of it. The home team adopted a defensive style of play, while the away team tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 49:11",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "y-card",
            "description": "The foul by Daniel Carvajal (Real Madrid) is worthy of a card and a yellow is duly shown by Juan Martinez Munuera."
        },
        {
            "gameTime": "2 - 45:30",
            "label": "",
            "description": "Ruben Castro (Betis) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the left post."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:13",
            "label": "",
            "description": "Joaquin (Betis) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "2 - 42:20",
            "label": "",
            "description": "Isco (Real Madrid) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 42:04",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 41:43",
            "label": "",
            "description": "Half chance! Jese (Real Madrid) plays a pass into the box, but Antonio Adan reacts well to snuff out the attack. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) has a good chance to get on the scoresheet and fires the ball towards goal from the edge of the penalty box, but it goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 37:15",
            "label": "",
            "description": "Karim Benzema (Real Madrid) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "2 - 35:13",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) sends a teasing cross into the area, but Antonio Adan intercepts the ball."
        },
        {
            "gameTime": "2 - 34:09",
            "label": "substitution",
            "description": "Zinedine Zidane decides to make a substitution. James Rodriguez will be replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "",
            "description": "Karim Benzema (Real Madrid) had a golden opportunity. He volleyed from point blank range towards the left side of the goal, but Antonio Adan was alert and made an amazing save!"
        },
        {
            "gameTime": "2 - 33:29",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 33:00",
            "label": "",
            "description": "James Rodriguez (Real Madrid) fashions a shot from the edge of the box after receiving an accurate pass. Antonio Adan makes a stunning save to stop the effort from flying into the left side of the goal. The referee blows his whistle, Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:54",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Toni Kroos (Real Madrid), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "2 - 30:29",
            "label": "substitution",
            "description": "The substitution has been made. Francisco Portillo (Betis) has replaced Alvaro Cejudo."
        },
        {
            "gameTime": "2 - 29:38",
            "label": "",
            "description": "Alvaro Cejudo (Betis) is penalised for holding. Juan Martinez Munuera signals a set piece. Real Madrid earn a free kick."
        },
        {
            "gameTime": "2 - 29:19",
            "label": "",
            "description": "Isco (Real Madrid) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 27:13",
            "label": "corner",
            "description": "The resulting corner from Toni Kroos (Real Madrid) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 26:57",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 25:52",
            "label": "soccer-ball",
            "description": "Goal! Karim Benzema (Real Madrid) fires home from very close range after latching on to a pass from James Rodriguez. The score is 1:1."
        },
        {
            "gameTime": "2 - 24:18",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) unleashes a decent effort from just outside the box which goes narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 23:43",
            "label": "y-card",
            "description": "Juan Martinez Munuera shows the yellow card to Francisco Jose Molinero Calderon (Betis) for a heavy challenge."
        },
        {
            "gameTime": "2 - 20:52",
            "label": "",
            "description": "A pass by James Rodriguez (Real Madrid) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 19:18",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "2 - 18:55",
            "label": "substitution",
            "description": "Substitution. Daniel Carvajal (Real Madrid) in, Danilo out."
        },
        {
            "gameTime": "2 - 18:39",
            "label": "y-card",
            "description": "Danilo (Real Madrid) sees a yellow card from Juan Martinez Munuera after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 16:22",
            "label": "",
            "description": "The flag is raised and Cristiano Ronaldo (Real Madrid) is offside again, not for the first time today."
        },
        {
            "gameTime": "2 - 16:06",
            "label": "",
            "description": "Danilo (Real Madrid) sends a pass into the penalty area, but the opponent manages to cut it out."
        },
        {
            "gameTime": "2 - 15:16",
            "label": "y-card",
            "description": "A yellow card for a tackle by Petros (Betis). Juan Martinez Munuera doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "",
            "description": "Toni Kroos (Real Madrid) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "2 - 12:28",
            "label": "y-card",
            "description": "Today's referee Juan Martinez Munuera rightly decides to book Juan Vargas (Betis) for his harsh tackle. A free kick is awarded to Real Madrid."
        },
        {
            "gameTime": "2 - 12:19",
            "label": "substitution",
            "description": "Juan Merino is forced to make a change. Foued Kadir is unable to continue due to injury, Joaquin (Betis) comes on."
        },
        {
            "gameTime": "2 - 11:39",
            "label": "injury",
            "description": "Foued Kadir (Betis) is down injured and the referee stops play so that he can receive medical treatment."
        },
        {
            "gameTime": "2 - 09:19",
            "label": "",
            "description": "A cross following the corner kick finds its way to James Rodriguez (Real Madrid) inside the box and he manages to steer it low to the middle of the target. He is about to start celebrating a goal, but Antonio Adan makes a save in the nick of time to maintain the current score."
        },
        {
            "gameTime": "2 - 09:02",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) will take a corner kick."
        },
        {
            "gameTime": "2 - 08:52",
            "label": "",
            "description": "The ball is cleared after Cristiano Ronaldo (Real Madrid) attempted to dribble past an opposing player. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 06:33",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "substitution",
            "description": "Juan Merino is forced to make an unplanned substitution as Fabian Ruiz suffers an injury and Daniel Ceballos (Betis) comes on."
        },
        {
            "gameTime": "2 - 05:25",
            "label": "injury",
            "description": "Fabian Ruiz (Betis) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "2 - 05:14",
            "label": "",
            "description": "Karim Benzema (Real Madrid) had a golden opportunity. He volleyed from point blank range towards the middle of the goal, but Antonio Adan was alert and made an amazing save!"
        },
        {
            "gameTime": "2 - 03:54",
            "label": "",
            "description": "Toni Kroos (Real Madrid) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards wide of the right post."
        },
        {
            "gameTime": "2 - 03:25",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 03:12",
            "label": "",
            "description": "An attempted cross from James Rodriguez (Real Madrid) is cleared. It will be a corner kick for Real Madrid."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "",
            "description": "James Rodriguez (Real Madrid) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "2 - 00:59",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 00:47",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. The visitors enjoy superiority over the opposition. It's obvious that defence has the highest priority for the home side. The away team makes a lot of passes and attempts to maintain possession."
        },
        {
            "gameTime": "1 - 45:38",
            "label": "whistle",
            "description": "Juan Martinez Munuera has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 44:53",
            "label": "",
            "description": "Alvaro Cejudo (Betis) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "1 - 44:42",
            "label": "",
            "description": "Raphael Varane (Real Madrid) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Juan Martinez Munuera with no other option than to blow for a foul. Betis are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 42:48",
            "label": "",
            "description": "Fabian Ruiz (Betis) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 40:34",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is caught offside!"
        },
        {
            "gameTime": "1 - 39:32",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 37:13",
            "label": "",
            "description": "Marcelo (Real Madrid) swings a cross into the box, but it's far too close to Antonio Adan, who smothers the ball."
        },
        {
            "gameTime": "1 - 35:53",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Cristiano Ronaldo (Real Madrid) sacrificed accuracy for power, and thus his attempt went well wide of the left post."
        },
        {
            "gameTime": "1 - 34:53",
            "label": "corner",
            "description": "Antonio Adan comes off his line to intercept the corner from Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "1 - 34:44",
            "label": "",
            "description": "Marcelo (Real Madrid) serves up a nice cross, but the defence clears the danger. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 33:07",
            "label": "",
            "description": "Pepe (Real Madrid) finds enough space to climb high and plants a header well wide of the left post. What a poor effort."
        },
        {
            "gameTime": "1 - 32:47",
            "label": "corner",
            "description": "Corner kick. Toni Kroos (Real Madrid) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 32:37",
            "label": "",
            "description": "A lofted cross from Danilo (Real Madrid) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "1 - 31:44",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the right post."
        },
        {
            "gameTime": "1 - 30:37",
            "label": "",
            "description": "Danilo (Real Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 28:21",
            "label": "",
            "description": "A pass by Cristiano Ronaldo (Real Madrid) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 27:45",
            "label": "",
            "description": "Fabian Ruiz (Betis) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 25:48",
            "label": "",
            "description": "Karim Benzema (Real Madrid) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender."
        },
        {
            "gameTime": "1 - 23:52",
            "label": "",
            "description": "A pass from James Rodriguez (Real Madrid) is intercepted by Antonio Adan and the move breaks down."
        },
        {
            "gameTime": "1 - 23:07",
            "label": "",
            "description": "Juan Martinez Munuera blows his whistle as Ruben Castro (Betis) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 21:29",
            "label": "",
            "description": "A decent save by Antonio Adan. Isco (Real Madrid) finds some space near the penalty spot to meet a cross and head it down to the middle of the goal, but the effort is saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 20:16",
            "label": "",
            "description": "Petros (Betis) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "1 - 20:03",
            "label": "",
            "description": "A clumsy foul by Cristiano Ronaldo (Real Madrid) and Juan Martinez Munuera blows his whistle. A free kick has been awarded to Betis."
        },
        {
            "gameTime": "1 - 18:20",
            "label": "",
            "description": "Raphael Varane (Real Madrid) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 17:25",
            "label": "",
            "description": "Karim Benzema (Real Madrid) shoots from the edge of the penalty area. The ball travels towards the middle of the target, but Antonio Adan easily deals with the threat."
        },
        {
            "gameTime": "1 - 15:26",
            "label": "corner",
            "description": "The resulting corner, taken by Toni Kroos (Real Madrid), comes to nothing."
        },
        {
            "gameTime": "1 - 15:15",
            "label": "",
            "description": "Luka Modric (Real Madrid) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 14:12",
            "label": "",
            "description": "The game is interrupted as Cristiano Ronaldo (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "1 - 13:59",
            "label": "",
            "description": "Toni Kroos (Real Madrid) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 13:53",
            "label": "",
            "description": "Fabian Ruiz (Betis) commits a rough foul. Juan Martinez Munuera stops the game and makes a call. It's a free kick to Real Madrid, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 12:46",
            "label": "",
            "description": "Karim Benzema (Real Madrid) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 11:37",
            "label": "",
            "description": "Marcelo (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 08:46",
            "label": "",
            "description": "Toni Kroos (Real Madrid) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 08:36",
            "label": "",
            "description": "Francisco Jose Molinero Calderon (Betis) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Juan Martinez Munuera blows for the foul but keeps his cards in his pocket on this occasion. Real Madrid are awarded a free kick."
        },
        {
            "gameTime": "1 - 06:36",
            "label": "soccer-ball",
            "description": "Alvaro Cejudo (Betis) gets to the ball on the edge of the box and fires in a first time shot without any hesitation. The strike is excellent and goes straight into the top left corner. He couldn't have done it any better. 1:0."
        },
        {
            "gameTime": "1 - 06:15",
            "label": "",
            "description": "Ruben Castro (Betis) goes on a mazy run, skips past two defenders and pulls the trigger in front of the keeper. Keylor Navas makes a great save to stop the effort going into the bottom left corner."
        },
        {
            "gameTime": "1 - 05:37",
            "label": "",
            "description": "Toni Kroos (Real Madrid) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "1 - 03:35",
            "label": "corner",
            "description": "The resulting corner from Petros (Betis) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 03:23",
            "label": "",
            "description": "Alvaro Cejudo (Betis) sends the ball into the box from the side of the pitch, but his cross is blocked. The ball is out of play and Betis manage to earn a corner."
        },
        {
            "gameTime": "1 - 01:57",
            "label": "",
            "description": "Luka Modric (Real Madrid) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Betis will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Juan Martinez Munuera."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. An impressive display from the visitors, they had the better of it. The home team adopted a defensive style of play, while the away team tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "24/01/2016 - 22:30",
    "gameHomeTeam": "Betis",
    "gameScore": "1 - 1"
}