{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-09-17 - 21-45 Napoli 3 - 1 Bologna/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. Napoli were dominant and more threatening of the two sides. It was a fairly one sided match. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 47:45",
            "label": "",
            "description": "That's a well taken pass by Allan (Napoli). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 46:04",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:23",
            "label": "",
            "description": "Napoli are playing excellent possession football at the moment by exchanging some long passes."
        },
        {
            "gameTime": "2 - 40:54",
            "label": "corner",
            "description": "Jose Callejon (Napoli) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 40:32",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "substitution",
            "description": "Substitution. Adam Masina (Bologna) receives a signal from the referee and is now allowed to enter the pitch as Vassilios Torosidis walks off."
        },
        {
            "gameTime": "2 - 37:17",
            "label": "corner",
            "description": "The resulting corner from Faouzi Ghoulam (Napoli) is cleared."
        },
        {
            "gameTime": "2 - 36:45",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) unleashes a powerful shot towards goal from a mid range free kick, but the ball is blocked by the defensive wall. Napoli earn a corner."
        },
        {
            "gameTime": "2 - 35:44",
            "label": "r-card",
            "description": "Emil Krafth (Bologna) makes an ugly challenge on his opponent and receives a red card from the referee!"
        },
        {
            "gameTime": "2 - 32:41",
            "label": "soccer-ball",
            "description": "Brilliant finish! Arkadiusz Milik (Napoli) perfectly collected a pass on the edge of the penalty area from Allan, then produced a nice strike into the right side of the goal. The score is 3:1."
        },
        {
            "gameTime": "2 - 31:23",
            "label": "",
            "description": "Luca Rizzo (Bologna) breaks into the penalty area but his shot is blocked."
        },
        {
            "gameTime": "2 - 30:08",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) receives a well played pass inside the penalty area and shoots. He sends the ball into orbit."
        },
        {
            "gameTime": "2 - 28:50",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to make a change. Allan (Napoli) replaces Jorginho."
        },
        {
            "gameTime": "2 - 28:43",
            "label": "substitution",
            "description": "That's the end of the game for Ladislav Krejci, who is replaced by Luca Rizzo (Bologna)."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "Napoli are ruled offside."
        },
        {
            "gameTime": "2 - 26:18",
            "label": "",
            "description": "Blerim Dzemaili (Bologna) receives a precise pass on the edge of the box and has an effort on goal. Unfortunately for him, his strike flies inches high over the bar."
        },
        {
            "gameTime": "2 - 25:20",
            "label": "",
            "description": "picks up a precise pass and attempts to threaten the keeper with a long range effort, but it goes well wide of the mark."
        },
        {
            "gameTime": "2 - 24:45",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 21:47",
            "label": "soccer-ball",
            "description": "What a goal that is! Arkadiusz Milik (Napoli) gets to the ball inside the box and brilliantly lifts the ball over Angelo da Costa and into the net. 2:1."
        },
        {
            "gameTime": "2 - 21:37",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Ivan Strinic as he is replaced by Faouzi Ghoulam (Napoli)."
        },
        {
            "gameTime": "2 - 21:09",
            "label": "",
            "description": "Emil Krafth (Bologna) takes a mid range shot, but the ball sails high over the bar."
        },
        {
            "gameTime": "2 - 18:07",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 17:27",
            "label": "",
            "description": "An attempted cross from Jose Callejon (Napoli) is cleared. Good work from Napoli as they win a corner."
        },
        {
            "gameTime": "2 - 15:59",
            "label": "substitution",
            "description": "Here is a change. Adam Nagy is going off and Roberto Donadoni gives the last tactical orders to Godfred Donsah (Bologna)."
        },
        {
            "gameTime": "2 - 15:58",
            "label": "substitution",
            "description": "Here's the change. Manolo Gabbiadini leaves the pitch and Arkadiusz Milik (Napoli) comes on as a substitute."
        },
        {
            "gameTime": "2 - 12:41",
            "label": "",
            "description": "Bologna hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "2 - 10:40",
            "label": "soccer-ball",
            "description": "A wonderful pass found its target. Simone Verdi (Bologna) received it well and shot from about 30 metres out. He did really well to send the ball past the goalkeeper and under the bar."
        },
        {
            "gameTime": "2 - 10:28",
            "label": "",
            "description": "Emil Krafth (Bologna) escapes the opposition's pressure by passing the ball on the ground."
        },
        {
            "gameTime": "2 - 07:52",
            "label": "",
            "description": "feels very aggrieved after the referee stops play for a foul that he commits while in possession of the ball."
        },
        {
            "gameTime": "2 - 04:52",
            "label": "",
            "description": "Marek Hamsik (Napoli) had a good chance to change the score. He ran towards the goal and unleashed a low shot from long range which went towards the middle of the goal, but Angelo da Costa was ready and made a save."
        },
        {
            "gameTime": "2 - 02:07",
            "label": "",
            "description": "Simone Verdi (Bologna) plays a one two with Federico Di Francesco, but the move breaks down."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "",
            "description": "There was plenty of entertainment during the first 45 minutes. Hopefully more of the same in the second half. Napoli dominated the opening period and easily created the most chances. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 44:58",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:37",
            "label": "",
            "description": "Jorginho (Napoli) was too forceful with his tackle and Daniele Doveri interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 42:36",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) fails to produce a decent enough free kick for a player of his ability and the only target that he finds is the wall of defenders in front of him."
        },
        {
            "gameTime": "1 - 41:05",
            "label": "",
            "description": "Vassilios Torosidis (Bologna) brings an opponent down and Daniele Doveri interrupts the game. Napoli have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 40:01",
            "label": "corner",
            "description": "Simone Verdi (Bologna) works the corner short."
        },
        {
            "gameTime": "1 - 39:38",
            "label": "corner",
            "description": "Ladislav Krejci (Bologna) swings in the corner kick, but one of the defenders leaps highest to head the ball away. Now Bologna have a corner."
        },
        {
            "gameTime": "1 - 39:17",
            "label": "",
            "description": "Blerim Dzemaili (Bologna) flights in the cross, but the defender is alert and clears to safety. Bologna will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 37:24",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "1 - 36:55",
            "label": "",
            "description": "Napoli are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "1 - 34:16",
            "label": "",
            "description": "Marios Oikonomou (Bologna) makes a reckless foul in order to win the ball from his opponent. Daniele Doveri has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 32:42",
            "label": "corner",
            "description": "Jose Callejon (Napoli) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "1 - 32:07",
            "label": "",
            "description": "connects with a pass but sees his shot from the edge of the box blocked. The ball goes out for a corner. Napoli can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 31:47",
            "label": "funfact",
            "description": "21:9 – this is the total number of shots produced by both teams."
        },
        {
            "gameTime": "1 - 29:47",
            "label": "",
            "description": "Ivan Strinic (Napoli) fouls an opponent. At least that's what referee Daniele Doveri signals."
        },
        {
            "gameTime": "1 - 26:16",
            "label": "",
            "description": "The linesman raises his flag for offside before Manolo Gabbiadini (Napoli) heads on."
        },
        {
            "gameTime": "1 - 24:39",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) is all over the pitch today. He is full of energy and asking for the ball, while his ability to control the game and to be on the ball is simply fantastic. Every manager wants to have a playmaker like him."
        },
        {
            "gameTime": "1 - 24:12",
            "label": "",
            "description": "That was close by Manolo Gabbiadini (Napoli)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the right post."
        },
        {
            "gameTime": "1 - 22:39",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) latches on to a precise defence splitting pass and drills a nice strike from a promising distance towards the middle of the goal. Angelo da Costa has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 20:36",
            "label": "",
            "description": "Jose Callejon (Napoli) finds some space inside the box and latches on to a brilliant cross, but he wastes his chance as his shot goes way wide of the left post."
        },
        {
            "gameTime": "1 - 19:36",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 18:43",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) connects with a cross on the edge of the box, controls the ball and pulls the trigger. Angelo da Costa makes a beautiful save to deny his effort which would have ended in the roof of the net. The ball goes out of play. Napoli are awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:36",
            "label": "",
            "description": "Daniele Doveri blows his whistle and it's Manolo Gabbiadini (Napoli) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 16:02",
            "label": "corner",
            "description": "Jose Callejon (Napoli) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "1 - 15:45",
            "label": "",
            "description": "attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. Napoli have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 13:59",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Lorenzo Insigne finds Jose Callejon (Napoli), who jumps highest and steers a close range header into the left side of the goal. His effort was both strong and precise, and Angelo da Costa had no chance of stopping that. 0:0."
        },
        {
            "gameTime": "1 - 11:37",
            "label": "",
            "description": "CLOSE! Lorenzo Insigne (Napoli) shows off his amazing skills with a solo run to the edge of the box before fashioning a shot that goes inches wide of the right post!"
        },
        {
            "gameTime": "1 - 09:54",
            "label": "y-card",
            "description": "Saphir Taider (Bologna) is booked after bringing down an opponent. Daniele Doveri had an easy decision to make."
        },
        {
            "gameTime": "1 - 08:36",
            "label": "",
            "description": "Jose Callejon (Napoli) sends the ball into the box from the side of the pitch, but his cross is blocked. The ball is out of play. Napoli will have a throw in."
        },
        {
            "gameTime": "1 - 07:32",
            "label": "",
            "description": "Angelo da Costa hears the fans clapping his superb goalkeeping. Jose Callejon (Napoli) shoots from the edge of the box towards the right side of the goal, but the goalkeeper makes a magnificent save."
        },
        {
            "gameTime": "1 - 06:59",
            "label": "",
            "description": "Flag up against Federico Di Francesco (Bologna). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 04:36",
            "label": "",
            "description": "Vassilios Torosidis (Bologna) commits a rough challenge and Daniele Doveri blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 04:14",
            "label": "corner",
            "description": "Ladislav Krejci (Bologna) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 03:14",
            "label": "",
            "description": "Pepe Reina gets a well deserved ovation! Simone Verdi (Bologna) produces a decent first time strike towards the middle of the goal, but the goalkeeper is positioned well to block it. Nice goalkeeping skills. The ball goes out of play. Bologna are awarded a corner kick."
        },
        {
            "gameTime": "1 - 02:07",
            "label": "",
            "description": "Great touch by Lorenzo Insigne (Napoli) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bologna will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Daniele Doveri will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Head to head clashes between these two clubs: 19.4.2016 0:6, 6.12.2015 3:2, 19.1.2014 2:2, 25.8.2013 0:3, 8.5.2013 0:3."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli will be looking to keep their unbeaten run of 11 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Napoli is Jose Callejon with 7 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. Napoli were dominant and more threatening of the two sides. It was a fairly one sided match. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        }
    ],
    "gameAwayTeam": "Bologna",
    "gameDate": "17/09/2016 - 21:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "3 - 1"
}