{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-02-18 - 18-15 Real Madrid 2 - 0 Espanyol/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:10",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 46:37",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 46:11",
            "label": "",
            "description": "The Real Madrid players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:48",
            "label": "",
            "description": "Marcelo (Real Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 43:40",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 42:01",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a long through ball to Cristiano Ronaldo, but he fails to control it properly and loses it to one of the defending players. The ball is behind the touchline and Real Madrid will take a throw in."
        },
        {
            "gameTime": "2 - 38:00",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Isco, who plays a vital role in the build up. He squares it to Gareth Bale (Real Madrid), who beats Diego Lopez with a brilliant shot into the bottom right corner. 2:0."
        },
        {
            "gameTime": "2 - 36:59",
            "label": "y-card",
            "description": "Casemiro (Real Madrid) is shown a yellow card after a horrible tackle."
        },
        {
            "gameTime": "2 - 36:39",
            "label": "",
            "description": "Pepe (Real Madrid) reacts well and displays good awareness near the penalty spot to get on the end of a cross from the free kick. He jumps high and produces a header which goes well wide of the right post."
        },
        {
            "gameTime": "2 - 36:08",
            "label": "substitution",
            "description": "Quique Flores has decided to substitute Jose Manuel Jurado and he is replaced by Alvaro Vazquez (Espanyol)."
        },
        {
            "gameTime": "2 - 35:32",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Nacho trots off the pitch and is replaced by Marcelo (Real Madrid)."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "y-card",
            "description": "Aaron Caricol (Espanyol) takes his opponent down and receives a yellow card from the referee."
        },
        {
            "gameTime": "2 - 32:50",
            "label": "",
            "description": "This would have been a magnificent goal from Lucas (Real Madrid), who collected the ball inside the box and prodded a first time shot on goal that flew just narrowly wide of the right post. The ball is off of the pitch and it's a goal kick for Espanyol."
        },
        {
            "gameTime": "2 - 32:12",
            "label": "",
            "description": "Alberto Undiano Mallenco has a clear sight and sees a foul from Nacho (Real Madrid)."
        },
        {
            "gameTime": "2 - 31:08",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) tries his luck with a long range effort after receiving a precise pass, but Diego Lopez has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 29:35",
            "label": "corner",
            "description": "Isco (Real Madrid) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 29:17",
            "label": "",
            "description": "Isco (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 27:01",
            "label": "",
            "description": "Jose Manuel Jurado (Espanyol) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "2 - 26:20",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle as Hernan Perez (Espanyol) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 25:29",
            "label": "substitution",
            "description": "It's time for a substitution. Gareth Bale (Real Madrid) comes on in place of Alvaro Morata."
        },
        {
            "gameTime": "2 - 23:32",
            "label": "",
            "description": "Alvaro Morata sends a lovely lofted pass forward that flies over the top of the defence and into the path of Cristiano Ronaldo (Real Madrid), but he can't direct his header on target as it flies well over the bar. The ball is off of the pitch and it's a goal kick for Espanyol."
        },
        {
            "gameTime": "2 - 22:32",
            "label": "y-card",
            "description": "Pape Diop (Espanyol) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "2 - 21:10",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 20:29",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle. Hernan Perez (Espanyol) commits a foul after dangerous play."
        },
        {
            "gameTime": "2 - 19:12",
            "label": "",
            "description": "What a miskick by Casemiro (Real Madrid). He smashes a volley from long distance that goes into the stands."
        },
        {
            "gameTime": "2 - 18:14",
            "label": "attendance",
            "description": "The attendance for today's match is 75606."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "corner",
            "description": "The resulting corner from Pablo Piatti (Espanyol) is cleared."
        },
        {
            "gameTime": "2 - 16:28",
            "label": "",
            "description": "Francisco Casilla hears the fans clapping his superb goalkeeping. Hernan Perez (Espanyol) shoots from the edge of the box towards the right side of the goal, but the goalkeeper makes a magnificent save. Corner kick. Espanyol will have an opportunity."
        },
        {
            "gameTime": "2 - 16:00",
            "label": "substitution",
            "description": "That's the end of the game for Mateo Kovacic, who is replaced by Casemiro (Real Madrid)."
        },
        {
            "gameTime": "2 - 12:25",
            "label": "",
            "description": "Hernan Perez (Espanyol) touches the ball with his hand."
        },
        {
            "gameTime": "2 - 11:55",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 10:57",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "",
            "description": "The free kick from the edge of the box is taken by Cristiano Ronaldo (Real Madrid), but he hits it straight in the defensive wall."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "y-card",
            "description": "Javi Fuego (Espanyol) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 04:31",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "2 - 03:00",
            "label": "y-card",
            "description": "Isco (Real Madrid) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "2 - 01:24",
            "label": "",
            "description": "The foul by Hernan Perez (Espanyol) was seen by Alberto Undiano Mallenco who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 00:11",
            "label": "substitution",
            "description": "The game is over for Jose Antonio Reyes. Hernan Perez (Espanyol) comes on for the second half."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Alberto Undiano Mallenco has ended it."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:29",
            "label": "",
            "description": "Pablo Piatti (Espanyol) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 41:00",
            "label": "y-card",
            "description": "Mateo Kovacic (Real Madrid) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 38:52",
            "label": "",
            "description": "A player from Real Madrid commits a rough challenge. Alberto Undiano Mallenco blows for a foul and keeps the game under control."
        },
        {
            "gameTime": "1 - 37:50",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) is furious with himself as he misses a golden opportunity from inside the six yard box. He sends a rebound a few inches wide of the left post."
        },
        {
            "gameTime": "1 - 36:58",
            "label": "",
            "description": "The Real Madrid players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 35:12",
            "label": "",
            "description": "An attempted cross from Lucas (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "soccer-ball",
            "description": "Isco produces a beautiful lofted cross into the box, where Alvaro Morata (Real Madrid) rises high to head the ball into the left side of the goal and beyond the goalkeeper. He makes it 1:0."
        },
        {
            "gameTime": "1 - 30:41",
            "label": "",
            "description": "A goal, which was scored by Cristiano Ronaldo (Real Madrid), was disallowed due to offside."
        },
        {
            "gameTime": "1 - 30:10",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 30:02",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) misses a good chance to score. An inch perfect cross into the box finds Cristiano Ronaldo (Real Madrid) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 29:16",
            "label": "",
            "description": "Real Madrid are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 28:29",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "1 - 27:38",
            "label": "y-card",
            "description": "Gerard Moreno (Espanyol) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 24:26",
            "label": "injury",
            "description": "Mateo Kovacic (Real Madrid) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 23:30",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 21:00",
            "label": "corner",
            "description": "Isco (Real Madrid) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 20:40",
            "label": "",
            "description": "Lucas (Real Madrid) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 19:20",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) works the corner short."
        },
        {
            "gameTime": "1 - 17:45",
            "label": "",
            "description": "Isco (Real Madrid) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "1 - 16:33",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 15:36",
            "label": "",
            "description": "Real Madrid are just stroking the ball across the park now, but the defence is doing very well breaking up their possession."
        },
        {
            "gameTime": "1 - 13:30",
            "label": "",
            "description": "Gerard Moreno (Espanyol) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 13:12",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) sends the corner into the box, but Diego Lopez intercepts it and averts the threat."
        },
        {
            "gameTime": "1 - 12:45",
            "label": "",
            "description": "This should have been a goal! Alvaro Morata (Real Madrid) sends a killer pass into the box, but Isco can't trick the opposition's defence and loses possession."
        },
        {
            "gameTime": "1 - 11:52",
            "label": "",
            "description": "Pepe (Real Madrid) leaps highest to meet the resulting corner and attempts to head home, but the effort goes harmlessly wide of the left post."
        },
        {
            "gameTime": "1 - 11:51",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 11:22",
            "label": "",
            "description": "Lucas (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 10:22",
            "label": "",
            "description": "Dangerous play by Pape Diop (Espanyol). Alberto Undiano Mallenco blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 07:42",
            "label": "corner",
            "description": "Jose Manuel Jurado (Espanyol) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 07:23",
            "label": "",
            "description": "Gerard Moreno (Espanyol) looks to break free, but an opposing player clears the ball away. Good work from Espanyol as they win a corner."
        },
        {
            "gameTime": "1 - 05:41",
            "label": "",
            "description": "Great teamplay by Real Madrid as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 04:03",
            "label": "",
            "description": "Toni Kroos (Real Madrid) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "1 - 03:39",
            "label": "",
            "description": "Referee Alberto Undiano Mallenco sees the trip by Aaron Caricol (Espanyol) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 02:06",
            "label": "",
            "description": "Pape Diop (Espanyol) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Espanyol will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alberto Undiano Mallenco will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gerard Moreno has already scored 8 goals and he is the top goal scorer for Espanyol in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Real Madrid players have rippled the net at least once in their last 32 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's the end of the match."
        }
    ],
    "gameAwayTeam": "Espanyol",
    "gameDate": "18/02/2017 - 18:15",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "2 - 0"
}