{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2017-04-29 - 16-30 Dortmund 0 - 0 FC Koln/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:44",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 46:27",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) rises above the opponent's defence and heads a precise cross towards the right post. His effort, however, is blocked by Timo Horn, who pulls off a stunning save!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:25",
            "label": "y-card",
            "description": "Tobias Stieler shows a yellow card to Lukas Klunter (Koln) for his blatant foul."
        },
        {
            "gameTime": "2 - 38:31",
            "label": "y-card",
            "description": "Booking. Gonzalo Castro (Dortmund) receives a caution from the referee."
        },
        {
            "gameTime": "2 - 35:05",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Ousmane Dembele (Dortmund). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 34:49",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) whips the ball in from the long range free kick, but the first man gets it clear. The linesman makes the right call and Dortmund will have a corner."
        },
        {
            "gameTime": "2 - 34:43",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Milos Jojic will be replaced by Salih Ozcan (Koln)."
        },
        {
            "gameTime": "2 - 30:44",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) was too forceful with his tackle and Tobias Stieler interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 28:35",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to substitute Sokratis and he is replaced by Lukasz Piszczek (Dortmund)."
        },
        {
            "gameTime": "2 - 25:47",
            "label": "substitution",
            "description": "Leonardo Bittencourt comes off the pitch to be replaced by Marco Hoger (Koln)."
        },
        {
            "gameTime": "2 - 25:03",
            "label": "",
            "description": "What a chance! The ball is inside the box and Pierre Emerick Aubameyang (Dortmund) takes a first time shot on goal, but his volley goes narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 24:30",
            "label": "attendance",
            "description": "The attendance for today's match is 81360."
        },
        {
            "gameTime": "2 - 21:38",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the bottom right corner, but Timo Horn was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 20:53",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to make a change. Raphael Guerreiro (Dortmund) replaces Shinji Kagawa."
        },
        {
            "gameTime": "2 - 20:42",
            "label": "substitution",
            "description": "Substitution. Ousmane Dembele (Dortmund) has come on for Marco Reus."
        },
        {
            "gameTime": "2 - 20:05",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "2 - 16:58",
            "label": "corner",
            "description": "Timo Horn leaps to intercept the corner kick from Marco Reus (Dortmund)."
        },
        {
            "gameTime": "2 - 16:43",
            "label": "",
            "description": "Marco Reus (Dortmund) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Dortmund have a corner."
        },
        {
            "gameTime": "2 - 16:22",
            "label": "corner",
            "description": "The corner kick from Gonzalo Castro (Dortmund) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 16:11",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Shinji Kagawa (Dortmund), is intercepted by the opposition's defence. Dortmund earn a corner."
        },
        {
            "gameTime": "2 - 13:17",
            "label": "corner",
            "description": "Shinji Kagawa (Dortmund) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "substitution",
            "description": "Peter Stoger has decided to introduce fresh legs, with Simon Zoller (Koln) replacing Artjoms Rudnevs."
        },
        {
            "gameTime": "2 - 07:30",
            "label": "corner",
            "description": "The corner from Gonzalo Castro (Dortmund) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 07:16",
            "label": "",
            "description": "Christian Pulisic (Dortmund) delivers a promising cross into the box, but it's cleared. Dortmund force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 04:54",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 04:25",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) tries his luck with a long range effort after receiving a precise pass. It goes to the top left corner, but Timo Horn has a clear view of it and makes a comfortable save. Dortmund will take a corner kick."
        },
        {
            "gameTime": "2 - 02:44",
            "label": "",
            "description": "Great touch by Marco Reus (Dortmund) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:03",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 38:41",
            "label": "y-card",
            "description": "Leonardo Bittencourt (Koln) receives a yellow card."
        },
        {
            "gameTime": "1 - 37:55",
            "label": "",
            "description": "It wasn't the best example of how to strike the ball. Gonzalo Castro (Dortmund) unleashed a first time shot from the edge of the box that went high over the crossbar."
        },
        {
            "gameTime": "1 - 36:51",
            "label": "",
            "description": "Marco Reus (Dortmund) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity!"
        },
        {
            "gameTime": "1 - 35:37",
            "label": "",
            "description": "Flag goes up against Marco Reus (Dortmund) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 33:29",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Marco Reus (Dortmund) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "1 - 30:38",
            "label": "",
            "description": "The linesman raises his flag. Erik Durm (Dortmund) is adjudged offside."
        },
        {
            "gameTime": "1 - 28:52",
            "label": "",
            "description": "Chance! Milos Jojic (Koln) comes within inches of scoring after picking up a pass from Artjoms Rudnevs, but his shot from inside the box flashes inches wide of the left post."
        },
        {
            "gameTime": "1 - 26:19",
            "label": "",
            "description": "Chance! Marco Reus (Dortmund) comes within inches of scoring after picking up a pass from Pierre Emerick Aubameyang, but his shot from inside the box flashes just over the bar. The ball goes out of play and FC Koln will have a goal kick."
        },
        {
            "gameTime": "1 - 26:04",
            "label": "",
            "description": "Leonardo Bittencourt (Koln) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 25:46",
            "label": "corner",
            "description": "Shinji Kagawa (Dortmund) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 25:11",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) creates himself some space on the edge of the box and unleashes a strong shot which is blocked by a defender. Dortmund force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 22:37",
            "label": "",
            "description": "Jonas Hector (Koln) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 20:44",
            "label": "",
            "description": "That was close by Christian Pulisic (Dortmund)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the right post."
        },
        {
            "gameTime": "1 - 15:47",
            "label": "",
            "description": "Julian Weigl (Dortmund) latches on to a superb cross into the box and plants a header well wide of the right post."
        },
        {
            "gameTime": "1 - 15:27",
            "label": "corner",
            "description": "Marco Reus (Dortmund) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 15:02",
            "label": "",
            "description": "Marco Reus (Dortmund) passes the ball into the box but an opposing player clears. Dortmund win a corner."
        },
        {
            "gameTime": "1 - 14:31",
            "label": "",
            "description": "A goal, which was scored by Pierre Emerick Aubameyang (Dortmund), was disallowed due to offside."
        },
        {
            "gameTime": "1 - 12:56",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the left post."
        },
        {
            "gameTime": "1 - 11:34",
            "label": "",
            "description": "Lovely cross from Marco Reus to find Pierre Emerick Aubameyang (Dortmund) deep in the box, but he steers his header well wide of the right post."
        },
        {
            "gameTime": "1 - 10:39",
            "label": "corner",
            "description": "Marco Reus (Dortmund) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 10:13",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) races towards goal but the defender gets back well to make a challenge. The ball is out of play. A goal scoring opportunity from a corner for Dortmund."
        },
        {
            "gameTime": "1 - 08:59",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Erik Durm (Dortmund) was quite harsh and Tobias Stieler didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 07:08",
            "label": "",
            "description": "Marco Reus (Dortmund) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 06:53",
            "label": "",
            "description": "Marco Reus (Dortmund) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "Neven Subotic (Koln) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul. Dortmund have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 04:20",
            "label": "",
            "description": "Tobias Stieler blows his whistle. Marco Reus (Dortmund) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 02:07",
            "label": "",
            "description": "Christian Pulisic (Dortmund) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Dortmund will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Tobias Stieler."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund are still unbeaten at home this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of FC Koln is Anthony Modeste with 23 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "21 the number of consecutive matches that Dortmund scored at least one goal."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most prolific goal scorer for Dortmund is Pierre Emerick Aubameyang with 27 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        }
    ],
    "gameAwayTeam": "FC Koln",
    "gameDate": "29/04/2017 - 16:30",
    "gameHomeTeam": "Dortmund",
    "gameScore": "0 - 0"
}