{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-03-05 - 18-00 Manchester City 4 - 0 Aston Villa/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. Manchester City were dominant and more threatening of the two sides. It was a fairly one sided match. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        },
        {
            "gameTime": "2 - 48:04",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 47:51",
            "label": "attendance",
            "description": "The attendance for today's match is 53892."
        },
        {
            "gameTime": "2 - 46:11",
            "label": "",
            "description": "Manchester City slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 42:48",
            "label": "",
            "description": "Fernandinho (Manchester City) should know this behaviour is beyond the rules. He was too careless with his challenge and left Lee Mason no option but to blow his whistle."
        },
        {
            "gameTime": "2 - 41:58",
            "label": "",
            "description": "A pass by Gael Clichy (Manchester City) ends up in no man's land, and the attacking effort comes to an end. The ball is off of the pitch and it's a goal kick for Aston Villa."
        },
        {
            "gameTime": "2 - 39:26",
            "label": "",
            "description": "Rudy Gestede (Aston Villa) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 38:36",
            "label": "funfact",
            "description": "The ratio of the ball possession is 71:29."
        },
        {
            "gameTime": "2 - 38:13",
            "label": "",
            "description": "Half chance! Jesus Navas (Manchester City) plays a pass into the box, but Brad Guzan reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "",
            "description": "The free kick is taken short by Manchester City."
        },
        {
            "gameTime": "2 - 37:47",
            "label": "",
            "description": "Idrissa Gueye (Aston Villa) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision! Manchester City are awarded a free kick."
        },
        {
            "gameTime": "2 - 36:32",
            "label": "",
            "description": "Bacary Sagna (Manchester City) collects a pass and has an effort from 22 metres out, but it flies just over the crossbar."
        },
        {
            "gameTime": "2 - 34:43",
            "label": "substitution",
            "description": "Remi Garde prepares a substitution. Jordan Ayew is replaced by Scott Sinclair (Aston Villa)."
        },
        {
            "gameTime": "2 - 34:15",
            "label": "substitution",
            "description": "Yaya Toure goes off the pitch and Manu Garcia (Manchester City) comes on."
        },
        {
            "gameTime": "2 - 33:43",
            "label": "",
            "description": "Raheem Sterling (Manchester City) is penalised for a foul. Lee Mason had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 32:42",
            "label": "",
            "description": "Manchester City take the free kick with a short pass."
        },
        {
            "gameTime": "2 - 32:18",
            "label": "",
            "description": "Idrissa Gueye (Aston Villa) escapes without any punishment from the referee after using excessive force to foul his opponent. A free kick has been awarded to Manchester City."
        },
        {
            "gameTime": "2 - 31:58",
            "label": "funfact",
            "description": "22:2 – the total goal attempt statistics."
        },
        {
            "gameTime": "2 - 31:37",
            "label": "",
            "description": "Kelechi Iheanacho (Manchester City) makes a strong challenge and Lee Mason blows for a foul."
        },
        {
            "gameTime": "2 - 30:45",
            "label": "",
            "description": "Kelechi Iheanacho (Manchester City) knew what to do with the ball, but was just a bit unlucky. After receiving a pass, he sent the ball goalwards from some 25 metres out, but he missed the right post by a whisker."
        },
        {
            "gameTime": "2 - 30:20",
            "label": "",
            "description": "The Manchester City players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 28:16",
            "label": "substitution",
            "description": "Here's the change. Jordan Veretout leaves the pitch and Leandro Bacuna (Aston Villa) comes on as a substitute."
        },
        {
            "gameTime": "2 - 27:35",
            "label": "penalty-missed",
            "description": "Sergio Aguero (Manchester City) fails to score from the penalty as his shot only hits the right post."
        },
        {
            "gameTime": "2 - 27:12",
            "label": "",
            "description": "Sergio Aguero (Manchester City) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 26:49",
            "label": "penalty",
            "description": "Lee Mason blows his whistle for a foul after Ciaran Clark (Aston Villa) hacks down one of his opponents. Manchester City are awarded a penalty. What an opportunity to score!"
        },
        {
            "gameTime": "2 - 24:55",
            "label": "substitution",
            "description": "Remi Garde has decided to substitute Gabriel Agbonlahor and he is replaced by Rudy Gestede (Aston Villa)."
        },
        {
            "gameTime": "2 - 24:35",
            "label": "substitution",
            "description": "Substitution. David Silva makes way for Kelechi Iheanacho (Manchester City)."
        },
        {
            "gameTime": "2 - 20:50",
            "label": "soccer-ball",
            "description": "Goal! Raheem Sterling (Manchester City) pounced on a loose ball inside the box and beats the goalkeeper with a shot into the bottom left corner. He makes it 4:0."
        },
        {
            "gameTime": "2 - 17:37",
            "label": "corner",
            "description": "The corner from David Silva (Manchester City) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "",
            "description": "Raheem Sterling (Manchester City) latches on to an accurate pass on the edge of the box and produces a ferocious strike towards the left post, but his shot is well held by the goalkeeper. The ball goes out of play. Manchester City are awarded a corner kick."
        },
        {
            "gameTime": "2 - 16:01",
            "label": "substitution",
            "description": "Substitution. Wilfried Bony is replaced by Raheem Sterling (Manchester City)."
        },
        {
            "gameTime": "2 - 14:51",
            "label": "soccer-ball",
            "description": "Goal! David Silva puts a cross into the box and finds Sergio Aguero (Manchester City), who latches on to it and strikes the ball into the bottom left corner. He makes it 3:0."
        },
        {
            "gameTime": "2 - 14:45",
            "label": "",
            "description": "Quick reactions by David Silva (Manchester City) and Sergio Aguero, tricking their opponents with a cheeky chip pass. A beautiful football moment and great skill, which caused the noise in the stadium to go up a notch."
        },
        {
            "gameTime": "2 - 13:44",
            "label": "",
            "description": "Sergio Aguero (Manchester City) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "2 - 12:23",
            "label": "",
            "description": "Gabriel Agbonlahor (Aston Villa) plays in a hopeful cross, but it doesn't find its way to any of the attacking players."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "",
            "description": "Jordan Ayew (Aston Villa) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 09:34",
            "label": "",
            "description": "Long passes, short passes and one two passes. Manchester City are showcasing great team work by keeping possession and producing pin point passes from player to player. The opposition's players are finding it very difficult to intercept at the moment."
        },
        {
            "gameTime": "2 - 08:12",
            "label": "",
            "description": "Idrissa Gueye (Aston Villa) tackles a bit over zealously and Lee Mason blows for a foul."
        },
        {
            "gameTime": "2 - 04:56",
            "label": "soccer-ball",
            "description": "Goal! It's a catastrophic error from the opponent which has gifted a chance to Sergio Aguero (Manchester City), who rolls the ball into the back of the net from close range. 2:0."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "soccer-ball",
            "description": "Goal 1:0! David Silva laid the ball off to Yaya Toure (Manchester City), who shot from close range into the bottom left corner, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 02:21",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 02:03",
            "label": "",
            "description": "Jesus Navas (Manchester City) races towards goal but the defender gets back well to make a challenge. Manchester City have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The performance from both teams could be described as average. There have been only a few exciting situations and the fans will be expecting more in the second half. Manchester City dominated the opening period and easily created the most chances. The tactic of the home side is slow build up play, while the away team's main priority is a flawless defence."
        },
        {
            "gameTime": "1 - 46:23",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 46:01",
            "label": "",
            "description": "Sergio Aguero (Manchester City) misses a golden opportunity to score from inside the six yard box after firing the ball over the crossbar."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "y-card",
            "description": "Lee Mason shows a yellow card to Jordan Veretout (Aston Villa) for a tough tackle."
        },
        {
            "gameTime": "1 - 44:25",
            "label": "",
            "description": "Gabriel Agbonlahor (Aston Villa) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 44:03",
            "label": "injury",
            "description": "Gabriel Agbonlahor (Aston Villa) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 43:44",
            "label": "",
            "description": "Wilfried Bony (Manchester City) thinks that he is fouled by his opponent, but the referee deems him to be the one who commits a foul and awards a free kick to the other team."
        },
        {
            "gameTime": "1 - 43:06",
            "label": "",
            "description": "Jesus Navas (Manchester City) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball has crossed the sideline. Manchester City are taking a throw in."
        },
        {
            "gameTime": "1 - 41:57",
            "label": "",
            "description": "Brad Guzan doesn't have to worry about that one. Gael Clichy puts a cross in towards Wilfried Bony (Manchester City), who is unable to keep his header on target from the centre of the box. He sends the ball well wide of the right post."
        },
        {
            "gameTime": "1 - 41:26",
            "label": "",
            "description": "The free kick is taken by David Silva (Manchester City), but ball is cleared."
        },
        {
            "gameTime": "1 - 40:54",
            "label": "",
            "description": "Aly Cissokho (Aston Villa) commits a rough challenge and Lee Mason blows his whistle for an infringement. Manchester City win a free kick."
        },
        {
            "gameTime": "1 - 40:07",
            "label": "funfact",
            "description": "The total number of attempts is 22:2."
        },
        {
            "gameTime": "1 - 37:10",
            "label": "",
            "description": "Wilfried Bony (Manchester City) receives a quality pass inside the box and fires a first time shot. His effort towards the middle of the goal is saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 35:14",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) sends the corner into the box, but Brad Guzan intercepts it and averts the threat."
        },
        {
            "gameTime": "1 - 34:51",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Jesus Navas (Manchester City). The ball is out of play. Manchester City win a corner kick."
        },
        {
            "gameTime": "1 - 34:38",
            "label": "corner",
            "description": "David Silva (Manchester City) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 34:09",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Nicolas Otamendi (Manchester City). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate. Manchester City win a corner."
        },
        {
            "gameTime": "1 - 28:57",
            "label": "",
            "description": "Gael Clichy (Manchester City) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 28:12",
            "label": "",
            "description": "Bacary Sagna (Manchester City) attempts to find Wilfried Bony, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 26:44",
            "label": "",
            "description": "Sergio Aguero (Manchester City) fails to beat a perfect example of the offside trap."
        },
        {
            "gameTime": "1 - 26:05",
            "label": "corner",
            "description": "Jordan Veretout (Aston Villa) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 25:33",
            "label": "",
            "description": "Jordan Ayew (Aston Villa) picks up a pass and unleashes a strong shot from inside the box directed towards the right post, but the goalkeeper is equal to it! The ball goes out of play. Aston Villa are awarded a corner kick."
        },
        {
            "gameTime": "1 - 24:46",
            "label": "",
            "description": "Fernandinho (Manchester City) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Lee Mason with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 23:57",
            "label": "",
            "description": "CHANCE! Sergio Aguero (Manchester City) fires just wide of the left post from inside the box after running onto a splendid pass from Wilfried Bony."
        },
        {
            "gameTime": "1 - 22:47",
            "label": "",
            "description": "Jesus Navas (Manchester City) serves up a nice cross, but Brad Guzan punches the ball away."
        },
        {
            "gameTime": "1 - 21:52",
            "label": "",
            "description": "Gael Clichy (Manchester City) sprays a pass out to David Silva, but he can't beat his man inside the box."
        },
        {
            "gameTime": "1 - 20:48",
            "label": "funfact",
            "description": "Corner kicks – 9:1."
        },
        {
            "gameTime": "1 - 20:13",
            "label": "",
            "description": "Yaya Toure (Manchester City) receives a pass and tries his luck with a long range powerful effort. His poorly placed shot lacks accuracy and flies way over the crossbar."
        },
        {
            "gameTime": "1 - 19:08",
            "label": "",
            "description": "Fernandinho (Manchester City) receives a pass and fires a shot in from long range, but it's blocked."
        },
        {
            "gameTime": "1 - 18:47",
            "label": "",
            "description": "Yaya Toure (Manchester City) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "1 - 18:07",
            "label": "",
            "description": "Lee Mason blows his whistle. Micah Richards (Aston Villa) commits a foul after dangerous play. Manchester City earn a free kick."
        },
        {
            "gameTime": "1 - 17:20",
            "label": "",
            "description": "Brad Guzan pulls off a great save to deny Sergio Aguero (Manchester City), who makes himself some space inside the box and unleashes a quick shot to the right side of the goal."
        },
        {
            "gameTime": "1 - 16:31",
            "label": "corner",
            "description": "David Silva (Manchester City) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 16:10",
            "label": "",
            "description": "Sergio Aguero (Manchester City) fails to send a pass into the box as his effort is cut out. Manchester City have a corner."
        },
        {
            "gameTime": "1 - 13:37",
            "label": "",
            "description": "Gael Clichy (Manchester City) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 12:43",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 12:26",
            "label": "",
            "description": "Jesus Navas (Manchester City) fails to find any of his teammates inside the box as his pass is blocked. The ball goes out for a corner. Manchester City can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 12:04",
            "label": "corner",
            "description": "David Silva (Manchester City) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 10:56",
            "label": "",
            "description": "Brad Guzan pulls off a great save to deny Sergio Aguero (Manchester City), who makes himself some space inside the box and unleashes a quick shot towards the top of the net. The ball is out of play and the linesman points at the corner flag. Corner to Manchester City."
        },
        {
            "gameTime": "1 - 10:43",
            "label": "corner",
            "description": "David Silva (Manchester City) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 10:17",
            "label": "",
            "description": "Sergio Aguero (Manchester City) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Manchester City have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 08:09",
            "label": "",
            "description": "The ball is cleared after Alan Hutton (Aston Villa) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 06:36",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 06:19",
            "label": "",
            "description": "Wilfried Bony (Manchester City) looks to break free, but an opposing player clears the ball away. The referee signals a corner kick to Manchester City."
        },
        {
            "gameTime": "1 - 06:12",
            "label": "",
            "description": "Manchester City are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 04:40",
            "label": "",
            "description": "Gael Clichy (Manchester City) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 03:31",
            "label": "",
            "description": "Vincent Kompany (Manchester City) makes a reckless foul in order to win the ball from his opponent. Lee Mason has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Manchester City will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lee Mason will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. Manchester City were dominant and more threatening of the two sides. It was a fairly one sided match. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        }
    ],
    "gameAwayTeam": "Aston Villa",
    "gameDate": "05/03/2016 - 18:00",
    "gameHomeTeam": "Manchester City",
    "gameScore": "4 - 0"
}