{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/france_ligue-1/2016-2017/2017-02-26 - 23-00 Marseille 1 - 5 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:07",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "2 - 44:35",
            "label": "",
            "description": "Dimitri Payet (Marseille) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 38:59",
            "label": "y-card",
            "description": "Remy Cabella (Marseille) has tested the patience of referee Benoit Bastien and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 37:09",
            "label": "y-card",
            "description": "Julian Draxler (Paris SG) receives a yellow card for infringement."
        },
        {
            "gameTime": "2 - 36:36",
            "label": "substitution",
            "description": "Substitution. Hatem Ben Arfa (Paris SG) receives a signal from the referee and is now allowed to enter the pitch as Edinson Cavani walks off."
        },
        {
            "gameTime": "2 - 34:31",
            "label": "corner",
            "description": "Kevin Trapp comes off his line to intercept the corner from Dimitri Payet (Marseille)."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "",
            "description": "William Vainqueur (Marseille) sends a cross into the box, but the opposition's defence clears the ball to safety. Marseille will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 30:47",
            "label": "",
            "description": "Angel Di Maria (Paris SG) is clearly in an offside position and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 29:17",
            "label": "",
            "description": "Dimitri Payet (Marseille) decided to surprise the goalkeeper with a quick shot from the edge of the box, but his effort came back off the right post!"
        },
        {
            "gameTime": "2 - 27:05",
            "label": "substitution",
            "description": "Substitution. Angel Di Maria (Paris SG) on for Lucas."
        },
        {
            "gameTime": "2 - 26:50",
            "label": "soccer-ball",
            "description": "Goal! Blaise Matuidi (Paris SG) shows perfect technique and produces a first time effort from just outside the box that goes into the roof of the net. It's 1:5."
        },
        {
            "gameTime": "2 - 26:35",
            "label": "",
            "description": "Lucas (Paris SG) tested Yohann Pele with a strike from just outside the box, but the effort is saved."
        },
        {
            "gameTime": "2 - 24:37",
            "label": "soccer-ball",
            "description": "What a hit! Rod Fanni (Marseille) shows good composure inside the box to fire a first time shot inside the right post. 1:4."
        },
        {
            "gameTime": "2 - 22:41",
            "label": "",
            "description": "Edinson Cavani (Paris SG) wastes a big chance! He unleashes a shot from the edge of the box and it goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 21:24",
            "label": "substitution",
            "description": "Rudi Garcia has decided to introduce fresh legs, with Gregory Sertic (Marseille) replacing Florian Thauvin."
        },
        {
            "gameTime": "2 - 20:54",
            "label": "",
            "description": "William Vainqueur (Marseille) tackles a bit over zealously and Benoit Bastien blows for a foul."
        },
        {
            "gameTime": "2 - 15:05",
            "label": "soccer-ball",
            "description": "Goal! Thomas Meunier passes the ball to the feet of Julian Draxler (Paris SG), who has an empty net in front of him and has no problems in tapping the ball in. 0:4."
        },
        {
            "gameTime": "2 - 14:40",
            "label": "corner",
            "description": "Lucas (Paris SG) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 14:12",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) runs with the ball towards the keeper and pulls the trigger from close range, but Yohann Pele anticipates his intention and makes an amazing save to stop the shot going into the bottom left corner. Paris SG earn a corner."
        },
        {
            "gameTime": "2 - 13:15",
            "label": "corner",
            "description": "Florian Thauvin (Marseille) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 12:57",
            "label": "",
            "description": "Maxime Lopez (Marseille) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. Marseille force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 11:49",
            "label": "",
            "description": "Layvin Kurzawa (Paris SG) peeled away from his marker and got on the end of the corner, but his fine header directed towards the goal is brilliantly saved by the goalkeeper."
        },
        {
            "gameTime": "2 - 11:29",
            "label": "corner",
            "description": "Paris SG have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:23",
            "label": "",
            "description": "Layvin Kurzawa (Paris SG) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 10:15",
            "label": "corner",
            "description": "Lucas (Paris SG) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 10:01",
            "label": "substitution",
            "description": "Today's match ends for Javier Pastore who will be replaced by Julian Draxler (Paris SG)."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "",
            "description": "Layvin Kurzawa (Paris SG) shoots from the edge of the penalty area. The ball travels towards the target, but Yohann Pele easily deals with the threat. It will be a corner kick for Paris SG."
        },
        {
            "gameTime": "2 - 07:36",
            "label": "corner",
            "description": "Florian Thauvin (Marseille) sends over a poor, overhit cross from the corner kick and the ball goes out of play."
        },
        {
            "gameTime": "2 - 07:21",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Hiroki Sakai (Marseille), is intercepted by the opposition's defence. The ball is out of play. Marseille will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 06:12",
            "label": "substitution",
            "description": "Rudi Garcia prepares a substitution. Clinton N'Jie is replaced by Remy Cabella (Marseille)."
        },
        {
            "gameTime": "2 - 04:56",
            "label": "soccer-ball",
            "description": "Lucas (Paris SG) connects with a pass inside the box and slams home into the bottom right corner. The goalkeeper was helpless."
        },
        {
            "gameTime": "2 - 02:21",
            "label": "",
            "description": "Layvin Kurzawa (Paris SG) pulls the jersey of one of the opposition players and Benoit Bastien blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here's the change. Patrice Evra leaves the pitch and Henri Bedimo (Marseille) comes on as a substitute."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 45:14",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 42:29",
            "label": "",
            "description": "Dimitri Payet (Marseille) hammered the ball from a long range free kick only into the defensive wall."
        },
        {
            "gameTime": "1 - 42:04",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) makes a slide tackle, but referee Benoit Bastien blows for a foul. Marseille have a free kick."
        },
        {
            "gameTime": "1 - 37:41",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Patrice Evra (Marseille) was quite harsh and Benoit Bastien didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 36:05",
            "label": "",
            "description": "Thiago Silva (Paris SG) has a goal ruled out for offside!"
        },
        {
            "gameTime": "1 - 34:55",
            "label": "corner",
            "description": "Lucas (Paris SG) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 34:53",
            "label": "",
            "description": "Layvin Kurzawa (Paris SG) fires the ball at goal from inside the area, but it's well blocked. Paris SG have a corner."
        },
        {
            "gameTime": "1 - 33:37",
            "label": "",
            "description": "Edinson Cavani (Paris SG) has an effort from the edge of the area, but he skies the ball over the top."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "corner",
            "description": "Florian Thauvin (Marseille) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 32:31",
            "label": "",
            "description": "Maxime Lopez (Marseille) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. The ball is out of play and Marseille manage to earn a corner."
        },
        {
            "gameTime": "1 - 30:15",
            "label": "",
            "description": "The free kick from long distance is taken by Dimitri Payet (Marseille), who fires in a direct effort just wide of the right post. What a chance!"
        },
        {
            "gameTime": "1 - 28:29",
            "label": "y-card",
            "description": "This is a yellow card! Marco Verratti (Paris SG) is not happy with the decision, but from our point of view it was clear."
        },
        {
            "gameTime": "1 - 28:10",
            "label": "corner",
            "description": "Lucas (Paris SG) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "1 - 27:41",
            "label": "",
            "description": "Layvin Kurzawa (Paris SG) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. Paris SG force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 23:05",
            "label": "",
            "description": "Lucas (Paris SG) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Yohann Pele."
        },
        {
            "gameTime": "1 - 19:28",
            "label": "",
            "description": "Benoit Bastien blows the whistle, Javier Pastore (Paris SG) is penalised for a foul."
        },
        {
            "gameTime": "1 - 15:39",
            "label": "soccer-ball",
            "description": "GOAL! Edinson Cavani (Paris SG) collects a pass and from inside the box he lifts the ball over Yohann Pele, who was off his line. What a finish that is! 0:2."
        },
        {
            "gameTime": "1 - 14:08",
            "label": "",
            "description": "Dimitri Payet (Marseille) has an effort on goal, but he misses to the right of the goal."
        },
        {
            "gameTime": "1 - 12:28",
            "label": "corner",
            "description": "The resulting corner from Lucas (Paris SG) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 11:50",
            "label": "",
            "description": "Layvin Kurzawa (Paris SG) wins himself just enough space inside the box to connect with the corner, but his header is well saved by the keeper. The referee and one of his assistants signal for a corner kick to Paris SG."
        },
        {
            "gameTime": "1 - 11:26",
            "label": "corner",
            "description": "The ball is out of play. A goal scoring opportunity from a corner for Paris SG."
        },
        {
            "gameTime": "1 - 11:21",
            "label": "",
            "description": "Thomas Meunier (Paris SG) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 10:00",
            "label": "",
            "description": "Patrice Evra (Marseille) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "1 - 05:16",
            "label": "soccer-ball",
            "description": "GOAL 0:1! The resulting free kick is headed powerfully goalwards by Thiago Silva and Marquinhos (Paris SG) glances a header from close range into the back of the net."
        },
        {
            "gameTime": "1 - 05:02",
            "label": "",
            "description": "William Vainqueur (Marseille) brings an opponent down and Benoit Bastien interrupts the game."
        },
        {
            "gameTime": "1 - 02:57",
            "label": "corner",
            "description": "The corner kick from Florian Thauvin (Marseille) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 02:40",
            "label": "",
            "description": "Clinton N'Jie (Marseille) fails to send a pass into the box as his effort is cut out. The referee blows his whistle, Marseille are awarded a corner kick."
        },
        {
            "gameTime": "1 - 01:42",
            "label": "",
            "description": "Referee Benoit Bastien sees the trip by Maxime Lopez (Marseille) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Benoit Bastien will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "26/02/2017 - 23:00",
    "gameHomeTeam": "Marseille",
    "gameScore": "1 - 5"
}