{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-25 - 20-00 CSKA Moscow 0 - 2 Wolfsburg/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The Wolfsburg fans must be pleased with the performance of their team. They were absolutely the better of the two sides. Both teams attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 49:09",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 47:37",
            "label": "y-card",
            "description": "Referee Gianluca Rocchi sees the trip by Bibras Natcho (CSKA Moscow) and doesn't hesitate to blow his whistle. Bibras Natcho (CSKA Moscow) is penalised."
        },
        {
            "gameTime": "2 - 46:57",
            "label": "",
            "description": "Sebastian Jung (Wolfsburg) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 46:22",
            "label": "",
            "description": "Nicklas Bendtner (Wolfsburg) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball onto the left post. Nice run, but unlucky finish!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:25",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Alan Dzagoev will be replaced by Kirill Panchenko (CSKA Moscow)."
        },
        {
            "gameTime": "2 - 42:50",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Sebastian Jung slips the ball through to Andre Schurrle (Wolfsburg), and he darts into the box to unleash a magnificent shot into the bottom right corner. He makes it 0:2."
        },
        {
            "gameTime": "2 - 42:07",
            "label": "",
            "description": "Nicklas Bendtner (Wolfsburg) races towards goal but the defender gets back well to make a challenge. The ball is out of play. Wolfsburg will take a throw in."
        },
        {
            "gameTime": "2 - 41:36",
            "label": "",
            "description": "Alan Dzagoev (CSKA Moscow) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 40:53",
            "label": "substitution",
            "description": "Dieter Hecking has decided to substitute Bas Dost and he is replaced by Nicklas Bendtner (Wolfsburg)."
        },
        {
            "gameTime": "2 - 39:57",
            "label": "attendance",
            "description": "The attendance is 16450."
        },
        {
            "gameTime": "2 - 39:42",
            "label": "",
            "description": "Zoran Tosic (CSKA Moscow) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 39:41",
            "label": "corner",
            "description": "Alan Dzagoev (CSKA Moscow) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 39:20",
            "label": "",
            "description": "Ahmed Musa (CSKA Moscow) slaloms his way past challenges, but an opposing player does well to get the ball away. CSKA Moscow have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "",
            "description": "Josuha Guilavogui (Wolfsburg) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "2 - 35:44",
            "label": "substitution",
            "description": "Here comes a substitution. Sebastian Jung (Wolfsburg) is brought on as a substitute for Max Kruse."
        },
        {
            "gameTime": "2 - 35:09",
            "label": "",
            "description": "Georgi Milanov (CSKA Moscow) serves up a nice cross, but Diego Benaglio punches the ball away."
        },
        {
            "gameTime": "2 - 33:53",
            "label": "",
            "description": "Ahmed Musa (CSKA Moscow) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 32:37",
            "label": "",
            "description": "CSKA Moscow seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 29:19",
            "label": "substitution",
            "description": "Leonid Slutski prepares a substitution. Kirill Nababkin is replaced by Bibras Natcho (CSKA Moscow)."
        },
        {
            "gameTime": "2 - 28:56",
            "label": "",
            "description": "Andre Schurrle (Wolfsburg) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 27:50",
            "label": "",
            "description": "Alan Dzagoev (CSKA Moscow) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "corner",
            "description": "Alan Dzagoev (CSKA Moscow) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 26:06",
            "label": "",
            "description": "Zoran Tosic (CSKA Moscow) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. The ball is out of play. CSKA Moscow win a corner kick."
        },
        {
            "gameTime": "2 - 25:52",
            "label": "",
            "description": "Half chance! Andre Schurrle (Wolfsburg) plays a pass into the box, but Igor Akinfeev reacts well to snuff out the attack. The linesman signals a throw in for Wolfsburg."
        },
        {
            "gameTime": "2 - 24:42",
            "label": "",
            "description": "Bas Dost (Wolfsburg) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 23:59",
            "label": "",
            "description": "Ahmed Musa (CSKA Moscow) sends a pass into the penalty area, but the opponent manages to cut it out."
        },
        {
            "gameTime": "2 - 21:49",
            "label": "soccer-ball-own",
            "description": "An unfortunate moment for Igor Akinfeev (CSKA Moscow), who has scored an own goal."
        },
        {
            "gameTime": "2 - 21:00",
            "label": "",
            "description": "Andre Schurrle (Wolfsburg) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 20:20",
            "label": "injury",
            "description": "Andre Schurrle (Wolfsburg) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 20:07",
            "label": "corner",
            "description": "Alan Dzagoev (CSKA Moscow) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 19:51",
            "label": "",
            "description": "Zoran Tosic (CSKA Moscow) flights in the cross, but the defender is alert and clears to safety. CSKA Moscow force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 17:08",
            "label": "",
            "description": "The referee blows his whistle as Viktor Vasin (CSKA Moscow) was too aggressive in his challenge."
        },
        {
            "gameTime": "2 - 17:08",
            "label": "",
            "description": "Naldo (Wolfsburg) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "2 - 16:58",
            "label": "y-card",
            "description": "Gianluca Rocchi blows his whistle for a foul after Pontus Wernbloom (CSKA Moscow) hacks down one of his opponents. Pontus Wernbloom (CSKA Moscow) picks up a caution."
        },
        {
            "gameTime": "2 - 16:35",
            "label": "",
            "description": "OFF THE POST! Zoran Tosic (CSKA Moscow) runs towards the goal to give his teammate support. He receives a fantastic pass and shoots from the edge of the box, but it crashes against the left post. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "2 - 15:15",
            "label": "substitution",
            "description": "Dieter Hecking has decided to make a change. Andre Schurrle (Wolfsburg) replaces Daniel Caligiuri."
        },
        {
            "gameTime": "2 - 14:46",
            "label": "",
            "description": "Pontus Wernbloom (CSKA Moscow) receives a pass and tries his luck with a long range powerful effort. His poorly placed shot lacks accuracy and flies way over the crossbar."
        },
        {
            "gameTime": "2 - 13:49",
            "label": "corner",
            "description": "A corner kick by CSKA Moscow is thwarted by the well prepared Diego Benaglio (Wolfsburg)."
        },
        {
            "gameTime": "2 - 13:39",
            "label": "",
            "description": "Zoran Tosic (CSKA Moscow) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The referee and his assistant both point at the corner flag. CSKA Moscow will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 12:19",
            "label": "",
            "description": "Maximilian Arnold (Wolfsburg) collects a rebound a long way out and doesn't hesitate to release a goal bound hammer of a shot. His attempt is precise and towards the bottom right corner. It would have ended in the back of the net if it wasn't for Igor Akinfeev and his brilliant save."
        },
        {
            "gameTime": "2 - 12:15",
            "label": "",
            "description": "Christian Trasch (Wolfsburg) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "2 - 11:40",
            "label": "",
            "description": "Vieirinha (Wolfsburg) is adjudged offside."
        },
        {
            "gameTime": "2 - 10:36",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Ahmed Musa (CSKA Moscow) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 10:06",
            "label": "corner",
            "description": "Marcel Schafer (Wolfsburg) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 09:56",
            "label": "",
            "description": "A lofted cross from Daniel Caligiuri (Wolfsburg) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The ball is out of play and the linesman points at the corner flag. Corner to Wolfsburg."
        },
        {
            "gameTime": "2 - 08:30",
            "label": "",
            "description": "A cross by Ahmed Musa (CSKA Moscow) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor. The ball goes out of play and Wolfsburg will have a goal kick."
        },
        {
            "gameTime": "2 - 08:06",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Daniel Caligiuri (Wolfsburg)."
        },
        {
            "gameTime": "2 - 06:12",
            "label": "corner",
            "description": "Marcel Schafer (Wolfsburg) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 06:00",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. Wolfsburg win a corner."
        },
        {
            "gameTime": "2 - 04:41",
            "label": "",
            "description": "Alan Dzagoev (CSKA Moscow) tries to find Ahmed Musa, but he puts too much power on the pass."
        },
        {
            "gameTime": "2 - 03:50",
            "label": "corner",
            "description": "Alan Dzagoev (CSKA Moscow) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "",
            "description": "Georgi Milanov (CSKA Moscow) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. The linesman makes the right call and CSKA Moscow will have a corner."
        },
        {
            "gameTime": "2 - 03:05",
            "label": "",
            "description": "Alan Dzagoev (CSKA Moscow) sends a teasing cross into the area, but Diego Benaglio intercepts the ball."
        },
        {
            "gameTime": "2 - 02:06",
            "label": "corner",
            "description": "Alan Dzagoev (CSKA Moscow) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 01:55",
            "label": "",
            "description": "The ball is cleared after Ahmed Musa (CSKA Moscow) attempted to dribble past an opposing player. The referee and one of his assistants signal for a corner kick to CSKA Moscow."
        },
        {
            "gameTime": "2 - 01:00",
            "label": "",
            "description": "The linesman raises his flag for offside before Daniel Caligiuri (Wolfsburg) heads on."
        },
        {
            "gameTime": "2 - 00:10",
            "label": "substitution",
            "description": "There will be a change on the pitch for the second half. Leonid Slutski probably wasn't satisfied with the performance of Sergey Ignashevich. He is replaced by Viktor Vasin (CSKA Moscow)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The game can't be described as attractive. We are hoping against hope that the second half will bring more exciting moments and goal opportunities. The visitors enjoy superiority over the opposition. The home side focus on defending and let the opposition enjoy possession of the ball."
        },
        {
            "gameTime": "1 - 46:03",
            "label": "whistle",
            "description": "Gianluca Rocchi has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "",
            "description": "Seydou Doumbia (CSKA Moscow) is flagged for offside."
        },
        {
            "gameTime": "1 - 44:13",
            "label": "",
            "description": "Alan Dzagoev (CSKA Moscow) fails to pick a body out in the box with an over hit cross to the back post. The ball is off of the pitch and it's a goal kick for Wolfsburg."
        },
        {
            "gameTime": "1 - 42:16",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) takes a rebound on the edge of the box and slams the ball well wide of the left post."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "corner",
            "description": "Marcel Schafer (Wolfsburg) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 41:37",
            "label": "",
            "description": "Christian Trasch (Wolfsburg) attempts a long crossfield pass, but the defence does well to intercept the ball. Corner kick. Wolfsburg will have an opportunity."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "",
            "description": "Marcel Schafer (Wolfsburg) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "1 - 39:16",
            "label": "",
            "description": "An attempted cross from Mario Fernandes (CSKA Moscow) is cleared."
        },
        {
            "gameTime": "1 - 38:47",
            "label": "",
            "description": "Gianluca Rocchi interrupts the game for a tactical foul by Christian Trasch (Wolfsburg)."
        },
        {
            "gameTime": "1 - 38:31",
            "label": "",
            "description": "Josuha Guilavogui (Wolfsburg) sends a long ball in, but Igor Akinfeev comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 36:01",
            "label": "corner",
            "description": "Marcel Schafer (Wolfsburg) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 35:19",
            "label": "",
            "description": "Igor Akinfeev pulls off a great save to deny Max Kruse (Wolfsburg), who makes himself some space inside the box and unleashes a quick shot to the left side of the goal. Wolfsburg will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 34:29",
            "label": "",
            "description": "Georgi Milanov (CSKA Moscow) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 33:31",
            "label": "",
            "description": "What a huge chance for Ahmed Musa (CSKA Moscow). He collects a precise pass inside the box and slices a shot that goes a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 32:55",
            "label": "",
            "description": "Marcel Schafer (Wolfsburg) breaks past challenges inside the box, but puts too much pace on his pass to Bas Dost."
        },
        {
            "gameTime": "1 - 31:10",
            "label": "",
            "description": "Bas Dost (Wolfsburg) passes the ball onto Max Kruse, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 30:35",
            "label": "",
            "description": "Seydou Doumbia (CSKA Moscow) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 27:29",
            "label": "y-card",
            "description": "Mario Fernandes (CSKA Moscow) jumps into a tackle and Gianluca Rocchi blows his whistle for a foul. The referee shows the yellow card to Mario Fernandes (CSKA Moscow)."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "",
            "description": "Alan Dzagoev (CSKA Moscow) smashes the ball towards goal from the edge of the penalty box, but his effort flies just a few inches wide of the right post."
        },
        {
            "gameTime": "1 - 25:32",
            "label": "",
            "description": "Georgi Milanov (CSKA Moscow) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 23:11",
            "label": "",
            "description": "Alan Dzagoev (CSKA Moscow) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 21:59",
            "label": "",
            "description": "Foul! Zoran Tosic (CSKA Moscow) is penalised for pulling back his opponent."
        },
        {
            "gameTime": "1 - 19:36",
            "label": "",
            "description": "Seydou Doumbia (CSKA Moscow) makes a rough challenge and Gianluca Rocchi blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 18:15",
            "label": "",
            "description": "Alan Dzagoev (CSKA Moscow) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 17:40",
            "label": "",
            "description": "The linesman signals that Seydou Doumbia (CSKA Moscow) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 17:30",
            "label": "",
            "description": "Flag goes up against Josuha Guilavogui (Wolfsburg) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 16:48",
            "label": "y-card",
            "description": "Ahmed Musa (CSKA Moscow) trips an opposition player and Gianluca Rocchi signals a foul. The referee gives a yellow card to Ahmed Musa (CSKA Moscow)."
        },
        {
            "gameTime": "1 - 15:50",
            "label": "",
            "description": "Georgi Milanov (CSKA Moscow) receives a pass and fires a shot in from long range, but it's blocked."
        },
        {
            "gameTime": "1 - 12:06",
            "label": "",
            "description": "Josuha Guilavogui (Wolfsburg) was too forceful with his tackle and Gianluca Rocchi interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 10:56",
            "label": "",
            "description": "Georgi Milanov (CSKA Moscow) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "1 - 09:30",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Vieirinha (Wolfsburg), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "1 - 08:54",
            "label": "",
            "description": "Mario Fernandes (CSKA Moscow) was trying to get to the ball but clattered into the legs of the opponent as well. Gianluca Rocchi blows his whistle for an infringement. Wolfsburg win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 07:17",
            "label": "",
            "description": "Bas Dost (Wolfsburg) tries his luck with a long range shot from a rebound, but it isn't precise at all and the ball flies miles over the crossbar. Very poor shot."
        },
        {
            "gameTime": "1 - 06:23",
            "label": "",
            "description": "Bas Dost (Wolfsburg) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball goes well wide of the right post!"
        },
        {
            "gameTime": "1 - 06:15",
            "label": "",
            "description": "Wolfsburg enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 05:42",
            "label": "",
            "description": "Marcel Schafer (Wolfsburg) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 04:02",
            "label": "",
            "description": "Ahmed Musa (CSKA Moscow) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 01:57",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 00:16",
            "label": "",
            "description": "The players are out at last! CSKA Moscow will take the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gianluca Rocchi is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The Wolfsburg fans must be pleased with the performance of their team. They were absolutely the better of the two sides. Both teams attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Wolfsburg",
    "gameDate": "25/11/2015 - 20:00",
    "gameHomeTeam": "CSKA Moscow",
    "gameScore": "0 - 2"
}