{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-02-17 - 22-45 Paris SG 1 - 1 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The host team were superior on the pitch today. The home team played possession football and the away players really focused on a well organized defence."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "",
            "description": "The foul by David Luiz (Paris SG) was seen by Cuneyt Cakir who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 46:57",
            "label": "corner",
            "description": "Corner kick. Javier Pastore (Paris SG) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 46:29",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) attempts to convert a cross into a goal, but his promising header from near the penalty spot towards the right post is denied by a decent save from Thibaut Courtois. Paris SG force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:49",
            "label": "",
            "description": "Javier Pastore (Paris SG) plays in a hopeful cross, but it doesn't find its way to any of the attacking players. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "2 - 42:44",
            "label": "",
            "description": "Javier Pastore (Paris SG) produces a killer pass onto Blaise Matuidi, who loses the ball to one of the defenders."
        },
        {
            "gameTime": "2 - 40:01",
            "label": "",
            "description": "Javier Pastore (Paris SG) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "2 - 39:03",
            "label": "",
            "description": "A cross is clipped into the penalty area by Javier Pastore (Paris SG) but poses no threat."
        },
        {
            "gameTime": "2 - 38:01",
            "label": "substitution",
            "description": "Jose Mourinho has decided to introduce fresh legs, with Oscar (Chelsea) replacing Cesc Fabregas."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "",
            "description": "Javier Pastore (Paris SG) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the right post."
        },
        {
            "gameTime": "2 - 36:46",
            "label": "attendance",
            "description": "The attendance is 45713."
        },
        {
            "gameTime": "2 - 35:59",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Loic Remy (Chelsea) for Diego Costa."
        },
        {
            "gameTime": "2 - 35:49",
            "label": "substitution",
            "description": "Laurent Blanc prepares a substitution. Ezequiel Lavezzi is replaced by Javier Pastore (Paris SG)."
        },
        {
            "gameTime": "2 - 34:57",
            "label": "",
            "description": "A brilliant individual effort! Edinson Cavani (Paris SG) tricks his way past challenges into the box and drags his shot narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 34:44",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 14:2."
        },
        {
            "gameTime": "2 - 33:43",
            "label": "substitution",
            "description": "Substitution. Juan Cuadrado (Chelsea) in, Willian out."
        },
        {
            "gameTime": "2 - 33:07",
            "label": "y-card",
            "description": "Cuneyt Cakir shows a yellow card to Marco Verratti (Paris SG) for his blatant foul."
        },
        {
            "gameTime": "2 - 32:21",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) takes the free kick from a long way out but the defender manages to get it clear."
        },
        {
            "gameTime": "2 - 31:40",
            "label": "",
            "description": "Cuneyt Cakir blows the whistle, David Luiz (Paris SG) is penalised for a foul. A free kick has been awarded to Chelsea."
        },
        {
            "gameTime": "2 - 29:47",
            "label": "",
            "description": "Nemanja Matic (Chelsea) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 28:10",
            "label": "",
            "description": "David Luiz (Paris SG) wasted an opportunity to score from the free kick from about 30 metres out. His attempt hit the defensive wall."
        },
        {
            "gameTime": "2 - 27:15",
            "label": "y-card",
            "description": "Cuneyt Cakir shows the yellow card to Cesc Fabregas (Chelsea) for a heavy challenge. Paris SG win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 25:06",
            "label": "corner",
            "description": "Ezequiel Lavezzi (Paris SG) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 24:30",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) fails to send a pass into the box as his effort is cut out. The referee blows his whistle, Paris SG are awarded a corner kick."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) pulls the jersey of one of the opposition players and Cuneyt Cakir blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 21:39",
            "label": "corner",
            "description": "The corner from Ezequiel Lavezzi (Paris SG) is intercepted by Thibaut Courtois."
        },
        {
            "gameTime": "2 - 21:25",
            "label": "corner",
            "description": "Ezequiel Lavezzi (Paris SG) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance. The ball goes out of play. Paris SG are awarded a corner kick."
        },
        {
            "gameTime": "2 - 21:13",
            "label": "",
            "description": "David Luiz (Paris SG) darts to the edge of the box to meet the ball from the free kick and directs a header under the crossbar. One of the defending players gets in its way and blocks it. The referee points to the corner flag and Paris SG will take a corner."
        },
        {
            "gameTime": "2 - 20:07",
            "label": "y-card",
            "description": "Branislav Ivanovic (Chelsea) is booked after bringing down an opponent. Cuneyt Cakir had an easy decision to make. Paris SG have a free kick."
        },
        {
            "gameTime": "2 - 19:33",
            "label": "",
            "description": "A cross from the free kick is whipped in by Cesc Fabregas (Chelsea), but one of the defenders steps in and averts the threat."
        },
        {
            "gameTime": "2 - 19:17",
            "label": "",
            "description": "David Luiz (Paris SG) pulls the shirt of his opponent and only escapes without punishment due to the benevolence of the referee. A free kick is awarded to Chelsea."
        },
        {
            "gameTime": "2 - 16:40",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 15:31",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) gives away a foul for a clumsy challenge. Referee Cuneyt Cakir saw the whole situation."
        },
        {
            "gameTime": "2 - 14:28",
            "label": "",
            "description": "Ezequiel Lavezzi (Paris SG) is first to the rebound and sends a header goalwards but it's blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "2 - 14:02",
            "label": "",
            "description": "Thibaut Courtois can hear the fans clapping for his superb goalkeeping after he magnificently stops the close range effort from Zlatan Ibrahimovic (Paris SG). The ball would have probably ended up in the middle of the net."
        },
        {
            "gameTime": "2 - 13:26",
            "label": "corner",
            "description": "Ezequiel Lavezzi (Paris SG) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 12:54",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball goes out of play and Paris SG have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "corner",
            "description": "Salvatore Sirigu leaps to intercept the corner kick from Cesc Fabregas (Chelsea)."
        },
        {
            "gameTime": "2 - 11:00",
            "label": "",
            "description": "Nemanja Matic (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Chelsea force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 08:55",
            "label": "soccer-ball",
            "description": "It's a goal! Edinson Cavani (Paris SG) makes it 0:1. He jumped highest to connect with a perfect cross from Blaise Matuidi and planted his close range header into the right side of the goal. Thibaut Courtois was helpless."
        },
        {
            "gameTime": "2 - 07:45",
            "label": "",
            "description": "John Terry (Chelsea) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 07:00",
            "label": "y-card",
            "description": "Gregory van der Wiel (Paris SG) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Cuneyt Cakir ignores the protests."
        },
        {
            "gameTime": "2 - 05:08",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) brings his opponent down. Cuneyt Cakir has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 04:32",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 03:52",
            "label": "",
            "description": "Marco Verratti (Paris SG) makes a rough challenge and Cuneyt Cakir blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 03:21",
            "label": "",
            "description": "Thiago Silva (Paris SG) plays a long ball to Zlatan Ibrahimovic, but the defence is well organised and manages to get it clear."
        },
        {
            "gameTime": "2 - 02:05",
            "label": "",
            "description": "Marco Verratti (Paris SG) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 01:41",
            "label": "",
            "description": "Maxwell (Paris SG) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The linesman signals a throw in for Paris SG."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have seen a few chances and nice movements, but the overall impression of the game is rather average and not hugely entertaining. The game is quite balanced. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 45:04",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 44:19",
            "label": "",
            "description": "Close! Zlatan Ibrahimovic (Paris SG) stands over the resulting free kick from around 24 metres out and his shot goes just over the crossbar."
        },
        {
            "gameTime": "1 - 42:56",
            "label": "",
            "description": "Nemanja Matic (Chelsea) commits an ugly tackle on his opponent, but there is no caution from the referee. Paris SG earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 41:27",
            "label": "",
            "description": "Cuneyt Cakir blows his whistle. Cesc Fabregas (Chelsea) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "",
            "description": "Ezequiel Lavezzi (Paris SG) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "1 - 40:42",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 37:45",
            "label": "",
            "description": "The Chelsea players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession."
        },
        {
            "gameTime": "1 - 35:43",
            "label": "soccer-ball",
            "description": "Goal! Gary Cahill finds Branislav Ivanovic (Chelsea) and he shows great determination to get to the ball and plant a header into the back of the net. 0:1."
        },
        {
            "gameTime": "1 - 34:24",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) trips an opponent with a slide tackle. Cuneyt Cakir stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 34:07",
            "label": "corner",
            "description": "Ezequiel Lavezzi (Paris SG) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 33:40",
            "label": "",
            "description": "Edinson Cavani (Paris SG) won himself just enough space to connect with the corner inside the box. His header flew towards the right post, but the goalkeeper dived superbly to stop the effort. Paris SG win a corner."
        },
        {
            "gameTime": "1 - 33:28",
            "label": "corner",
            "description": "Ezequiel Lavezzi (Paris SG) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 32:37",
            "label": "",
            "description": "Ezequiel Lavezzi (Paris SG) serves up a nice cross, but the defence clears the danger. The ball is out of play and the linesman points at the corner flag. Corner to Paris SG."
        },
        {
            "gameTime": "1 - 32:14",
            "label": "",
            "description": "Ramires (Chelsea) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "1 - 31:55",
            "label": "",
            "description": "David Luiz (Paris SG) is penalised for holding. Cuneyt Cakir signals a set piece."
        },
        {
            "gameTime": "1 - 29:47",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "1 - 28:48",
            "label": "",
            "description": "Marco Verratti (Paris SG) is penalised after knocking an opponent down. Chelsea are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 26:42",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "1 - 26:01",
            "label": "",
            "description": "Paris SG are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 25:21",
            "label": "",
            "description": "Nemanja Matic (Chelsea) was too forceful with his tackle and Cuneyt Cakir interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 25:02",
            "label": "",
            "description": "A pass from Eden Hazard (Chelsea) is intercepted by Salvatore Sirigu and the move breaks down."
        },
        {
            "gameTime": "1 - 24:12",
            "label": "",
            "description": "Maxwell (Paris SG) sends a cross into the box, but Thibaut Courtois comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 23:40",
            "label": "",
            "description": "Ezequiel Lavezzi (Paris SG) climbs high to connect with a cross on the edge of the box, but his header is off target."
        },
        {
            "gameTime": "1 - 22:11",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) is flagged for offside."
        },
        {
            "gameTime": "1 - 19:13",
            "label": "",
            "description": "Cuneyt Cakir couldn't ignore the rough tackle by Diego Costa (Chelsea) and blew his whistle."
        },
        {
            "gameTime": "1 - 18:53",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) unleashes a missile of a shot towards goal, but his good effort is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 17:36",
            "label": "",
            "description": "Nemanja Matic (Chelsea) commits a rough foul. Cuneyt Cakir stops the game and makes a call."
        },
        {
            "gameTime": "1 - 16:49",
            "label": "",
            "description": "Diego Costa (Chelsea) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "1 - 14:44",
            "label": "",
            "description": "Maxwell (Paris SG) swings a cross into the box, but it's far too close to Thibaut Courtois, who smothers the ball."
        },
        {
            "gameTime": "1 - 13:34",
            "label": "",
            "description": "A pass by Edinson Cavani (Paris SG) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 12:37",
            "label": "",
            "description": "Cuneyt Cakir interrupts the game for a tactical foul by Gary Cahill (Chelsea)."
        },
        {
            "gameTime": "1 - 10:38",
            "label": "",
            "description": "A brilliant cross into the box finds Zlatan Ibrahimovic (Paris SG), who directs his header to the middle of the goal, but the goalkeeper shows his reflexes and makes an astonishing save."
        },
        {
            "gameTime": "1 - 10:13",
            "label": "",
            "description": "Thibaut Courtois pulls off a decent save! Blaise Matuidi (Paris SG) attempts to head home after a precise cross into the box. He aims his header towards the middle of the net, but the effort is kept out."
        },
        {
            "gameTime": "1 - 08:53",
            "label": "",
            "description": "Ezequiel Lavezzi (Paris SG) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 07:53",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 06:55",
            "label": "",
            "description": "The ball spins up and hits the hand of Cesc Fabregas (Chelsea) after he fails to control it and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 03:45",
            "label": "",
            "description": "Dangerous play by Gregory van der Wiel (Paris SG). Cuneyt Cakir blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 02:56",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 02:28",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "1 - 01:55",
            "label": "",
            "description": "A crossfield pass from Cesar Azpilicueta (Chelsea) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Paris SG will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Cuneyt Cakir will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The host team were superior on the pitch today. The home team played possession football and the away players really focused on a well organized defence."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "17/02/2015 - 22:45",
    "gameHomeTeam": "Paris SG",
    "gameScore": "1 - 1"
}