{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2016-04-02 - 16-30 Bayern Munich 1 - 0 Eintracht Frankfurt/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The game produced by the players today wasn't one of the most inspiring. They definitely haven't shown us their best. Bayern Munich were better today and displayed masterful control and movement. The tactic of the home side was to keep the ball at their feet as much as possible, while the away team tried to attack as quickly and accurately as possible."
        },
        {
            "gameTime": "2 - 48:50",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 47:53",
            "label": "y-card",
            "description": "Luc Castaignos (Eintracht Frankfurt) has too much to say to the referee and receives a caution."
        },
        {
            "gameTime": "2 - 47:46",
            "label": "",
            "description": "Makoto Hasebe (Eintracht Frankfurt) commits a foul and Florian Meyer immediately signals a free kick."
        },
        {
            "gameTime": "2 - 46:45",
            "label": "",
            "description": "Carlos Zambrano (Eintracht Frankfurt) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 45:17",
            "label": "injury",
            "description": "Carlos Zambrano (Eintracht Frankfurt) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:12",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Lukas Hradecky guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "",
            "description": "Florian Meyer couldn't ignore the rough tackle by Arturo Vidal (Bayern Munich) and blew his whistle."
        },
        {
            "gameTime": "2 - 41:24",
            "label": "attendance",
            "description": "The attendance for today's match is 75000."
        },
        {
            "gameTime": "2 - 40:50",
            "label": "",
            "description": "Luc Castaignos (Eintracht Frankfurt) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the right post."
        },
        {
            "gameTime": "2 - 39:11",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Arturo Vidal (Bayern Munich) comes onto the pitch so that Mario Gotze can be given a rest."
        },
        {
            "gameTime": "2 - 38:19",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Mario Gotze (Bayern Munich). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "2 - 36:27",
            "label": "",
            "description": "Sonny Kittel (Eintracht Frankfurt) bursts into the penalty area with the ball at his feet after a wonderful individual effort that left fans breathless and in awe. However, he sends the ball in a completely different direction than intended, well wide of the target."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "2 - 33:53",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 32:10",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the roof of the net, but Lukas Hradecky was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 30:39",
            "label": "corner",
            "description": "Marc Stendera (Eintracht Frankfurt) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 30:18",
            "label": "",
            "description": "A promising cross into the box is nearly received by the lurking Sonny Kittel (Eintracht Frankfurt), but one of the defending players cuts it out to avert the threat. The linesman points to the corner flag, Eintracht Frankfurt are going to take it."
        },
        {
            "gameTime": "2 - 29:23",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 27:27",
            "label": "",
            "description": "The free kick is delivered by Constant Djakpa (Eintracht Frankfurt) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "2 - 25:49",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 25:15",
            "label": "substitution",
            "description": "The game has come to an end for Robert Lewandowski. He has contributed as much as he could today. He will be replaced by the fresh legs of Douglas Costa (Bayern Munich)."
        },
        {
            "gameTime": "2 - 24:39",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) attempts to surprise the keeper with a shot from distance, but it lacks accuracy and goes high over the crossbar."
        },
        {
            "gameTime": "2 - 23:13",
            "label": "",
            "description": "Carlos Zambrano (Eintracht Frankfurt) holds his head in his hands after missing a big chance. He latches on to a rebound, creates some space from himself and fires the ball from the edge of the box well wide of the right post."
        },
        {
            "gameTime": "2 - 21:36",
            "label": "",
            "description": "Stefan Aigner (Eintracht Frankfurt) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 20:29",
            "label": "corner",
            "description": "Thomas Muller (Bayern Munich) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 20:03",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) receives a low pass just outside the box and unleashes a fine strike towards the right post. Lukas Hradecky pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed. Good work from Bayern Munich as they win a corner."
        },
        {
            "gameTime": "2 - 19:27",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Thomas Muller (Bayern Munich), but the defence gets it clear."
        },
        {
            "gameTime": "2 - 18:34",
            "label": "substitution",
            "description": "Substitution. Sonny Kittel (Eintracht Frankfurt) has come on for Anis Ben Hatira."
        },
        {
            "gameTime": "2 - 16:34",
            "label": "funfact",
            "description": "21:4 – this is the total number of shots produced by both teams."
        },
        {
            "gameTime": "2 - 15:04",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) is caught offside, but it was a really close call."
        },
        {
            "gameTime": "2 - 14:22",
            "label": "",
            "description": "Marc Stendera (Eintracht Frankfurt) swings a cross into the box, but it's far too close to Manuel Neuer, who smothers the ball."
        },
        {
            "gameTime": "2 - 13:43",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) makes a slide tackle, but referee Florian Meyer blows for a foul."
        },
        {
            "gameTime": "2 - 12:51",
            "label": "substitution",
            "description": "Niko Kovac prepares a substitution. Haris Seferovic is replaced by Luc Castaignos (Eintracht Frankfurt)."
        },
        {
            "gameTime": "2 - 11:11",
            "label": "",
            "description": "A neat pass is well received by Franck Ribery (Bayern Munich), who is lurking on the edge of the box and produces a low drive directed towards the middle of the goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "2 - 09:55",
            "label": "y-card",
            "description": "Today's referee Florian Meyer rightly decides to book Mario Gotze (Bayern Munich) for his harsh tackle."
        },
        {
            "gameTime": "2 - 09:32",
            "label": "",
            "description": "Anis Ben Hatira (Eintracht Frankfurt) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 08:09",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the left side of the net, but Lukas Hradecky leaps like a salmon to deny him."
        },
        {
            "gameTime": "2 - 06:17",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) produces a decent strike goalwards from the resulting set piece. His effort crashes against the crossbar and the ball stays out of the net. The goalkeeper was quite lucky!"
        },
        {
            "gameTime": "2 - 05:53",
            "label": "y-card",
            "description": "Marc Stendera (Eintracht Frankfurt) sees a yellow card from Florian Meyer after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 05:17",
            "label": "corner",
            "description": "Franck Ribery (Bayern Munich) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 04:58",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition. Bayern Munich have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 04:39",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) attempts to find one of his teammates with a ball from a free kick outside the box. The goalkeeper climbs high above all the players in the box to intercept the cross and snuff out the opportunity."
        },
        {
            "gameTime": "2 - 03:25",
            "label": "y-card",
            "description": "Florian Meyer shows a yellow card to Timothy Chandler (Eintracht Frankfurt) for a tough tackle."
        },
        {
            "gameTime": "2 - 02:56",
            "label": "substitution",
            "description": "Niko Kovac is forced to make a change. Szabolcs Huszti is unable to continue due to injury, Marc Stendera (Eintracht Frankfurt) comes on."
        },
        {
            "gameTime": "2 - 02:08",
            "label": "injury",
            "description": "Szabolcs Huszti (Eintracht Frankfurt) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 00:57",
            "label": "",
            "description": "What a big chance! Szabolcs Huszti (Eintracht Frankfurt) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Not a lot happening in the first half, it hasn't been the best game so far in terms of quality. Bayern Munich dominated the opening period and easily created the most chances. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 46:46",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Florian Meyer has ended it."
        },
        {
            "gameTime": "1 - 46:30",
            "label": "",
            "description": "Szabolcs Huszti (Eintracht Frankfurt) sends a cross into the box, but Manuel Neuer comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) finds himself beyond the last defender but the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:46",
            "label": "y-card",
            "description": "Florian Meyer shows the yellow card to Anis Ben Hatira (Eintracht Frankfurt) for a heavy challenge."
        },
        {
            "gameTime": "1 - 42:33",
            "label": "",
            "description": "Bayern Munich control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 40:22",
            "label": "y-card",
            "description": "David Abraham (Eintracht Frankfurt) gets a yellow card."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "y-card",
            "description": "Florian Meyer has issued a yellow card to Robert Lewandowski (Bayern Munich)."
        },
        {
            "gameTime": "1 - 39:45",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "",
            "description": "Szabolcs Huszti (Eintracht Frankfurt) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 38:01",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) takes a short free kick."
        },
        {
            "gameTime": "1 - 37:29",
            "label": "",
            "description": "Szabolcs Huszti (Eintracht Frankfurt) tackles a bit over zealously and Florian Meyer blows for a foul. Free kick. Bayern Munich will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 37:06",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 36:28",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) finds himself behind the opposition's defence, but the game is stopped for offside."
        },
        {
            "gameTime": "1 - 34:30",
            "label": "",
            "description": "The game is pretty dull as Eintracht Frankfurt are just passing the ball from player to player. Nothing lasts forever, though, and they finally make a mistake, allowing the opposition to pick up the ball."
        },
        {
            "gameTime": "1 - 32:42",
            "label": "",
            "description": "Javi Martinez (Bayern Munich) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the right post."
        },
        {
            "gameTime": "1 - 32:25",
            "label": "corner",
            "description": "There's an opportunity for Thiago Alcantara (Bayern Munich) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 31:59",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Juan Bernat (Bayern Munich). Now Bayern Munich have a corner."
        },
        {
            "gameTime": "1 - 31:11",
            "label": "",
            "description": "Szabolcs Huszti (Eintracht Frankfurt) attempts to convert a cross into a goal, but his promising header from near the penalty spot towards the roof of the net is denied by a decent save from Manuel Neuer."
        },
        {
            "gameTime": "1 - 30:07",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) brings an opponent down and Florian Meyer interrupts the game."
        },
        {
            "gameTime": "1 - 28:10",
            "label": "",
            "description": "An unsuccessful long range effort by Xabi Alonso (Bayern Munich) after he collected a pass and unleashed a shot. The ball was directed towards the right post, but it was an easy job for the goalkeeper to make a save."
        },
        {
            "gameTime": "1 - 27:46",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 27:02",
            "label": "",
            "description": "It looks like Stefan Aigner (Eintracht Frankfurt) saw red with that tackle. Florian Meyer won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 24:54",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 23:34",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) shows too much aggression while trying to break free from his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 22:40",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) trips an opponent with a slide tackle. Florian Meyer stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 19:39",
            "label": "soccer-ball",
            "description": "GOAL! Franck Ribery (Bayern Munich) gets to the rebound inside the box and fires in a stunning overhead kick. Phenomenal finish! 1:0."
        },
        {
            "gameTime": "1 - 19:01",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) produces a ferocious strike from the edge of the box. His dangerous low effort towards the middle of the goal is blocked by Lukas Hradecky, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 18:07",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 15:59",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "1 - 14:25",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Franck Ribery (Bayern Munich) takes it short."
        },
        {
            "gameTime": "1 - 14:11",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) crosses the ball into the box, but one of the defending players averts the threat. The ball goes out of play. Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "1 - 12:21",
            "label": "",
            "description": "Szabolcs Huszti (Eintracht Frankfurt) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "1 - 12:04",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) commits a rough challenge and Florian Meyer blows his whistle for a foul. Eintracht Frankfurt will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 11:28",
            "label": "",
            "description": "Anis Ben Hatira (Eintracht Frankfurt) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 08:45",
            "label": "corner",
            "description": "Thiago Alcantara (Bayern Munich) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "1 - 08:29",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) slaloms his way past challenges, but an opposing player does well to get the ball away. Bayern Munich earn a corner."
        },
        {
            "gameTime": "1 - 07:56",
            "label": "",
            "description": "A cross into the box from Haris Seferovic (Eintracht Frankfurt) is cleared."
        },
        {
            "gameTime": "1 - 06:32",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) forces a pass into the box, but Lukas Hradecky is alert and does a great job to rob him of the ball."
        },
        {
            "gameTime": "1 - 05:40",
            "label": "",
            "description": "Xabi Alonso clips a neat ball into the box towards Robert Lewandowski (Bayern Munich), whose header from the centre of the box goes a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 03:20",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) is penalised for a foul. Florian Meyer had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 01:53",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 00:10",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) sends a long ball in, but Lukas Hradecky comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Bayern Munich will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Florian Meyer will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The game produced by the players today wasn't one of the most inspiring. They definitely haven't shown us their best. Bayern Munich were better today and displayed masterful control and movement. The tactic of the home side was to keep the ball at their feet as much as possible, while the away team tried to attack as quickly and accurately as possible."
        }
    ],
    "gameAwayTeam": "Eintracht Frankfurt",
    "gameDate": "02/04/2016 - 16:30",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "1 - 0"
}