{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-05-06 - 21-45 Granada CF 0 - 4 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:53",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 45:46",
            "label": "",
            "description": "Karim Benzema (Real Madrid) produces a ferocious strike from the edge of the box. His dangerous effort towards the bottom left corner is blocked by Guillermo Ochoa, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 42:51",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Sverrir Ingi Ingason (Granada CF) was quite harsh and Ignacio Iglesias Villanueva didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 42:06",
            "label": "corner",
            "description": "Granada CF quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 41:37",
            "label": "corner",
            "description": "A quickly taken corner by Granada CF."
        },
        {
            "gameTime": "2 - 41:15",
            "label": "",
            "description": "Martin Hongla (Granada CF) wriggles into space and fires the ball from the edge of the area, but one of the defenders is there to block the effort. The ball is out of play. Granada CF win a corner kick."
        },
        {
            "gameTime": "2 - 38:35",
            "label": "",
            "description": "That was close by Karim Benzema (Real Madrid)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the right post."
        },
        {
            "gameTime": "2 - 37:42",
            "label": "corner",
            "description": "The resulting corner from Gaston Silva (Granada CF) is cleared."
        },
        {
            "gameTime": "2 - 37:13",
            "label": "",
            "description": "Martin Hongla (Granada CF) misses a good chance to score. An inch perfect cross into the box finds Martin Hongla (Granada CF) who rises for a header, but sends the ball well over the bar. The ball is out of play and the linesman points at the corner flag. Corner to Granada CF."
        },
        {
            "gameTime": "2 - 36:14",
            "label": "",
            "description": "Flag up against Karim Benzema (Real Madrid). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 35:41",
            "label": "substitution",
            "description": "Substitution. Andreas Pereira did his best and is replaced by Juanan Entrena (Granada CF)."
        },
        {
            "gameTime": "2 - 34:33",
            "label": "",
            "description": "Martin Hongla (Granada CF) pounced on a rebound on the edge of the box and his shot goes a whisker over the crossbar. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "2 - 33:58",
            "label": "corner",
            "description": "Isco (Real Madrid) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "substitution",
            "description": "Here is a change. Lucas is going off and Zinedine Zidane gives the last tactical orders to Mariano Diaz (Real Madrid)."
        },
        {
            "gameTime": "2 - 25:25",
            "label": "corner",
            "description": "The resulting corner from Andreas Pereira (Granada CF) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 25:03",
            "label": "",
            "description": "Isaac Cuenca (Granada CF) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The ball is out of play. A goal scoring opportunity from a corner for Granada CF."
        },
        {
            "gameTime": "2 - 23:42",
            "label": "substitution",
            "description": "We are about to witness a substitution. Isco (Real Madrid) is replacing Casemiro."
        },
        {
            "gameTime": "2 - 22:05",
            "label": "attendance",
            "description": "The attendance for today's match is 19094."
        },
        {
            "gameTime": "2 - 21:00",
            "label": "",
            "description": "Golden chance! Sergio Ramos (Real Madrid) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the left post. The ball is off of the pitch and it's a goal kick for Granada CF."
        },
        {
            "gameTime": "2 - 20:33",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 20:00",
            "label": "",
            "description": "Lucas (Real Madrid) wasted a huge opportunity! The fans already began to celebrate as he unleashed a powerful shot from the edge of the box after a brilliant solo effort. The ball went towards the bottom right corner, but Guillermo Ochoa made a crucial save! The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 18:49",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 18:39",
            "label": "",
            "description": "Karim Benzema (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 17:15",
            "label": "",
            "description": "Danilo (Real Madrid) misses a big chance! He got to the rebound inside the penalty box but placed the ball only against the right post!"
        },
        {
            "gameTime": "2 - 16:12",
            "label": "",
            "description": "Isaac Cuenca (Granada CF) sends a chip pass into the box, but Francisco Casilla is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 14:00",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Marco Asensio departs the field of play to be replaced by Karim Benzema (Real Madrid)."
        },
        {
            "gameTime": "2 - 06:59",
            "label": "",
            "description": "Marco Asensio (Real Madrid) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 04:29",
            "label": "corner",
            "description": "Andreas Pereira (Granada CF) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 04:08",
            "label": "",
            "description": "This shall not pass! Martin Hongla (Granada CF) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. Granada CF have a corner."
        },
        {
            "gameTime": "2 - 00:39",
            "label": "substitution",
            "description": "Tony Adams makes a switch. David Lomban (Granada CF) is coming on in place of Rene Krhin at the start of the second period."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Ignacio Iglesias Villanueva blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:29",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 44:23",
            "label": "",
            "description": "Casemiro (Real Madrid) has a shot blocked, it rebounds back to him, but even on his second attempt he cannot hit the target. His effort goes well wide."
        },
        {
            "gameTime": "1 - 41:50",
            "label": "",
            "description": "OFF THE POST! Good play from Lucas (Real Madrid) as skips past two defending players and from the edge of the box unleashes a decent strike that smashes against the crossbar!"
        },
        {
            "gameTime": "1 - 41:13",
            "label": "",
            "description": "Victorien Angban (Granada CF) receives an accurate pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, his effort goes high above the crossbar."
        },
        {
            "gameTime": "1 - 40:50",
            "label": "",
            "description": "James Rodriguez (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 37:16",
            "label": "",
            "description": "Adrian Ramos (Granada CF) receives a pass and decides to smash the ball from long range. His poor effort sails well wide of the right post."
        },
        {
            "gameTime": "1 - 34:44",
            "label": "soccer-ball",
            "description": "Alvaro Morata (Real Madrid) receives the ball inside the box, reacts quickly and without any problems stabs the ball under the crossbar."
        },
        {
            "gameTime": "1 - 29:50",
            "label": "soccer-ball",
            "description": "Alvaro Morata (Real Madrid) latches on to an excellent pass just outside the box and thunders the ball in off the crossbar."
        },
        {
            "gameTime": "1 - 26:30",
            "label": "corner",
            "description": "The resulting corner from Andreas Pereira (Granada CF) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 25:11",
            "label": "",
            "description": "Isaac Cuenca (Granada CF) sends a cross into the box, but the opposition's defence clears the ball to safety. Corner kick. Granada CF will have an opportunity."
        },
        {
            "gameTime": "1 - 22:10",
            "label": "",
            "description": "The free kick from long range, taken by Granada CF, is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 21:47",
            "label": "",
            "description": "Ignacio Iglesias Villanueva blows for a foul after Lucas (Real Madrid) was too aggressive in the battle for the ball. Free kick. Granada CF will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 17:01",
            "label": "substitution",
            "description": "Tony Adams is forced to make an unplanned substitution as Aly Malle suffers an injury and Uche Agbo (Granada CF) comes on."
        },
        {
            "gameTime": "1 - 16:46",
            "label": "",
            "description": "The linesman raises his flag for offside before Adrian Ramos (Granada CF) heads on."
        },
        {
            "gameTime": "1 - 14:31",
            "label": "",
            "description": "The ball is cleared after Alvaro Morata (Real Madrid) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 10:26",
            "label": "soccer-ball",
            "description": "James Rodriguez (Real Madrid) heads the ball into the middle after a splendid cross. This timely header produces a wonderful moment."
        },
        {
            "gameTime": "1 - 07:06",
            "label": "",
            "description": "Danilo (Real Madrid) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. The ball goes out of play and Granada CF will have a goal kick."
        },
        {
            "gameTime": "1 - 05:32",
            "label": "",
            "description": "Danilo (Real Madrid) is caught offside!"
        },
        {
            "gameTime": "1 - 02:35",
            "label": "soccer-ball",
            "description": "Goal! James Rodriguez (Real Madrid) finishes from close range with an easy finish and he makes it 0:1. He was ably assisted there by Lucas."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Ignacio Iglesias Villanueva."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid scored at least one goal in each of their last 46 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There is an average of 4.6 goals per game between these two sides over the last 5 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "06/05/2017 - 21:45",
    "gameHomeTeam": "Granada CF",
    "gameScore": "0 - 4"
}