{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2016-11-23 - 22-45 Celtic 0 - 2 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The visitors played the better football overall. The home side tried to win the ball back as quickly as possible every time they lost possession. The away team tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 49:04",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:13",
            "label": "",
            "description": "Moussa Dembele (Celtic) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "2 - 46:19",
            "label": "",
            "description": "Barcelona control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:15",
            "label": "",
            "description": "Moussa Dembele (Celtic) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "y-card",
            "description": "Ivan Rakitic (Barcelona) takes his opponent down and receives a yellow card from the referee."
        },
        {
            "gameTime": "2 - 41:53",
            "label": "y-card",
            "description": "Stuart Armstrong (Celtic) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 41:05",
            "label": "",
            "description": "James Forrest (Celtic) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 40:43",
            "label": "",
            "description": "Neat passing move from Barcelona in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 37:57",
            "label": "",
            "description": "What a chance that is! Luis Suarez (Barcelona) wastes a huge opportunity as he receives a beautiful pass inside the box but is somehow only able to prod the ball onto the right post!"
        },
        {
            "gameTime": "2 - 35:02",
            "label": "",
            "description": "Sergio Busquets (Barcelona) commits a foul and Daniele Orsato immediately signals a free kick."
        },
        {
            "gameTime": "2 - 34:19",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 34:10",
            "label": "",
            "description": "Sergi Roberto (Barcelona) tries to slide the ball through to a teammate but it's well blocked by a defender. Corner kick. Barcelona will have an opportunity."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "",
            "description": "A pass by Luis Suarez (Barcelona) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 32:41",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 32:33",
            "label": "",
            "description": "Sergi Roberto (Barcelona) fails to find any of his teammates inside the box as his pass is blocked. Barcelona have a corner."
        },
        {
            "gameTime": "2 - 31:02",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Neymar will be replaced by Arda Turan (Barcelona)."
        },
        {
            "gameTime": "2 - 30:40",
            "label": "",
            "description": "Lionel Messi (Barcelona) robs an opponent of the ball and explodes in anger when Daniele Orsato blows for a foul."
        },
        {
            "gameTime": "2 - 30:04",
            "label": "",
            "description": "A pass by James Forrest (Celtic) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 29:42",
            "label": "",
            "description": "Sergio Busquets (Barcelona) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "2 - 26:45",
            "label": "substitution",
            "description": "Luis Enrique has decided to introduce fresh legs, with Marlon (Barcelona) replacing Gerard Pique."
        },
        {
            "gameTime": "2 - 26:10",
            "label": "substitution",
            "description": "It's time for a substitution. Patrick Roberts (Celtic) comes on in place of Callum McGregor."
        },
        {
            "gameTime": "2 - 25:40",
            "label": "y-card",
            "description": "Mikael Lustig (Celtic) infringed the rules and goes into the book. Daniele Orsato pulls out a yellow card."
        },
        {
            "gameTime": "2 - 25:29",
            "label": "y-card",
            "description": "Neymar (Barcelona) is shown a yellow card by the referee."
        },
        {
            "gameTime": "2 - 24:11",
            "label": "corner",
            "description": "The resulting corner, taken by Neymar (Barcelona), comes to nothing."
        },
        {
            "gameTime": "2 - 24:01",
            "label": "",
            "description": "Neymar (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee points to the corner flag. It's a corner to Barcelona."
        },
        {
            "gameTime": "2 - 22:54",
            "label": "",
            "description": "James Forrest (Celtic) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "",
            "description": "CHANCE! Neymar finds Lionel Messi (Barcelona) with a sweet pass, but he can't find the target as his effort from inside the box goes just wide of the left post!"
        },
        {
            "gameTime": "2 - 20:44",
            "label": "",
            "description": "Moussa Dembele (Celtic) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 20:16",
            "label": "",
            "description": "Gerard Pique (Barcelona) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 20:15",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Lucas Digne (Barcelona) will replace Jordi Alba."
        },
        {
            "gameTime": "2 - 19:34",
            "label": "injury",
            "description": "Gerard Pique (Barcelona) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 19:17",
            "label": "injury",
            "description": "Moussa Dembele (Celtic) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 18:53",
            "label": "",
            "description": "Moussa Dembele (Celtic) wastes a great chance as he climbs high around the penalty spot to connect with a cross from the resulting free kick. He produces a header which goes well over the bar."
        },
        {
            "gameTime": "2 - 18:29",
            "label": "substitution",
            "description": "Substitution. Tom Rogic walks off the pitch and Nir Bitton (Celtic) comes on as a substitute."
        },
        {
            "gameTime": "2 - 17:43",
            "label": "y-card",
            "description": "Sergi Roberto (Barcelona) is awarded a yellow card. The referee showed him no mercy."
        },
        {
            "gameTime": "2 - 16:07",
            "label": "",
            "description": "The game is interrupted. Mikael Lustig (Celtic) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "2 - 15:46",
            "label": "",
            "description": "Barcelona are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 13:11",
            "label": "",
            "description": "Daniele Orsato has a clear sight and sees a foul from Tom Rogic (Celtic)."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "",
            "description": "The linesman raises his flag. Luis Suarez (Barcelona) is adjudged offside."
        },
        {
            "gameTime": "2 - 09:58",
            "label": "soccer-ball",
            "description": "Lionel Messi (Barcelona) makes no mistake from the penalty spot after waiting for Craig Gordon to move before slotting the ball low into the middle of the goal!"
        },
        {
            "gameTime": "2 - 09:47",
            "label": "",
            "description": "Lionel Messi (Barcelona) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 09:24",
            "label": "penalty",
            "description": "Emilio Izaguirre (Celtic) pulls the jersey of one of the opposition players and Daniele Orsato blows his whistle for a foul. It's a penalty! Great chance to score for Barcelona!"
        },
        {
            "gameTime": "2 - 07:32",
            "label": "",
            "description": "Moussa Dembele (Celtic) meets an accurate cross in the box and steers a fine header towards the net. The goalkeeper has to react quickly to keep the ball out."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "",
            "description": "Celtic are ruled offside."
        },
        {
            "gameTime": "2 - 03:49",
            "label": "",
            "description": "Tom Rogic (Celtic) looks to break free, but an opposing player clears the ball away. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "2 - 03:04",
            "label": "",
            "description": "Callum McGregor (Celtic) receives a low pass just outside the box and unleashes a fine strike towards the bottom right corner. Marc Andre ter Stegen pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "2 - 01:01",
            "label": "",
            "description": "Moussa Dembele (Celtic) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 00:35",
            "label": "",
            "description": "Neymar (Barcelona) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Scott Sinclair will not participate anymore and James Forrest (Celtic) is coming on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The performance from both teams could be described as average. There have been only a few exciting situations and the fans will be expecting more in the second half. The away side is controlling this game. The home players try to win the ball back as quickly as possible every time they lose possession. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 43:29",
            "label": "",
            "description": "Scott Brown (Celtic) makes a rough challenge and Daniele Orsato blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 43:04",
            "label": "",
            "description": "Scott Brown (Celtic) commits a rough challenge and Daniele Orsato blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 42:22",
            "label": "",
            "description": "Scott Sinclair (Celtic) is able to continue to play."
        },
        {
            "gameTime": "1 - 41:03",
            "label": "injury",
            "description": "The game is interrupted now, Scott Sinclair (Celtic) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 40:50",
            "label": "y-card",
            "description": "Jordi Alba (Barcelona) is booked after bringing down an opponent. Daniele Orsato had an easy decision to make."
        },
        {
            "gameTime": "1 - 40:25",
            "label": "",
            "description": "Luis Suarez (Barcelona) jumps above the defenders in order to convert a lofted cross with a nice header. Craig Gordon makes a reflexive save to block his effort from hitting the net."
        },
        {
            "gameTime": "1 - 38:25",
            "label": "",
            "description": "The ball is cleared after Moussa Dembele (Celtic) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 38:02",
            "label": "",
            "description": "Luis Suarez (Barcelona) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 36:23",
            "label": "",
            "description": "Neymar (Barcelona) tries to send a pass but it's blocked. The ball has crossed the sideline. Barcelona are taking a throw in."
        },
        {
            "gameTime": "1 - 35:57",
            "label": "",
            "description": "Moussa Dembele (Celtic) produces a ferocious strike from the edge of the box. His dangerous low effort towards the middle of the goal is blocked by Marc Andre ter Stegen, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 35:02",
            "label": "",
            "description": "Neymar (Barcelona) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 32:08",
            "label": "",
            "description": "The linesman signals that Scott Sinclair (Celtic) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 30:26",
            "label": "",
            "description": "Luis Suarez (Barcelona) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Daniele Orsato with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 28:29",
            "label": "",
            "description": "Tom Rogic (Celtic) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 27:44",
            "label": "",
            "description": "Referee Daniele Orsato sees the trip by Andre Gomes (Barcelona) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 25:30",
            "label": "",
            "description": "Moussa Dembele (Celtic) is flagged for offside."
        },
        {
            "gameTime": "1 - 23:47",
            "label": "soccer-ball",
            "description": "Neymar sends a precise lofted cross into the box. Lionel Messi (Barcelona) latches on to it and finishes with a quick shot which hits the bottom of the left post and bounces in off it. The goalkeeper had no chance. The score changes to 0:1."
        },
        {
            "gameTime": "1 - 22:56",
            "label": "y-card",
            "description": "Erik Sviatchenko (Celtic) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 22:31",
            "label": "corner",
            "description": "Neymar (Barcelona) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 21:54",
            "label": "",
            "description": "Andre Gomes (Barcelona) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort. Barcelona will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 21:24",
            "label": "corner",
            "description": "Neymar (Barcelona) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 21:19",
            "label": "",
            "description": "Jordi Alba (Barcelona) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. The ball goes out for a corner. Barcelona can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 20:58",
            "label": "",
            "description": "Stuart Armstrong (Celtic) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 20:10",
            "label": "",
            "description": "Andre Gomes (Barcelona) is penalised for holding. Daniele Orsato signals a set piece."
        },
        {
            "gameTime": "1 - 18:39",
            "label": "",
            "description": "Lionel Messi (Barcelona) fails to keep his cool and squanders a golden chance to score from inside the penalty area after firing the ball over the crossbar."
        },
        {
            "gameTime": "1 - 17:44",
            "label": "",
            "description": "Callum McGregor (Celtic) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 15:22",
            "label": "",
            "description": "Lionel Messi (Barcelona) takes a first time shot from inside the box, but his poor effort flies way wide of the right post."
        },
        {
            "gameTime": "1 - 14:12",
            "label": "",
            "description": "Emilio Izaguirre (Celtic) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 10:34",
            "label": "",
            "description": "Scott Sinclair (Celtic) is adjudged offside."
        },
        {
            "gameTime": "1 - 09:30",
            "label": "",
            "description": "Sergio Busquets (Barcelona) tries to find Lionel Messi, but he puts too much power on the through ball. The ball is off of the pitch and it's a goal kick for Celtic."
        },
        {
            "gameTime": "1 - 08:29",
            "label": "",
            "description": "Lionel Messi (Barcelona) misses a good chance to score. An inch perfect cross into the box finds Lionel Messi (Barcelona) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 06:35",
            "label": "corner",
            "description": "Scott Sinclair (Celtic) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 06:24",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Scott Sinclair (Celtic). The ball is out of play and the linesman points at the corner flag. Corner to Celtic."
        },
        {
            "gameTime": "1 - 05:26",
            "label": "",
            "description": "Scott Sinclair (Celtic) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 03:11",
            "label": "",
            "description": "A pass by Neymar (Barcelona) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 00:42",
            "label": "",
            "description": "Moussa Dembele (Celtic) is caught offside!"
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Celtic will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Daniele Orsato."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The visitors played the better football overall. The home side tried to win the ball back as quickly as possible every time they lost possession. The away team tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "23/11/2016 - 22:45",
    "gameHomeTeam": "Celtic",
    "gameScore": "0 - 2"
}