{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-11-29 - 18-00 Eibar 0 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. The Real Madrid fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The hosts tried to catch the opposition off guard and hit them on the break. The visiting side kept the ball at their feet and the main intention was to produce that final killer pass."
        },
        {
            "gameTime": "2 - 48:10",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 48:00",
            "label": "y-card",
            "description": "Simone Verdi (Eibar) violates the rules and gets a yellow card."
        },
        {
            "gameTime": "2 - 46:57",
            "label": "",
            "description": "Karim Benzema (Real Madrid) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:19",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort."
        },
        {
            "gameTime": "2 - 43:54",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows the yellow card to Gonzalo Escalante (Eibar) for a heavy challenge."
        },
        {
            "gameTime": "2 - 43:19",
            "label": "",
            "description": "Karim Benzema (Real Madrid) sprays a pass out to Toni Kroos, but he can't beat his man inside the box."
        },
        {
            "gameTime": "2 - 42:34",
            "label": "",
            "description": "A pass by Takashi Inui (Eibar) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 40:02",
            "label": "substitution",
            "description": "Here's the change. Sergio Enrich leaves the pitch and Mikel Arruabarrena (Eibar) comes on as a substitute."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "substitution",
            "description": "Jose Mendilibar has decided to make a change. Izet Hajrovic (Eibar) replaces Saul Berjon."
        },
        {
            "gameTime": "2 - 39:47",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Karim Benzema (Real Madrid) is coming onto the pitch as Daniel Carvajal cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 38:17",
            "label": "injury",
            "description": "The game is interrupted now, Daniel Carvajal (Real Madrid) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 37:52",
            "label": "",
            "description": "Ander Capa (Eibar) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "2 - 36:43",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) makes no mistake from the penalty spot after waiting for Asier Riesgo to move before slotting the ball low into the middle of the goal!"
        },
        {
            "gameTime": "2 - 36:38",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 35:59",
            "label": "penalty",
            "description": "Jesus Gil Manzano blows his whistle for a foul after hacks down one of his opponents. The referee makes a call and blows his whistle for an infringement. Real Madrid are awarded a penalty."
        },
        {
            "gameTime": "2 - 34:33",
            "label": "",
            "description": "Saul Berjon (Eibar) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "2 - 33:57",
            "label": "substitution",
            "description": "Here comes a substitution. Casemiro (Real Madrid) is brought on as a substitute for Mateo Kovacic."
        },
        {
            "gameTime": "2 - 32:11",
            "label": "",
            "description": "What a chance! The ball rebounds out to Takashi Inui (Eibar) and his strike from the edge of the box goes narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 31:56",
            "label": "",
            "description": "The free kick is delivered by Saul Berjon (Eibar) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "2 - 31:16",
            "label": "y-card",
            "description": "The foul by Lucas (Real Madrid) is worthy of a card and a yellow is duly shown by Jesus Gil Manzano."
        },
        {
            "gameTime": "2 - 27:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but it goes well wide of the left post."
        },
        {
            "gameTime": "2 - 27:43",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "Danilo (Real Madrid) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 26:05",
            "label": "",
            "description": "What a big chance! Cristiano Ronaldo (Real Madrid) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 24:37",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Adrian will be replaced by Simone Verdi (Eibar)."
        },
        {
            "gameTime": "2 - 24:01",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 23:05",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 22:52",
            "label": "",
            "description": "sends a cross into the box, but the opposition's defence quickly intercepts the ball. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "2 - 21:21",
            "label": "",
            "description": "Luka Modric (Real Madrid) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "substitution",
            "description": "Substitution. Lucas (Real Madrid) replaces James Rodriguez."
        },
        {
            "gameTime": "2 - 19:14",
            "label": "corner",
            "description": "Saul Berjon (Eibar) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 18:56",
            "label": "",
            "description": "Saul Berjon (Eibar) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. Eibar force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "y-card",
            "description": "Gareth Bale (Real Madrid) is booked for saying more than Jesus Gil Manzano was willing to tolerate."
        },
        {
            "gameTime": "2 - 17:28",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 16:06",
            "label": "",
            "description": "Takashi Inui (Eibar) gets into a good shooting position. He wins some space for himself and drills a long range daisy cutter towards the middle of the goal. His good effort is, however, superbly saved by Keylor Navas!"
        },
        {
            "gameTime": "2 - 15:40",
            "label": "y-card",
            "description": "Pepe (Real Madrid) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Jesus Gil Manzano didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 14:06",
            "label": "",
            "description": "Aleksandar Pantic (Eibar) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 13:55",
            "label": "corner",
            "description": "Saul Berjon (Eibar) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 13:38",
            "label": "corner",
            "description": "Saul Berjon (Eibar) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 13:19",
            "label": "corner",
            "description": "Saul Berjon (Eibar) swings in the corner, but it's comfortably cleared away. Eibar force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 12:42",
            "label": "",
            "description": "Takashi Inui (Eibar) produces a dangerous lofted cross into the box which is intercepted. The ball goes out of play. Eibar are awarded a corner kick."
        },
        {
            "gameTime": "2 - 12:03",
            "label": "",
            "description": "Sergio Enrich (Eibar) comes close to scoring. He meets a lovely lofted pass from Takashi Inui, but sends his close range header way over the crossbar."
        },
        {
            "gameTime": "2 - 11:07",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 10:50",
            "label": "",
            "description": "The ball is cleared after Mateo Kovacic (Real Madrid) attempted to dribble past an opposing player. The referee points to the corner flag. It's a corner to Real Madrid."
        },
        {
            "gameTime": "2 - 09:15",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) latches on to a lofted pass and strikes a snap shot from outside the box. His effort curls way wide of the left post."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) decides to have a shot at goal from the free kick, but it hits the defensive wall."
        },
        {
            "gameTime": "2 - 07:25",
            "label": "",
            "description": "Ander Capa (Eibar) fouls an opponent. At least that's what referee Jesus Gil Manzano signals. That's a free kick to Real Madrid."
        },
        {
            "gameTime": "2 - 06:51",
            "label": "",
            "description": "Adrian (Eibar) swings a cross into the box, but it's far too close to Keylor Navas, who smothers the ball."
        },
        {
            "gameTime": "2 - 06:05",
            "label": "",
            "description": "Sergio Enrich (Eibar) is picked out by one of his teammates with a brilliant long range cross, but he doesn't control the ball well and the defence eliminates the danger without any problem."
        },
        {
            "gameTime": "2 - 04:26",
            "label": "",
            "description": "Takashi Inui (Eibar) serves up a nice cross, but Keylor Navas punches the ball away."
        },
        {
            "gameTime": "2 - 02:44",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 01:29",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We are watching a run of the mill game with only a few moments to ignite the crowd. The players surely can surely perform better, they just need to motivate themselves. Real Madrid have arguably been the better of the two sides in the first half. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 46:05",
            "label": "whistle",
            "description": "Jesus Gil Manzano has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:38",
            "label": "corner",
            "description": "The ball is whipped in from the corner by James Rodriguez (Real Madrid), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 45:12",
            "label": "",
            "description": "Gareth Bale (Real Madrid) receives a lofted pass and is given time inside the box to unleash a shot goalwards. The ball is directed to the bottom left corner, but it lacks power and Asier Riesgo pulls off a comfortable save to thwart the effort. The linesman points to the corner flag, Real Madrid are going to take it."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:10",
            "label": "",
            "description": "David Junca (Eibar) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 42:48",
            "label": "soccer-ball",
            "description": "It's a goal! Gareth Bale (Real Madrid) makes it 0:1. He jumped highest to connect with a perfect cross from Luka Modric and planted his close range header into the left side of the goal. Asier Riesgo was helpless."
        },
        {
            "gameTime": "1 - 42:10",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 41:47",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 40:13",
            "label": "",
            "description": "Luka Modric (Real Madrid) produces a long range cannon of a shot after a nice pass. The ball heads towards the middle of the goal, but is easily stopped by a save from Asier Riesgo and the score remains the same."
        },
        {
            "gameTime": "1 - 39:44",
            "label": "",
            "description": "This shall not pass! Gareth Bale (Real Madrid) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 38:13",
            "label": "",
            "description": "Luka Modric (Real Madrid) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 36:47",
            "label": "y-card",
            "description": "Today's referee Jesus Gil Manzano rightly decides to book Mateo Kovacic (Real Madrid) for his harsh tackle."
        },
        {
            "gameTime": "1 - 35:22",
            "label": "",
            "description": "Gareth Bale (Real Madrid) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "1 - 33:52",
            "label": "",
            "description": "Sergio Enrich (Eibar) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 32:56",
            "label": "",
            "description": "Danilo (Real Madrid) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 31:18",
            "label": "injury",
            "description": "Danilo (Real Madrid) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 30:37",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows a yellow card to Mauro Dos Santos (Eibar), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 29:44",
            "label": "corner",
            "description": "Saul Berjon (Eibar) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 29:09",
            "label": "",
            "description": "Adrian (Eibar) swings in a cross, but the ball is cleared to safety by one of the defending players. The referee and his assistant both point at the corner flag. Eibar will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 27:23",
            "label": "",
            "description": "Sergio Enrich (Eibar) is in a clear offside position and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 26:09",
            "label": "",
            "description": "Gareth Bale (Real Madrid) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 24:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 23:38",
            "label": "",
            "description": "Danilo (Real Madrid) sends a cross into the box, but Asier Riesgo comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 23:11",
            "label": "",
            "description": "Jesus Gil Manzano blows his whistle after Gonzalo Escalante (Eibar) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 22:30",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 20:00",
            "label": "",
            "description": "Jesus Gil Manzano blows his whistle after Daniel Garcia (Eibar) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 19:11",
            "label": "",
            "description": "The referee stops play as the linesman flags Gareth Bale (Real Madrid) offside."
        },
        {
            "gameTime": "1 - 18:24",
            "label": "",
            "description": "Takashi Inui (Eibar) receives a precise pass and is given time inside the box to send a promising strike towards the left post. Keylor Navas guesses his intentions and denies him with a fine save."
        },
        {
            "gameTime": "1 - 17:28",
            "label": "",
            "description": "Close! Danilo (Real Madrid) picks up a pass and produces a ferocious strike towards the right post, but the goalkeeper gets his fingertips to the ball to keep it out."
        },
        {
            "gameTime": "1 - 16:33",
            "label": "",
            "description": "Saul Berjon (Eibar) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies into the stands."
        },
        {
            "gameTime": "1 - 14:40",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) has a shot blocked, it rebounds back to him, but even on his second attempt he cannot hit the target. His effort goes well wide."
        },
        {
            "gameTime": "1 - 14:35",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a precise low pass inside the box, controls it and sends it straight at Asier Riesgo, who makes a comfortable save."
        },
        {
            "gameTime": "1 - 13:09",
            "label": "",
            "description": "Saul Berjon (Eibar) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 12:39",
            "label": "",
            "description": "Sergio Enrich (Eibar) receives a precise pass and finds some space for a shot. The keeper is alert and denies his long range effort towards the roof of the net. Decent save!"
        },
        {
            "gameTime": "1 - 10:42",
            "label": "",
            "description": "Good movement by Gareth Bale (Real Madrid), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "1 - 07:12",
            "label": "",
            "description": "Gareth Bale (Real Madrid) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 06:28",
            "label": "",
            "description": "Takashi Inui (Eibar) sends a teasing cross into the area, but Keylor Navas intercepts the ball."
        },
        {
            "gameTime": "1 - 05:32",
            "label": "",
            "description": "Sergio Enrich (Eibar) was standing in a clear offside position, making it an easy call for the linesman."
        },
        {
            "gameTime": "1 - 04:07",
            "label": "",
            "description": "A pass by Luka Modric (Real Madrid) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 01:19",
            "label": "corner",
            "description": "The resulting corner from Saul Berjon (Eibar) comes to nothing."
        },
        {
            "gameTime": "1 - 00:59",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Ander Capa (Eibar). Good work from Eibar as they win a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jesus Gil Manzano will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. The Real Madrid fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The hosts tried to catch the opposition off guard and hit them on the break. The visiting side kept the ball at their feet and the main intention was to produce that final killer pass."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "29/11/2015 - 18:00",
    "gameHomeTeam": "Eibar",
    "gameScore": "0 - 2"
}