{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-03-19 - 18-00 Chelsea 2 - 2 West Ham/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The home team had more of the game. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        },
        {
            "gameTime": "2 - 50:50",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 50:17",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) receives a precise pass inside the box and takes a shot that flies just wide of the left post."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "Dimitri Payet (West Ham) stands over the free kick and opts to take it himself, sending it towards the right post only for Thibaut Courtois to dive and make a save."
        },
        {
            "gameTime": "2 - 45:35",
            "label": "y-card",
            "description": "That will be a yellow card for one of the players. The one who gets booked is Willian (Chelsea)."
        },
        {
            "gameTime": "2 - 45:18",
            "label": "y-card",
            "description": "Cesc Fabregas (Chelsea) sees a yellow card. He should be more careful because one more challenge like that could result in a red card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 5 min. of added time."
        },
        {
            "gameTime": "2 - 43:45",
            "label": "y-card",
            "description": "Adrian (West Ham) says more than he should have to the referee and is shown a yellow card."
        },
        {
            "gameTime": "2 - 43:25",
            "label": "soccer-ball",
            "description": "Cesc Fabregas (Chelsea) steps up to take the penalty and leaves the keeper helpless with a shot into the bottom right corner."
        },
        {
            "gameTime": "2 - 42:48",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 42:44",
            "label": "y-card",
            "description": "The foul by Michail Antonio (West Ham) is worthy of a card and a yellow is duly shown by Robert Madley."
        },
        {
            "gameTime": "2 - 42:33",
            "label": "penalty",
            "description": "A clumsy foul by Michail Antonio (West Ham) and Robert Madley blows his whistle. The referee points to the penalty spot. Chelsea are awarded a penalty kick!"
        },
        {
            "gameTime": "2 - 41:50",
            "label": "corner",
            "description": "The resulting corner, taken by Dimitri Payet (West Ham), comes to nothing."
        },
        {
            "gameTime": "2 - 41:34",
            "label": "",
            "description": "Emmanuel Emenike (West Ham) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The ball goes out of play. West Ham are awarded a corner kick."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "substitution",
            "description": "Guus Hiddink has decided to introduce fresh legs, with Ruben Loftus Cheek (Chelsea) replacing Oscar."
        },
        {
            "gameTime": "2 - 37:22",
            "label": "",
            "description": "Gary Cahill (Chelsea) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but his attempt went well wide of the right post."
        },
        {
            "gameTime": "2 - 37:16",
            "label": "corner",
            "description": "It will be a corner kick. It is a great opportunity for their players who are good in the air to get into the penalty area."
        },
        {
            "gameTime": "2 - 36:43",
            "label": "substitution",
            "description": "Substitution. Manuel Lanzini did his best and is replaced by Pedro Obiang (West Ham)."
        },
        {
            "gameTime": "2 - 36:06",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) misses a good chance to score. An inch perfect cross into the box finds Cesc Fabregas (Chelsea) who rises for a header, but sends the ball well over the bar. Good work from Chelsea as they win a corner."
        },
        {
            "gameTime": "2 - 35:11",
            "label": "corner",
            "description": "The resulting corner from Dimitri Payet (West Ham) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 34:31",
            "label": "",
            "description": "Andrew Carroll (West Ham) rises highest from the corner to head at goal, but his effort towards the middle of the goal is comfortably saved by the goalkeeper. The ball is out of play and West Ham manage to earn a corner."
        },
        {
            "gameTime": "2 - 34:19",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 33:55",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) takes the corner but fails to find any of his teammates. West Ham earn a corner."
        },
        {
            "gameTime": "2 - 33:35",
            "label": "",
            "description": "Dimitri Payet (West Ham) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. The referee points to the corner flag and West Ham will take a corner."
        },
        {
            "gameTime": "2 - 31:30",
            "label": "",
            "description": "John Terry (Chelsea) connects with the corner kick around the penalty spot, but steers his header inches over the bar."
        },
        {
            "gameTime": "2 - 31:21",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner."
        },
        {
            "gameTime": "2 - 31:09",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) tries to pass the ball into the penalty area but it's blocked. Corner kick. Chelsea will have an opportunity."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Emmanuel Emenike (West Ham) is coming onto the pitch as Enner Valencia cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 29:36",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) gets to a rebound inside the goalmouth, but even from this distance he misses the target and fails to score."
        },
        {
            "gameTime": "2 - 27:15",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "2 - 27:06",
            "label": "corner",
            "description": "Willian (Chelsea) will take a corner kick."
        },
        {
            "gameTime": "2 - 26:35",
            "label": "",
            "description": "Oscar (Chelsea) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players. The ball is out of play. Chelsea win a corner kick."
        },
        {
            "gameTime": "2 - 23:50",
            "label": "",
            "description": "John Obi Mikel (Chelsea) gets in a header from the resulting free kick. It lacks accuracy, however, to bother the keeper and the ball goes a few metres over the bar."
        },
        {
            "gameTime": "2 - 23:07",
            "label": "",
            "description": "That's a free kick to Chelsea. Michail Antonio (West Ham) trips an opponent with a slide tackle. Robert Madley stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "2 - 18:06",
            "label": "y-card",
            "description": "Cheikhou Kouyate (West Ham) picks up a yellow card for an infringement."
        },
        {
            "gameTime": "2 - 17:00",
            "label": "substitution",
            "description": "Guus Hiddink has decided to substitute Loic Remy and he is replaced by Bertrand Traore (Chelsea)."
        },
        {
            "gameTime": "2 - 15:59",
            "label": "soccer-ball",
            "description": "Andrew Carroll (West Ham) has acres of space after latching on to a precise pass into the box. He doesn't hesitate to unleash a great effort which ends up in the bottom left corner."
        },
        {
            "gameTime": "2 - 15:58",
            "label": "",
            "description": "Adrian blocks Loic Remy (Chelsea)'s effort from the edge of the box."
        },
        {
            "gameTime": "2 - 14:37",
            "label": "substitution",
            "description": "Diafra Sakho goes off the pitch and Andrew Carroll (West Ham) comes on."
        },
        {
            "gameTime": "2 - 13:03",
            "label": "attendance",
            "description": "The attendance for today's match is 41623."
        },
        {
            "gameTime": "2 - 12:39",
            "label": "",
            "description": "Aaron Cresswell (West Ham) picks up a pass inside the box and unleashes a shot goalwards that crashes against the bar. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "2 - 12:17",
            "label": "corner",
            "description": "Pedro (Chelsea) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 12:07",
            "label": "",
            "description": "Pedro (Chelsea) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 10:02",
            "label": "corner",
            "description": "The corner from Willian (Chelsea) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 09:51",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner but it's cleared. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 09:38",
            "label": "",
            "description": "Chelsea force a corner. Their opponents will face another attacking threat. Branislav Ivanovic (Chelsea) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 07:26",
            "label": "",
            "description": "John Terry (Chelsea) outjumped the defenders to meet the ball from the free kick and plants a precise header from deep inside the box towards the net! The goalkeeper shows his reflexes and superbly keeps the ball out!"
        },
        {
            "gameTime": "2 - 06:40",
            "label": "",
            "description": "Cheikhou Kouyate (West Ham) fouls an opponent. At least that's what referee Robert Madley signals. Chelsea have a free kick."
        },
        {
            "gameTime": "2 - 05:26",
            "label": "",
            "description": "Oscar (Chelsea) does well to meet a cross from Branislav Ivanovic, but he directs his shot just wide of the left post."
        },
        {
            "gameTime": "2 - 02:51",
            "label": "",
            "description": "Diafra Sakho (West Ham) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 00:10",
            "label": "substitution",
            "description": "It is time for a substitution. Pedro (Chelsea) is on for ."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Robert Madley starts the second half."
        },
        {
            "gameTime": "1 - 49:00",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. In terms of the overall play, the match has been fairly even so far. The home team makes a lot of passes and attempts to maintain possession, while the visitors look to counter attack."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "whistle",
            "description": "Robert Madley has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 47:56",
            "label": "soccer-ball",
            "description": "Cesc Fabregas (Chelsea) scores a beautiful goal from the resulting free kick. He bends the ball into the top left corner. A technically stunning goal."
        },
        {
            "gameTime": "1 - 47:33",
            "label": "y-card",
            "description": "Angelo Ogbonna (West Ham) receives a yellow card."
        },
        {
            "gameTime": "1 - 47:00",
            "label": "y-card",
            "description": "Winston Reid (West Ham) is booked by the referee."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "5 additional min. will be played."
        },
        {
            "gameTime": "1 - 42:48",
            "label": "",
            "description": "Mark Noble (West Ham) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 41:32",
            "label": "corner",
            "description": "Willian (Chelsea) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 41:22",
            "label": "",
            "description": "The ball is cleared after Branislav Ivanovic (Chelsea) attempted to dribble past an opposing player. Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 40:21",
            "label": "",
            "description": "Willian (Chelsea) struck with a long range free kick. His attempt flew just wide of the left post. The goalkeeper was lucky there."
        },
        {
            "gameTime": "1 - 37:51",
            "label": "injury",
            "description": "The game is interrupted now, picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 37:21",
            "label": "",
            "description": "Cheikhou Kouyate (West Ham) robs an opponent of the ball and explodes in anger when Robert Madley blows for a foul. Chelsea will take a free kick."
        },
        {
            "gameTime": "1 - 37:06",
            "label": "corner",
            "description": "Willian (Chelsea) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 36:53",
            "label": "",
            "description": "The referee blows his whistle, Chelsea are awarded a corner kick. An attempted cross from Branislav Ivanovic (Chelsea) is cleared."
        },
        {
            "gameTime": "1 - 32:54",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Manuel Lanzini (West Ham)."
        },
        {
            "gameTime": "1 - 31:14",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 30:50",
            "label": "",
            "description": "Aaron Cresswell (West Ham) connects with an accurate pass inside the box and fires the ball to the bottom right corner, but one of the defending players steps in to block the effort. West Ham win a corner."
        },
        {
            "gameTime": "1 - 30:13",
            "label": "",
            "description": "John Obi Mikel (Chelsea) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Robert Madley with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 27:58",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 27:30",
            "label": "",
            "description": "Willian (Chelsea) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. The ball goes behind for a corner. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 25:06",
            "label": "",
            "description": "skips perfectly past challenges but misdirects his shot from the edge of the box. The ball flies a few yards over the bar."
        },
        {
            "gameTime": "1 - 23:28",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 23:21",
            "label": "",
            "description": "Dimitri Payet (West Ham) slides a pass forward, but one of the defenders cuts it out. West Ham force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 21:14",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) misses a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball floats high over the crossbar!"
        },
        {
            "gameTime": "1 - 20:58",
            "label": "corner",
            "description": "The corner from Willian (Chelsea) is intercepted by Adrian."
        },
        {
            "gameTime": "1 - 20:22",
            "label": "",
            "description": "Now Chelsea have a corner. creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear."
        },
        {
            "gameTime": "1 - 18:48",
            "label": "corner",
            "description": "The resulting corner from Dimitri Payet (West Ham) is cleared."
        },
        {
            "gameTime": "1 - 18:35",
            "label": "",
            "description": "This shall not pass! Dimitri Payet (West Ham) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. West Ham get a corner."
        },
        {
            "gameTime": "1 - 16:56",
            "label": "soccer-ball",
            "description": "Manuel Lanzini (West Ham) controls the ball with a great first touch just outside the penalty area after receiving a pass and smashes the ball into the roof of the net to give the goalkeeper no chance!"
        },
        {
            "gameTime": "1 - 15:30",
            "label": "y-card",
            "description": "Branislav Ivanovic (Chelsea) is awarded a yellow card. The referee showed him no mercy."
        },
        {
            "gameTime": "1 - 10:55",
            "label": "",
            "description": "Winston Reid (West Ham) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "1 - 10:48",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 10:25",
            "label": "",
            "description": "Enner Valencia (West Ham) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 08:06",
            "label": "",
            "description": "Willian (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball is behind the touchline and Chelsea will take a throw in."
        },
        {
            "gameTime": "1 - 06:05",
            "label": "",
            "description": "Aaron Cresswell (West Ham) sends a long ball in, but Thibaut Courtois comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 05:34",
            "label": "",
            "description": "was too forceful with his tackle and Robert Madley interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 04:46",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Dimitri Payet (West Ham). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 04:29",
            "label": "",
            "description": "Manuel Lanzini (West Ham) tries to send the ball in front of the goal, but the opposition's defence averts the threat. West Ham have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 03:47",
            "label": "",
            "description": "That's a well played offside trap. is flagged for offside, ending the attack."
        },
        {
            "gameTime": "1 - 03:21",
            "label": "",
            "description": "Chelsea slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Chelsea will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Robert Madley is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The home team had more of the game. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        }
    ],
    "gameAwayTeam": "West Ham",
    "gameDate": "19/03/2016 - 18:00",
    "gameHomeTeam": "Chelsea",
    "gameScore": "2 - 2"
}