{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-09-16 - 22-00 Chelsea 1 - 2 Liverpool/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a very watchable match. Great goals and there was plenty of action at both ends of the pitch. No regrets about following this game. Neither of the teams had any obvious superiority in this game. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 48:19",
            "label": "whistle",
            "description": "That's it for today, Martin Atkinson has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 47:46",
            "label": "",
            "description": "Flag goes up against Diego Costa (Chelsea) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Cesc Fabregas (Chelsea) sends it out of play."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "Victor Moses (Chelsea) wastes a good opportunity as his pass into the box is blocked by the defence. Chelsea win a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:25",
            "label": "substitution",
            "description": "Today's match ends for Georginio Wijnaldum who will be replaced by Kevin Stewart (Liverpool)."
        },
        {
            "gameTime": "2 - 44:20",
            "label": "",
            "description": "Diego Costa (Chelsea) is flagged for offside."
        },
        {
            "gameTime": "2 - 44:15",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) unleashes a shot from a mid range free kick that crashes into the defensive wall. The opposition's goalkeeper set it up perfectly."
        },
        {
            "gameTime": "2 - 44:07",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) will take a free kick. Is he going to strike the ball directly at the goal? Let's find out!"
        },
        {
            "gameTime": "2 - 42:57",
            "label": "y-card",
            "description": "Lucas Leiva (Liverpool) shouldn't be surprised it's a yellow from the ref, who cooled the situation down well."
        },
        {
            "gameTime": "2 - 42:56",
            "label": "",
            "description": "Lucas Leiva (Liverpool) brings his opponent down with a tackle and Martin Atkinson blows his whistle for a foul. Chelsea have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "",
            "description": "Chelsea players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "2 - 41:50",
            "label": "",
            "description": "Victor Moses (Chelsea) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 39:12",
            "label": "",
            "description": "One of the players from Liverpool times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "substitution",
            "description": "Substitution. Oscar leaves the pitch and is replaced by Pedro (Chelsea)."
        },
        {
            "gameTime": "2 - 38:48",
            "label": "substitution",
            "description": "The substitution is prepared. Cesc Fabregas (Chelsea) joins the action as a substitute, replacing Nemanja Matic."
        },
        {
            "gameTime": "2 - 38:19",
            "label": "substitution",
            "description": "Antonio Conte has decided to substitute Willian and he is replaced by Victor Moses (Chelsea)."
        },
        {
            "gameTime": "2 - 37:15",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 36:57",
            "label": "substitution",
            "description": "We are about to witness a substitution. Lucas Leiva (Liverpool) is replacing Philippe Coutinho."
        },
        {
            "gameTime": "2 - 36:32",
            "label": "",
            "description": "Adam Lallana (Liverpool) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players. The referee and his assistant both point at the corner flag. Liverpool will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 35:57",
            "label": "",
            "description": "Thibaut Courtois makes a superb save to deny a header which was nodded towards the bottom right corner by Divock Origi (Liverpool) after a cross from the side."
        },
        {
            "gameTime": "2 - 35:07",
            "label": "",
            "description": "Nemanja Matic (Chelsea) clips a neat ball into the box in the direction of N'Golo Kante, but he can't get on the end of the pass."
        },
        {
            "gameTime": "2 - 34:15",
            "label": "attendance",
            "description": "The attendance for today's match is 41514."
        },
        {
            "gameTime": "2 - 33:12",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) picks up a pass inside the box and finds some space for a shot before unleashing a low drive goalwards, but one of the defending players blocks his effort."
        },
        {
            "gameTime": "2 - 30:52",
            "label": "",
            "description": "A pass from Willian (Chelsea) is intercepted by Simon Mignolet and the move breaks down."
        },
        {
            "gameTime": "2 - 28:24",
            "label": "",
            "description": "Martin Atkinson blows for a foul after Branislav Ivanovic (Chelsea) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 28:09",
            "label": "",
            "description": "Sadio Mane (Liverpool) gives away a foul for a clumsy challenge. Referee Martin Atkinson saw the whole situation."
        },
        {
            "gameTime": "2 - 27:11",
            "label": "",
            "description": "James Milner (Liverpool) is penalised for holding. Martin Atkinson signals a set piece."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "",
            "description": "Sadio Mane (Liverpool) is clearly in an offside position after the ball is played through to him and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 24:25",
            "label": "corner",
            "description": "Thibaut Courtois comes off his line to intercept the corner from James Milner (Liverpool)."
        },
        {
            "gameTime": "2 - 24:01",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by James Milner (Liverpool), was easily dealt with by one of the defenders. Liverpool have a corner."
        },
        {
            "gameTime": "2 - 23:16",
            "label": "",
            "description": "Martin Atkinson blows his whistle after Oscar (Chelsea) kicks an opponent's legs instead of the ball. A free kick has been awarded to Liverpool."
        },
        {
            "gameTime": "2 - 20:36",
            "label": "",
            "description": "Martin Atkinson blows his whistle for a foul after Philippe Coutinho (Liverpool) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 19:48",
            "label": "",
            "description": "This was a piece of cake for Simon Mignolet. Diego Costa (Chelsea) found himself some space after latching on to a pass, but his strike only went low to the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 17:51",
            "label": "",
            "description": "Willian (Chelsea) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "2 - 17:38",
            "label": "",
            "description": "A player from Liverpool pulled an opponent down, forcing the referee to blow his whistle. Chelsea are awarded a free kick."
        },
        {
            "gameTime": "2 - 15:25",
            "label": "soccer-ball",
            "description": "Nemanja Matic provides Diego Costa (Chelsea) with a nice pass inside the box. It allows him to finish with a low shot into the middle of the goal."
        },
        {
            "gameTime": "2 - 13:34",
            "label": "",
            "description": "Oscar (Chelsea) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "2 - 11:58",
            "label": "substitution",
            "description": "Substitution. Daniel Sturridge will be replaced by Divock Origi (Liverpool)."
        },
        {
            "gameTime": "2 - 11:42",
            "label": "",
            "description": "The ball is cleared after Branislav Ivanovic (Chelsea) attempted to dribble past an opposing player. The ball is off of the pitch and it's a goal kick for Liverpool."
        },
        {
            "gameTime": "2 - 10:07",
            "label": "",
            "description": "Willian (Chelsea) produces a poor pass. He attempts to get the ball into the box but it's hacked away."
        },
        {
            "gameTime": "2 - 07:47",
            "label": "",
            "description": "N'Golo Kante (Chelsea) fails to score from close range. He picks up a rebound, but sends it wide of the target!"
        },
        {
            "gameTime": "2 - 06:50",
            "label": "",
            "description": "Willian (Chelsea) serves up a nice cross, but Simon Mignolet punches the ball away."
        },
        {
            "gameTime": "2 - 06:34",
            "label": "",
            "description": "Chelsea enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 04:33",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "2 - 03:17",
            "label": "",
            "description": "Jordan Henderson (Liverpool) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Martin Atkinson blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "2 - 02:31",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) pulls the shirt of his opponent and only escapes without punishment due to the benevolence of the referee."
        },
        {
            "gameTime": "2 - 01:38",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Willian (Chelsea). The ball goes out of play and Liverpool will have a goal kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. The away side are dominant and dictating the tempo of the game, mainly because of their higher activity and more accurate passing. The home team makes a lot of passes and attempts to maintain possession. The same goes for the away side."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:24",
            "label": "y-card",
            "description": "The referee gives a yellow card to Willian (Chelsea) for talking back. He must be careful for the remainder of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:48",
            "label": "",
            "description": "Jordan Henderson (Liverpool) takes a short free kick."
        },
        {
            "gameTime": "1 - 44:06",
            "label": "",
            "description": "N'Golo Kante (Chelsea) tackles a bit over zealously and Martin Atkinson blows for a foul. Liverpool are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 43:42",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "1 - 43:19",
            "label": "corner",
            "description": "Willian (Chelsea) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 43:05",
            "label": "",
            "description": "Diego Costa (Chelsea) races towards goal but the defender gets back well to make a challenge. Chelsea earn a corner."
        },
        {
            "gameTime": "1 - 42:41",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 40:59",
            "label": "",
            "description": "Joel Matip (Liverpool) brings his opponent down. Martin Atkinson has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 39:17",
            "label": "",
            "description": "Willian (Chelsea) rises above the defence to meet a cross from the corner. His timing is good, but he directs his header just a few inches wide of the left post."
        },
        {
            "gameTime": "1 - 39:01",
            "label": "corner",
            "description": "Willian (Chelsea) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 38:40",
            "label": "",
            "description": "Chelsea keep the ball well and push forward with purpose, but here comes an interception from the opposition. The ball goes behind for a corner. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 38:20",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 38:05",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety. Chelsea will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 37:46",
            "label": "",
            "description": "Eden Hazard (Chelsea) looks to break free, but an opposing player clears the ball away. Chelsea force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 37:32",
            "label": "",
            "description": "Willian (Chelsea) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 37:14",
            "label": "",
            "description": "One of the Liverpool players unfairly tackled his opponent and conceded a foul. Chelsea win a free kick."
        },
        {
            "gameTime": "1 - 35:12",
            "label": "soccer-ball",
            "description": "Jordan Henderson (Liverpool) quickly gets to a rebound. He is not worried how far out he is and slams the ball towards the goal. To the amazement of all, it goes all the way into the top right corner. He makes it 0:1 with this magnificent strike."
        },
        {
            "gameTime": "1 - 33:59",
            "label": "",
            "description": "David Luiz (Chelsea) creates himself some space around the penalty spot and connects with the free kick. His accurate header would have probably ended up inside the right post, but Simon Mignolet pulls off a decent save to thwart him."
        },
        {
            "gameTime": "1 - 33:32",
            "label": "",
            "description": "Willian (Chelsea) takes a direct free kick."
        },
        {
            "gameTime": "1 - 32:46",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) fouls an opponent. At least that's what referee Martin Atkinson signals. A free kick to Chelsea."
        },
        {
            "gameTime": "1 - 31:28",
            "label": "",
            "description": "Chelsea are ruled offside."
        },
        {
            "gameTime": "1 - 30:56",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner."
        },
        {
            "gameTime": "1 - 30:23",
            "label": "",
            "description": "Willian (Chelsea) fails to send a pass into the box as his effort is cut out. The referee blows his whistle, Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 28:28",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) was too forceful with his tackle and Martin Atkinson interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 28:05",
            "label": "",
            "description": "N'Golo Kante (Chelsea) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "1 - 26:08",
            "label": "",
            "description": "David Luiz (Chelsea) collects an inch perfect pass and strikes the ball from far out, but his shot is blocked."
        },
        {
            "gameTime": "1 - 25:51",
            "label": "",
            "description": "Nemanja Matic (Chelsea) weaves his way through opponents and strikes the ball from the edge of the area, but it's blocked by a defender."
        },
        {
            "gameTime": "1 - 25:19",
            "label": "",
            "description": "A brilliant individual effort! Daniel Sturridge (Liverpool) tricks his way past challenges into the box and drags his shot narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 24:12",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "1 - 23:55",
            "label": "",
            "description": "Joel Matip (Liverpool) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee points to the corner flag. It's a corner to Liverpool."
        },
        {
            "gameTime": "1 - 23:11",
            "label": "",
            "description": "David Luiz (Chelsea) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 22:00",
            "label": "injury",
            "description": "David Luiz (Chelsea) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 21:31",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) is having a lively performance. He is causing problems and wanting the ball at every opportunity."
        },
        {
            "gameTime": "1 - 20:09",
            "label": "",
            "description": "The linesman raises his flag. Diego Costa (Chelsea) is adjudged offside."
        },
        {
            "gameTime": "1 - 16:55",
            "label": "soccer-ball",
            "description": "What a hit! Dejan Lovren (Liverpool) shows good composure inside the box to fire a first time shot inside the left post. 0:1."
        },
        {
            "gameTime": "1 - 16:50",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 16:08",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) makes a strong challenge and Martin Atkinson blows for a foul. Liverpool have a free kick."
        },
        {
            "gameTime": "1 - 14:44",
            "label": "",
            "description": "Eden Hazard (Chelsea) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 13:51",
            "label": "",
            "description": "What a miskick by Jordan Henderson (Liverpool). He smashes a volley from long distance that goes into the stands."
        },
        {
            "gameTime": "1 - 13:34",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 13:07",
            "label": "corner",
            "description": "The resulting corner from Jordan Henderson (Liverpool) is cleared."
        },
        {
            "gameTime": "1 - 12:37",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The referee and one of his assistants signal for a corner kick to Liverpool."
        },
        {
            "gameTime": "1 - 09:30",
            "label": "",
            "description": "A player from Liverpool commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "1 - 09:05",
            "label": "",
            "description": "Jordan Henderson (Liverpool) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "1 - 08:09",
            "label": "",
            "description": "Poor challenge! Branislav Ivanovic (Chelsea) is penalised for tripping and Martin Atkinson blows his whistle. A free kick has been awarded to Liverpool."
        },
        {
            "gameTime": "1 - 06:37",
            "label": "",
            "description": "A cross from Cesar Azpilicueta (Chelsea) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 04:41",
            "label": "",
            "description": "Sadio Mane (Liverpool) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 03:41",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Chelsea was in an offside position."
        },
        {
            "gameTime": "1 - 02:37",
            "label": "",
            "description": "The Liverpool players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 02:18",
            "label": "",
            "description": "A neat pass is well received by Daniel Sturridge (Liverpool), who is lurking on the edge of the box and produces a low drive directed towards the middle of the goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "1 - 00:13",
            "label": "",
            "description": "Chelsea will kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Martin Atkinson."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "4:1 This was the result of the last match between Liverpool and Leicester."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jordan Henderson from Liverpool has already played 360 minutes this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Chelsea scored at least one goal in each of their last 9 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Diego Costa looks sharp as he's the top goal scorer for Chelsea with 17 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a very watchable match. Great goals and there was plenty of action at both ends of the pitch. No regrets about following this game. Neither of the teams had any obvious superiority in this game. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Liverpool",
    "gameDate": "16/09/2016 - 22:00",
    "gameHomeTeam": "Chelsea",
    "gameScore": "1 - 2"
}