{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-08-16 - 18-00 Manchester City 3 - 0 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "What a terrific football game that was, with everything included. Manchester City were better today and displayed masterful control and movement. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:56",
            "label": "",
            "description": "Falcao (Chelsea) attempts to turn the rebound in from close range. Nevertheless, the goalkeeper pulls off a stunning save and stops the ball from hitting the net. Great goalkeeping."
        },
        {
            "gameTime": "2 - 47:55",
            "label": "",
            "description": "Diego Costa (Chelsea) attempts to test the goalkeeper after collecting a cross inside the penalty area. Luck doesn't appear to be on his side today as his attempt rattles the left post."
        },
        {
            "gameTime": "2 - 45:17",
            "label": "y-card",
            "description": "Eliaquim Mangala (Manchester City) gets a yellow card. The referee Martin Atkinson made the right call."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "",
            "description": "Diego Costa (Chelsea) is penalised for a foul. Martin Atkinson had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 43:01",
            "label": "",
            "description": "What a wasted opportunity by Juan Cuadrado (Chelsea)! He creates some space for himself inside the penalty box and unleashes a decent strike towards the middle of the net, but Joe Hart makes a comfortable save to thwart him."
        },
        {
            "gameTime": "2 - 41:58",
            "label": "",
            "description": "Martin Demichelis (Manchester City) makes a strong challenge and Martin Atkinson blows for a foul."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "soccer-ball",
            "description": "Goal! That was a fantastic finish by Fernandinho (Manchester City) from just outside the box. He wasted little time in getting away a bullet of a shot that flew past the goalkeeper into the left side of the net."
        },
        {
            "gameTime": "2 - 38:01",
            "label": "substitution",
            "description": "The manager makes a subsitution with Wilfried Bony (Manchester City) coming on for Sergio Aguero."
        },
        {
            "gameTime": "2 - 35:05",
            "label": "",
            "description": "Yaya Toure (Manchester City) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the right post is, however, superbly saved by Asmir Begovic!"
        },
        {
            "gameTime": "2 - 35:03",
            "label": "y-card",
            "description": "Eden Hazard (Chelsea) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Martin Atkinson ignores the protests."
        },
        {
            "gameTime": "2 - 33:56",
            "label": "soccer-ball",
            "description": "David Silva delivers a well placed cross from the corner. Vincent Kompany (Manchester City) wins the ball and powers an unstoppable header in off the right post. The score now reads 2:0."
        },
        {
            "gameTime": "2 - 33:55",
            "label": "corner",
            "description": "David Silva (Manchester City) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 33:50",
            "label": "substitution",
            "description": "Jose Mourinho has decided to make a change. Falcao (Chelsea) replaces Willian."
        },
        {
            "gameTime": "2 - 33:33",
            "label": "substitution",
            "description": "Raheem Sterling will be replaced by Martin Demichelis (Manchester City)."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "",
            "description": "Samir Nasri (Manchester City) sends a pass into the penalty area, but the opponent manages to cut it out. Manchester City have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 32:36",
            "label": "",
            "description": "Half chance! Aleksandar Kolarov (Manchester City) plays a pass into the box, but Asmir Begovic reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 32:02",
            "label": "",
            "description": "Samir Nasri (Manchester City) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 31:40",
            "label": "attendance",
            "description": "The attendance is 54331."
        },
        {
            "gameTime": "2 - 29:20",
            "label": "",
            "description": "David Silva (Manchester City) smashes the ball upfield and Raheem Sterling controls it with a great first touch."
        },
        {
            "gameTime": "2 - 27:39",
            "label": "",
            "description": "The cross into the penalty area from Juan Cuadrado (Chelsea) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "2 - 24:45",
            "label": "",
            "description": "Joe Hart pulls off a great save to deny Eden Hazard (Chelsea), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "2 - 22:30",
            "label": "",
            "description": "Sergio Aguero (Manchester City) breaks into the penalty area but his shot is blocked."
        },
        {
            "gameTime": "2 - 21:16",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "substitution",
            "description": "Manuel Pellegrini has decided to substitute Jesus Navas and he is replaced by Samir Nasri (Manchester City)."
        },
        {
            "gameTime": "2 - 19:39",
            "label": "",
            "description": "What a chance that is! Sergio Aguero (Manchester City) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 18:51",
            "label": "substitution",
            "description": "Substitution. Ramires makes way for Juan Cuadrado (Chelsea)."
        },
        {
            "gameTime": "2 - 18:20",
            "label": "",
            "description": "Ramires (Chelsea) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "2 - 15:49",
            "label": "",
            "description": "Yaya Toure (Manchester City) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Asmir Begovic is alert and denies him."
        },
        {
            "gameTime": "2 - 14:19",
            "label": "",
            "description": "David Silva (Manchester City) attempted to pick out a free teammate inside the box, but Asmir Begovic comes off the line to clear the ball away."
        },
        {
            "gameTime": "2 - 12:39",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "2 - 10:21",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 10:08",
            "label": "",
            "description": "Eden Hazard (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee points to the corner flag and Chelsea will take a corner."
        },
        {
            "gameTime": "2 - 09:23",
            "label": "",
            "description": "Sergio Aguero (Manchester City) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 07:51",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) sends an accurate short pass. Eden Hazard controls the ball with a fine first touch and is able to come up with a new attacking effort."
        },
        {
            "gameTime": "2 - 05:16",
            "label": "y-card",
            "description": "Yellow card! It's like Yaya Toure (Manchester City) was asking for a caution with his behaviour. Martin Atkinson agrees and books him."
        },
        {
            "gameTime": "2 - 04:33",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Ramires (Chelsea) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "2 - 03:11",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 02:36",
            "label": "y-card",
            "description": "Martin Atkinson shows a yellow card to Branislav Ivanovic (Chelsea) for a tough tackle. Manchester City get a free kick."
        },
        {
            "gameTime": "2 - 01:44",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Jose Mourinho gives a chance to Kurt Zouma (Chelsea) and John Terry is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 49:59",
            "label": "",
            "description": "There was plenty of entertainment during the first 45 minutes. Hopefully more of the same in the second half. The hosts were superior in their performance in the first half. They were more active and precise. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 49:58",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 49:32",
            "label": "",
            "description": "Gary Cahill (Chelsea) is able to continue to play."
        },
        {
            "gameTime": "1 - 49:31",
            "label": "",
            "description": "Diego Costa (Chelsea) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 49:10",
            "label": "",
            "description": "David Silva (Manchester City) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 46:58",
            "label": "injury",
            "description": "Diego Costa (Chelsea) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 45:12",
            "label": "y-card",
            "description": "The foul by Fernandinho (Manchester City) is worthy of a card and a yellow is duly shown by Martin Atkinson."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 43:45",
            "label": "injury",
            "description": "Looks like Gary Cahill (Chelsea) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 43:13",
            "label": "",
            "description": "Aleksandar Kolarov swings the cross over. Eliaquim Mangala (Manchester City) gets his head to it but it goes just wide of the right post."
        },
        {
            "gameTime": "1 - 41:23",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) unleashes a decent effort from just outside the box which goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 39:24",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) sends a cross into the box, but Joe Hart comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 36:53",
            "label": "corner",
            "description": "The resulting corner from David Silva (Manchester City) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 36:42",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) has a shot blocked from inside the box. Manchester City will take a corner kick."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "",
            "description": "Sergio Aguero passes to Raheem Sterling (Manchester City), but he produces a wild shot from the edge of the box which goes high over the bar."
        },
        {
            "gameTime": "1 - 32:38",
            "label": "y-card",
            "description": "A yellow card for a tackle by Vincent Kompany (Manchester City). Martin Atkinson doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 30:27",
            "label": "soccer-ball",
            "description": "Sergio Aguero (Manchester City) receives a precise pass inside the box from Yaya Toure and he beats the goalkeeper with a neat finish into the left side of the net. 1:0."
        },
        {
            "gameTime": "1 - 28:51",
            "label": "corner",
            "description": "The resulting corner, taken by Jesus Navas (Manchester City), comes to nothing."
        },
        {
            "gameTime": "1 - 28:38",
            "label": "",
            "description": "Jesus Navas (Manchester City) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. It will be a corner kick for Manchester City."
        },
        {
            "gameTime": "1 - 26:38",
            "label": "",
            "description": "Jesus Navas (Manchester City) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 24:42",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 22:45",
            "label": "",
            "description": "Diego Costa (Chelsea) was too fierce in his attempt to get the ball from his opponent and Martin Atkinson blows for a foul."
        },
        {
            "gameTime": "1 - 21:40",
            "label": "",
            "description": "Sergio Aguero (Manchester City) had a good opportunity when he latched on to a cross from the wing, but his strike wasn't accurate at all and the ball went well wide of the left post."
        },
        {
            "gameTime": "1 - 20:24",
            "label": "",
            "description": "Yaya Toure (Manchester City) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "1 - 19:21",
            "label": "",
            "description": "Nemanja Matic (Chelsea) meets a cross from Eden Hazard, but he cannot keep his header on target. It goes high over the crossbar."
        },
        {
            "gameTime": "1 - 18:25",
            "label": "",
            "description": "Fernandinho (Manchester City) trips an opposition player and Martin Atkinson signals a foul."
        },
        {
            "gameTime": "1 - 16:26",
            "label": "",
            "description": "Sergio Aguero (Manchester City) receives a quality pass inside the box and fires a first time shot. His effort towards the right post is saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 15:37",
            "label": "",
            "description": "Asmir Begovic was forced into action to thwart Sergio Aguero (Manchester City). He found himself some space after latching on to a pass and unleashed a shot to the right post but couldn't beat the keeper."
        },
        {
            "gameTime": "1 - 14:33",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) sends a chip pass into the box, but Joe Hart is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 13:12",
            "label": "corner",
            "description": "Aleksandar Kolarov (Manchester City) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 12:48",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball goes out of play and Manchester City have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 11:27",
            "label": "",
            "description": "Eden Hazard (Chelsea) plays a one two with Willian, but the move breaks down."
        },
        {
            "gameTime": "1 - 09:46",
            "label": "",
            "description": "A pass by David Silva (Manchester City) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 07:53",
            "label": "",
            "description": "Nemanja Matic (Chelsea) commits a rough foul. Martin Atkinson stops the game and makes a call."
        },
        {
            "gameTime": "1 - 06:26",
            "label": "",
            "description": "The ball is cleared after Ramires (Chelsea) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 04:19",
            "label": "corner",
            "description": "David Silva (Manchester City) takes the corner."
        },
        {
            "gameTime": "1 - 03:59",
            "label": "",
            "description": "David Silva (Manchester City) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger. Manchester City force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 02:57",
            "label": "",
            "description": "Jesus Navas (Manchester City) strikes a shot towards goal from the edge of the penalty box, but it flies just wide of the left post."
        },
        {
            "gameTime": "1 - 01:21",
            "label": "",
            "description": "Nice individual effort by Sergio Aguero (Manchester City). He gets all the way through to the keeper and hits a shot to the middle of the goal, but Asmir Begovic does a good job to anticipate the direction of the ball and keeps it out."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Chelsea will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Martin Atkinson will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a terrific football game that was, with everything included. Manchester City were better today and displayed masterful control and movement. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "16/08/2015 - 18:00",
    "gameHomeTeam": "Manchester City",
    "gameScore": "3 - 0"
}