{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-02-25 - 20-00 Napoli 0 - 2 Atalanta/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:31",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 48:17",
            "label": "",
            "description": "Dries Mertens (Napoli) sends an inaccurate first time shot that sails miles wide of the right post."
        },
        {
            "gameTime": "2 - 46:01",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 45:52",
            "label": "substitution",
            "description": "Substitution. Andrea Petagna makes his way off the pitch and Ervin Zukanovic (Atalanta) comes on as his replacement."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:55",
            "label": "",
            "description": "Raul Albiol (Napoli) controls the ball from the corner kick and unleashes a low drive from the edge of the box towards the middle of the target. The goalkeeper has a clear sight of the shot and thwarts him with a comfortable save."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 40:28",
            "label": "substitution",
            "description": "Here is a change. Jasmin Kurtic is going off and Gian Piero Gasperini gives the last tactical orders to Bryan Cristante (Atalanta)."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "corner",
            "description": "The corner from Faouzi Ghoulam (Napoli) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 37:00",
            "label": "substitution",
            "description": "Substitution. Alberto Grassi (Atalanta) on for Alejandro Gomez."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "corner",
            "description": "Jose Callejon (Napoli) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 33:48",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to make a change. Cristian Maggio (Napoli) replaces Elseid Hysaj."
        },
        {
            "gameTime": "2 - 33:28",
            "label": "substitution",
            "description": "Today's match ends for Lorenzo Insigne who will be replaced by Leonardo Pavoletti (Napoli)."
        },
        {
            "gameTime": "2 - 32:01",
            "label": "y-card",
            "description": "Etrit Berisha (Atalanta) is literally asking for a yellow card with his behaviour. The referee agrees and books him."
        },
        {
            "gameTime": "2 - 30:46",
            "label": "",
            "description": "Jose Callejon (Napoli) receives a lofted pass in the goal area and unleashes a dangerous header which sails narrowly wide of the left post! The ball is off of the pitch and it's a goal kick for Atalanta."
        },
        {
            "gameTime": "2 - 27:16",
            "label": "",
            "description": "What a great effort! Piotr Zielinski (Napoli) decides to unleash a long range shot. Despite hitting it very well, it scorches inches wide of the left post. We could have witnessed a magnificent goal. The ball goes out of play and Atalanta will have a goal kick."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "soccer-ball",
            "description": "What a hit! Mattia Caldara (Atalanta) shows good composure inside the box to fire a first time shot into the bottom left corner. 0:2."
        },
        {
            "gameTime": "2 - 21:38",
            "label": "yr-card",
            "description": "Franck Kessie (Atalanta) should have been more careful. He commits a bad foul, receives his second yellow card and is sent off!"
        },
        {
            "gameTime": "2 - 21:20",
            "label": "corner",
            "description": "Alejandro Gomez (Atalanta) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 18:56",
            "label": "y-card",
            "description": "Franck Kessie (Atalanta) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 18:23",
            "label": "",
            "description": "The Atalanta players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 13:52",
            "label": "substitution",
            "description": "Substitution. Marek Hamsik makes way for Arkadiusz Milik (Napoli)."
        },
        {
            "gameTime": "2 - 13:00",
            "label": "corner",
            "description": "Alejandro Gomez (Atalanta) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "corner",
            "description": "Alejandro Gomez (Atalanta) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 10:14",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 07:57",
            "label": "corner",
            "description": "Pepe Reina leaps to intercept the corner kick from Alejandro Gomez (Atalanta)."
        },
        {
            "gameTime": "2 - 07:55",
            "label": "corner",
            "description": "Alejandro Gomez (Atalanta) takes the corner, but the goalkeeper jumps and gathers the ball. The ball is out of play and the linesman points at the corner flag. Corner to Atalanta."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "",
            "description": "A cross into the box from Alejandro Gomez (Atalanta) is cleared. Atalanta win a corner."
        },
        {
            "gameTime": "2 - 04:29",
            "label": "",
            "description": "Jose Callejon (Napoli) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 04:08",
            "label": "",
            "description": "Neat passing move from Napoli in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 01:50",
            "label": "",
            "description": "Marek Hamsik (Napoli) fails to pick a body out in the box with an over hit cross to the back post. The ball is off of the pitch and it's a goal kick for Atalanta."
        },
        {
            "gameTime": "2 - 01:09",
            "label": "",
            "description": "Chance! Andrea Petagna (Atalanta) gets to the rebound on the edge of the box and unleashes a low shot towards goal, but Pepe Reina is alert and makes a great save to deny him."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:03",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:10",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Jose Callejon (Napoli). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 44:00",
            "label": "",
            "description": "Dries Mertens (Napoli) steps up to take the set piece from the edge of the box and unleashes a shot directed into the top left corner, but the goalkeeper makes a decent save and denies him. The referee and his assistant both point at the corner flag. Napoli will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "corner",
            "description": "The corner from Alejandro Gomez (Atalanta) is intercepted by Pepe Reina."
        },
        {
            "gameTime": "1 - 42:20",
            "label": "corner",
            "description": "A dangerous looking corner kick from Alejandro Gomez (Atalanta) is cleared to safety by the defence. The referee blows his whistle, Atalanta are awarded a corner kick."
        },
        {
            "gameTime": "1 - 41:50",
            "label": "corner",
            "description": "Alejandro Gomez (Atalanta) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance. The linesman makes the right call and Atalanta will have a corner."
        },
        {
            "gameTime": "1 - 41:40",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Alejandro Gomez (Atalanta), but one of the defenders gets it clear. The ball goes out of play. Atalanta are awarded a corner kick."
        },
        {
            "gameTime": "1 - 40:01",
            "label": "y-card",
            "description": "Elseid Hysaj (Napoli) is booked after bringing down an opponent. Domenico Celi had an easy decision to make."
        },
        {
            "gameTime": "1 - 38:57",
            "label": "",
            "description": "What a huge chance for Dries Mertens (Napoli). He collects a precise pass inside the box and slices a shot that goes a whisker wide of the left post. The ball goes out of play and Atalanta will have a goal kick."
        },
        {
            "gameTime": "1 - 38:27",
            "label": "",
            "description": "The Napoli players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 36:52",
            "label": "",
            "description": "Leonardo Spinazzola (Atalanta) bursts into the penalty area with the ball at his feet after a wonderful individual effort that left fans breathless and in awe. However, he sends the ball in a completely different direction than intended, well wide of the target."
        },
        {
            "gameTime": "1 - 34:40",
            "label": "",
            "description": "Piotr Zielinski (Napoli) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort! The ball goes out of play and Atalanta will have a goal kick."
        },
        {
            "gameTime": "1 - 34:00",
            "label": "corner",
            "description": "Jose Callejon (Napoli) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 33:44",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 33:12",
            "label": "",
            "description": "Andrea Petagna (Atalanta) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 28:00",
            "label": "soccer-ball",
            "description": "Mattia Caldara (Atalanta) scores a goal with a fine header that goes inside the left post, giving the goalkeeper no chance."
        },
        {
            "gameTime": "1 - 27:55",
            "label": "corner",
            "description": "Alejandro Gomez (Atalanta) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 27:53",
            "label": "",
            "description": "Jasmin Kurtic (Atalanta) sends a pass into the box, but his attempt is thwarted and cleared. The ball is out of play and Atalanta manage to earn a corner."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "",
            "description": "Domenico Celi blows his whistle after Dries Mertens (Napoli) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "",
            "description": "Leonardo Spinazzola (Atalanta) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "1 - 24:57",
            "label": "",
            "description": "Atalanta seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 23:12",
            "label": "injury",
            "description": "Rafael Toloi (Atalanta) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 21:58",
            "label": "",
            "description": "Dries Mertens (Napoli) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 20:00",
            "label": "",
            "description": "Domenico Celi has a clear sight and sees a foul from Remo Freuler (Atalanta)."
        },
        {
            "gameTime": "1 - 19:04",
            "label": "",
            "description": "Remo Freuler (Atalanta) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 17:46",
            "label": "",
            "description": "Andrea Conti (Atalanta) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him."
        },
        {
            "gameTime": "1 - 15:31",
            "label": "",
            "description": "Atalanta players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 13:07",
            "label": "",
            "description": "Remo Freuler (Atalanta) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 10:19",
            "label": "",
            "description": "The linesman raises his flag for offside before Alejandro Gomez (Atalanta) heads on."
        },
        {
            "gameTime": "1 - 08:26",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Napoli."
        },
        {
            "gameTime": "1 - 06:00",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) fails to score from inside the box as his rebound pings off the bar! The ball is off of the pitch and it's a goal kick for Atalanta."
        },
        {
            "gameTime": "1 - 05:15",
            "label": "",
            "description": "Franck Kessie (Atalanta) collects a rebound and produces a mid range attempt. The ball goes to the middle of the target, but Pepe Reina keeps it out."
        },
        {
            "gameTime": "1 - 05:07",
            "label": "",
            "description": "Leonardo Spinazzola (Atalanta) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "",
            "description": "Marek Hamsik (Napoli) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 02:44",
            "label": "",
            "description": "Franck Kessie (Atalanta) gives away a foul for a clumsy challenge. Referee Domenico Celi saw the whole situation."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Domenico Celi will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Atalanta have played 10 games so far this season that have had under 2.5 total goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli have not tasted defeat in their last 14 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's the end of the match."
        }
    ],
    "gameAwayTeam": "Atalanta",
    "gameDate": "25/02/2017 - 20:00",
    "gameHomeTeam": "Napoli",
    "gameScore": "0 - 2"
}