{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-16 - 21-45 Dyn. Kiev 2 - 2 FC Porto/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. We saw a very balanced game over the 90 minutes. Both teams tried to constantly keep their opponents under pressure."
        },
        {
            "gameTime": "2 - 48:07",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 47:34",
            "label": "",
            "description": "Artem Kravets (Dynamo Kiev) and his stunning dribble! He zig zags through the defence and gets in front of the keeper. He faints to shoot and then suddenly strikes goalwards, but his effort misses the target by a whisker. Very unlucky for Artem Kravets (Dynamo Kiev). This could have been a legendary goal."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "",
            "description": "Vitorino Gabriel Pacheco Antunes (Dynamo Kiev) attempts a long crossfield pass, but the defence does well to intercept the ball."
        },
        {
            "gameTime": "2 - 46:22",
            "label": "substitution",
            "description": "Substitution. Vincent Aboubakar makes his way off the pitch and Pablo Osvaldo (FC Porto) comes on as his replacement."
        },
        {
            "gameTime": "2 - 45:37",
            "label": "corner",
            "description": "Younes Belhanda (Dynamo Kiev) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 45:10",
            "label": "",
            "description": "Sergiy Rybalka (Dynamo Kiev) tries to slide the ball through to a teammate but it's well blocked by a defender. Dyn. Kiev will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:11",
            "label": "soccer-ball",
            "description": "Vitaliy Buyalskyy (Dynamo Kiev) smartly headed the ball past the goalkeeper."
        },
        {
            "gameTime": "2 - 43:07",
            "label": "",
            "description": "Quick reactions by Sergiy Rybalka (Dynamo Kiev) and Vitaliy Buyalskyy, tricking their opponents with a cheeky chip pass. A beautiful football moment and great skill, which caused the noise in the stadium to go up a notch."
        },
        {
            "gameTime": "2 - 43:07",
            "label": "",
            "description": "Sergiy Rybalka (Dynamo Kiev) decides to have a shot at goal from the free kick, but it hits the defensive wall."
        },
        {
            "gameTime": "2 - 42:40",
            "label": "",
            "description": "Promising opportunity for Dyn. Kiev as they have a free kick from 24."
        },
        {
            "gameTime": "2 - 42:30",
            "label": "y-card",
            "description": "Danilo Pereira (FC Porto) is booked after bringing down an opponent. Felix Brych had an easy decision to make."
        },
        {
            "gameTime": "2 - 40:58",
            "label": "substitution",
            "description": "That will be all from Miguel Veloso who is being replaced by the fresh legs of Artem Kravets (Dynamo Kiev)."
        },
        {
            "gameTime": "2 - 40:50",
            "label": "",
            "description": "Denys Garmash (Dynamo Kiev) commits a rough challenge and Felix Brych blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 37:37",
            "label": "",
            "description": "What a chance that is! Denys Garmash (Dynamo Kiev) displays good awareness near the penalty spot to get on the end of a cross, but he sends his header narrowly wide of the left post. The ball goes out of play and FC Porto will have a goal kick."
        },
        {
            "gameTime": "2 - 35:54",
            "label": "soccer-ball",
            "description": "Goal! Vincent Aboubakar (FC Porto) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball low inside the right post. It's 1:2."
        },
        {
            "gameTime": "2 - 35:20",
            "label": "corner",
            "description": "The resulting corner from Ruben Neves (FC Porto) comes to nothing."
        },
        {
            "gameTime": "2 - 35:11",
            "label": "",
            "description": "Oleksandr Rybka makes a brilliant save! Jesus Manuel Corona (FC Porto) easily weaves through the defence and unleashes a shot from just outside of the box. His effort goes straight under the crossbar but is saved by the keeper! FC Porto force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 34:50",
            "label": "",
            "description": "FC Porto are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 32:48",
            "label": "substitution",
            "description": "Rui Barros has decided to introduce fresh legs, with Jesus Manuel Corona (FC Porto) replacing Yacine Brahimi."
        },
        {
            "gameTime": "2 - 31:57",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) brings his opponent down with a tackle and Felix Brych blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 30:44",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) wastes a great chance from the resulting corner. He times his header superbly when he leaps high to meet a precise cross, but can't aim better than into the middle of the goal, straight into the arms of the goalkeeper."
        },
        {
            "gameTime": "2 - 30:20",
            "label": "corner",
            "description": "Miguel Veloso (Dynamo Kiev) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 30:14",
            "label": "",
            "description": "Denys Garmash (Dynamo Kiev) shoots from outside the box, but his effort is blocked. The ball goes out of play and Dyn. Kiev have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 28:20",
            "label": "",
            "description": "Evgen Khacheridi (Dynamo Kiev) reacts well and displays good awareness near the penalty spot to get on the end of a cross from the free kick. He jumps high and produces a header which goes well wide of the left post."
        },
        {
            "gameTime": "2 - 28:14",
            "label": "",
            "description": "The players claim that Yacine Brahimi (FC Porto) handled the ball and it seems they are right."
        },
        {
            "gameTime": "2 - 27:32",
            "label": "",
            "description": "FC Porto are happy to keep the ball as they wait for gaps in defence to open up. However, an opposing player steps in and clears."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Younes Belhanda (Dynamo Kiev) comes onto the pitch for Derlis Gonzalez."
        },
        {
            "gameTime": "2 - 24:27",
            "label": "",
            "description": "Vincent Aboubakar (FC Porto) is having a lively performance. He is causing problems and wanting the ball at every opportunity."
        },
        {
            "gameTime": "2 - 22:52",
            "label": "",
            "description": "Andre (FC Porto) receives a pass and decides to smash the ball from long range. His poor effort sails well wide of the right post."
        },
        {
            "gameTime": "2 - 21:33",
            "label": "substitution",
            "description": "Sergiy Rebrov has decided to substitute Oleg Gusev and he is replaced by Vitaliy Buyalskyy (Dynamo Kiev)."
        },
        {
            "gameTime": "2 - 19:40",
            "label": "substitution",
            "description": "It's time for a substitution. Cristian Tello (FC Porto) comes on in place of Hector Herrera."
        },
        {
            "gameTime": "2 - 18:45",
            "label": "",
            "description": "Oleg Gusev (Dynamo Kiev) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "2 - 15:34",
            "label": "funfact",
            "description": "The total number of attempts is 13:8."
        },
        {
            "gameTime": "2 - 15:24",
            "label": "",
            "description": "Oleg Gusev (Dynamo Kiev) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort."
        },
        {
            "gameTime": "2 - 14:07",
            "label": "",
            "description": "Derlis Gonzalez (Dynamo Kiev) was trying to get to the ball but clattered into the legs of the opponent as well. Felix Brych blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 13:40",
            "label": "",
            "description": "Maicon (FC Porto) shoots at goal from the free kick from some 25 metres out. His attempt was quite precise and another few inches and it would have ended up inside the right post."
        },
        {
            "gameTime": "2 - 12:44",
            "label": "y-card",
            "description": "Sergiy Rybalka (Dynamo Kiev) picks up a yellow card for an infringement."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "",
            "description": "The game is interrupted, a clear handball by Ruben Neves (FC Porto)."
        },
        {
            "gameTime": "2 - 09:48",
            "label": "",
            "description": "Maximiliano Pereira (FC Porto) sends the ball into the penalty area from a throw in as if it's a corner kick."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "",
            "description": "Andre (FC Porto) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 06:50",
            "label": "",
            "description": "A cross is clipped into the penalty area by Maximiliano Pereira (FC Porto) but poses no threat."
        },
        {
            "gameTime": "2 - 05:33",
            "label": "",
            "description": "Vitorino Antunes (Dynamo Kiev) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "",
            "description": "Dyn. Kiev are enjoying a spell of pressure at the moment, but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 02:50",
            "label": "y-card",
            "description": "Vincent Aboubakar (FC Porto) receives a yellow card from the referee as expected."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "",
            "description": "Miguel Layun (FC Porto) sends over a free kick from long range but the defence is alert."
        },
        {
            "gameTime": "2 - 00:55",
            "label": "y-card",
            "description": "A yellow card for a tackle by Oleg Gusev (Dynamo Kiev). Felix Brych doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. The home fans will be really pleased with what they've seen from their players so far. The home side cause the away team problems with their pressing, but they still try to play possession football."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "",
            "description": "Miguel Veloso (Dynamo Kiev) whips a long ball in from the free kick which is intercepted by Iker Casillas."
        },
        {
            "gameTime": "1 - 45:20",
            "label": "",
            "description": "Ruben Neves (FC Porto) brings an opponent down and Felix Brych interrupts the game. A free kick from around the half way line will be taken by Dyn. Kiev."
        },
        {
            "gameTime": "1 - 45:05",
            "label": "",
            "description": "Vitorino Antunes (Dynamo Kiev) attempts to surprise the keeper with a nice shot, but it lacks accuracy and goes well wide of the right post."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "corner",
            "description": "Oleg Gusev (Dynamo Kiev) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 44:23",
            "label": "",
            "description": "What an opportunity! Denys Garmash (Dynamo Kiev) wastes a huge chance as he latches on to a perfect pass and produces a first time blast from point blank range. It goes towards the left side of the goal, but Iker Casillas reacts superbly to keep the ball out. The ball is out of play. Dyn. Kiev win a corner kick."
        },
        {
            "gameTime": "1 - 43:44",
            "label": "",
            "description": "Vincent Aboubakar (FC Porto) commits a rough foul. Felix Brych stops the game and makes a call."
        },
        {
            "gameTime": "1 - 42:21",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) fouls an opponent. At least that's what referee Felix Brych signals."
        },
        {
            "gameTime": "1 - 41:06",
            "label": "",
            "description": "Yacine Brahimi (FC Porto) breaks into the penalty area but his shot is blocked."
        },
        {
            "gameTime": "1 - 40:23",
            "label": "",
            "description": "FC Porto seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 39:59",
            "label": "funfact",
            "description": "The current number of corner kicks is 7:2."
        },
        {
            "gameTime": "1 - 39:26",
            "label": "y-card",
            "description": "Maximiliano Pereira (FC Porto) is awarded a yellow card for his behaviour."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "",
            "description": "Oleg Gusev (Dynamo Kiev) is adjudged offside."
        },
        {
            "gameTime": "1 - 38:32",
            "label": "corner",
            "description": "Oleg Gusev (Dynamo Kiev) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 37:55",
            "label": "",
            "description": "Vitorino Antunes (Dynamo Kiev) tries to send a pass but it's blocked. The referee points to the corner flag and Dyn. Kiev will take a corner."
        },
        {
            "gameTime": "1 - 35:20",
            "label": "",
            "description": "Oleg Gusev (Dynamo Kiev) races towards goal but the defender gets back well to make a challenge. The ball is off of the pitch and it's a goal kick for FC Porto."
        },
        {
            "gameTime": "1 - 34:30",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 33:08",
            "label": "",
            "description": "Denys Garmash (Dynamo Kiev) sends a long ball in, but Iker Casillas comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 32:23",
            "label": "",
            "description": "Vincent Aboubakar (FC Porto) gets on the ball and beats an opponent, but his run is stopped by the referee Felix Brych who sees an offensive foul."
        },
        {
            "gameTime": "1 - 31:53",
            "label": "",
            "description": "FC Porto are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 30:09",
            "label": "",
            "description": "Iker Casillas (FC Porto) will take a goal kick to hopefully start an attacking move for his team."
        },
        {
            "gameTime": "1 - 29:53",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) skips perfectly past challenges but misdirects his shot from the edge of the box. The ball flies a few yards wide of the left post."
        },
        {
            "gameTime": "1 - 27:30",
            "label": "",
            "description": "Miguel Veloso (Dynamo Kiev) jumps into a tackle and Felix Brych blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 27:09",
            "label": "",
            "description": "Dyn. Kiev keep possession of the ball by producing one two passes, but an opponent steps in and wins the ball."
        },
        {
            "gameTime": "1 - 25:35",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 22:42",
            "label": "soccer-ball",
            "description": "Goal! Miguel Layun clips a neat ball into the box in the direction of Vincent Aboubakar (FC Porto), who jumps highest and steers a bullet header from the centre of the box into the bottom right corner. Oleksandr Rybka had no chance of stopping that. 1:1."
        },
        {
            "gameTime": "1 - 21:37",
            "label": "",
            "description": "Sergiy Rybalka (Dynamo Kiev) makes a slide tackle, but referee Felix Brych blows for a foul."
        },
        {
            "gameTime": "1 - 19:50",
            "label": "soccer-ball",
            "description": "Goal! Oleg Gusev (Dynamo Kiev) finishes from close range with an easy finish and he makes it 1:0. He was ably assisted there by Denys Garmash."
        },
        {
            "gameTime": "1 - 18:55",
            "label": "",
            "description": "Denys Garmash (Dynamo Kiev) commits a foul and Felix Brych immediately signals a free kick."
        },
        {
            "gameTime": "1 - 17:41",
            "label": "",
            "description": "Miguel Veloso (Dynamo Kiev) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "1 - 16:52",
            "label": "y-card",
            "description": "Maicon (FC Porto) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "1 - 14:40",
            "label": "",
            "description": "Close! Yacine Brahimi (FC Porto) takes the resultant free kick from 22 metres out and his shot goes just over the crossbar."
        },
        {
            "gameTime": "1 - 13:51",
            "label": "",
            "description": "Aleksandar Dragovic (Dynamo Kiev) is penalised for holding. Felix Brych signals a set piece. FC Porto win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 13:33",
            "label": "",
            "description": "Great teamplay by FC Porto as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 11:06",
            "label": "",
            "description": "Flag goes up against Denys Garmash (Dynamo Kiev) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 10:23",
            "label": "",
            "description": "Felix Brych has a clear sight and sees a foul from Ruben Neves (FC Porto). That's a free kick to Dyn. Kiev."
        },
        {
            "gameTime": "1 - 09:52",
            "label": "",
            "description": "Hector Herrera (FC Porto) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 08:03",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "1 - 07:37",
            "label": "corner",
            "description": "There's an opportunity for Miguel Veloso (Dynamo Kiev) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 07:04",
            "label": "",
            "description": "Derlis Gonzalez (Dynamo Kiev) looks to break free, but an opposing player clears the ball away. Good work from Dyn. Kiev as they win a corner."
        },
        {
            "gameTime": "1 - 06:01",
            "label": "corner",
            "description": "The resulting corner from Miguel Layun (FC Porto) is cleared."
        },
        {
            "gameTime": "1 - 05:41",
            "label": "",
            "description": "Miguel Layun (FC Porto) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. FC Porto earn a corner."
        },
        {
            "gameTime": "1 - 04:43",
            "label": "",
            "description": "Felix Brych blows his whistle and signals a foul after Junior Moraes (Dynamo Kiev) brought his opponent down."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "corner",
            "description": "Oleg Gusev (Dynamo Kiev) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 02:49",
            "label": "corner",
            "description": "Oleg Gusev (Dynamo Kiev) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety. The referee and one of his assistants signal for a corner kick to Dyn. Kiev."
        },
        {
            "gameTime": "1 - 02:16",
            "label": "",
            "description": "Danilo Silva (Dynamo Kiev) sends a pass into the box, but his attempt is thwarted and cleared. The ball is out of play. Dyn. Kiev will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 01:28",
            "label": "",
            "description": "Dyn. Kiev control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dyn. Kiev will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Felix Brych will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. We saw a very balanced game over the 90 minutes. Both teams tried to constantly keep their opponents under pressure."
        }
    ],
    "gameAwayTeam": "FC Porto",
    "gameDate": "16/09/2015 - 21:45",
    "gameHomeTeam": "Dyn. Kiev",
    "gameScore": "2 - 2"
}