{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-04 - 22-45 Gent 1 - 0 Valencia/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. The hosts looked more lively and played better football. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 49:39",
            "label": "whistle",
            "description": "That's it for today, Daniele Orsato has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:16",
            "label": "corner",
            "description": "Pablo Piatti (Valencia) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "",
            "description": "Valencia are just stroking the ball across the park now, but the defence is doing very well breaking up their possession. Valencia have a corner."
        },
        {
            "gameTime": "2 - 47:41",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Brecht Dejaegere walks off the pitch to be replaced by Kalifa Coulibaly (Gent)."
        },
        {
            "gameTime": "2 - 46:32",
            "label": "",
            "description": "Daniel Parejo (Valencia) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:33",
            "label": "",
            "description": "Antonio Barragan (Valencia) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "2 - 42:19",
            "label": "",
            "description": "Aderlan Santos (Valencia) makes an unfair challenge by holding his opponent to prevent him from getting the ball."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "corner",
            "description": "The ball goes out of play. Gent are awarded a corner kick."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "y-card",
            "description": "Daniele Orsato shows a yellow card to Enzo Perez (Valencia), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Rafinha (Gent) comes onto the pitch so that Benito Raman can be given a rest."
        },
        {
            "gameTime": "2 - 38:42",
            "label": "",
            "description": "Pablo Piatti (Valencia) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "2 - 38:32",
            "label": "",
            "description": "Benito Raman (Gent) brings his opponent down with a tackle and Daniele Orsato blows his whistle for a foul. Valencia are awarded the free kick."
        },
        {
            "gameTime": "2 - 36:20",
            "label": "",
            "description": "The Valencia players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 34:59",
            "label": "corner",
            "description": "The ball is out of play. A goal scoring opportunity from a corner for Valencia."
        },
        {
            "gameTime": "2 - 34:48",
            "label": "",
            "description": "Matz Sels pulls off a superb save! He leapt to block the shot Alcacer Paco (Valencia) fired on target after a rebound. His effort from inside the box flew straight towards the left post, but was stopped by the goalkeeper."
        },
        {
            "gameTime": "2 - 33:42",
            "label": "corner",
            "description": "Pablo Piatti (Valencia) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 33:30",
            "label": "",
            "description": "Andre Gomes (Valencia) fails to find any of his teammates inside the box as his pass is blocked. Valencia force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "",
            "description": "Enzo Perez (Valencia) brings his opponent down. Daniele Orsato has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 31:21",
            "label": "",
            "description": "Daniel Parejo (Valencia) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "2 - 29:17",
            "label": "",
            "description": "Benito Raman (Gent) is adjudged offside."
        },
        {
            "gameTime": "2 - 27:19",
            "label": "y-card",
            "description": "The foul by Benito Raman (Gent) is worthy of a card and a yellow is duly shown by Daniele Orsato."
        },
        {
            "gameTime": "2 - 26:35",
            "label": "y-card",
            "description": "Today's referee Daniele Orsato rightly decides to book Andre Gomes (Valencia) for his harsh tackle."
        },
        {
            "gameTime": "2 - 25:03",
            "label": "corner",
            "description": "Joao Cancelo (Valencia) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 24:53",
            "label": "",
            "description": "The game is pretty dull as Valencia are just passing the ball from player to player. Nothing lasts forever, though, and they finally make a mistake, allowing the opposition to pick up the ball. The ball goes out of play and Valencia have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 24:10",
            "label": "substitution",
            "description": "Santo Espirito has decided to introduce fresh legs, with Joao Cancelo (Valencia) replacing Sofiane Feghouli."
        },
        {
            "gameTime": "2 - 23:31",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Pablo Piatti (Valencia), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 23:08",
            "label": "",
            "description": "Pablo Piatti (Valencia) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him. The ball is out of play and Valencia manage to earn a corner."
        },
        {
            "gameTime": "2 - 22:23",
            "label": "",
            "description": "Daniele Orsato blows his whistle after Andre Gomes (Valencia) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "2 - 19:38",
            "label": "",
            "description": "Sofiane Feghouli (Valencia) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 17:40",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Andre Gomes (Valencia) is coming onto the pitch as Javi Fuego cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 16:38",
            "label": "",
            "description": "Brecht Dejaegere (Gent) wriggles into space and fires the ball from the edge of the area, but one of the defenders is there to block the effort."
        },
        {
            "gameTime": "2 - 16:20",
            "label": "",
            "description": "Shkodran Mustafi (Valencia) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 15:55",
            "label": "y-card",
            "description": "Daniele Orsato shows the yellow card to Shkodran Mustafi (Valencia) for a heavy challenge."
        },
        {
            "gameTime": "2 - 15:08",
            "label": "injury",
            "description": "Shkodran Mustafi (Valencia) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 14:38",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Sofiane Feghouli (Valencia) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 13:22",
            "label": "",
            "description": "Nana Asare (Gent) swings a cross into the box, but it's far too close to Jaume Domenech, who smothers the ball."
        },
        {
            "gameTime": "2 - 11:31",
            "label": "",
            "description": "Daniel Parejo (Valencia) attempted to pick out a free teammate inside the box, but Matz Sels comes off the line to clear the ball away."
        },
        {
            "gameTime": "2 - 10:46",
            "label": "",
            "description": "Daniel Parejo (Valencia) failed to convert a mid range free kick and sends the ball narrowly over the bar."
        },
        {
            "gameTime": "2 - 09:53",
            "label": "",
            "description": "Daniele Orsato blows his whistle and signals a foul after Renato Neto (Gent) brought his opponent down. Valencia are awarded a free kick."
        },
        {
            "gameTime": "2 - 09:17",
            "label": "substitution",
            "description": "Kenny Saief is being substituted because of an injury. Hein Vanhaezebrouck sends Benito Raman (Gent) on the pitch."
        },
        {
            "gameTime": "2 - 08:47",
            "label": "",
            "description": "Enzo Perez (Valencia) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 07:39",
            "label": "injury",
            "description": "Kenny Saief (Gent) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 06:53",
            "label": "",
            "description": "Jose Gaya (Valencia) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 03:42",
            "label": "soccer-ball",
            "description": "Sven Kums (Gent) slams the penalty home into the roof of the net."
        },
        {
            "gameTime": "2 - 03:41",
            "label": "",
            "description": "Sven Kums (Gent) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 02:59",
            "label": "penalty",
            "description": "The referee blows his whistle, a clear handball by Antonio Barragan (Valencia). PENALTY to Gent! Let's see who will take responsibility."
        },
        {
            "gameTime": "2 - 02:20",
            "label": "",
            "description": "Sven Kums (Gent) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "2 - 01:45",
            "label": "",
            "description": "Pablo Piatti (Valencia) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 00:27",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Shkodran Mustafi (Valencia). Daniele Orsato saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "2 - 00:08",
            "label": "substitution",
            "description": "Santo Espirito makes a switch. Pablo Piatti (Valencia) is coming on in place of Santi Mina at the start of the second period."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Daniele Orsato starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The game produced by the players until now hasn't been particularly attractive, but there is still 45 minutes left so let's hope they will come out with renewed vigour and provide better entertainment this half. The home side is in control of this game. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 45:10",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 43:52",
            "label": "",
            "description": "Referee Daniele Orsato sees the trip by Danijel Milicevic (Gent) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 43:07",
            "label": "",
            "description": "Laurent Depoitre (Gent) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 42:32",
            "label": "",
            "description": "Kenny Saief (Gent) commits a rough foul. Daniele Orsato stops the game and makes a call."
        },
        {
            "gameTime": "1 - 40:20",
            "label": "",
            "description": "Santi Mina (Valencia) is flagged for offside."
        },
        {
            "gameTime": "1 - 38:32",
            "label": "corner",
            "description": "Daniel Parejo (Valencia) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 38:23",
            "label": "",
            "description": "Daniel Parejo (Valencia) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Valencia have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 35:31",
            "label": "",
            "description": "Sven Kums (Gent) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "1 - 34:31",
            "label": "",
            "description": "Danijel Milicevic (Gent) receives a lofted pass and is given time inside the box to unleash a shot goalwards. The ball is directed to the bottom left corner, but it lacks power and Jaume Domenech pulls off a comfortable save to thwart the effort."
        },
        {
            "gameTime": "1 - 32:15",
            "label": "",
            "description": "Sven Kums (Gent) pounces on the rebound on the edge of the box but his wild shot goes high over the crossbar."
        },
        {
            "gameTime": "1 - 31:44",
            "label": "corner",
            "description": "Danijel Milicevic (Gent) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 31:27",
            "label": "",
            "description": "Laurent Depoitre (Gent) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The referee points to the corner flag and Gent will take a corner."
        },
        {
            "gameTime": "1 - 30:13",
            "label": "",
            "description": "Thomas Foket (Gent) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 29:35",
            "label": "y-card",
            "description": "Daniele Orsato shows a yellow card to Sofiane Feghouli (Valencia) for a tough tackle."
        },
        {
            "gameTime": "1 - 27:20",
            "label": "",
            "description": "Kenny Saief (Gent) sends a teasing cross into the area, but Jaume Domenech intercepts the ball."
        },
        {
            "gameTime": "1 - 25:20",
            "label": "",
            "description": "Brecht Dejaegere (Gent) receives a lofted pass in the goal area and unleashes a dangerous header which sails a few inches over the bar!"
        },
        {
            "gameTime": "1 - 24:34",
            "label": "",
            "description": "The players claim that Enzo Perez (Valencia) handled the ball and it seems they are right."
        },
        {
            "gameTime": "1 - 23:49",
            "label": "",
            "description": "Sofiane Feghouli (Valencia) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 22:42",
            "label": "",
            "description": "Kenny Saief (Gent) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety."
        },
        {
            "gameTime": "1 - 21:15",
            "label": "",
            "description": "Laurent Depoitre (Gent) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 20:29",
            "label": "",
            "description": "Laurent Depoitre (Gent) attempts to score as he rises near the penalty spot and heads the ball to the roof of the net. Jaume Domenech displays brilliant reflexes and pulls off a comfortable save to stop the ball from hitting the net."
        },
        {
            "gameTime": "1 - 19:31",
            "label": "",
            "description": "Kenny Saief (Gent) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 19:00",
            "label": "corner",
            "description": "Danijel Milicevic (Gent) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 18:46",
            "label": "",
            "description": "Laurent Depoitre (Gent) slaloms his way past challenges, but an opposing player does well to get the ball away. The referee signals a corner kick to Gent."
        },
        {
            "gameTime": "1 - 17:51",
            "label": "",
            "description": "What a chance that is! Sven Kums (Gent) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 17:01",
            "label": "",
            "description": "Crossbar! Danijel Milicevic (Gent) had a good opportunity when he latched on to a cross from the wing, but his header from around the penalty spot wasn't accurate enough and the ball crashed against the bar!"
        },
        {
            "gameTime": "1 - 15:24",
            "label": "",
            "description": "Kenny Saief (Gent) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 13:41",
            "label": "",
            "description": "A cross by Antonio Barragan (Valencia) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "1 - 11:35",
            "label": "",
            "description": "Javi Fuego (Valencia) trips an opposition player and Daniele Orsato signals a foul."
        },
        {
            "gameTime": "1 - 09:51",
            "label": "",
            "description": "Sofiane Feghouli (Valencia) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 09:09",
            "label": "corner",
            "description": "Daniel Parejo (Valencia) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 08:52",
            "label": "",
            "description": "Daniel Parejo (Valencia) fails to send a pass into the box as his effort is cut out. Valencia win a corner."
        },
        {
            "gameTime": "1 - 08:22",
            "label": "",
            "description": "The game is interrupted. Thomas Foket (Gent) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "1 - 07:37",
            "label": "",
            "description": "Nana Asare (Gent) fouls an opponent. At least that's what referee Daniele Orsato signals."
        },
        {
            "gameTime": "1 - 06:18",
            "label": "corner",
            "description": "Danijel Milicevic (Gent) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 05:58",
            "label": "",
            "description": "Thomas Foket (Gent) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender. Corner kick. Gent will have an opportunity."
        },
        {
            "gameTime": "1 - 05:12",
            "label": "",
            "description": "Lasse Nielsen (Gent) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 03:57",
            "label": "",
            "description": "Kenny Saief (Gent) receives a well played pass inside the penalty area and shoots. He sends the ball into orbit."
        },
        {
            "gameTime": "1 - 03:38",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Thomas Foket (Gent)."
        },
        {
            "gameTime": "1 - 02:06",
            "label": "",
            "description": "Laurent Depoitre (Gent) is obviously very disappointed with his shot from the rebound. He aims exactly at the goalkeeper's gloves. This should have been an easy goal!"
        },
        {
            "gameTime": "1 - 01:58",
            "label": "",
            "description": "Sven Kums (Gent) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "1 - 00:32",
            "label": "",
            "description": "Antonio Barragan (Valencia) tackles a bit over zealously and Daniele Orsato blows for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Valencia will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Daniele Orsato will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. The hosts looked more lively and played better football. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Valencia",
    "gameDate": "04/11/2015 - 22:45",
    "gameHomeTeam": "Gent",
    "gameScore": "1 - 0"
}