{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-01-29 - 14-00 Betis 1 - 1 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The visitors controlled the game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        },
        {
            "gameTime": "2 - 48:08",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "soccer-ball",
            "description": "Goal 1:1! Luis Suarez (Barcelona) receives a precise pass inside the box from Lionel Messi and he beats the goalkeeper with a neat finish into the bottom right corner."
        },
        {
            "gameTime": "2 - 43:51",
            "label": "",
            "description": "Lionel Messi (Barcelona) crosses the ball into the box from a free kick, but his attempt is well judged by the keeper who saves comfortably."
        },
        {
            "gameTime": "2 - 42:36",
            "label": "",
            "description": "Antonio Adan blocks a long range effort from Neymar (Barcelona) towards the bottom left corner."
        },
        {
            "gameTime": "2 - 40:44",
            "label": "substitution",
            "description": "Substitution. Rafael Navarro (Betis) on for Petros."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "substitution",
            "description": "Victor Sanchez has decided to make a change. Nahuel Leiva (Betis) replaces Alex Alegria."
        },
        {
            "gameTime": "2 - 36:26",
            "label": "",
            "description": "Lovely run from Ruben Castro (Betis). He finds himself one on one with the goalkeeper, lines up a shot, but the keeper boldly launches himself to intercept the ball."
        },
        {
            "gameTime": "2 - 34:54",
            "label": "",
            "description": "Neymar (Barcelona) attempts to curl the ball over the wall from the free kick, but one of the defenders deflects it away from danger."
        },
        {
            "gameTime": "2 - 32:55",
            "label": "y-card",
            "description": "Ruben Castro (Betis) receives a yellow card."
        },
        {
            "gameTime": "2 - 32:50",
            "label": "y-card",
            "description": "Andre Gomes (Barcelona) is awarded a yellow card for his behaviour."
        },
        {
            "gameTime": "2 - 32:40",
            "label": "",
            "description": "What a chance! Luis Suarez (Barcelona) gets on the end of a pass inside the box and takes a shot to the bottom right corner, but one of the defending players makes a crucial goal line clearance."
        },
        {
            "gameTime": "2 - 32:37",
            "label": "",
            "description": "Marc Andre ter Stegen makes a good save! Ruben Castro (Betis) easily weaves through the defence and unleashes a shot from long range. His effort is directed towards the bottom left corner, but the goalkeeper is alert and stops it."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "soccer-ball",
            "description": "Goal! The resulting corner is whipped into the box and Alex Alegria (Betis) buries the ball into the back of the net from a Ryan Donk knock down. 1:0."
        },
        {
            "gameTime": "2 - 29:04",
            "label": "corner",
            "description": "Riza Durmisi (Betis) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 28:48",
            "label": "",
            "description": "Ruben Castro (Betis) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the left post."
        },
        {
            "gameTime": "2 - 27:43",
            "label": "",
            "description": "Riza Durmisi (Betis) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "2 - 27:07",
            "label": "",
            "description": "Crossbar! Daniel Ceballos (Betis) picks up a precise pass and produces a bullet of a strike from distance that smashes against the crossbar. It could have been a brilliant goal."
        },
        {
            "gameTime": "2 - 25:12",
            "label": "attendance",
            "description": "The attendance is 43790."
        },
        {
            "gameTime": "2 - 24:42",
            "label": "y-card",
            "description": "Today's referee Alejandro Hernandez rightly decides to book Ivan Rakitic (Barcelona) for his harsh tackle."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "substitution",
            "description": "Substitution. Ruben Pardo makes his way off the pitch and Ryan Donk (Betis) comes on as his replacement."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "substitution",
            "description": "Luis Enrique has decided to introduce fresh legs, with Sergi Roberto (Barcelona) replacing Arda Turan."
        },
        {
            "gameTime": "2 - 22:50",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Jordi Alba (Barcelona) comes onto the pitch for Lucas Digne."
        },
        {
            "gameTime": "2 - 21:55",
            "label": "y-card",
            "description": "Alejandro Hernandez shows a yellow card to Petros (Betis), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 17:40",
            "label": "",
            "description": "Riza Durmisi (Betis) sends the free kick into the box, but Marc Andre ter Stegen leaps to intercept it."
        },
        {
            "gameTime": "2 - 16:27",
            "label": "",
            "description": "Marc Andre ter Stegen (Barcelona) is able to continue to play."
        },
        {
            "gameTime": "2 - 15:30",
            "label": "injury",
            "description": "The game is interrupted now, Marc Andre ter Stegen (Barcelona) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 13:59",
            "label": "substitution",
            "description": "We are about to witness a substitution. Andre Gomes (Barcelona) is replacing Denis Suarez."
        },
        {
            "gameTime": "2 - 13:58",
            "label": "",
            "description": "Ruben Pardo (Betis) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 13:54",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Ruben Pardo (Betis) takes it short."
        },
        {
            "gameTime": "2 - 10:40",
            "label": "",
            "description": "Marc Andre ter Stegen blocks a long range effort from Ruben Castro (Betis) towards the left side of the goal."
        },
        {
            "gameTime": "2 - 09:39",
            "label": "",
            "description": "Ruben Pardo (Betis) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "corner",
            "description": "Ruben Pardo (Betis) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 08:55",
            "label": "",
            "description": "A cross into the box from Riza Durmisi (Betis) is cleared. The referee and one of his assistants signal for a corner kick to Betis."
        },
        {
            "gameTime": "2 - 06:25",
            "label": "",
            "description": "Marc Andre ter Stegen was in the right place at the right time to intercept a cross from a free kick by Riza Durmisi (Betis)."
        },
        {
            "gameTime": "2 - 05:14",
            "label": "",
            "description": "Aleix Vidal (Barcelona) tackles a bit over zealously and Alejandro Hernandez blows for a foul. Betis are awarded the free kick."
        },
        {
            "gameTime": "2 - 02:53",
            "label": "corner",
            "description": "Neymar (Barcelona) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The game produced by the players until now hasn't been particularly attractive, but there is still 45 minutes left so let's hope they will come out with renewed vigour and provide better entertainment this half. The away team controlled the game for most of the first half. The home team's main weapon is fast counter attacks, while the away side attempts to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:07",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:43",
            "label": "",
            "description": "Ruben Castro (Betis) unleashes a shot from a mid range free kick that goes high over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "1 - 42:55",
            "label": "y-card",
            "description": "Alejandro Hernandez shows the yellow card to Gerard Pique (Barcelona) for a heavy challenge. A free kick has been awarded to Betis."
        },
        {
            "gameTime": "1 - 41:00",
            "label": "",
            "description": "Ruben Castro (Betis) is adjudged offside."
        },
        {
            "gameTime": "1 - 40:12",
            "label": "",
            "description": "The game is interrupted as Neymar (Barcelona) is flagged offside."
        },
        {
            "gameTime": "1 - 38:28",
            "label": "",
            "description": "Antonio Adan pulls off a great save to deny Neymar (Barcelona), who makes himself some space inside the box and unleashes a quick shot to the right side of the goal."
        },
        {
            "gameTime": "1 - 34:06",
            "label": "corner",
            "description": "Riza Durmisi (Betis) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 33:30",
            "label": "",
            "description": "Cristiano Piccini (Betis) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 29:48",
            "label": "corner",
            "description": "Riza Durmisi (Betis) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 29:25",
            "label": "",
            "description": "This shall not pass! Ruben Castro (Betis) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. Now Betis have a corner."
        },
        {
            "gameTime": "1 - 28:12",
            "label": "",
            "description": "Riza Durmisi (Betis) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 26:47",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Ruben Castro (Betis), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "1 - 25:49",
            "label": "",
            "description": "Neymar (Barcelona) lines up the resulting free kick from the edge of the box, but he produces a poor shot that goes high over the bar. The ball could have snow on it when it returns!"
        },
        {
            "gameTime": "1 - 24:15",
            "label": "",
            "description": "Ruben Castro (Betis) wriggles into space inside the box with excellent ball control, but his effort on goal is well blocked."
        },
        {
            "gameTime": "1 - 22:26",
            "label": "",
            "description": "Riza Durmisi (Betis) latches on to an accurate pass inside the box and immediately unleashes a shot towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 19:21",
            "label": "corner",
            "description": "Petros (Betis) takes the corner kick, but Marc Andre ter Stegen reads it well and stops the effort."
        },
        {
            "gameTime": "1 - 18:50",
            "label": "",
            "description": "What a wonderful moment! Daniel Ceballos (Betis) receives a perfect pass in the middle of the pitch, lines up the ball and unloads a powerful strike towards the left post. His effort fails to surprise Marc Andre ter Stegen, who makes a nice save. The referee signals a corner kick to Betis."
        },
        {
            "gameTime": "1 - 18:01",
            "label": "corner",
            "description": "Petros (Betis) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 16:21",
            "label": "",
            "description": "Cristiano Piccini (Betis) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. The ball is out of play and the linesman points at the corner flag. Corner to Betis."
        },
        {
            "gameTime": "1 - 14:50",
            "label": "",
            "description": "Luis Suarez (Barcelona) produces a long range cannon of a shot after a nice pass. The ball heads towards the middle of the goal, but is easily stopped by a save from Antonio Adan and the score remains the same."
        },
        {
            "gameTime": "1 - 12:51",
            "label": "",
            "description": "A cross, provided by Lucas Digne (Barcelona), caused no threat to the opposition's defence as the ball was cleared out of danger."
        },
        {
            "gameTime": "1 - 11:33",
            "label": "",
            "description": "Ruben Castro (Betis) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Marc Andre ter Stegen."
        },
        {
            "gameTime": "1 - 10:27",
            "label": "corner",
            "description": "Alin Tosca (Betis) takes a short corner kick."
        },
        {
            "gameTime": "1 - 10:04",
            "label": "",
            "description": "Ruben Castro (Betis) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Betis win a corner."
        },
        {
            "gameTime": "1 - 06:01",
            "label": "corner",
            "description": "The resulting corner, taken by Neymar (Barcelona), comes to nothing."
        },
        {
            "gameTime": "1 - 05:49",
            "label": "",
            "description": "What a goal scoring opportunity! Luis Suarez (Barcelona) makes a good run into the box to meet a cross and fires the ball in on goal, but the shot is amazingly blocked by a defender. Barcelona have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 02:16",
            "label": "",
            "description": "Petros (Betis) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 01:25",
            "label": "",
            "description": "Ruben Castro (Betis) produces a long range cannon of a shot after a nice pass. The ball heads towards the left post, but is stopped by a great save from Marc Andre ter Stegen and the score remains the same."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Barcelona will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alejandro Hernandez will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona will be looking to keep their unbeaten run of 13 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lionel Messi is the biggest threat to an opponent! He has already scored 16 goals and is top scorer in this Barcelona team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "0:1 is the most common score for Betis in this competition. 5 of their all matches finished with that score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The visitors controlled the game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "29/01/2017 - 14:00",
    "gameHomeTeam": "Betis",
    "gameScore": "1 - 1"
}