{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-03-12 - 17-00 Napoli 3 - 0 Crotone/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:14",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "corner",
            "description": "Jose Callejon (Napoli) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "corner",
            "description": "Jose Callejon (Napoli) works the corner short."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "y-card",
            "description": "Gianmarco Ferrari (Crotone) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "2 - 41:29",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Noe Dussenne as he is replaced by Giuseppe Cuomo (Crotone)."
        },
        {
            "gameTime": "2 - 40:38",
            "label": "corner",
            "description": "Dries Mertens (Napoli) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "corner",
            "description": "Jose Callejon (Napoli) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 33:32",
            "label": "substitution",
            "description": "Davide Nicola has decided to make a change. Boadu Maxwell Acosty (Crotone) replaces Marcello Trotta."
        },
        {
            "gameTime": "2 - 33:20",
            "label": "",
            "description": "Dries Mertens (Napoli) unleashes a promising shot low towards the middle of the goal after his wonderful solo run, but Alex Cordaz thwarts the effort with a fabulous save. The score remains the same."
        },
        {
            "gameTime": "2 - 30:45",
            "label": "",
            "description": "The Crotone players keep hold of the ball by exchanging some long passes. One inaccurate pass, however, surrenders possession."
        },
        {
            "gameTime": "2 - 27:00",
            "label": "substitution",
            "description": "Here is a change. Lorenzo Insigne is going off and Maurizio Sarri gives the last tactical orders to Emanuele Giaccherini (Napoli)."
        },
        {
            "gameTime": "2 - 25:16",
            "label": "substitution",
            "description": "Substitution. Andrea Barberis (Crotone) replaces Lorenzo Crisetig."
        },
        {
            "gameTime": "2 - 24:46",
            "label": "soccer-ball",
            "description": "Goal 3:0! Jorginho tees up Lorenzo Insigne (Napoli) inside the box and he rolls the ball into the bottom left corner and past Alex Cordaz."
        },
        {
            "gameTime": "2 - 20:37",
            "label": "soccer-ball",
            "description": "Dries Mertens (Napoli) smoothly converts the penalty with a beautiful low drive into the left side of the net."
        },
        {
            "gameTime": "2 - 20:30",
            "label": "",
            "description": "Dries Mertens (Napoli) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 20:00",
            "label": "penalty",
            "description": "Maurizio Mariani blows his whistle and signals a foul after Mario Sampirisi (Crotone) brought his opponent down. The referee points to the penalty spot. It's a penalty for Napoli!"
        },
        {
            "gameTime": "2 - 16:44",
            "label": "substitution",
            "description": "Substitution. Dries Mertens (Napoli) in, Leonardo Pavoletti out."
        },
        {
            "gameTime": "2 - 15:01",
            "label": "corner",
            "description": "Jose Callejon (Napoli) swings in a cross from the corner, but Alex Cordaz reads it well and gathers the ball."
        },
        {
            "gameTime": "2 - 13:35",
            "label": "corner",
            "description": "Crotone didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 11:51",
            "label": "corner",
            "description": "The corner from Ivan Strinic (Napoli) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 09:28",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Piotr Zielinski (Napoli) for Marko Rog."
        },
        {
            "gameTime": "2 - 08:48",
            "label": "y-card",
            "description": "Lorenzo Crisetig (Crotone) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "",
            "description": "Adrian Stoian (Crotone) whips a long ball in from the free kick which is intercepted by Pepe Reina."
        },
        {
            "gameTime": "2 - 05:20",
            "label": "",
            "description": "Leonardo Pavoletti (Napoli) connects with a cross and powers a header goalwards, but his effort goes just over the bar. The ball is off of the pitch and it's a goal kick for Crotone."
        },
        {
            "gameTime": "2 - 05:10",
            "label": "corner",
            "description": "The corner from Ivan Strinic (Napoli) is intercepted by Alex Cordaz."
        },
        {
            "gameTime": "2 - 03:10",
            "label": "corner",
            "description": "Diego Falcinelli (Crotone) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 02:50",
            "label": "",
            "description": "Diego Falcinelli (Crotone) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders. The referee blows his whistle, Crotone are awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:53",
            "label": "funfact",
            "description": "The ratio of the ball possession is 82:18."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:44",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Maurizio Mariani has ended it."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "",
            "description": "Maurizio Mariani interrupts the game for a tactical foul by Noe Dussenne (Crotone)."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "y-card",
            "description": "What was Bruno Martella (Crotone) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "1 - 40:45",
            "label": "",
            "description": "Leonardo Pavoletti (Napoli) picks up a lofted cross inside the box and fires a quick shot to the middle of the goal. His promising effort is kept out by Alex Cordaz, who pulls off a stunning save!"
        },
        {
            "gameTime": "1 - 39:49",
            "label": "",
            "description": "The linesman raises his flag for offside before Jose Callejon (Napoli) heads on."
        },
        {
            "gameTime": "1 - 36:19",
            "label": "",
            "description": "The Napoli players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 31:30",
            "label": "soccer-ball",
            "description": "Lorenzo Insigne (Napoli) gives no chance to the keeper and converts the penalty with a sharp low drive into the left side of the net."
        },
        {
            "gameTime": "1 - 31:00",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 30:50",
            "label": "penalty",
            "description": "Mario Sampirisi (Crotone) should know this behaviour is beyond the rules. He was too careless with his challenge and left Maurizio Mariani no option but to blow his whistle. The referee points to the penalty spot. Napoli are awarded a penalty kick!"
        },
        {
            "gameTime": "1 - 26:56",
            "label": "y-card",
            "description": "Marko Rog (Napoli) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "1 - 24:26",
            "label": "",
            "description": "Lorenzo Crisetig (Crotone) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Maurizio Mariani blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 22:23",
            "label": "",
            "description": "Marek Hamsik (Napoli) looks to break free, but an opposing player clears the ball away. The ball goes out of play and Crotone will have a goal kick."
        },
        {
            "gameTime": "1 - 19:18",
            "label": "",
            "description": "What a big chance! Marcello Trotta (Crotone) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post. The ball is off of the pitch and it's a goal kick for Napoli."
        },
        {
            "gameTime": "1 - 17:25",
            "label": "",
            "description": "Ivan Strinic (Napoli) gets a shot from inside the penalty area and it flies just wide of the left post. The ball goes out of play and Crotone will have a goal kick."
        },
        {
            "gameTime": "1 - 13:01",
            "label": "",
            "description": "The Napoli players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 10:50",
            "label": "corner",
            "description": "Ivan Strinic (Napoli) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 10:40",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) receives a precise pass and is given time inside the box to send a promising strike towards the top right corner. Alex Cordaz guesses his intention and denies him with a fine save. The ball is out of play. Napoli win a corner kick."
        },
        {
            "gameTime": "1 - 09:07",
            "label": "",
            "description": "Lorenzo Crisetig (Crotone) makes a rough challenge and Maurizio Mariani blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 06:10",
            "label": "corner",
            "description": "Jose Callejon (Napoli) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "1 - 05:57",
            "label": "",
            "description": "Jose Callejon (Napoli) receives a precise low pass inside the box, controls the ball and releases it towards the top right corner. Unfortunately for him, Alex Cordaz makes a great save to stop his effort. Corner kick. Napoli will have an opportunity."
        },
        {
            "gameTime": "1 - 04:13",
            "label": "",
            "description": "Adrian Stoian (Crotone) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Napoli will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Maurizio Mariani was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Crotone will try to end their 6 game winless streak."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dries Mertens from Napoli will look to add to his goal tally, he has netted 18 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        }
    ],
    "gameAwayTeam": "Crotone",
    "gameDate": "12/03/2017 - 17:00",
    "gameHomeTeam": "Napoli",
    "gameScore": "3 - 0"
}