{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2017-01-02 - 15-30 Middlesbrough 0 - 0 Leicester/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 51:59",
            "label": "",
            "description": "The game can't be described as thrilling. We can only hope that the next matches won't follow the same pattern and that they will bring more exciting moments and goal opportunities. Neither of the teams had any obvious superiority in this game. The home side played long passes and crosses into the box. The tactic of the away side, on the other hand, was slow build up play."
        },
        {
            "gameTime": "2 - 51:42",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 51:40",
            "label": "",
            "description": "Demarai Gray (Leicester) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 50:18",
            "label": "",
            "description": "Gaston Ramirez (Middlesbrough) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul. Another situation results in a direct free kick for Leicester."
        },
        {
            "gameTime": "2 - 50:06",
            "label": "",
            "description": "A pass by Leonardo Ulloa (Leicester) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "",
            "description": "Fabio (Middlesbrough) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 46:28",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Adam Clayton (Middlesbrough) was quite harsh and Robert Madley didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 46:04",
            "label": "",
            "description": "Leonardo Ulloa (Leicester) climbs high to connect with a cross near the penalty spot but plants a header high over the bar."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:01",
            "label": "substitution",
            "description": "Aitor Karanka de la Hoz prepares a substitution. Adam Forshaw is replaced by Grant Leadbitter (Middlesbrough)."
        },
        {
            "gameTime": "2 - 39:52",
            "label": "",
            "description": "Adam Clayton (Middlesbrough) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "2 - 37:35",
            "label": "substitution",
            "description": "Substitution. Marc Albrighton (Leicester) has come on for Nampalys Mendy."
        },
        {
            "gameTime": "2 - 37:26",
            "label": "",
            "description": "Gaston Ramirez (Middlesbrough) spurned a good chance! He gets a shot away from inside the penalty box, but it goes inches wide of the right post."
        },
        {
            "gameTime": "2 - 36:20",
            "label": "",
            "description": "Demarai Gray (Leicester) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 35:49",
            "label": "attendance",
            "description": "The attendance for today's match is 32437."
        },
        {
            "gameTime": "2 - 34:09",
            "label": "substitution",
            "description": "Here comes a substitution. Stewart Downing (Middlesbrough) is brought on as a substitute for Adama Traore."
        },
        {
            "gameTime": "2 - 32:11",
            "label": "",
            "description": "Fabio (Middlesbrough) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 29:56",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Gaston Ramirez (Middlesbrough), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 29:47",
            "label": "",
            "description": "George Friend (Middlesbrough) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. The ball is out of play. Middlesbrough will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 28:44",
            "label": "substitution",
            "description": "Claudio Ranieri has decided to introduce fresh legs, with Demarai Gray (Leicester) replacing Shinji Okazaki."
        },
        {
            "gameTime": "2 - 28:26",
            "label": "",
            "description": "Adama Traore (Middlesbrough) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 25:52",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Ahmed Musa (Leicester) will replace Riyad Mahrez."
        },
        {
            "gameTime": "2 - 24:03",
            "label": "",
            "description": "Leonardo Ulloa (Leicester) wins himself just enough space inside the box to connect with the corner. His header flies towards the middle of the goal, but the goalkeeper blocks the effort."
        },
        {
            "gameTime": "2 - 23:42",
            "label": "corner",
            "description": "Christian Fuchs (Leicester) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 23:32",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Christian Fuchs (Leicester). Corner kick. Leicester will have an opportunity."
        },
        {
            "gameTime": "2 - 22:37",
            "label": "",
            "description": "George Friend (Middlesbrough) makes a good run with the ball into the box, but mishits his shot as it goes high over the bar."
        },
        {
            "gameTime": "2 - 19:26",
            "label": "",
            "description": "Fabio (Middlesbrough) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 18:20",
            "label": "",
            "description": "Adam Clayton (Middlesbrough) makes an overly aggressive challenge and Robert Madley blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 16:08",
            "label": "",
            "description": "Fabio (Middlesbrough) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards wide of the left post."
        },
        {
            "gameTime": "2 - 15:10",
            "label": "",
            "description": "George Friend (Middlesbrough) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 13:18",
            "label": "",
            "description": "Gaston Ramirez (Middlesbrough) feels very aggrieved after the referee stops play for a foul that he commits while in possession of the ball."
        },
        {
            "gameTime": "2 - 12:35",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Danny Simpson (Leicester). Robert Madley saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "2 - 11:17",
            "label": "",
            "description": "Fabio (Middlesbrough) tries to find Marten de Roon, but he puts too much power on the through ball."
        },
        {
            "gameTime": "2 - 09:47",
            "label": "",
            "description": "Andy King (Leicester) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the right post."
        },
        {
            "gameTime": "2 - 09:13",
            "label": "",
            "description": "Andy King (Leicester) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "2 - 07:53",
            "label": "",
            "description": "Gaston Ramirez (Middlesbrough) swings it in and Alvaro Negredo gets on the end of it, but Kasper Schmeichel shows good awareness and comes off his line to thwart the move."
        },
        {
            "gameTime": "2 - 05:10",
            "label": "",
            "description": "Fabio (Middlesbrough) serves up a nice cross, but Kasper Schmeichel punches the ball away."
        },
        {
            "gameTime": "2 - 03:33",
            "label": "corner",
            "description": "The corner from Gaston Ramirez (Middlesbrough) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 03:24",
            "label": "",
            "description": "Adama Traore (Middlesbrough) serves up a nice cross, but the defence clears the danger. The ball goes behind for a corner. Middlesbrough will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 02:38",
            "label": "",
            "description": "George Friend (Middlesbrough) decided to shoot after receiving a sweet pass. The ball went low to the middle of the goal, but Kasper Schmeichel made a easy save."
        },
        {
            "gameTime": "2 - 02:28",
            "label": "",
            "description": "An attempted cross from Adama Traore (Middlesbrough) is cleared."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Robert Madley blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The players are likely to put the fans to sleep with this performance rather than receiving any vociferous support. Let's hope we are about to see an improvement in the second half. We are witnessing quite a balanced game with both teams struggling to prevail. The home side are playing long passes and crosses into the box. The away side's tactic, on the other hand, is slow build up play."
        },
        {
            "gameTime": "1 - 47:09",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Robert Madley has ended it."
        },
        {
            "gameTime": "1 - 46:39",
            "label": "",
            "description": "Fabio (Middlesbrough) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 45:56",
            "label": "",
            "description": "Shinji Okazaki (Leicester) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 42:28",
            "label": "y-card",
            "description": "Robert Madley shows a yellow card to Benjamin Gibson (Middlesbrough) for a tough tackle."
        },
        {
            "gameTime": "1 - 40:38",
            "label": "",
            "description": "Riyad Mahrez (Leicester) shoots from the edge of the penalty area. The ball travels towards the right side of the target, but Brad Guzan easily deals with the threat."
        },
        {
            "gameTime": "1 - 39:25",
            "label": "",
            "description": "Gaston Ramirez (Middlesbrough) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 38:33",
            "label": "",
            "description": "Riyad Mahrez (Leicester) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 37:56",
            "label": "",
            "description": "What a chance that is! Marten de Roon (Middlesbrough) finds himself in a promising position after receiving a pass on the edge of the box. His attempt goes just over the bar."
        },
        {
            "gameTime": "1 - 37:43",
            "label": "",
            "description": "Fabio (Middlesbrough) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 34:47",
            "label": "",
            "description": "Adama Traore (Middlesbrough) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 33:57",
            "label": "substitution",
            "description": "Aitor Karanka de la Hoz is forced to make an unplanned substitution as Antonio Barragan suffers an injury and George Friend (Middlesbrough) comes on."
        },
        {
            "gameTime": "1 - 32:55",
            "label": "injury",
            "description": "Looks like Antonio Barragan (Middlesbrough) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 28:15",
            "label": "",
            "description": "What an opportunity! Alvaro Negredo (Middlesbrough) wins the ball from the resulting set piece and unleashes a precise shot from inside the goal area which sails narrowly wide of the left post!"
        },
        {
            "gameTime": "1 - 25:40",
            "label": "y-card",
            "description": "The referee shows a yellow card to Gaston Ramirez (Middlesbrough). No wonder. A clear yellow for bad language."
        },
        {
            "gameTime": "1 - 24:45",
            "label": "",
            "description": "Adama Traore (Middlesbrough) whips the ball into the box and Alvaro Negredo takes a perfect touch to control it, but one of the defenders does well to intercept."
        },
        {
            "gameTime": "1 - 22:55",
            "label": "",
            "description": "Andy King (Leicester) releases a promising shot from the free kick on the edge of the box. His effort towards the middle of the goal is comfortably saved by Brad Guzan."
        },
        {
            "gameTime": "1 - 21:55",
            "label": "",
            "description": "Adam Clayton (Middlesbrough) trips an opposition player and Robert Madley signals a foul. Leicester are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 20:59",
            "label": "",
            "description": "Riyad Mahrez (Leicester) sends a cross into the box, but Brad Guzan comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 19:56",
            "label": "",
            "description": "CHANCE! Marten de Roon (Middlesbrough) picks up a pass inside the box and has a sight of goal, but he blazes his shot well over the top."
        },
        {
            "gameTime": "1 - 17:33",
            "label": "",
            "description": "Adama Traore (Middlesbrough) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 16:58",
            "label": "",
            "description": "Fabio (Middlesbrough) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 15:14",
            "label": "",
            "description": "Gaston Ramirez (Middlesbrough) attempts to find Adama Traore, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 14:44",
            "label": "",
            "description": "Adam Clayton (Middlesbrough) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "1 - 13:30",
            "label": "",
            "description": "Daniel Amartey (Leicester) is penalised for a foul. Robert Madley had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 12:40",
            "label": "corner",
            "description": "Riyad Mahrez (Leicester) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 12:20",
            "label": "",
            "description": "Danny Simpson (Leicester) whips a promising cross into the box, but the opposition's defence intercepts the ball. Leicester have a corner."
        },
        {
            "gameTime": "1 - 10:59",
            "label": "",
            "description": "Riyad Mahrez (Leicester) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort."
        },
        {
            "gameTime": "1 - 10:24",
            "label": "",
            "description": "Gaston Ramirez (Middlesbrough) fouls an opponent. At least that's what referee Robert Madley signals. Leicester have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 07:53",
            "label": "",
            "description": "Christian Fuchs (Leicester) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the right post."
        },
        {
            "gameTime": "1 - 07:20",
            "label": "",
            "description": "Shinji Okazaki (Leicester) clutches his head in despair after he blew a huge opportunity! He received the ball from the free kick, took a good first touch and unleashed a projectile from close range to the left side of the goal, but Brad Guzan makes a nice save."
        },
        {
            "gameTime": "1 - 06:35",
            "label": "",
            "description": "Riyad Mahrez (Leicester) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 04:27",
            "label": "",
            "description": "Antonio Barragan (Middlesbrough) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Middlesbrough will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Robert Madley."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Leicester have lost 7x away this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "3:0 was the biggest win for Leicester this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The latest Middlesbrough matches: Southampton (1:2), Chelsea (0:3), Manchester City (2:2), Sunderland (1:0)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The game can't be described as thrilling. We can only hope that the next matches won't follow the same pattern and that they will bring more exciting moments and goal opportunities. Neither of the teams had any obvious superiority in this game. The home side played long passes and crosses into the box. The tactic of the away side, on the other hand, was slow build up play."
        }
    ],
    "gameAwayTeam": "Leicester",
    "gameDate": "02/01/2017 - 15:30",
    "gameHomeTeam": "Middlesbrough",
    "gameScore": "0 - 0"
}