{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-05-14 - 18-00 Dep. La Coruna 0 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "The fans can't complain about what they saw on the pitch as both sides displayed a highly captivating football match. The Real Madrid fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The hosts defended well and were deadly on the counter attack. The away side displayed some nice build up play using a lot of passes."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 46:42",
            "label": "",
            "description": "Federico Cartabia (Dep. La Coruna) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "2 - 45:24",
            "label": "attendance",
            "description": "The attendance is 29017."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:00",
            "label": "y-card",
            "description": "Luka Modric (Real Madrid) goes into the book and receives a yellow card."
        },
        {
            "gameTime": "2 - 43:29",
            "label": "",
            "description": "The ball is cleared after Lucas Perez (Dep. La Coruna) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 42:30",
            "label": "",
            "description": "Oriol Riera (Dep. La Coruna) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 41:49",
            "label": "",
            "description": "James Rodriguez (Real Madrid) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post."
        },
        {
            "gameTime": "2 - 40:51",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Antonio Mateu Lahoz didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 40:24",
            "label": "",
            "description": "Stipe Pletikosa pulls off a great save to deny Marcelo (Real Madrid), who makes himself some space inside the box and unleashes a quick low drive to the bottom right corner."
        },
        {
            "gameTime": "2 - 39:13",
            "label": "corner",
            "description": "Luis Alberto (Dep. La Coruna) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 38:43",
            "label": "",
            "description": "Federico Cartabia (Dep. La Coruna) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. Dep. La Coruna have a corner."
        },
        {
            "gameTime": "2 - 38:00",
            "label": "",
            "description": "Federico Cartabia (Dep. La Coruna) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "2 - 37:17",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) is caught offside after the linesman raises his flag."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) works the corner short."
        },
        {
            "gameTime": "2 - 36:18",
            "label": "",
            "description": "Half chance! Marcelo (Real Madrid) plays a pass into the box, but Stipe Pletikosa reacts well to snuff out the attack. The referee points to the corner flag. It's a corner to Real Madrid."
        },
        {
            "gameTime": "2 - 35:52",
            "label": "",
            "description": "Real Madrid are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "2 - 33:39",
            "label": "",
            "description": "Great ball in from Daniel Carvajal. Isco (Real Madrid) should really have done better with a close range header, but he heads it a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 32:24",
            "label": "",
            "description": "Flag goes up against James Rodriguez (Real Madrid) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 32:03",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but James Rodriguez (Real Madrid) takes it short."
        },
        {
            "gameTime": "2 - 31:45",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Jese (Real Madrid). Real Madrid force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 30:49",
            "label": "substitution",
            "description": "Victor Sanchez has decided to make a change. Oriol Riera (Dep. La Coruna) replaces Faycal Fajr."
        },
        {
            "gameTime": "2 - 30:38",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Pedro Mosquera Parada leaves the pitch and Celso Borges (Dep. La Coruna) comes on."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "substitution",
            "description": "That's the end of the game for Gareth Bale, who is replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 30:03",
            "label": "",
            "description": "Antonio Mateu Lahoz blows his whistle and signals a foul after Fernando Navarro (Dep. La Coruna) brought his opponent down."
        },
        {
            "gameTime": "2 - 29:14",
            "label": "",
            "description": "Pedro Mosquera Parada (Dep. La Coruna) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "2 - 28:38",
            "label": "",
            "description": "Luis Alberto (Dep. La Coruna) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 27:23",
            "label": "",
            "description": "What a great chance for Rober Vilalba (Dep. La Coruna). He times his jump superbly when he leaps high to meet a precise cross from the corner, directing his towering header inside the right post, but the goalkeeper denies him with a miraculous save."
        },
        {
            "gameTime": "2 - 26:47",
            "label": "corner",
            "description": "Lucas Perez (Dep. La Coruna) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 26:18",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Dep. La Coruna have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 25:52",
            "label": "substitution",
            "description": "Substitution. Alejandro Arribas walks off the pitch and Rober Vilalba (Dep. La Coruna) comes on as a substitute."
        },
        {
            "gameTime": "2 - 24:45",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) clearly handles the ball, but he is surprised when the referee blows his whistle."
        },
        {
            "gameTime": "2 - 23:23",
            "label": "",
            "description": "A cross is clipped into the penalty area by Gareth Bale (Real Madrid) but poses no threat."
        },
        {
            "gameTime": "2 - 21:33",
            "label": "",
            "description": "What a poor attempt! Daniel Carvajal (Real Madrid) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "2 - 21:21",
            "label": "",
            "description": "Marcelo (Real Madrid) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 20:40",
            "label": "corner",
            "description": "Lucas Perez (Dep. La Coruna) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 20:28",
            "label": "",
            "description": "Sidnei (Dep. La Coruna) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders. The referee and one of his assistants signal for a corner kick to Dep. La Coruna."
        },
        {
            "gameTime": "2 - 19:29",
            "label": "",
            "description": "Faycal Fajr (Dep. La Coruna) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) fouls an opponent. At least that's what referee Antonio Mateu Lahoz signals."
        },
        {
            "gameTime": "2 - 17:33",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 16:15",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) controls the ball after receiving a lofted pass, but he blazes it into the stands. Such a quick situation requires a cool head."
        },
        {
            "gameTime": "2 - 15:26",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Toni Kroos trots off the pitch and is replaced by Isco (Real Madrid)."
        },
        {
            "gameTime": "2 - 13:40",
            "label": "",
            "description": "A precise low pass is received by Manuel Pablo (Dep. La Coruna), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well over the bar."
        },
        {
            "gameTime": "2 - 12:49",
            "label": "",
            "description": "Karim Benzema (Real Madrid) attempted to pick out a free teammate inside the box, but Stipe Pletikosa comes off the line to clear the ball away."
        },
        {
            "gameTime": "2 - 11:48",
            "label": "y-card",
            "description": "The foul by Pedro Mosquera Parada (Dep. La Coruna) is worthy of a card and a yellow is duly shown by Antonio Mateu Lahoz."
        },
        {
            "gameTime": "2 - 10:41",
            "label": "",
            "description": "Gareth Bale (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 09:12",
            "label": "",
            "description": "Federico Cartabia (Dep. La Coruna) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "2 - 08:23",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) latches on to an accurate pass on the edge of the box and unleashes a strong shot towards the right side of the goal, but his effort is denied by the well positioned keeper with a stunning save."
        },
        {
            "gameTime": "2 - 07:44",
            "label": "",
            "description": "Luis Alberto (Dep. La Coruna) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "2 - 06:47",
            "label": "",
            "description": "The ball is cleared after Federico Cartabia (Dep. La Coruna) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "y-card",
            "description": "Antonio Mateu Lahoz shows the yellow card to Toni Kroos (Real Madrid) for a heavy challenge."
        },
        {
            "gameTime": "2 - 04:36",
            "label": "",
            "description": "That was a nice football moment. James Rodriguez (Real Madrid) receives an amazing defence splitting low pass on the edge of the box and blasts the ball towards the roof of the net. Stipe Pletikosa guesses his intention and dives superbly to deny him with a remarkable save!"
        },
        {
            "gameTime": "2 - 03:47",
            "label": "",
            "description": "Federico Cartabia (Dep. La Coruna) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "2 - 02:27",
            "label": "corner",
            "description": "Luis Alberto (Dep. La Coruna) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 02:00",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Faycal Fajr (Dep. La Coruna). The referee points to the corner flag and Dep. La Coruna will take a corner."
        },
        {
            "gameTime": "2 - 00:27",
            "label": "substitution",
            "description": "Cristiano Ronaldo will be replaced by James Rodriguez (Real Madrid)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. Real Madrid have arguably been the better of the two sides in the first half. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 44:58",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slams the ball from a long range free kick. He should have curled it higher to avoid hitting the wall."
        },
        {
            "gameTime": "1 - 43:46",
            "label": "",
            "description": "Antonio Mateu Lahoz blows his whistle after Pedro Mosquera Parada (Dep. La Coruna) brings one of his opponents down with a strong tackle. It's a free kick to Real Madrid in a dangerous position."
        },
        {
            "gameTime": "1 - 43:03",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Pedro Mosquera Parada (Dep. La Coruna) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 42:08",
            "label": "",
            "description": "Marcelo (Real Madrid) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "",
            "description": "Luka Modric (Real Madrid) makes an overly aggressive challenge and Antonio Mateu Lahoz blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 40:38",
            "label": "",
            "description": "Karim Benzema (Real Madrid) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "1 - 39:03",
            "label": "",
            "description": "Gareth Bale (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 38:00",
            "label": "",
            "description": "Fernando Navarro (Dep. La Coruna) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 36:57",
            "label": "",
            "description": "Federico Cartabia (Dep. La Coruna) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "1 - 35:34",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Federico Cartabia (Dep. La Coruna), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "1 - 35:14",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) breaks past challenges inside the box, but puts too much pace on his pass to Marcelo."
        },
        {
            "gameTime": "1 - 33:40",
            "label": "",
            "description": "What a great touch by Cristiano Ronaldo (Real Madrid)! He picks up a precise pass inside the box and immediately produces a shot towards the net. Unfortunately for him, his bullet only crashes against the crossbar."
        },
        {
            "gameTime": "1 - 33:22",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 32:52",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The ball is out of play. A goal scoring opportunity from a corner for Real Madrid."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "",
            "description": "Fernando Navarro (Dep. La Coruna) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 30:05",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 29:34",
            "label": "",
            "description": "Karim Benzema (Real Madrid) fashions a shot from the edge of the box after receiving an accurate pass. Stipe Pletikosa makes a stunning save to stop the effort from flying into the right side of the goal. Real Madrid win a corner."
        },
        {
            "gameTime": "1 - 28:52",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes a nice first touch to control a cross and shoots at goal from near the penalty spot, but his effort only hits the right hand post!"
        },
        {
            "gameTime": "1 - 26:50",
            "label": "",
            "description": "Real Madrid string together a series of short passes."
        },
        {
            "gameTime": "1 - 24:25",
            "label": "soccer-ball",
            "description": "Goal! Toni Kroos launched the corner kick and superbly found the head of Cristiano Ronaldo (Real Madrid), whose accurate effort from near the penalty spot went straight into the bottom left corner. It's 0:2."
        },
        {
            "gameTime": "1 - 24:24",
            "label": "corner",
            "description": "Corner kick. Toni Kroos (Real Madrid) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "Luka Modric (Real Madrid) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 24:05",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 23:59",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) wins some space for himself around the penalty spot and manages to produce a promising header. One of the defenders stops his effort before it gets to the goalkeeper, making him redundant. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 22:34",
            "label": "",
            "description": "Karim Benzema (Real Madrid) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 22:22",
            "label": "",
            "description": "Real Madrid keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 19:08",
            "label": "",
            "description": "Federico Cartabia (Dep. La Coruna) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 16:57",
            "label": "",
            "description": "Casemiro (Real Madrid) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 15:55",
            "label": "",
            "description": "Good defending. Gareth Bale (Real Madrid) tries to find Cristiano Ronaldo inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 14:09",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) fails to deliver a decent cross from the corner and the ball goes out of play."
        },
        {
            "gameTime": "1 - 13:00",
            "label": "",
            "description": "Marcelo (Real Madrid) sends the ball into the box from the side of the pitch, but his cross is blocked. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 11:52",
            "label": "",
            "description": "Sidnei (Dep. La Coruna) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 10:32",
            "label": "",
            "description": "Marcelo (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 09:37",
            "label": "",
            "description": "Karim Benzema (Real Madrid) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 08:16",
            "label": "",
            "description": "Some neat passing and movement from Real Madrid as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 06:26",
            "label": "soccer-ball",
            "description": "Goal! Cristiano Ronaldo (Real Madrid) shows good awareness inside the box as he latches on to a brilliant pass and fires a first time shot into the bottom right corner. Karim Benzema assisted in the goal. 0:0."
        },
        {
            "gameTime": "1 - 05:57",
            "label": "",
            "description": "Marcelo (Real Madrid) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 05:25",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 05:09",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared. Real Madrid will take a corner kick."
        },
        {
            "gameTime": "1 - 04:18",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 03:30",
            "label": "",
            "description": "The cross into the penalty area from Cristiano Ronaldo (Real Madrid) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "1 - 02:17",
            "label": "",
            "description": "Gareth Bale (Real Madrid) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 01:03",
            "label": "",
            "description": "Toni Kroos (Real Madrid) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Dep. La Coruna will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Mateu Lahoz was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans can't complain about what they saw on the pitch as both sides displayed a highly captivating football match. The Real Madrid fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The hosts defended well and were deadly on the counter attack. The away side displayed some nice build up play using a lot of passes."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "14/05/2016 - 18:00",
    "gameHomeTeam": "Dep. La Coruna",
    "gameScore": "0 - 2"
}