{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-04-29 - 21-45 Espanyol 0 - 3 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:00",
            "label": "whistle",
            "description": "Alberto Undiano Mallenco is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 46:19",
            "label": "",
            "description": "Gerard Moreno (Espanyol) makes his forward run a little too early and is caught in an offside position after his teammate tries to play a pass to him."
        },
        {
            "gameTime": "2 - 45:47",
            "label": "",
            "description": "Lionel Messi (Barcelona) unleashes a rocket of a shot towards the right side of the goal, but the goalkeeper denies his attempt with a stunning save."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:59",
            "label": "attendance",
            "description": "The attendance for today's match is 31708."
        },
        {
            "gameTime": "2 - 42:47",
            "label": "",
            "description": "That didn't go as planned! Gerard Moreno (Espanyol) tried his luck from the edge of the box, but his effort low towards the middle of the goal was too weak to get past Marc Andre ter Stegen, who easily kept it out."
        },
        {
            "gameTime": "2 - 41:35",
            "label": "soccer-ball",
            "description": "GOAL! A terrible mistake leads to a goal. The defender ends up losing possession, allowing Luis Suarez (Barcelona) to pick up the ball before slotting it into the back of the net to make it 0:3."
        },
        {
            "gameTime": "2 - 40:06",
            "label": "",
            "description": "Alberto Undiano Mallenco interrupts the game for a tactical foul by Luis Suarez (Barcelona)."
        },
        {
            "gameTime": "2 - 35:30",
            "label": "corner",
            "description": "Neymar (Barcelona) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 35:06",
            "label": "",
            "description": "Lionel Messi (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 33:54",
            "label": "substitution",
            "description": "Quique Flores has decided to introduce fresh legs, with Marc Roca Junque (Espanyol) replacing Javi Fuego."
        },
        {
            "gameTime": "2 - 32:53",
            "label": "substitution",
            "description": "Substitution. Andre Gomes is replaced by Javier Mascherano (Barcelona)."
        },
        {
            "gameTime": "2 - 30:47",
            "label": "soccer-ball",
            "description": "Lionel Messi is in a good shooting position, but he sees his teammate and passes the ball to him. Ivan Rakitic (Barcelona) takes it nicely and beats the goalkeeper with a precise shot into the bottom right corner to make the score 0:2."
        },
        {
            "gameTime": "2 - 22:43",
            "label": "",
            "description": "Lionel Messi (Barcelona) stands over the free kick and opts to take it himself, sending it towards the right post only for Diego Lopez to dive and make a save."
        },
        {
            "gameTime": "2 - 22:35",
            "label": "y-card",
            "description": "The yellow card goes to Javi Fuego (Espanyol)."
        },
        {
            "gameTime": "2 - 20:59",
            "label": "substitution",
            "description": "Substitution. Hernan Perez (Espanyol) on for Pablo Piatti."
        },
        {
            "gameTime": "2 - 19:05",
            "label": "",
            "description": "Lionel Messi (Barcelona) was too forceful with his tackle and Alberto Undiano Mallenco interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 16:31",
            "label": "corner",
            "description": "Pablo Piatti (Espanyol) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 16:10",
            "label": "",
            "description": "Jose Manuel Jurado (Espanyol) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. The ball goes out of play. Espanyol are awarded a corner kick."
        },
        {
            "gameTime": "2 - 15:33",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 15:25",
            "label": "substitution",
            "description": "Substitution. Leo Baptistao (Espanyol) replaces Felipe Caicedo."
        },
        {
            "gameTime": "2 - 15:06",
            "label": "",
            "description": "Neymar (Barcelona) has a great chance inside the six yard box, shoots to the top right corner, but Diego Lopez pulls off an exquisite save to deny him. The ball is out of play. Barcelona will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 14:12",
            "label": "",
            "description": "Neymar (Barcelona) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 12:53",
            "label": "y-card",
            "description": "Aaron Caricol (Espanyol) is punished with the yellow card."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 10:37",
            "label": "injury",
            "description": "Felipe Caicedo (Espanyol) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 10:01",
            "label": "",
            "description": "Neymar (Barcelona) runs with the ball towards the keeper and pulls the trigger from close range, but Diego Lopez anticipates his intention and makes an amazing save to stop the shot going into the bottom left corner. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 09:21",
            "label": "corner",
            "description": "Pablo Piatti (Espanyol) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 08:55",
            "label": "",
            "description": "What a goal scoring opportunity! Pablo Piatti (Espanyol) finds some space inside the box and gets in a strike, but the shot is brilliantly blocked by one of the defending players sliding in. Espanyol force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "soccer-ball",
            "description": "Goal! A mistake from the defence gifted a chance to a lurking Luis Suarez (Barcelona), who keeps his cool and rolls the ball into the net from close range. 0:1."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:13",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:40",
            "label": "",
            "description": "Neymar (Barcelona) has a great chance to score, but he blasts the ball well wide of the left post."
        },
        {
            "gameTime": "1 - 39:10",
            "label": "",
            "description": "Sergi Roberto (Barcelona) wasted a chance to score! He pinged a fine header from deep inside the box towards the net, but his aim was off and it flew narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 35:13",
            "label": "",
            "description": "Pablo Piatti (Espanyol) is deemed to be in an offside position by the linesman and it looks like it is the right decision despite being a very close call."
        },
        {
            "gameTime": "1 - 32:32",
            "label": "",
            "description": "Javi Lopez (Espanyol) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 30:35",
            "label": "",
            "description": "Luis Suarez (Barcelona) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "1 - 29:18",
            "label": "",
            "description": "Neymar (Barcelona) gets on the ball and beats an opponent, but his run is stopped by the referee Alberto Undiano Mallenco who sees an offensive foul."
        },
        {
            "gameTime": "1 - 26:34",
            "label": "corner",
            "description": "Pablo Piatti (Espanyol) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 26:02",
            "label": "",
            "description": "Pablo Piatti (Espanyol) produces a lovely chip pass into the box, but one of the opposition players cuts it out. Espanyol win a corner."
        },
        {
            "gameTime": "1 - 25:22",
            "label": "corner",
            "description": "The resulting corner from Neymar (Barcelona) is cleared by the defence."
        },
        {
            "gameTime": "1 - 24:59",
            "label": "",
            "description": "Lionel Messi (Barcelona) looks to break free, but an opposing player clears the ball away. Good work from Barcelona as they win a corner."
        },
        {
            "gameTime": "1 - 24:31",
            "label": "",
            "description": "Javi Fuego (Espanyol) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 22:49",
            "label": "",
            "description": "Lionel Messi (Barcelona) serves up a nice cross, but Diego Lopez punches the ball away."
        },
        {
            "gameTime": "1 - 22:05",
            "label": "",
            "description": "Alberto Undiano Mallenco blows for a foul after Javi Lopez (Espanyol) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 20:11",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "1 - 17:50",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle and signals a foul after Sergio Busquets (Barcelona) brought his opponent down."
        },
        {
            "gameTime": "1 - 15:39",
            "label": "",
            "description": "The players claim that Luis Suarez (Barcelona) handled the ball inside the box and it seems they are right."
        },
        {
            "gameTime": "1 - 15:15",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 14:44",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender. Barcelona have a corner."
        },
        {
            "gameTime": "1 - 13:57",
            "label": "y-card",
            "description": "Is that a yellow card in the referee's hand? It is! Gerard Moreno (Espanyol) gets booked."
        },
        {
            "gameTime": "1 - 13:33",
            "label": "",
            "description": "Lionel Messi (Barcelona) handles the ball and everyone in the stadium shouts 'handball'."
        },
        {
            "gameTime": "1 - 11:11",
            "label": "",
            "description": "Neymar (Barcelona) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender."
        },
        {
            "gameTime": "1 - 07:25",
            "label": "corner",
            "description": "Pablo Piatti (Espanyol) sends the corner into the box, but Marc Andre ter Stegen intercepts it and averts the threat."
        },
        {
            "gameTime": "1 - 06:41",
            "label": "",
            "description": "Pablo Piatti (Espanyol) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort. The ball is out of play and Espanyol manage to earn a corner."
        },
        {
            "gameTime": "1 - 05:12",
            "label": "",
            "description": "Jose Manuel Jurado (Espanyol) finds himself with a great opportunity! He unleashes a shot from the edge of the box, which whizzes just wide of the left post!"
        },
        {
            "gameTime": "1 - 03:21",
            "label": "",
            "description": "Alberto Undiano Mallenco blows the whistle, Felipe Caicedo (Espanyol) is penalised for a foul."
        },
        {
            "gameTime": "1 - 02:25",
            "label": "injury",
            "description": "The game is interrupted now, Sergi Roberto (Barcelona) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Barcelona will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alberto Undiano Mallenco is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lionel Messi from Barcelona will look to add to his goal tally, he has netted 33 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 1:1 in the last game between Espanyol and Gijon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Alberto Undiano Mallenco is looking at his watch and immediately ends this match."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "29/04/2017 - 21:45",
    "gameHomeTeam": "Espanyol",
    "gameScore": "0 - 3"
}