{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-24 - 22-45 Maccabi Tel Aviv 0 - 4 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The away team was superior on the pitch today. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        },
        {
            "gameTime": "2 - 48:40",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "soccer-ball",
            "description": "Oscar takes over corner duties and expertly finds Kurt Zouma (Chelsea), who jumps highest and coolly plants a bullet header into the middle of the goal. The score is now 0:2."
        },
        {
            "gameTime": "2 - 45:58",
            "label": "corner",
            "description": "Oscar (Chelsea) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 45:02",
            "label": "",
            "description": "Diego Costa (Chelsea) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:48",
            "label": "corner",
            "description": "Eden Ben Basat (Maccabi Tel Aviv) works the corner short."
        },
        {
            "gameTime": "2 - 44:10",
            "label": "",
            "description": "Yosef Azulay Shlomy (Maccabi Tel Aviv) collects a pass and has an effort from distance which is blocked. Maccabi Tel Aviv have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "substitution",
            "description": "Substitution. Eran Zahavi makes his way off the pitch and Barak Itzhaki (Maccabi Tel Aviv) comes on as his replacement."
        },
        {
            "gameTime": "2 - 42:57",
            "label": "",
            "description": "Pedro (Chelsea) makes a good run with the ball, but his shot from the edge of the penalty area goes just wide of the left post. Terrific solo effort, though. The ball goes out of play and Maccabi Tel Aviv will have a goal kick."
        },
        {
            "gameTime": "2 - 42:19",
            "label": "",
            "description": "Chelsea seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "2 - 40:49",
            "label": "",
            "description": "Pedro (Chelsea) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the left post. The ball is off of the pitch and it's a goal kick for Maccabi Tel Aviv."
        },
        {
            "gameTime": "2 - 39:39",
            "label": "substitution",
            "description": "A substitution has been made. Gal Alberman is replaced by Yosef Azulay Shlomy (Maccabi Tel Aviv)."
        },
        {
            "gameTime": "2 - 38:46",
            "label": "y-card",
            "description": "The foul by Cesc Fabregas (Chelsea) is worthy of a card and a yellow is duly shown by Alberto Undiano Mallenco."
        },
        {
            "gameTime": "2 - 38:14",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "2 - 37:52",
            "label": "",
            "description": "A clumsy foul by Nosa Igiebor (Maccabi Tel Aviv) and Alberto Undiano Mallenco blows his whistle."
        },
        {
            "gameTime": "2 - 37:23",
            "label": "",
            "description": "The linesman raises his flag for offside before Pedro (Chelsea) heads on."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "",
            "description": "Pedro (Chelsea) was too fierce in his attempt to get the ball from his opponent and Alberto Undiano Mallenco blows for a foul."
        },
        {
            "gameTime": "2 - 36:08",
            "label": "",
            "description": "Diego Costa (Chelsea) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 34:46",
            "label": "",
            "description": "Some neat passing and movement from Chelsea as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "2 - 34:35",
            "label": "substitution",
            "description": "Slavisa Jokanovic prepares a substitution. Tal Ben Haim II. is replaced by Eden Ben Basat (Maccabi Tel Aviv)."
        },
        {
            "gameTime": "2 - 33:15",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Loic Remy (Chelsea) comes onto the pitch so that Willian can be given a rest."
        },
        {
            "gameTime": "2 - 31:37",
            "label": "soccer-ball",
            "description": "It's a goal! Oscar (Chelsea) does well to meet a cross inside the box and strikes a perfect header past the goalkeeper into the middle of the goal."
        },
        {
            "gameTime": "2 - 30:50",
            "label": "",
            "description": "Omri Ben Harush (Maccabi Tel Aviv) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 30:50",
            "label": "",
            "description": "Oscar (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 28:54",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle. Abdul Baba Rahman (Chelsea) commits a foul after dangerous play. It's a free kick to Maccabi Tel Aviv, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "2 - 27:43",
            "label": "soccer-ball",
            "description": "Willian (Chelsea) takes the free kick and beats the goalkeeper with a shot which goes inside the left post. Simply stunning!"
        },
        {
            "gameTime": "2 - 26:16",
            "label": "substitution",
            "description": "Jose Mourinho is forced to make a change. John Terry is not able to carry on due to injury. He is replaced by Kurt Zouma (Chelsea)."
        },
        {
            "gameTime": "2 - 25:29",
            "label": "injury",
            "description": "John Terry (Chelsea) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 24:28",
            "label": "",
            "description": "Gal Alberman (Maccabi Tel Aviv) commits a rough challenge and Alberto Undiano Mallenco blows his whistle for a foul. Chelsea earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 23:59",
            "label": "substitution",
            "description": "Here comes a substitution. Pedro (Chelsea) is brought on as a substitute for Eden Hazard."
        },
        {
            "gameTime": "2 - 20:44",
            "label": "",
            "description": "Flag goes up against Tal Ben Haim II. (Maccabi Tel Aviv) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 19:18",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 18:38",
            "label": "corner",
            "description": "Eran Zahavi (Maccabi Tel Aviv) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 17:38",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) collects the ball on the edge of the box and produces a precise shot which would have ended inside the left post, if Asmir Begovic hadn't pulled off a wonderful save. The ball is out of play and Maccabi Tel Aviv manage to earn a corner."
        },
        {
            "gameTime": "2 - 17:08",
            "label": "",
            "description": "Oscar (Chelsea) picks up a lofted cross inside the box and fires a quick shot to the middle of the goal. His promising effort is kept out by Predrag Rajkovic, who pulls off a stunning save!"
        },
        {
            "gameTime": "2 - 16:45",
            "label": "",
            "description": "A neat pass is well received by Eden Hazard (Chelsea), who is lurking on the edge of the box and strikes the ball towards the bottom left corner, but the goalkeeper makes an incredible save to block his shot."
        },
        {
            "gameTime": "2 - 16:11",
            "label": "corner",
            "description": "Predrag Rajkovic leaps to collect the ball from the corner which was sent over by Willian (Chelsea)."
        },
        {
            "gameTime": "2 - 15:53",
            "label": "",
            "description": "Oscar (Chelsea) looks to break free, but an opposing player clears the ball away. The ball goes out for a corner. Chelsea can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 14:53",
            "label": "",
            "description": "Willian makes a nice run and receives a pin point long through ball from Cesc Fabregas (Chelsea). It would probably have put him one on one with the keeper, but one of the defenders makes a great block."
        },
        {
            "gameTime": "2 - 13:33",
            "label": "y-card",
            "description": "Today's referee Alberto Undiano Mallenco rightly decides to book Nemanja Matic (Chelsea) for his harsh tackle."
        },
        {
            "gameTime": "2 - 13:05",
            "label": "",
            "description": "Gary Cahill (Chelsea) commits a foul after bringing down his opponent with a slide tackle. That's a free kick to Maccabi Tel Aviv."
        },
        {
            "gameTime": "2 - 12:07",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 11:20",
            "label": "",
            "description": "Some patient build up play from Chelsea as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 10:25",
            "label": "",
            "description": "Tal Ben Haim II. (Maccabi Tel Aviv) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "2 - 09:22",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) produces a dangerous low pass into the penalty area, but the defence manage to cut it out. The ball goes out of play and Maccabi Tel Aviv will have a goal kick."
        },
        {
            "gameTime": "2 - 07:59",
            "label": "",
            "description": "Diego Costa (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 06:54",
            "label": "",
            "description": "Diego Costa (Chelsea) is adjudged offside."
        },
        {
            "gameTime": "2 - 06:53",
            "label": "",
            "description": "Eden Hazard (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 06:19",
            "label": "",
            "description": "The linesman raises his flag. Cesc Fabregas (Chelsea) is adjudged offside."
        },
        {
            "gameTime": "2 - 06:18",
            "label": "",
            "description": "Chelsea hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "2 - 05:38",
            "label": "",
            "description": "Carlos Garcia (Maccabi Tel Aviv) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 05:08",
            "label": "corner",
            "description": "The corner from Eran Zahavi (Maccabi Tel Aviv) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "",
            "description": "Asmir Begovic can hear the fans clapping for his superb goalkeeping after he magnificently stops the close range effort from Elazar Dasa (Maccabi Tel Aviv). The ball would have probably ended up inside the right post. The linesman points to the corner flag, Maccabi Tel Aviv are going to take it."
        },
        {
            "gameTime": "2 - 03:56",
            "label": "",
            "description": "Diego Costa (Chelsea) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 03:13",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "2 - 02:13",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Chelsea was in an offside position."
        },
        {
            "gameTime": "2 - 02:04",
            "label": "",
            "description": "Eden Hazard (Chelsea) attempts to whip a quick pass into the box, but Abdul Baba Rahman was not able to dribble past the opponent's defence and loses the ball."
        },
        {
            "gameTime": "2 - 01:14",
            "label": "",
            "description": "From a seemingly non threatining position, an indirect free kick is taken by Eran Zahavi (Maccabi Tel Aviv) which creates a surprising opportunity, but the opposition's defence is alert and thwarts his attempt at last possible moment."
        },
        {
            "gameTime": "2 - 00:56",
            "label": "",
            "description": "Gary Cahill (Chelsea) was too forceful with his tackle and Alberto Undiano Mallenco interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 00:25",
            "label": "",
            "description": "Tal Ben Haim II. is not given a chance to finish after receiving a sweet pass by Eran Zahavi (Maccabi Tel Aviv). The ball is behind the touchline and Maccabi Tel Aviv will take a throw in."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:01",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. The visitors were more active and dominated the home side in the first half, who weren't able to keep up. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:07",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) looks to break free, but an opposing player clears the ball away. The ball goes out of play and Maccabi Tel Aviv will have a goal kick."
        },
        {
            "gameTime": "1 - 43:35",
            "label": "corner",
            "description": "Willian (Chelsea) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 43:16",
            "label": "",
            "description": "Diego Costa (Chelsea) races towards goal but the defender gets back well to make a challenge. Corner kick. Chelsea will have an opportunity."
        },
        {
            "gameTime": "1 - 42:36",
            "label": "",
            "description": "Eden Hazard (Chelsea) picks up a pass and unleashes a low shot towards goal, but he can't generate enough power to trouble Predrag Rajkovic."
        },
        {
            "gameTime": "1 - 42:19",
            "label": "corner",
            "description": "The corner from Willian (Chelsea) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "",
            "description": "Oscar (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play. A goal scoring opportunity from a corner for Chelsea."
        },
        {
            "gameTime": "1 - 40:09",
            "label": "r-card",
            "description": "Tal Ben Haim (Maccabi Tel Aviv) knows that the game is over for him after receiving a red card from the referee for fouling his opponent!"
        },
        {
            "gameTime": "1 - 39:28",
            "label": "",
            "description": "Tal Ben Haim (Maccabi Tel Aviv) makes a slide tackle, but referee Alberto Undiano Mallenco blows for a foul."
        },
        {
            "gameTime": "1 - 39:12",
            "label": "",
            "description": "Eran Zahavi (Maccabi Tel Aviv) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 38:54",
            "label": "",
            "description": "Oscar (Chelsea) receives an accurate pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, his effort goes high above the crossbar. The ball goes out of play and Maccabi Tel Aviv will have a goal kick."
        },
        {
            "gameTime": "1 - 38:17",
            "label": "corner",
            "description": "Willian (Chelsea) takes a short corner kick."
        },
        {
            "gameTime": "1 - 38:03",
            "label": "",
            "description": "Diego Costa (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 36:52",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 36:04",
            "label": "",
            "description": "Willian (Chelsea) fires the resultant free kick towards the left post, but the keeper makes a brilliant save and denies him the chance to score."
        },
        {
            "gameTime": "1 - 34:49",
            "label": "",
            "description": "Alberto Undiano Mallenco has a clear sight and sees a foul from Carlos Garcia (Maccabi Tel Aviv). Chelsea have been awarded a free kick."
        },
        {
            "gameTime": "1 - 33:46",
            "label": "",
            "description": "Omri Ben Harush (Maccabi Tel Aviv) receives a pass and tries his luck with a long range powerful effort. His poorly placed shot lacks accuracy and flies way over the crossbar. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 32:38",
            "label": "",
            "description": "The Maccabi Tel Aviv players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "",
            "description": "Diego Costa (Chelsea) attempts to find his teammate with a short pass into the box. Eden Hazard collects the ball, but his attack is thwarted by the defence."
        },
        {
            "gameTime": "1 - 29:52",
            "label": "",
            "description": "Diego Costa (Chelsea) had a good opportunity when he latched on to a cross from the wing, but his strike wasn't accurate at all and the ball went well over the bar. The ball is off of the pitch and it's a goal kick for Maccabi Tel Aviv."
        },
        {
            "gameTime": "1 - 29:26",
            "label": "",
            "description": "Chelsea are playing some nice combination football, sending it precisely from player to player, but a defender shows good anticipation and ends the move with a good block."
        },
        {
            "gameTime": "1 - 26:33",
            "label": "corner",
            "description": "The corner by Tal Ben Haim II. (Maccabi Tel Aviv) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 26:20",
            "label": "",
            "description": "The ball is cleared after Dor Peretz (Maccabi Tel Aviv) attempted to dribble past an opposing player. Maccabi Tel Aviv get a corner."
        },
        {
            "gameTime": "1 - 26:01",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) finds his teammate inside the box with a sweet pass. However, Willian wasn't able to finish and lost the ball."
        },
        {
            "gameTime": "1 - 24:57",
            "label": "",
            "description": "Flag up against Nosa Igiebor (Maccabi Tel Aviv). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 24:09",
            "label": "",
            "description": "A spell of possession for Maccabi Tel Aviv in an attempt to control the game."
        },
        {
            "gameTime": "1 - 23:26",
            "label": "",
            "description": "Eden Hazard (Chelsea) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 22:11",
            "label": "",
            "description": "Omri Ben Harush (Maccabi Tel Aviv) commits a rough foul. Alberto Undiano Mallenco stops the game and makes a call."
        },
        {
            "gameTime": "1 - 19:59",
            "label": "soccer-ball",
            "description": "A shot is blocked but the rebound lands at the feet of Gary Cahill (Chelsea) who fires the ball into the back of the net."
        },
        {
            "gameTime": "1 - 19:58",
            "label": "",
            "description": "Gary Cahill (Chelsea) connects with the resulting corner kick deep into the box, but the keeper gets a glove to his header and pushes it onto the left post."
        },
        {
            "gameTime": "1 - 19:28",
            "label": "corner",
            "description": "Corner kick. Willian (Chelsea) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 19:27",
            "label": "",
            "description": "Oscar (Chelsea) races towards goal but the defender gets back well to make a challenge. The ball goes out of play and Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 19:01",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar. The ball is off of the pitch and it's a goal kick for Maccabi Tel Aviv."
        },
        {
            "gameTime": "1 - 18:01",
            "label": "",
            "description": "Tal Ben Haim (Maccabi Tel Aviv) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 16:48",
            "label": "",
            "description": "Some great controlled play and passing from Maccabi Tel Aviv. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 16:25",
            "label": "",
            "description": "Diego Costa (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 14:57",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 14:07",
            "label": "",
            "description": "This should have been a goal! Willian (Chelsea) sends a killer pass into the box, but Diego Costa can't trick the opposition's defence and loses possession."
        },
        {
            "gameTime": "1 - 12:36",
            "label": "",
            "description": "Tal Ben Haim II. (Maccabi Tel Aviv) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 11:27",
            "label": "",
            "description": "Eden Hazard (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 10:56",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 09:52",
            "label": "",
            "description": "Chelsea are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "1 - 08:53",
            "label": "",
            "description": "Chelsea hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 06:43",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity! The ball is off of the pitch and it's a goal kick for Maccabi Tel Aviv."
        },
        {
            "gameTime": "1 - 05:43",
            "label": "",
            "description": "Dor Peretz (Maccabi Tel Aviv) gives away a foul for a clumsy challenge. Referee Alberto Undiano Mallenco saw the whole situation. Chelsea are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 04:55",
            "label": "",
            "description": "That's a well taken pass by Elazar Dasa (Maccabi Tel Aviv). He unleashes a strike from the edge of the box, but blazes it high over the bar. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 04:39",
            "label": "",
            "description": "The ball is cleared after Eran Zahavi (Maccabi Tel Aviv) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "",
            "description": "Chelsea are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 02:21",
            "label": "",
            "description": "Dor Peretz (Maccabi Tel Aviv) connects with a cross from the side, but produces a header which goes way over the bar. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "1 - 00:24",
            "label": "",
            "description": "Dor Peretz (Maccabi Tel Aviv) makes a rough challenge and Alberto Undiano Mallenco blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Chelsea will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Alberto Undiano Mallenco."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The away team was superior on the pitch today. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "24/11/2015 - 22:45",
    "gameHomeTeam": "Maccabi Tel Aviv",
    "gameScore": "0 - 4"
}