{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-12-09 - 22-45 Galatasaray 1 - 4 Arsenal/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The game was more or less balanced. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 47:25",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:40",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Lukas Podolski (Arsenal) was set free in the area by Yaya Sanogo and made no mistake with a lovely finish into the bottom right corner. 1:4."
        },
        {
            "gameTime": "2 - 46:11",
            "label": "",
            "description": "Olcan Adin (Galatasaray) unleashes a shot, but his effort is poor and floats high over the bar."
        },
        {
            "gameTime": "2 - 45:50",
            "label": "",
            "description": "Arsenal exchange some short passes over a small area and control the game. Now they make a mistake and lose the ball and the whole situation changes completely. It's a throw in for Galatasaray."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:42",
            "label": "",
            "description": "Galatasaray are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. The ball is out of play. Arsenal will have a throw in."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "soccer-ball",
            "description": "Wesley Sneijder (Galatasaray) scores from a free kick after smashing the ball over the defensive wall and into the top left corner of the goal!"
        },
        {
            "gameTime": "2 - 42:18",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) will take a free kick. Is he going to strike the ball directly at the goal? Let's find out!"
        },
        {
            "gameTime": "2 - 41:48",
            "label": "",
            "description": "Per Mertesacker (Arsenal) handled the ball and can consider himself lucky for not receiving a yellow card. It wasn't so serious, and he didn't influence the game. Another situation results in a direct free kick for Galatasaray."
        },
        {
            "gameTime": "2 - 41:12",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) stands over the free kick and opts to take it himself, but it is straight at Wojciech Szczesny."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) will take a free kick. Is he going to strike the ball directly at the goal? Let's find out!"
        },
        {
            "gameTime": "2 - 40:42",
            "label": "",
            "description": "Joel Campbell (Arsenal) makes a strong challenge and David Fernandez Borbalan blows for a foul. Galatasaray are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 40:02",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) sends a teasing cross into the area, but Wojciech Szczesny intercepts the ball."
        },
        {
            "gameTime": "2 - 39:47",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Yasin Oztekin (Galatasaray) takes it short."
        },
        {
            "gameTime": "2 - 39:36",
            "label": "",
            "description": "Yasin Oztekin (Galatasaray) slides a pass forward, but one of the defenders cuts it out. The ball is out of play. A goal scoring opportunity from a corner for Galatasaray."
        },
        {
            "gameTime": "2 - 39:11",
            "label": "",
            "description": "Arsenal players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "2 - 37:42",
            "label": "",
            "description": "Galatasaray are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. The referee and the linesman both signal a throw in for Arsenal."
        },
        {
            "gameTime": "2 - 37:12",
            "label": "",
            "description": "A perfect long pass by Emre Colak (Galatasaray) finds Alex Nicolao Telles. He latches on to the pass and continues his attacking run."
        },
        {
            "gameTime": "2 - 36:51",
            "label": "",
            "description": "Alex Nicolao Telles (Galatasaray) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 36:30",
            "label": "",
            "description": "The free kick is taken short by Galatasaray."
        },
        {
            "gameTime": "2 - 36:16",
            "label": "",
            "description": "David Fernandez Borbalan has a clear sight and sees a foul from Yaya Sanogo (Arsenal). Galatasaray are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 35:33",
            "label": "",
            "description": "Yasin Oztekin (Galatasaray) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 34:19",
            "label": "",
            "description": "Hamit Altintop (Galatasaray) takes a shot after receiving a good pass, but his effort from the edge of the box goes just over the crossbar. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) misses a good chance to score. An inch perfect cross into the box finds Wesley Sneijder (Galatasaray) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 33:15",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Alex Nicolao Telles (Galatasaray), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 32:31",
            "label": "",
            "description": "David Fernandez Borbalan blows his whistle and it's Yaya Sanogo (Arsenal) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 32:13",
            "label": "",
            "description": "Joel Campbell (Arsenal) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 31:41",
            "label": "substitution",
            "description": "Substitution. Bruma makes way for Olcan Adin (Galatasaray)."
        },
        {
            "gameTime": "2 - 31:29",
            "label": "substitution",
            "description": "It is time for a substitution. Stefan O'Connor (Arsenal) is on for Mathieu Debuchy."
        },
        {
            "gameTime": "2 - 30:55",
            "label": "",
            "description": "Alex Nicolao Telles (Galatasaray) swings a cross into the box, but it's far too close to Wojciech Szczesny, who smothers the ball."
        },
        {
            "gameTime": "2 - 30:21",
            "label": "",
            "description": "Emre Colak (Galatasaray) smashes the ball upfield and Bruma controls it with a great first touch."
        },
        {
            "gameTime": "2 - 28:53",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Hamit Altintop (Galatasaray), whose instinctive shot towards goal flashes inches wide of the left post. The ball goes out of play and Arsenal will have a goal kick."
        },
        {
            "gameTime": "2 - 27:49",
            "label": "",
            "description": "Arsenal exchange some short passes over a small area and control the game. Now they make a mistake and lose the ball and the whole situation changes completely. The ball has crossed the sideline. Galatasaray are taking a throw in."
        },
        {
            "gameTime": "2 - 27:17",
            "label": "corner",
            "description": "Joel Campbell (Arsenal) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 27:02",
            "label": "",
            "description": "The ball is cleared after Joel Campbell (Arsenal) attempted to dribble past an opposing player. The ball is out of play and the linesman points at the corner flag. Corner to Arsenal."
        },
        {
            "gameTime": "2 - 26:42",
            "label": "",
            "description": "Alex Nicolao Telles (Galatasaray) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 26:20",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 32:13."
        },
        {
            "gameTime": "2 - 24:05",
            "label": "",
            "description": "Bruma (Galatasaray) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "2 - 23:27",
            "label": "",
            "description": "Galatasaray string together a series of short passes."
        },
        {
            "gameTime": "2 - 23:08",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) fires the ball on goal, but his attempt goes well wide of the left post. The ball goes out of play and Arsenal will have a goal kick."
        },
        {
            "gameTime": "2 - 22:55",
            "label": "",
            "description": "Hamit Altintop (Galatasaray) goes for goal, but slices it wide of the target."
        },
        {
            "gameTime": "2 - 21:52",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Bruma (Galatasaray). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 21:37",
            "label": "",
            "description": "Alex Nicolao Telles (Galatasaray) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. Good work from Galatasaray as they win a corner."
        },
        {
            "gameTime": "2 - 20:57",
            "label": "",
            "description": "Umut Bulut (Galatasaray) is first to the rebound and sends a header goalwards but it's blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "2 - 19:55",
            "label": "y-card",
            "description": "Lukas Podolski (Arsenal) fails to control his temper and is booked by the referee for dissent."
        },
        {
            "gameTime": "2 - 19:44",
            "label": "y-card",
            "description": "It's like he was asking for a caution. Mathieu Debuchy (Arsenal) receives a yellow card."
        },
        {
            "gameTime": "2 - 19:06",
            "label": "",
            "description": "Arsenal are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. The ball is behind the touchline and Galatasaray will take a throw in."
        },
        {
            "gameTime": "2 - 18:13",
            "label": "",
            "description": "Bruma (Galatasaray) finds himself in a promising position to finish! He unleashes a poor shot which flies into the stands. What a poor effort that was! The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "2 - 16:45",
            "label": "",
            "description": "Arsenal keep the ball and are displaying some tiki taka style passing at the moment."
        },
        {
            "gameTime": "2 - 16:13",
            "label": "",
            "description": "Yasin Oztekin (Galatasaray) wasted a huge opportunity! The fans already began to celebrate as he unleashed a powerful shot from the edge of the box after a brilliant solo effort. The ball went towards the bottom right corner, but Wojciech Szczesny made a crucial save!"
        },
        {
            "gameTime": "2 - 14:53",
            "label": "",
            "description": "Wojciech Szczesny makes a brilliant save! Yasin Oztekin (Galatasaray) easily weaves through the defence and unleashes a shot from just outside of the box. His low shot goes towards the middle of the goal but is saved by keeper!"
        },
        {
            "gameTime": "2 - 14:31",
            "label": "",
            "description": "Alex Nicolao Telles (Galatasaray) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 13:45",
            "label": "corner",
            "description": "The corner from Hamit Altintop (Galatasaray) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 13:24",
            "label": "",
            "description": "Arsenal are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. It will be a corner kick for Galatasaray."
        },
        {
            "gameTime": "2 - 12:40",
            "label": "",
            "description": "The ball is cleared after Hector Bellerin (Arsenal) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 11:44",
            "label": "",
            "description": "Arsenal produce a short pass from the free kick."
        },
        {
            "gameTime": "2 - 11:30",
            "label": "y-card",
            "description": "Semih Kaya (Galatasaray) has tested the patience of referee David Fernandez Borbalan and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 11:07",
            "label": "",
            "description": "Felipe Melo (Galatasaray) fires the ball from distance, but it's blocked by a defender."
        },
        {
            "gameTime": "2 - 10:49",
            "label": "",
            "description": "Alex Nicolao Telles (Galatasaray) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 10:18",
            "label": "",
            "description": "The ball is behind the sideline. Mathieu Debuchy (Arsenal) takes a throw in."
        },
        {
            "gameTime": "2 - 09:17",
            "label": "",
            "description": "Galatasaray are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error."
        },
        {
            "gameTime": "2 - 08:04",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the right post. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "2 - 07:54",
            "label": "",
            "description": "Hamit Altintop (Galatasaray) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 07:30",
            "label": "",
            "description": "Arsenal exchange some short passes over a small area and control the game. Now they make a mistake and lose the ball and the whole situation changes completely."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "",
            "description": "Felipe Melo (Galatasaray) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "2 - 05:33",
            "label": "",
            "description": "Galatasaray restart play with a quick free kick."
        },
        {
            "gameTime": "2 - 05:09",
            "label": "",
            "description": "Gedion Zelalem (Arsenal) commits a rough foul. David Fernandez Borbalan stops the game and makes a call. A free kick has been awarded to Galatasaray."
        },
        {
            "gameTime": "2 - 04:22",
            "label": "",
            "description": "Yaya Sanogo (Arsenal) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "2 - 03:52",
            "label": "",
            "description": "What a beautiful long range strike by Yasin Oztekin (Galatasaray). He is quite unlucky as his shot flies just over the bar. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "",
            "description": "Galatasaray hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 02:21",
            "label": "",
            "description": "Handball by Ainsley Maitland Niles (Arsenal)."
        },
        {
            "gameTime": "2 - 02:13",
            "label": "",
            "description": "Arsenal try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "2 - 01:49",
            "label": "",
            "description": "Dangerous play by Yasin Oztekin (Galatasaray). David Fernandez Borbalan blows his whistle for a foul. Arsenal have a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The game is over for Burak Yilmaz. Yasin Oztekin (Galatasaray) comes on for the second half."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here is a change after the half time break. Mathieu Flamini is replaced by Gedion Zelalem (Arsenal)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Hamza Hamzaoglu has made a change at the break. Hamit Altintop (Galatasaray) has come on in place of Osman Tarik Camdal."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Aaron Ramsey is replaced by Ainsley Maitland Niles (Arsenal)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. The away side is controlling this game. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of David Fernandez Borbalan has ended it."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "",
            "description": "Osman Tarik Camdal (Galatasaray) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:49",
            "label": "",
            "description": "Arsenal are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. The linesman signals a throw in for Galatasaray."
        },
        {
            "gameTime": "1 - 44:35",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) attempts a long crossfield pass, but the defence does well to intercept the ball."
        },
        {
            "gameTime": "1 - 44:01",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball."
        },
        {
            "gameTime": "1 - 43:38",
            "label": "",
            "description": "Decent spell from Galatasaray here and they keep the pressure on until one of the defending players steps in."
        },
        {
            "gameTime": "1 - 43:17",
            "label": "",
            "description": "Calum Chambers (Arsenal) leaps high deep inside the box to meet a beautiful cross from the free kick and attempts to score with a header. His effort is not accurate at all and goes well over the bar. The ball goes out of play and Galatasaray will have a goal kick."
        },
        {
            "gameTime": "1 - 42:59",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) will take a free kick. Is he going to strike the ball directly at the goal? Let's find out!"
        },
        {
            "gameTime": "1 - 42:36",
            "label": "y-card",
            "description": "David Fernandez Borbalan shows a yellow card to Osman Tarik Camdal (Galatasaray) for his blatant foul."
        },
        {
            "gameTime": "1 - 42:10",
            "label": "",
            "description": "Galatasaray take a quick free kick with a short pass and play continues."
        },
        {
            "gameTime": "1 - 41:59",
            "label": "",
            "description": "David Fernandez Borbalan blows for a foul after Alex Oxlade Chamberlain (Arsenal) was too aggressive in the battle for the ball. Galatasaray earn a free kick."
        },
        {
            "gameTime": "1 - 41:28",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) attempts to surprise the keeper with a shot from distance, but it lacks accuracy and goes high over the crossbar. The ball goes out of play and Arsenal will have a goal kick."
        },
        {
            "gameTime": "1 - 40:59",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) clutches his head after wasting a good opportunity. He expertly collected the ball from a rebound and fired from long range, but his effort wasn't accurate at all and the ball went miles over the crossbar. The ball goes out of play and Galatasaray will have a goal kick."
        },
        {
            "gameTime": "1 - 40:42",
            "label": "corner",
            "description": "Joel Campbell (Arsenal) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 40:14",
            "label": "",
            "description": "Sinan Bolat pulls off a great save to deny Joel Campbell (Arsenal), who makes himself some space inside the box and unleashes a quick low drive to the bottom left corner. Arsenal will take a corner kick."
        },
        {
            "gameTime": "1 - 39:19",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 39:02",
            "label": "",
            "description": "Poor challenge! Umut Bulut (Galatasaray) is penalised for tripping and David Fernandez Borbalan blows his whistle. Arsenal win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 38:52",
            "label": "",
            "description": "Arsenal are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 38:11",
            "label": "",
            "description": "What a poor attempt! Bruma (Galatasaray) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "1 - 38:00",
            "label": "",
            "description": "David Fernandez Borbalan couldn't ignore the rough tackle by Hector Bellerin (Arsenal) and blew his whistle. Galatasaray have a free kick."
        },
        {
            "gameTime": "1 - 37:17",
            "label": "",
            "description": "Umut Bulut (Galatasaray) latches on to a cross to head the ball wide of the net. A poor header. The ball goes out of play and Arsenal will have a goal kick."
        },
        {
            "gameTime": "1 - 37:03",
            "label": "",
            "description": "Osman Tarik Camdal (Galatasaray) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 34:55",
            "label": "",
            "description": "The free kick from long distance is taken by Burak Yilmaz (Galatasaray), who fires in a direct effort just wide of the left post. What a chance! The ball goes out of play and Arsenal will have a goal kick."
        },
        {
            "gameTime": "1 - 34:50",
            "label": "",
            "description": "The free kick will be taken by Burak Yilmaz (Galatasaray)."
        },
        {
            "gameTime": "1 - 34:44",
            "label": "",
            "description": "Mathieu Debuchy (Arsenal) commits a rough challenge and David Fernandez Borbalan blows his whistle for an infringement. Galatasaray have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 34:02",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) collects an inch perfect pass and strikes the ball from far out, but his shot is blocked. Rough tackle by Yaya Sanogo (Arsenal). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 33:22",
            "label": "",
            "description": "Arsenal try to speed play up by taking a quick free kick."
        },
        {
            "gameTime": "1 - 32:55",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Felipe Melo (Galatasaray) was quite harsh and David Fernandez Borbalan didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 32:40",
            "label": "",
            "description": "Some patient build up play from Arsenal as they look to unlock the defence."
        },
        {
            "gameTime": "1 - 32:03",
            "label": "",
            "description": "Osman Tarik Camdal (Galatasaray) weaves through the defence with ease and gets into a good position in front of goal. He pulls the trigger in an effort to beat the keeper, but fails as the ball zooms over the bar. The ball goes out of play and Arsenal will have a goal kick."
        },
        {
            "gameTime": "1 - 31:17",
            "label": "",
            "description": "Osman Tarik Camdal (Galatasaray) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 30:45",
            "label": "",
            "description": "Arsenal take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 30:34",
            "label": "",
            "description": "It looks like Alex Nicolao Telles (Galatasaray) was seeing red according to his tackle. David Fernández Borbalán won't tolerate such behaviour on the pitch and blows for a foul. A free kick to Arsenal."
        },
        {
            "gameTime": "1 - 29:55",
            "label": "",
            "description": "Emre Colak (Galatasaray) gets a shot away from distance, but wasn't really set to take it and fires high and wide. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "1 - 28:50",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 28:35",
            "label": "soccer-ball",
            "description": "Aaron Ramsey (Arsenal) quickly gets to a rebound. He is not worried how far out he is and slams the ball towards the goal. To the amazement of all, it goes all the way into the top left corner. He makes it 0:3 with this magnificent strike."
        },
        {
            "gameTime": "1 - 28:25",
            "label": "corner",
            "description": "Joel Campbell (Arsenal) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 27:30",
            "label": "injury",
            "description": "Alex Oxlade Chamberlain (Arsenal) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "1 - 27:12",
            "label": "",
            "description": "Lukas Podolski (Arsenal) latches on to a lovely pass inside the box and fires towards the left side of the net, but the effort is smothered by the keeper. The referee and his assistant both point at the corner flag. Arsenal will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 26:40",
            "label": "",
            "description": "Per Mertesacker (Arsenal) finds enough space to climb high and plants a header well wide of the left post. What a poor effort. The ball goes out of play and Galatasaray will have a goal kick."
        },
        {
            "gameTime": "1 - 26:15",
            "label": "corner",
            "description": "Joel Campbell (Arsenal) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 25:52",
            "label": "",
            "description": "Joel Campbell (Arsenal) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked. Arsenal force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 25:19",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Joel Campbell (Arsenal) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 24:49",
            "label": "",
            "description": "A cross by Alex Nicolao Telles (Galatasaray) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor. The ball is out of play. Arsenal will take a throw in."
        },
        {
            "gameTime": "1 - 24:14",
            "label": "",
            "description": "Bruma (Galatasaray) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 23:20",
            "label": "",
            "description": "Hector Bellerin (Arsenal) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 23:10",
            "label": "",
            "description": "Some neat passing and movement from Arsenal as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 21:57",
            "label": "",
            "description": "Yaya Sanogo (Arsenal) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 21:31",
            "label": "",
            "description": "Osman Tarik Camdal (Galatasaray) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 20:17",
            "label": "",
            "description": "Arsenal quickly take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 19:55",
            "label": "",
            "description": "Semih Kaya (Galatasaray) makes a reckless foul in order to win the ball from his opponent. David Fernandez Borbalan has a clear sight of it and blows his whistle. Arsenal are awarded the free kick."
        },
        {
            "gameTime": "1 - 19:18",
            "label": "",
            "description": "Lukas Podolski (Arsenal) picks up a pass inside the box and unleashes a shot goalwards that crashes against the bar. It could have been a brilliant goal, unlucky. The ball goes out of play and Galatasaray will have a goal kick."
        },
        {
            "gameTime": "1 - 18:27",
            "label": "",
            "description": "Felipe Melo (Galatasaray) creates a good chance for himself and goes for goal from mid range, but he misses the right post by a whisker. The ball goes out of play and Arsenal will have a goal kick."
        },
        {
            "gameTime": "1 - 17:59",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Wesley Sneijder (Galatasaray)."
        },
        {
            "gameTime": "1 - 17:57",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) produces a dangerous lofted cross into the box which is intercepted. The ball goes out of play and Galatasaray have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 17:13",
            "label": "",
            "description": "Mathieu Debuchy latches onto a perfect defence splitting pass from Alex Oxlade Chamberlain (Arsenal) and heads towards goal. Mathieu Debuchy (Arsenal) finds himself behind the opposition's defence, but the game is stopped for offside."
        },
        {
            "gameTime": "1 - 16:58",
            "label": "",
            "description": "Some great controlled play and passing from Arsenal. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 16:21",
            "label": "",
            "description": "Umut Bulut (Galatasaray) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies into the stands. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "1 - 15:24",
            "label": "",
            "description": "Galatasaray continue the game with a quickly taken free kick."
        },
        {
            "gameTime": "1 - 14:55",
            "label": "y-card",
            "description": "Mathieu Flamini (Arsenal) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "1 - 13:06",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 11:52",
            "label": "",
            "description": "The Galatasaray players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball."
        },
        {
            "gameTime": "1 - 11:34",
            "label": "",
            "description": "Mathieu Debuchy (Arsenal) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 10:37",
            "label": "soccer-ball",
            "description": "Goal 0:2! Aaron Ramsey (Arsenal) receives a precise pass inside the box from Alex Oxlade Chamberlain and he beats the goalkeeper with a neat finish into the bottom right corner."
        },
        {
            "gameTime": "1 - 09:42",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) fails to find a teammate across the pitch with a long ball. The ball goes out of play and Arsenal will have a goal kick."
        },
        {
            "gameTime": "1 - 08:59",
            "label": "",
            "description": "The Galatasaray players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 08:25",
            "label": "",
            "description": "Wojciech Szczesny blocks a long range effort from Wesley Sneijder (Galatasaray) towards the top right corner."
        },
        {
            "gameTime": "1 - 07:55",
            "label": "",
            "description": "Hakan Balta (Galatasaray) takes a rebound on the edge of the box and slams the ball well wide of the left post. The ball is off of the pitch and it's a goal kick for Arsenal."
        },
        {
            "gameTime": "1 - 06:32",
            "label": "corner",
            "description": "The resulting corner from Wesley Sneijder (Galatasaray) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 06:10",
            "label": "",
            "description": "Emre Colak (Galatasaray) unleashes a bullet of a shot that is blocked by a defender. Galatasaray win a corner."
        },
        {
            "gameTime": "1 - 05:24",
            "label": "",
            "description": "Arsenal take a quick free kick and immediately restart play."
        },
        {
            "gameTime": "1 - 05:13",
            "label": "",
            "description": "Alex Nicolao Telles (Galatasaray) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul. Arsenal will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 04:49",
            "label": "",
            "description": "Osman Tarik Camdal (Galatasaray) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 04:06",
            "label": "",
            "description": "Arsenal spell of possession comes to an end after a mistake."
        },
        {
            "gameTime": "1 - 03:16",
            "label": "",
            "description": "Lukas Podolski (Arsenal) looks to break free, but an opposing player clears the ball away. David Fernandez Borbalan blows his whistle after Lukas Podolski (Arsenal) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 02:18",
            "label": "soccer-ball",
            "description": "Goal Lukas Podolski (Arsenal)! Lukas Podolski (Arsenal) was put through by Aaron Ramsey and he showed brilliant composure inside the box to fire into the top left corner. 0:1."
        },
        {
            "gameTime": "1 - 01:25",
            "label": "",
            "description": "Lukas Podolski (Arsenal) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 01:02",
            "label": "",
            "description": "Emre Colak (Galatasaray) was too forceful with his tackle and David Fernandez Borbalan interrupted the game to signal a free kick. Arsenal have been awarded a free kick."
        },
        {
            "gameTime": "1 - 00:36",
            "label": "",
            "description": "Burak Yilmaz (Galatasaray) attempts to create a scoring opportunity with a wonderful long ball, but his pass is blocked."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Arsenal will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "David Fernandez Borbalan will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The game was more or less balanced. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Arsenal",
    "gameDate": "09/12/2014 - 22:45",
    "gameHomeTeam": "Galatasaray",
    "gameScore": "1 - 4"
}