{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-04-22 - 21-45 Real Madrid 1 - 0 Atl. Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "The game produced by the players today wasn't one of the most inspiring. They definitely haven't shown us their best. The home side dominated today's game. The home team played possession football and the away players really focused on a well organized defence."
        },
        {
            "gameTime": "2 - 50:11",
            "label": "whistle",
            "description": "That's it for today, Felix Brych has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:38",
            "label": "y-card",
            "description": "The foul by Koke (Atl. Madrid) is worthy of a card and a yellow is duly shown by Felix Brych."
        },
        {
            "gameTime": "2 - 47:59",
            "label": "substitution",
            "description": "Carlo Ancelotti has decided to make a change. Asier Illarramendi (Real Madrid) replaces Isco."
        },
        {
            "gameTime": "2 - 47:43",
            "label": "y-card",
            "description": "The referee gives a yellow card to Alvaro Arbeloa (Real Madrid)."
        },
        {
            "gameTime": "2 - 47:42",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) attempts to delay the restart of play. The referee doesn't like it."
        },
        {
            "gameTime": "2 - 46:46",
            "label": "substitution",
            "description": "The manager has been forced to make a substitution and the injured Chicharito leaves the pitch to be replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "substitution",
            "description": "That will be all from Fabio Coentrao who is being replaced by the fresh legs of Alvaro Arbeloa (Real Madrid)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:25",
            "label": "injury",
            "description": "Chicharito (Real Madrid) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 44:05",
            "label": "",
            "description": "A rebound falls at the feet of Raul Garcia (Atl. Madrid) who unleashes a shot from long range towards the goal. However, his effort is poor and it flies high over the crossbar."
        },
        {
            "gameTime": "2 - 42:30",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Cristiano Ronaldo is the provider as he slips the ball to Chicharito (Real Madrid) who simply steers it home from close range. It's 1:0."
        },
        {
            "gameTime": "2 - 41:37",
            "label": "",
            "description": "Chicharito (Real Madrid) sends a cross into the box, but Jan Oblak comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 40:12",
            "label": "",
            "description": "Mario Mandzukic (Atl. Madrid) is able to continue to play."
        },
        {
            "gameTime": "2 - 40:01",
            "label": "substitution",
            "description": "Diego Simeone prepares a substitution. Tiago is replaced by Jose Maria Gimenez (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 39:07",
            "label": "injury",
            "description": "Mario Mandzukic (Atl. Madrid) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 38:35",
            "label": "",
            "description": "Pepe (Real Madrid) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the right post."
        },
        {
            "gameTime": "2 - 38:24",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner."
        },
        {
            "gameTime": "2 - 37:40",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) serves up a nice cross, but Jan Oblak punches the ball away. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 35:36",
            "label": "",
            "description": "Isco (Real Madrid) smashes the ball towards goal from the edge of the penalty box, but it goes well wide of the right post."
        },
        {
            "gameTime": "2 - 35:26",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 34:51",
            "label": "",
            "description": "Chicharito (Real Madrid) takes a wonderful touch after collecting a pass inside the box. He steers his low drive towards the left post, but the keeper dives low to keep the ball out. Real Madrid get a corner."
        },
        {
            "gameTime": "2 - 34:14",
            "label": "",
            "description": "Good defending. Sergio Ramos (Real Madrid) tries to find Toni Kroos inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 32:57",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) sends over a cross, but he can't find any teammate inside the box. Poor delivery. The ball goes out of play and Atl. Madrid will have a goal kick."
        },
        {
            "gameTime": "2 - 30:34",
            "label": "yr-card",
            "description": "RED CARD! Arda Turan (Atl. Madrid) makes a bad challenge and receives a second yellow card from Felix Brych. He can have an early bath."
        },
        {
            "gameTime": "2 - 29:56",
            "label": "",
            "description": "Raphael Varane (Real Madrid) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 28:50",
            "label": "y-card",
            "description": "Pepe (Real Madrid) picked up a yellow card from referee."
        },
        {
            "gameTime": "2 - 28:49",
            "label": "",
            "description": "Unsporting behaviour by Pepe (Real Madrid)."
        },
        {
            "gameTime": "2 - 28:47",
            "label": "y-card",
            "description": "Raul Garcia (Atl. Madrid) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 28:04",
            "label": "injury",
            "description": "The game is interrupted now, Raphael Varane (Real Madrid) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 27:39",
            "label": "",
            "description": "Arda Turan (Atl. Madrid) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 26:43",
            "label": "funfact",
            "description": "Total attempts – 23:6."
        },
        {
            "gameTime": "2 - 25:26",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) didn't hesitate to knock his opponent down with a harsh sliding tackle. Felix Brych could probably show him a yellow, but he only goes with blowing the whistle for a foul."
        },
        {
            "gameTime": "2 - 24:45",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slams the ball towards the middle of the goal, but it fails to surprise Jan Oblak and he's equal to it."
        },
        {
            "gameTime": "2 - 23:59",
            "label": "",
            "description": "Koke (Atl. Madrid) is well placed to meet a cross and sends a difficult header towards the middle of the goal, but the goalkeeper reacts well to stop the effort."
        },
        {
            "gameTime": "2 - 23:22",
            "label": "",
            "description": "A cross into the box from Raul Garcia (Atl. Madrid) is cleared."
        },
        {
            "gameTime": "2 - 22:19",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "2 - 21:55",
            "label": "",
            "description": "The ball is cleared after Sergio Ramos (Real Madrid) attempted to dribble past an opposing player. The ball is out of play. Real Madrid will take a throw in."
        },
        {
            "gameTime": "2 - 19:27",
            "label": "substitution",
            "description": "Substitution. Antoine Griezmann makes way for Raul Garcia (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 18:27",
            "label": "",
            "description": "Gabi (Atl. Madrid) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it."
        },
        {
            "gameTime": "2 - 18:14",
            "label": "corner",
            "description": "The corner from Koke (Atl. Madrid) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 17:35",
            "label": "",
            "description": "Gabi (Atl. Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The referee and his assistant both point at the corner flag. Atl. Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 17:06",
            "label": "",
            "description": "Jan Oblak makes a superb save to deny a header which was nodded by Sergio Ramos (Real Madrid) after a cross from the side."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "",
            "description": "Tiago (Atl. Madrid) commits a foul and Felix Brych immediately signals a free kick."
        },
        {
            "gameTime": "2 - 16:12",
            "label": "corner",
            "description": "Good work from Atl. Madrid as they win a corner."
        },
        {
            "gameTime": "2 - 15:52",
            "label": "",
            "description": "Tiago (Atl. Madrid) gets himself onto the end of the corner, but his header is blocked."
        },
        {
            "gameTime": "2 - 15:25",
            "label": "corner",
            "description": "Koke (Atl. Madrid) will take the corner."
        },
        {
            "gameTime": "2 - 15:23",
            "label": "",
            "description": "A long ball forward to Mario Mandzukic (Atl. Madrid) is intercepted. Atl. Madrid force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 13:52",
            "label": "",
            "description": "Raphael Varane (Real Madrid) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "2 - 13:35",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 13:03",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "",
            "description": "Felix Brych blows the whistle, Cristiano Ronaldo (Real Madrid) is penalised for a foul."
        },
        {
            "gameTime": "2 - 10:59",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 08:43",
            "label": "",
            "description": "Chicharito (Real Madrid) finds himself in a promising position after receiving a beautiful cross from the side, but the opposition defence is ready and one of the defenders averts the threat with a quick interception."
        },
        {
            "gameTime": "2 - 07:33",
            "label": "corner",
            "description": "Real Madrid take a short corner kick."
        },
        {
            "gameTime": "2 - 07:01",
            "label": "",
            "description": "Isco (Real Madrid) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The ball is out of play and Real Madrid manage to earn a corner."
        },
        {
            "gameTime": "2 - 06:21",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 06:07",
            "label": "",
            "description": "A lofted cross from Raphael Varane (Real Madrid) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "",
            "description": "Isco (Real Madrid) unleashed a powerful long range strike, but the ball was blocked by a defender on its way."
        },
        {
            "gameTime": "2 - 04:46",
            "label": "",
            "description": "Real Madrid players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "2 - 03:09",
            "label": "",
            "description": "Isco plays a lovely pass into Chicharito (Real Madrid), but he can't find the target. His strike from inside the box goes narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "",
            "description": "Chicharito (Real Madrid) looks to break free, but an opposing player clears the ball away. The linesman signals a throw in for Real Madrid."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Diego Simeone has made a change at the break. Gabi (Atl. Madrid) has come on in place of Saul Niguez."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game. It hasn't been very exciting show so far. The home side is dominant and dictating the tempo of the game, mainly because of their work rate and accurate passing. The tactic of the home side is slow build up play, while the away team's main priority is a flawless defence."
        },
        {
            "gameTime": "1 - 45:29",
            "label": "whistle",
            "description": "Felix Brych has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 44:47",
            "label": "",
            "description": "Raphael Varane (Real Madrid) gets his head on the corner, but he can't find the target as his header flies high over the crossbar."
        },
        {
            "gameTime": "1 - 43:59",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 43:52",
            "label": "",
            "description": "Jan Oblak pulls off a great save to deny Cristiano Ronaldo (Real Madrid), who makes himself some space inside the box and unleashes a quick shot to the right side of the goal. Real Madrid earn a corner."
        },
        {
            "gameTime": "1 - 42:51",
            "label": "corner",
            "description": "The corner from Isco (Real Madrid) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) crosses the ball into the box, but one of the defending players averts the threat. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "1 - 40:30",
            "label": "",
            "description": "Real Madrid try to speed play up by taking a quick free kick."
        },
        {
            "gameTime": "1 - 39:59",
            "label": "",
            "description": "Saul Niguez (Atl. Madrid) makes a reckless foul in order to win the ball from his opponent. Felix Brych has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 37:37",
            "label": "",
            "description": "James Rodriguez (Real Madrid) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "1 - 36:51",
            "label": "",
            "description": "Miranda (Atl. Madrid) makes a rough challenge and Felix Brych blows his whistle for a foul. A mid range free kick is awarded to Real Madrid out wide and from this angle a cross into the box is likely."
        },
        {
            "gameTime": "1 - 35:59",
            "label": "",
            "description": "Jesus Gamez (Atl. Madrid) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 33:48",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 33:20",
            "label": "",
            "description": "James Rodriguez (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "1 - 32:30",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 31:54",
            "label": "",
            "description": "Jan Oblak reacts well to deny a long range free kick from Cristiano Ronaldo (Real Madrid) towards the bottom right corner. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 30:57",
            "label": "y-card",
            "description": "Felix Brych shows a yellow card to Arda Turan (Atl. Madrid), who isn't surprised as the tackle was really hard and late. A free kick to Real Madrid."
        },
        {
            "gameTime": "1 - 30:30",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 30:13",
            "label": "",
            "description": "Chicharito (Real Madrid) meets a cross inside the box, but his header is blocked by an opposing player. Real Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 29:03",
            "label": "",
            "description": "Jesus Gamez (Atl. Madrid) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the right post is, however, superbly saved by Iker Casillas!"
        },
        {
            "gameTime": "1 - 26:44",
            "label": "",
            "description": "Close! James Rodriguez (Real Madrid) takes the resultant free kick from 26 metres out and his shot goes just over the crossbar."
        },
        {
            "gameTime": "1 - 25:39",
            "label": "",
            "description": "The referee blows his whistle as Jesus Gamez (Atl. Madrid) was too aggressive in his challenge. Real Madrid are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 23:18",
            "label": "",
            "description": "Koke (Atl. Madrid) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 22:08",
            "label": "funfact",
            "description": "63:37 – the ratio of ball possession."
        },
        {
            "gameTime": "1 - 21:14",
            "label": "",
            "description": "Felix Brych couldn't ignore the rough tackle by Cristiano Ronaldo (Real Madrid) and blew his whistle."
        },
        {
            "gameTime": "1 - 20:38",
            "label": "corner",
            "description": "The resulting corner from Koke (Atl. Madrid) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 20:04",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The linesman points to the corner flag, Atl. Madrid are going to take it."
        },
        {
            "gameTime": "1 - 19:42",
            "label": "",
            "description": "Jesus Gamez (Atl. Madrid) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The ball has crossed the sideline. Atl. Madrid are taking a throw in."
        },
        {
            "gameTime": "1 - 19:15",
            "label": "",
            "description": "Fabio Coentrao (Real Madrid) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 18:51",
            "label": "injury",
            "description": "Fabio Coentrao (Real Madrid) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 17:43",
            "label": "",
            "description": "Felix Brych blows his whistle and it's Sergio Ramos (Real Madrid) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 16:03",
            "label": "",
            "description": "Isco (Real Madrid) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 15:00",
            "label": "",
            "description": "Koke (Atl. Madrid) covers his face with his hands after wasting a promising chance. He takes the rebound on the edge of the box but blazes the ball high over the crossbar."
        },
        {
            "gameTime": "1 - 14:07",
            "label": "",
            "description": "Atl. Madrid decide to take a short pass from the free kick and the attacking effort continues."
        },
        {
            "gameTime": "1 - 13:44",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) escapes without any punishment from the referee after using excessive force to foul his opponent. Atl. Madrid are awarded a free kick."
        },
        {
            "gameTime": "1 - 13:06",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slams the ball goalwards from 18 metres out, but his decent effort flies a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 11:45",
            "label": "",
            "description": "Chicharito (Real Madrid) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 10:31",
            "label": "",
            "description": "Arda Turan (Atl. Madrid) brings his opponent down with a tackle and Felix Brych blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 09:27",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) hammers the ball from far out, but his shot is blocked by an opposition player."
        },
        {
            "gameTime": "1 - 08:08",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) passes the ball onto James Rodriguez, but one of the defenders dispossesses him. The ball is out of play. Real Madrid will have a throw in."
        },
        {
            "gameTime": "1 - 05:48",
            "label": "",
            "description": "Juanfran (Atl. Madrid) makes an overly aggressive challenge and Felix Brych blows his whistle for a foul. The free kick is taken short by Real Madrid."
        },
        {
            "gameTime": "1 - 04:00",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) races towards goal but the defender gets back well to make a challenge. The ball is behind the touchline and Real Madrid will take a throw in."
        },
        {
            "gameTime": "1 - 02:35",
            "label": "",
            "description": "Real Madrid are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 01:36",
            "label": "",
            "description": "What a poor attempt! Toni Kroos (Real Madrid) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Atl. Madrid will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Felix Brych."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The game produced by the players today wasn't one of the most inspiring. They definitely haven't shown us their best. The home side dominated today's game. The home team played possession football and the away players really focused on a well organized defence."
        }
    ],
    "gameAwayTeam": "Atl. Madrid",
    "gameDate": "22/04/2015 - 21:45",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "1 - 0"
}