{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2016-04-09 - 16-30 VfB Stuttgart 1 - 3 Bayern Munich/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The away side was dominant and dictated the tempo of the game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        },
        {
            "gameTime": "2 - 47:07",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 46:20",
            "label": "",
            "description": "Bayern Munich are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:57",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) goes on a weaving run through the defence and gets within shooting range but his effort is blocked."
        },
        {
            "gameTime": "2 - 44:30",
            "label": "attendance",
            "description": "The attendance is 60000."
        },
        {
            "gameTime": "2 - 43:33",
            "label": "soccer-ball",
            "description": "What a beautiful moment! Douglas Costa (Bayern Munich) got to the ball and unleashed a strong shot from distance. It turned out to be a good decision as his effort found its way into the bottom left corner. Przemyslaw Tyton just shakes his head in disbelief. The score changes to 1:3."
        },
        {
            "gameTime": "2 - 42:13",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) races towards goal but the defender gets back well to make a challenge. The linesman signals a throw in for Bayern Munich."
        },
        {
            "gameTime": "2 - 40:52",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "2 - 40:23",
            "label": "corner",
            "description": "Franck Ribery (Bayern Munich) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 40:09",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball is out of play and Bayern Munich manage to earn a corner."
        },
        {
            "gameTime": "2 - 38:41",
            "label": "funfact",
            "description": "Here's the current ball possession statistics for both teams – 28:72."
        },
        {
            "gameTime": "2 - 35:44",
            "label": "",
            "description": "Flag up against Georg Niedermeier (VfB Stuttgart). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 35:15",
            "label": "corner",
            "description": "Filip Kostic (VfB Stuttgart) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 35:03",
            "label": "",
            "description": "Florian Klein (VfB Stuttgart) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The referee signals a corner kick to VfB Stuttgart."
        },
        {
            "gameTime": "2 - 34:33",
            "label": "",
            "description": "Bastian Dankert blows his whistle and it's Douglas Costa (Bayern Munich) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 34:16",
            "label": "",
            "description": "Timo Werner (VfB Stuttgart) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 33:01",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "",
            "description": "Great touch by Thiago Alcantara (Bayern Munich) as he received a precise pass on the edge of the box. His powerful shot bounced off the goalkeeper’s gloves and hit the post."
        },
        {
            "gameTime": "2 - 31:54",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "2 - 31:19",
            "label": "",
            "description": "Bastian Dankert blows for a foul after Florian Klein (VfB Stuttgart) was too aggressive in the battle for the ball. Bayern Munich have a free kick."
        },
        {
            "gameTime": "2 - 30:12",
            "label": "",
            "description": "Artem Kravets (VfB Stuttgart) finds himself some space to meet a beautiful cross from the free kick, and from near the penalty spot he attempts to score with a header. His effort lacks accuracy and floats high over the bar."
        },
        {
            "gameTime": "2 - 29:55",
            "label": "",
            "description": "Filip Kostic (VfB Stuttgart) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "2 - 29:53",
            "label": "",
            "description": "Javi Martinez (Bayern Munich) makes a rough challenge and Bastian Dankert blows his whistle for a foul. It's a free kick to VfB Stuttgart in a dangerous position."
        },
        {
            "gameTime": "2 - 29:26",
            "label": "substitution",
            "description": "Pep Guardiola decides to make a substitution. Joshua Kimmich will be replaced by Douglas Costa (Bayern Munich)."
        },
        {
            "gameTime": "2 - 29:13",
            "label": "substitution",
            "description": "Substitution. Borys Tashchy (VfB Stuttgart) in, Lukas Rupp out."
        },
        {
            "gameTime": "2 - 28:37",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) had a good opportunity when he latched on to a cross from the wing, but his strike from near the penalty spot wasn't accurate at all and the ball went way wide of the right post. What a miss that is!"
        },
        {
            "gameTime": "2 - 28:11",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) tested Przemyslaw Tyton with a strike from just outside the box, but the effort is saved."
        },
        {
            "gameTime": "2 - 28:01",
            "label": "",
            "description": "Flag goes up against Rafinha (Bayern Munich) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 27:39",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Rafinha (Bayern Munich)."
        },
        {
            "gameTime": "2 - 26:45",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "2 - 26:16",
            "label": "",
            "description": "Bayern Munich enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 24:40",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Daniel Didavi (VfB Stuttgart) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 23:40",
            "label": "substitution",
            "description": "The substitution has been made. Thiago Alcantara (Bayern Munich) has replaced Mario Gotze."
        },
        {
            "gameTime": "2 - 22:12",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) receives a low pass just outside the box and unleashes a fine strike towards the bottom right corner. Przemyslaw Tyton pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "2 - 20:54",
            "label": "corner",
            "description": "Filip Kostic (VfB Stuttgart) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 20:41",
            "label": "",
            "description": "Filip Kostic (VfB Stuttgart) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. The referee points to the corner flag. It's a corner to VfB Stuttgart."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "soccer-ball",
            "description": "Goal! Daniel Didavi (VfB Stuttgart) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball into the top right corner. It's 1:2."
        },
        {
            "gameTime": "2 - 16:58",
            "label": "",
            "description": "Filip Kostic (VfB Stuttgart) takes a direct free kick."
        },
        {
            "gameTime": "2 - 16:57",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) commits an ugly challenge. The referee sees it and immediately blows his whistle. VfB Stuttgart win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 15:39",
            "label": "corner",
            "description": "Filip Kostic (VfB Stuttgart) sends the corner into the box, but Manuel Neuer intercepts it and averts the threat."
        },
        {
            "gameTime": "2 - 15:02",
            "label": "",
            "description": "Filip Kostic (VfB Stuttgart) takes the free kick and attempts to find some of his teammates inside the box, but the ball is intercepted and cleared out of danger. The ball is out of play. VfB Stuttgart will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 14:26",
            "label": "y-card",
            "description": "David Alaba (Bayern Munich) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Bastian Dankert ignores the protests. VfB Stuttgart are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 12:21",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball goes out of play and VfB Stuttgart will have a goal kick."
        },
        {
            "gameTime": "2 - 10:33",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) launches into a thunderous tackle on his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 07:45",
            "label": "",
            "description": "Filip Kostic (VfB Stuttgart) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "2 - 06:54",
            "label": "soccer-ball",
            "description": "Goal! David Alaba (Bayern Munich) finds himself some space inside the box to get on the end of a pass from Juan Bernat, then sends the ball into the bottom left corner. 0:2."
        },
        {
            "gameTime": "2 - 05:18",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Filip Kostic (VfB Stuttgart)."
        },
        {
            "gameTime": "2 - 04:27",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) swings a cross into the box, but it's far too close to Przemyslaw Tyton, who smothers the ball."
        },
        {
            "gameTime": "2 - 04:06",
            "label": "",
            "description": "A lofted cross from Franck Ribery (Bayern Munich) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 03:20",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 02:30",
            "label": "",
            "description": "Rafinha (Bayern Munich) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "2 - 01:26",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We have seen a few chances and nice movements, but the overall impression of the game is rather average and not hugely entertaining. During the first 45 minutes, we have witnessed the ascendency of the visiting team who have been precise and effective. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:29",
            "label": "y-card",
            "description": "Daniel Didavi (VfB Stuttgart) has tested the patience of referee Bastian Dankert and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:32",
            "label": "corner",
            "description": "Filip Kostic (VfB Stuttgart) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 44:15",
            "label": "",
            "description": "Timo Werner (VfB Stuttgart) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee and his assistant both point at the corner flag. VfB Stuttgart will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 43:41",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Franck Ribery (Bayern Munich)."
        },
        {
            "gameTime": "1 - 43:19",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. Bayern Munich win a corner."
        },
        {
            "gameTime": "1 - 42:16",
            "label": "",
            "description": "The linesman raises his flag for offside before Artem Kravets (VfB Stuttgart) heads on."
        },
        {
            "gameTime": "1 - 40:56",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) is caught offside!"
        },
        {
            "gameTime": "1 - 40:26",
            "label": "corner",
            "description": "Franck Ribery (Bayern Munich) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 40:02",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention. Bayern Munich force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 38:18",
            "label": "corner",
            "description": "The corner by Filip Kostic (VfB Stuttgart) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 37:50",
            "label": "corner",
            "description": "Filip Kostic (VfB Stuttgart) takes the corner, but the opposition's defence is ready and clears the ball to safety. Good work from VfB Stuttgart as they win a corner."
        },
        {
            "gameTime": "1 - 37:38",
            "label": "",
            "description": "Filip Kostic (VfB Stuttgart) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. VfB Stuttgart force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 36:59",
            "label": "y-card",
            "description": "A yellow card for a tackle by Xabi Alonso (Bayern Munich). Bastian Dankert doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 35:43",
            "label": "corner",
            "description": "The resulting corner from Franck Ribery (Bayern Munich) is cleared."
        },
        {
            "gameTime": "1 - 35:28",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The ball goes out of play. Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "1 - 34:32",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) controls a cross inside the six yard box, but sends his shot slightly wide of the left post."
        },
        {
            "gameTime": "1 - 34:03",
            "label": "",
            "description": "Rafinha (Bayern Munich) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 33:41",
            "label": "",
            "description": "Bayern Munich seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 30:58",
            "label": "soccer-ball-own",
            "description": "This is definitely not what Georg Niedermeier (VfB Stuttgart) wanted. Attempting to intercept an offensive pass, he scored an own goal and made it 0:1."
        },
        {
            "gameTime": "1 - 28:46",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the roof of the net, but Przemyslaw Tyton is alert and denies him with a nice save."
        },
        {
            "gameTime": "1 - 27:45",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Bayern Munich."
        },
        {
            "gameTime": "1 - 26:11",
            "label": "substitution",
            "description": "Substitution. Arturo Vidal walks off the pitch and Thomas Muller (Bayern Munich) comes on as a substitute."
        },
        {
            "gameTime": "1 - 24:11",
            "label": "",
            "description": "Artem Kravets (VfB Stuttgart) is penalised for a foul. Bastian Dankert had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 23:19",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "1 - 21:42",
            "label": "y-card",
            "description": "Bastian Dankert shows a yellow card to Arturo Vidal (Bayern Munich) for a tough tackle."
        },
        {
            "gameTime": "1 - 20:02",
            "label": "",
            "description": "The foul by Juan Bernat (Bayern Munich) was seen by Bastian Dankert who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 19:18",
            "label": "",
            "description": "A cross from Juan Bernat (Bayern Munich) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 18:20",
            "label": "",
            "description": "The ball falls to Florian Klein (VfB Stuttgart) on the edge of the box, but his shot goes well wide of the goal."
        },
        {
            "gameTime": "1 - 18:15",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Filip Kostic (VfB Stuttgart), was easily dealt with by one of the defenders."
        },
        {
            "gameTime": "1 - 17:16",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) gives away a foul for a clumsy challenge. Referee Bastian Dankert saw the whole situation. VfB Stuttgart are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 15:22",
            "label": "",
            "description": "Filip Kostic (VfB Stuttgart) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 15:09",
            "label": "",
            "description": "Javi Martinez (Bayern Munich) should know this behaviour is beyond the rules. He was too careless with his challenge and left Bastian Dankert no option but to blow his whistle. VfB Stuttgart earn a free kick."
        },
        {
            "gameTime": "1 - 14:26",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "1 - 12:47",
            "label": "",
            "description": "A crossfield pass from Xabi Alonso (Bayern Munich) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 11:47",
            "label": "corner",
            "description": "Filip Kostic (VfB Stuttgart) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 11:01",
            "label": "",
            "description": "Daniel Didavi (VfB Stuttgart) clutches his head in despair after blowing a huge opportunity! He receives the ball after the free kick and takes good first touch to unleash a low shot from close range, but Manuel Neuer makes a nice save. It will be a corner kick for VfB Stuttgart."
        },
        {
            "gameTime": "1 - 11:00",
            "label": "",
            "description": "Filip Kostic (VfB Stuttgart) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 10:33",
            "label": "",
            "description": "Rafinha (Bayern Munich) brings his opponent down. Bastian Dankert has a clear sight of it and blows his whistle for a foul. A free kick has been awarded to VfB Stuttgart."
        },
        {
            "gameTime": "1 - 09:42",
            "label": "",
            "description": "Artem Kravets (VfB Stuttgart) sends a teasing cross into the area, but Manuel Neuer intercepts the ball."
        },
        {
            "gameTime": "1 - 08:21",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 07:07",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) fails to find a teammate across the pitch with a long ball. The ball is off of the pitch and it's a goal kick for VfB Stuttgart."
        },
        {
            "gameTime": "1 - 06:43",
            "label": "",
            "description": "The ball is cleared after Franck Ribery (Bayern Munich) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 05:58",
            "label": "",
            "description": "The linesman signals that Mario Gotze (Bayern Munich) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 03:33",
            "label": "",
            "description": "Great teamplay by Bayern Munich as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 02:59",
            "label": "",
            "description": "Artem Kravets (VfB Stuttgart) is flagged for offside."
        },
        {
            "gameTime": "1 - 02:09",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 01:53",
            "label": "",
            "description": "Filip Kostic (VfB Stuttgart) dinks a fine lofted pass from the free kick. However, one of the defenders heads the ball out of danger."
        },
        {
            "gameTime": "1 - 01:02",
            "label": "",
            "description": "VfB Stuttgart win a free kick. Arturo Vidal (Bayern Munich) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 00:02",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "",
            "description": "The players are out and the match is about to start. VfB Stuttgart will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bastian Dankert will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The away side was dominant and dictated the tempo of the game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        }
    ],
    "gameAwayTeam": "Bayern Munich",
    "gameDate": "09/04/2016 - 16:30",
    "gameHomeTeam": "VfB Stuttgart",
    "gameScore": "1 - 3"
}