{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2014-2015/2015-04-26 - 16-00 Torino 2 - 1 Juventus/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "What a terrific football game that was, with everything included. There wasn't any significant dominance by either side in this game. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 50:21",
            "label": "whistle",
            "description": "Paolo Tagliavento is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:05",
            "label": "",
            "description": "It wasn't the best example of how to strike the ball. Andrea Pirlo (Juventus) unleashed a first time shot from the edge of the box that went high over the crossbar. The ball is off of the pitch and it's a goal kick for Torino."
        },
        {
            "gameTime": "2 - 46:32",
            "label": "",
            "description": "The game is interrupted as Fabio Quagliarella (Torino) is flagged offside."
        },
        {
            "gameTime": "2 - 45:38",
            "label": "",
            "description": "What a wasted chance that is! An inch perfect cross into the box finds Alessandro Matri (Juventus) who sends his header well wide of the left post. The ball is off of the pitch and it's a goal kick for Torino."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 5 min. of added time."
        },
        {
            "gameTime": "2 - 43:22",
            "label": "corner",
            "description": "The resulting corner from Andrea Pirlo (Juventus) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 43:04",
            "label": "",
            "description": "Alessandro Matri (Juventus) blasts the ball from just outside the box, but his attempt is blocked by the defender. Juventus force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 42:43",
            "label": "y-card",
            "description": "Giuseppe Vives (Torino) attempts to discuss the decision with Paolo Tagliavento, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "2 - 41:44",
            "label": "",
            "description": "The Juventus players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 40:49",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Simone Padoin as he is replaced by Fernando Llorente (Juventus)."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "",
            "description": "Joseph Martinez (Torino) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 39:24",
            "label": "",
            "description": "Emiliano Moretti (Torino) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 38:43",
            "label": "injury",
            "description": "The game is interrupted now, Emiliano Moretti (Torino) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 37:51",
            "label": "",
            "description": "Andrea Pirlo (Juventus) finds himself with a great opportunity! He unleashes a shot from the edge of the box, which whizzes just wide of the right post! The ball goes out of play and Torino will have a goal kick."
        },
        {
            "gameTime": "2 - 36:47",
            "label": "substitution",
            "description": "That will be all from Matteo Darmian who is being replaced by the fresh legs of Cristian Molinaro (Torino)."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "",
            "description": "Joseph Martinez (Torino) has a goal ruled out for offside!"
        },
        {
            "gameTime": "2 - 34:11",
            "label": "",
            "description": "Arturo Vidal (Juventus) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar. The ball goes out of play and Torino will have a goal kick."
        },
        {
            "gameTime": "2 - 32:13",
            "label": "substitution",
            "description": "Roberto Pereyra comes off the pitch to be replaced by Simone Pepe (Juventus)."
        },
        {
            "gameTime": "2 - 31:57",
            "label": "y-card",
            "description": "A yellow card for a tackle by Leonardo Bonucci (Juventus). Paolo Tagliavento doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 30:53",
            "label": "",
            "description": "Alessandro Matri (Juventus) rises above the defence inside the box, but his header flies narrowly wide of the left post. The ball is off of the pitch and it's a goal kick for Torino."
        },
        {
            "gameTime": "2 - 30:20",
            "label": "corner",
            "description": "Gianluigi Buffon comes off his line to intercept the corner from Omar El Kaddouri (Torino)."
        },
        {
            "gameTime": "2 - 29:42",
            "label": "",
            "description": "Nice touch by Fabio Quagliarella (Torino) as he latched on to an accurate cross and attempted to direct the ball with a fine header towards the net, but the goalkeeper reacted quickly to keep it out. Torino earn a corner."
        },
        {
            "gameTime": "2 - 29:03",
            "label": "",
            "description": "Carlos Tevez (Juventus) commits a foul and Paolo Tagliavento immediately signals a free kick."
        },
        {
            "gameTime": "2 - 28:39",
            "label": "",
            "description": "What a miskick by Giuseppe Vives (Torino). He smashes a volley from long distance that goes into the stands. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "2 - 26:37",
            "label": "substitution",
            "description": "Substitution. Giuseppe Vives (Torino) receives a signal from the referee and is now allowed to enter the pitch as Marco Benassi walks off."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "y-card",
            "description": "It's like he was asking for a caution. Emiliano Moretti (Torino) receives a yellow card."
        },
        {
            "gameTime": "2 - 24:46",
            "label": "",
            "description": "Alessandro Matri (Juventus) had a good opportunity when he latched on to a cross from the wing, but his header wasn't accurate at all and the ball went well wide of the right post."
        },
        {
            "gameTime": "2 - 21:40",
            "label": "",
            "description": "Alessandro Matri (Juventus) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 21:08",
            "label": "",
            "description": "Omar El Kaddouri (Torino) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 20:20",
            "label": "",
            "description": "Fabio Quagliarella (Torino) got the ball on the edge of the box and fired in a first time shot on goal, but his effort floated well over the bar. High, wide and not at all handsome. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "2 - 19:51",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Alvaro Morata will be replaced by Carlos Tevez (Juventus)."
        },
        {
            "gameTime": "2 - 18:38",
            "label": "",
            "description": "Alvaro Morata (Juventus) is unable to feed an accurate cross into the box. The ball is off of the pitch and it's a goal kick for Torino."
        },
        {
            "gameTime": "2 - 16:52",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) plants a nice towering header goalwards, but one of the defenders is in the right place at the right time and makes a vital clearance."
        },
        {
            "gameTime": "2 - 15:40",
            "label": "substitution",
            "description": "Here is a change. Maxi Lopez is going off and Giampiero Ventura gives the last tactical orders to Joseph Martinez (Torino)."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "",
            "description": "Andrea Pirlo (Juventus) whips a long ball in from the free kick which is intercepted by Daniele Padelli."
        },
        {
            "gameTime": "2 - 14:01",
            "label": "y-card",
            "description": "Alessandro Gazzi (Torino) has tested the patience of referee Paolo Tagliavento and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 11:18",
            "label": "soccer-ball",
            "description": "Fabio Quagliarella (Torino) received a delightful pass inside the box before slotting the ball past the goalkeeper. What a brilliant finish!"
        },
        {
            "gameTime": "2 - 10:59",
            "label": "",
            "description": "Matteo Darmian (Torino) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 10:32",
            "label": "injury",
            "description": "Matteo Darmian (Torino) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 07:56",
            "label": "",
            "description": "Omar El Kaddouri (Torino) brings an opponent down and Paolo Tagliavento interrupts the game."
        },
        {
            "gameTime": "2 - 06:55",
            "label": "",
            "description": "Andrea Pirlo (Juventus) takes a mid range free kick and his beautiful strike only rattles the right post."
        },
        {
            "gameTime": "2 - 06:15",
            "label": "",
            "description": "Alessandro Gazzi (Torino) makes a rough challenge and Paolo Tagliavento blows his whistle for a foul. Juventus have a free kick."
        },
        {
            "gameTime": "2 - 05:24",
            "label": "corner",
            "description": "Andrea Pirlo (Juventus) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 05:03",
            "label": "",
            "description": "Alessandro Matri (Juventus) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. The referee signals a corner kick to Juventus."
        },
        {
            "gameTime": "2 - 04:03",
            "label": "",
            "description": "Roberto Pereyra (Juventus) is penalised for a foul. Paolo Tagliavento had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 03:47",
            "label": "",
            "description": "Andrea Pirlo (Juventus) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 03:03",
            "label": "",
            "description": "The Juventus players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 01:34",
            "label": "",
            "description": "Matteo Darmian (Torino) serves up a nice cross, but Gianluigi Buffon punches the ball away."
        },
        {
            "gameTime": "2 - 00:50",
            "label": "",
            "description": "Paolo Tagliavento blows for a foul after Alvaro Morata (Juventus) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Although it hasn't been the most inspiring of performances so far, both teams have had their moments, and we might very well witness some thrilling football in the second half. Neither side is enjoying any significant control of the game. The home team makes a lot of passes and attempts to maintain possession. The same goes for the away side."
        },
        {
            "gameTime": "1 - 45:57",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "soccer-ball",
            "description": "Matteo Darmian (Torino) changes the scoreline after getting on the end of a brilliant pass and firing a precise shot that goes inside the right post!"
        },
        {
            "gameTime": "1 - 42:36",
            "label": "",
            "description": "Stefano Sturaro (Juventus) makes a slide tackle, but referee Paolo Tagliavento blows for a foul."
        },
        {
            "gameTime": "1 - 41:21",
            "label": "",
            "description": "Nikola Maksimovic (Torino) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "1 - 38:01",
            "label": "",
            "description": "Juventus hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "1 - 35:50",
            "label": "",
            "description": "Fabio Quagliarella (Torino) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 34:51",
            "label": "soccer-ball",
            "description": "Andrea Pirlo (Juventus) changes the score with this magnificent free kick from just outside the box. The shot went in off the bar and the goalkeeper didn't have a chance."
        },
        {
            "gameTime": "1 - 33:13",
            "label": "",
            "description": "Paolo Tagliavento blows his whistle after Alessandro Gazzi (Torino) brings one of his opponents down with a strong tackle. Juventus earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 32:21",
            "label": "",
            "description": "Roberto Pereyra (Juventus) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "1 - 30:50",
            "label": "",
            "description": "Daniele Padelli pulls off a great save to block a header from Alvaro Morata (Juventus) after a nice lofted cross."
        },
        {
            "gameTime": "1 - 28:06",
            "label": "",
            "description": "The linesman raises his flag. Maxi Lopez (Torino) is adjudged offside."
        },
        {
            "gameTime": "1 - 25:52",
            "label": "",
            "description": "Fabio Quagliarella (Torino) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards wide of the left post. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "1 - 24:58",
            "label": "",
            "description": "Matteo Darmian (Torino) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the left post. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "1 - 21:53",
            "label": "",
            "description": "Paolo Tagliavento blows his whistle as Fabio Quagliarella (Torino) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 19:59",
            "label": "",
            "description": "Bruno Peres (Torino) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 17:18",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Roberto Pereyra (Juventus) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 16:33",
            "label": "",
            "description": "A cross from the free kick is whipped in by Nikola Maksimovic (Torino), but one of the defenders steps in and averts the threat."
        },
        {
            "gameTime": "1 - 15:48",
            "label": "",
            "description": "Fabio Quagliarella (Torino) makes a bad challenge and the referee blows his whistle for a foul. Juventus are awarded a free kick."
        },
        {
            "gameTime": "1 - 14:45",
            "label": "",
            "description": "Paolo Tagliavento blows his whistle. Leonardo Bonucci (Juventus) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 12:32",
            "label": "",
            "description": "Alessandro Matri (Juventus) comes close to scoring. He peels away from his marker and gets on the end of a cross from Andrea Pirlo, but he hits a shot just over the crossbar."
        },
        {
            "gameTime": "1 - 11:24",
            "label": "",
            "description": "Matteo Darmian (Torino) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 09:47",
            "label": "",
            "description": "Good movement by Bruno Peres (Torino), but he can't find any of his teammates as the cross is poor. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "1 - 09:07",
            "label": "",
            "description": "The foul by Alvaro Morata (Juventus) was seen by Paolo Tagliavento who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 08:08",
            "label": "",
            "description": "Fabio Quagliarella (Torino) meets a delivery on the edge of the penalty area and shoots towards to the bottom left corner. He didn't put enough power into the effort, though, and Gianluigi Buffon pulls off an easy save."
        },
        {
            "gameTime": "1 - 06:23",
            "label": "",
            "description": "Marco Benassi (Torino) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball miles of the left post. Nice run, but poor finish! The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "1 - 04:27",
            "label": "",
            "description": "Poor challenge! Nikola Maksimovic (Torino) is penalised for tripping and Paolo Tagliavento blows his whistle."
        },
        {
            "gameTime": "1 - 02:17",
            "label": "corner",
            "description": "The corner from Omar El Kaddouri (Torino) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 01:57",
            "label": "corner",
            "description": "The corner from Omar El Kaddouri (Torino) is intercepted by the defence. Torino force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 01:36",
            "label": "",
            "description": "A cross into the box from Bruno Peres (Torino) is cleared. The ball is out of play. Torino will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 00:59",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Alvaro Morata (Juventus), whose instinctive shot towards goal flashes inches over the top. The ball goes out of play and Torino will have a goal kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Juventus will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paolo Tagliavento is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a terrific football game that was, with everything included. There wasn't any significant dominance by either side in this game. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Juventus",
    "gameDate": "26/04/2015 - 16:00",
    "gameHomeTeam": "Torino",
    "gameScore": "2 - 1"
}