{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-04-20 - 23-00 Real Madrid 3 - 0 Villarreal/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. The home team had more of the game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was what is known as kick and rush football."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 47:20",
            "label": "injury",
            "description": "Looks like Cristiano Ronaldo (Real Madrid) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 42:28",
            "label": "corner",
            "description": "Jese (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 42:18",
            "label": "",
            "description": "Jese (Real Madrid) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 40:34",
            "label": "",
            "description": "Casemiro (Real Madrid) will miss the next game because of that yellow card."
        },
        {
            "gameTime": "2 - 39:01",
            "label": "y-card",
            "description": "Carlos Clos Gomez shows the yellow card to Casemiro (Real Madrid) for a heavy challenge."
        },
        {
            "gameTime": "2 - 38:10",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to introduce fresh legs, with Jese (Real Madrid) replacing Lucas."
        },
        {
            "gameTime": "2 - 36:15",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 20:5."
        },
        {
            "gameTime": "2 - 33:01",
            "label": "substitution",
            "description": "The game has come to an end for Luka Modric. He has contributed as much as he could today. He will be replaced by the fresh legs of James Rodriguez (Real Madrid)."
        },
        {
            "gameTime": "2 - 32:51",
            "label": "",
            "description": "Eric Bertrand Bailly (Villarreal) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 30:10",
            "label": "soccer-ball",
            "description": "What a hit! Luka Modric (Real Madrid) shows good composure inside the box to fire a first time shot into the middle of the net. 3:0."
        },
        {
            "gameTime": "2 - 30:01",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 29:26",
            "label": "corner",
            "description": "Isco (Real Madrid) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 29:17",
            "label": "injury",
            "description": "Eric Bertrand Bailly (Villarreal) picks up an injury."
        },
        {
            "gameTime": "2 - 28:28",
            "label": "",
            "description": "Karim Benzema (Real Madrid) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 27:52",
            "label": "substitution",
            "description": "Marcelino Garcia Toral decides to make a substitution. Manuel Trigueros will be replaced by Rodrigo Hernandez (Villarreal)."
        },
        {
            "gameTime": "2 - 27:34",
            "label": "substitution",
            "description": "Substitution. Toni Kroos is replaced by Isco (Real Madrid)."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 26:08",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a sweet pass into the penalty area, but one of the defenders averts the danger. The linesman points to the corner flag, Real Madrid are going to take it."
        },
        {
            "gameTime": "2 - 23:36",
            "label": "soccer-ball",
            "description": "Goal! Karim Benzema displays great vision and sends a pass to Lucas (Real Madrid), who shows brilliant composure inside the box to bury the ball inside the right post. The score is 2:0."
        },
        {
            "gameTime": "2 - 21:05",
            "label": "",
            "description": "Lucas (Real Madrid) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "2 - 18:11",
            "label": "substitution",
            "description": "Marcelino Garcia Toral has decided to substitute Adrian and he is replaced by Leo Baptistao (Villarreal)."
        },
        {
            "gameTime": "2 - 16:48",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Jonathan dos Santos walks off the pitch to be replaced by Samuel (Villarreal)."
        },
        {
            "gameTime": "2 - 15:59",
            "label": "",
            "description": "Half chance! Lucas (Real Madrid) plays a pass into the box, but Sergio Asenjo reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 13:42",
            "label": "attendance",
            "description": "The attendance is 62678."
        },
        {
            "gameTime": "2 - 10:03",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the right post."
        },
        {
            "gameTime": "2 - 07:47",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 06:13",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "2 - 04:22",
            "label": "",
            "description": "Luka Modric (Real Madrid) knew what to do with the ball, but was just a bit unlucky. After receiving a pass, he sent the ball goalwards from some 18 metres out, but he missed the right post by a whisker."
        },
        {
            "gameTime": "2 - 04:07",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 03:56",
            "label": "",
            "description": "The ball is cleared after Cristiano Ronaldo (Real Madrid) attempted to dribble past an opposing player. The ball goes out for a corner. Real Madrid can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 02:32",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) jumps for a header from the corner kick, but fails to steer the ball into the goal as it flies high over the bar."
        },
        {
            "gameTime": "2 - 02:23",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 02:17",
            "label": "",
            "description": "Luka Modric (Real Madrid) blasts the ball from just outside the box, but his attempt is blocked by the defender. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 01:03",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. The home side is dominant and dictating the tempo of the game, mainly because of their work rate and accurate passing. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:56",
            "label": "y-card",
            "description": "The referee gives a yellow card to Danilo (Real Madrid)."
        },
        {
            "gameTime": "1 - 43:08",
            "label": "y-card",
            "description": "The foul by Manuel Trigueros (Villarreal) is worthy of a card and a yellow is duly shown by Carlos Clos Gomez."
        },
        {
            "gameTime": "1 - 42:53",
            "label": "corner",
            "description": "Denis Suarez (Villarreal) works the corner short."
        },
        {
            "gameTime": "1 - 42:33",
            "label": "",
            "description": "Keylor Navas pulls off a great save to deny Cedric Bakambu (Villarreal), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal. Villarreal will take a corner kick."
        },
        {
            "gameTime": "1 - 40:38",
            "label": "soccer-ball",
            "description": "An unlucky rebound falls to Karim Benzema (Real Madrid) and he scores with a bullet header."
        },
        {
            "gameTime": "1 - 40:37",
            "label": "",
            "description": "A pass from Cristiano Ronaldo (Real Madrid) is intercepted by Sergio Asenjo and the move breaks down."
        },
        {
            "gameTime": "1 - 39:16",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "1 - 38:43",
            "label": "",
            "description": "The linesman raises his flag. Cristiano Ronaldo (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "1 - 36:48",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 36:40",
            "label": "",
            "description": "Marcelo (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 34:33",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 34:21",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "1 - 32:12",
            "label": "",
            "description": "Decent spell from Real Madrid here and they keep the pressure on until one of the defending players steps in. The referee and his assistant both point at the corner flag. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 29:15",
            "label": "",
            "description": "Adrian (Villarreal) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "1 - 26:32",
            "label": "",
            "description": "Cedric Bakambu (Villarreal) gets on the ball and beats an opponent, but his run is stopped by the referee Carlos Clos Gomez who sees an offensive foul."
        },
        {
            "gameTime": "1 - 24:06",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 21:04",
            "label": "corner",
            "description": "There's an opportunity for Toni Kroos (Real Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 19:52",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) unleashes a bullet of a shot that is blocked by a defender. Real Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 16:20",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Toni Kroos (Real Madrid) takes it short."
        },
        {
            "gameTime": "1 - 16:05",
            "label": "",
            "description": "Casemiro (Real Madrid) delivers a crossfield pass, but the ball is cut out before it reaches its intended target. Real Madrid win a corner."
        },
        {
            "gameTime": "1 - 15:37",
            "label": "",
            "description": "Real Madrid are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "1 - 13:51",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) and Marcelo combine well with a quick one two to trick their opponent."
        },
        {
            "gameTime": "1 - 10:58",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) decided to shoot after receiving a sweet pass. The ball went to the middle of the goal, but Sergio Asenjo made an easy save."
        },
        {
            "gameTime": "1 - 10:01",
            "label": "corner",
            "description": "The resulting corner from Toni Kroos (Real Madrid) is cleared by the defence."
        },
        {
            "gameTime": "1 - 09:37",
            "label": "",
            "description": "Marcelo (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 06:04",
            "label": "",
            "description": "Toni Kroos (Real Madrid) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "1 - 03:56",
            "label": "",
            "description": "Denis Suarez (Villarreal) unleashes a bullet of a shot that is blocked by a defender."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Clos Gomez is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. The home team had more of the game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was what is known as kick and rush football."
        }
    ],
    "gameAwayTeam": "Villarreal",
    "gameDate": "20/04/2016 - 23:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "3 - 0"
}