{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-09-10 - 17-00 Arsenal 2 - 1 Southampton/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 52:59",
            "label": "",
            "description": "All in all that was an entertaining game of football thanks to some decent attacking play. The hosts looked more lively and played better football. The home team played possession football and the away players really focused on a well organized defence."
        },
        {
            "gameTime": "2 - 52:22",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 48:59",
            "label": "soccer-ball",
            "description": "Santi Cazorla (Arsenal) smoothly converts the penalty with a beautiful low drive into the left side of the net."
        },
        {
            "gameTime": "2 - 48:58",
            "label": "",
            "description": "Santi Cazorla (Arsenal) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 48:57",
            "label": "y-card",
            "description": "Ryan Bertrand (Southampton) criticises the decision of the referee and immediately receives a yellow card."
        },
        {
            "gameTime": "2 - 48:56",
            "label": "y-card",
            "description": "A yellow card for bad language! Virgil Van Dijk (Southampton) couldn’t remain silent and the result is obvious."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "penalty",
            "description": "Jose Fonte (Southampton) trips an opposition player and Robert Madley signals a foul. PENALTY! A huge scoring opportunity for Arsenal."
        },
        {
            "gameTime": "2 - 45:55",
            "label": "y-card",
            "description": "Jose Fonte (Southampton) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "2 - 45:37",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 45:05",
            "label": "",
            "description": "Mesut Ozil (Arsenal) produces a lovely chip pass into the box, but one of the opposition players cuts it out. The referee points to the corner flag and Arsenal will take a corner."
        },
        {
            "gameTime": "2 - 43:37",
            "label": "",
            "description": "Mesut Ozil (Arsenal) sends a cross into the box, but Fraser Forster comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 42:32",
            "label": "",
            "description": "A cross is clipped into the penalty area by Alexis Sanchez (Arsenal) but poses no threat."
        },
        {
            "gameTime": "2 - 41:40",
            "label": "",
            "description": "Laurent Koscielny (Arsenal) takes a direct free kick."
        },
        {
            "gameTime": "2 - 40:55",
            "label": "y-card",
            "description": "Pierre Emile Hojbjerg (Southampton) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "",
            "description": "Great ball in from Santi Cazorla. Olivier Giroud (Arsenal) should really have done better with a close range header, but he heads it a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 38:47",
            "label": "corner",
            "description": "The corner by James Ward Prowse (Southampton) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "2 - 38:14",
            "label": "",
            "description": "Pierre Emile Hojbjerg (Southampton) picks up the rebound inside the penalty area and releases a good shot to the bottom left corner. Unfortunately for him, Petr Cech shows how quick his reflexes are and dives superbly to stop his effort. What a save but what a wasted opportunity! Southampton will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 38:10",
            "label": "",
            "description": "What a sweet touch by Shane Long (Southampton) as he collects a pass. From near the edge of the box he produces a shot which goes towards the left post, but the goalkeeper pulls off a decent save to thwart him!"
        },
        {
            "gameTime": "2 - 36:00",
            "label": "",
            "description": "Santi Cazorla (Arsenal) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "2 - 35:31",
            "label": "",
            "description": "James Ward Prowse (Southampton) brings his opponent down with a tackle and Robert Madley blows his whistle for a foul. Arsenal are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 34:39",
            "label": "substitution",
            "description": "That's the end of the game for Dusan Tadic, who is replaced by James Ward Prowse (Southampton)."
        },
        {
            "gameTime": "2 - 34:14",
            "label": "",
            "description": "Olivier Giroud (Arsenal) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 33:36",
            "label": "",
            "description": "Nacho Monreal (Arsenal) connects with an accurate pass inside the box and fires the ball to the bottom right corner, but one of the defending players steps in to block the effort. The referee blows his whistle, Arsenal are awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:41",
            "label": "",
            "description": "What a great touch by Santi Cazorla (Arsenal) as he controls a fine pass into the box and takes a shot to the bottom left corner, but an opposing player makes a clearance. Great defending."
        },
        {
            "gameTime": "2 - 29:49",
            "label": "substitution",
            "description": "A substitution has been made. Theo Walcott goes off and Alex Iwobi (Arsenal) comes on."
        },
        {
            "gameTime": "2 - 29:14",
            "label": "",
            "description": "Shane Long (Southampton) wins himself enough space to connect with a cross inside the box, but his fine header goes narrowly over the crossbar!"
        },
        {
            "gameTime": "2 - 28:54",
            "label": "",
            "description": "Steven Davis (Southampton) takes a direct free kick."
        },
        {
            "gameTime": "2 - 28:30",
            "label": "",
            "description": "Theo Walcott (Arsenal) was trying to get to the ball but clattered into the legs of the opponent as well. Robert Madley blows his whistle for an infringement. Southampton are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 27:00",
            "label": "",
            "description": "Nathan Redmond (Southampton) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "2 - 25:26",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 25:15",
            "label": "attendance",
            "description": "The attendance is 59962."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "",
            "description": "The linesman signals that Nathan Redmond (Southampton) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 22:44",
            "label": "",
            "description": "Mesut Ozil sprays a wonderful pass out to Alexis Sanchez (Arsenal), who cannot get enough power or direction to cause Fraser Forster problems and the goalkeeper is able to watch the ball go just over the crossbar."
        },
        {
            "gameTime": "2 - 21:13",
            "label": "",
            "description": "CHANCE! Shane Long (Southampton) fires just wide of the left post from inside the box after running onto a splendid pass from Dusan Tadic."
        },
        {
            "gameTime": "2 - 18:55",
            "label": "substitution",
            "description": "Substitution. Jordy Clasie did his best and is replaced by Pierre Emile Hojbjerg (Southampton)."
        },
        {
            "gameTime": "2 - 18:55",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 18:05",
            "label": "",
            "description": "Mesut Ozil (Arsenal) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. Arsenal force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 16:49",
            "label": "substitution",
            "description": "Arsene Wenger has decided to make a change. Alexis Sanchez (Arsenal) replaces Alex Oxlade Chamberlain."
        },
        {
            "gameTime": "2 - 16:36",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Olivier Giroud (Arsenal) comes onto the pitch for Lucas Perez."
        },
        {
            "gameTime": "2 - 15:36",
            "label": "",
            "description": "Hector Bellerin (Arsenal) blows an opportunity as he sends a rebound from just outside of the box narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 12:06",
            "label": "",
            "description": "The ball is out of play. Southampton will take a throw in."
        },
        {
            "gameTime": "2 - 08:55",
            "label": "y-card",
            "description": "That will be a yellow card for one of the players. The one who gets booked is Fraser Forster (Southampton)."
        },
        {
            "gameTime": "2 - 08:26",
            "label": "",
            "description": "A dangerous towering header by Theo Walcott (Arsenal) from around the penalty spot goes just wide of the right post. This corner kick didn't change the score."
        },
        {
            "gameTime": "2 - 07:55",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 07:42",
            "label": "",
            "description": "Hector Bellerin (Arsenal) sends a pass into the penalty area, but the opponent manages to cut it out. Arsenal will take a corner kick."
        },
        {
            "gameTime": "2 - 07:32",
            "label": "",
            "description": "Arsenal are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "2 - 03:55",
            "label": "",
            "description": "Santi Cazorla (Arsenal) will take the free kick."
        },
        {
            "gameTime": "2 - 03:37",
            "label": "",
            "description": "Robert Madley blows the whistle, Jordy Clasie (Southampton) is penalised for a foul. That's a free kick to Arsenal."
        },
        {
            "gameTime": "2 - 00:52",
            "label": "substitution",
            "description": "That will be all from Jay Rodriguez who is being replaced by the fresh legs of Shane Long (Southampton)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Robert Madley starts the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Both sides have been very active in the first half, providing the fans with an exciting show. The home side dominated the first half in most aspects of the game, but the visitors will surely attempt to turn the situation around in the second half. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 47:14",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Robert Madley has ended it."
        },
        {
            "gameTime": "1 - 46:55",
            "label": "",
            "description": "Referee Robert Madley sees the trip by Theo Walcott (Arsenal) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "",
            "description": "Shkodran Mustafi (Arsenal) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:22",
            "label": "",
            "description": "Lucas Perez (Arsenal) misses a good chance to score. A perfect cross into the box finds Lucas Perez (Arsenal) who rises for a header, but he sends the ball well over the bar. The ball goes out of play and Southampton will have a goal kick."
        },
        {
            "gameTime": "1 - 42:53",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 42:25",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety. Arsenal earn a corner."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Southampton hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 35:27",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "1 - 32:55",
            "label": "",
            "description": "Santi Cazorla (Arsenal) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 32:44",
            "label": "",
            "description": "Nathan Redmond (Southampton) fouls an opponent. At least that's what referee Robert Madley signals. Free kick. Arsenal will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 31:58",
            "label": "",
            "description": "Some great controlled play and passing from Arsenal. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 28:50",
            "label": "soccer-ball",
            "description": "Goal! Laurent Koscielny (Arsenal) fires the rebound inside the right post after the ball breaks to him in the box. The score is 1:1."
        },
        {
            "gameTime": "1 - 28:30",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 28:22",
            "label": "",
            "description": "This shall not pass! Nacho Monreal (Arsenal) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. The linesman points to the corner flag, Arsenal are going to take it."
        },
        {
            "gameTime": "1 - 27:53",
            "label": "",
            "description": "Theo Walcott (Arsenal) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 27:04",
            "label": "",
            "description": "Nathan Redmond (Southampton) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 25:50",
            "label": "",
            "description": "Fraser Forster (Southampton) takes a direct free kick."
        },
        {
            "gameTime": "1 - 25:45",
            "label": "y-card",
            "description": "Santi Cazorla (Arsenal) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "1 - 22:15",
            "label": "",
            "description": "The ball is behind the touchline and Southampton will take a throw in."
        },
        {
            "gameTime": "1 - 17:52",
            "label": "soccer-ball-own",
            "description": "OWN GOAL! The free kick is whipped in and the ball hits Petr Cech (Arsenal), who finds the back of his own net. 0:1."
        },
        {
            "gameTime": "1 - 17:51",
            "label": "",
            "description": "Dusan Tadic (Southampton) fires in the free kick from a promising position just outside the box. It's a fantastic strike and looks set for glory, but it only rattles the crossbar!"
        },
        {
            "gameTime": "1 - 17:50",
            "label": "",
            "description": "Dusan Tadic (Southampton) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 15:55",
            "label": "y-card",
            "description": "Nacho Monreal (Arsenal) gets booked for the first time in this match."
        },
        {
            "gameTime": "1 - 14:02",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 11:44",
            "label": "",
            "description": "Alves Cedric (Southampton) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 11:07",
            "label": "",
            "description": "Shkodran Mustafi (Arsenal) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "1 - 09:10",
            "label": "",
            "description": "Mesut Ozil (Arsenal) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "1 - 07:41",
            "label": "",
            "description": "Lucas Perez (Arsenal) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "1 - 04:45",
            "label": "",
            "description": "Jay Rodriguez (Southampton) climbs high to connect with a cross near the penalty spot but plants a header high over the bar."
        },
        {
            "gameTime": "1 - 02:59",
            "label": "",
            "description": "Petr Cech (Arsenal) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 02:49",
            "label": "",
            "description": "The linesman raises his flag for offside before Dusan Tadic (Southampton) heads on."
        },
        {
            "gameTime": "1 - 01:44",
            "label": "",
            "description": "Steven Davis (Southampton) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Arsenal will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Robert Madley will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Southampton have only 45 points from 36 games this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "From a total of 36 games that Southampton played there were 17 matches with under 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Arsenal have signed: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining game of football thanks to some decent attacking play. The hosts looked more lively and played better football. The home team played possession football and the away players really focused on a well organized defence."
        }
    ],
    "gameAwayTeam": "Southampton",
    "gameDate": "10/09/2016 - 17:00",
    "gameHomeTeam": "Arsenal",
    "gameScore": "2 - 1"
}