{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-09-24 - 21-45 Napoli 2 - 0 Chievo/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. Great display from the home side, you have to say that they were the better side today. The home team attempted to leave the opposition defence outnumbered and hit them on the break. The visitors tried to keep the ball on the ground and play a passing game."
        },
        {
            "gameTime": "2 - 48:17",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 47:16",
            "label": "",
            "description": "Antonio Floro Flores (Chievo) receives a fine low pass and attempts to send the ball past the goalkeeper, but his shot goes wide of the goal."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:37",
            "label": "",
            "description": "Dries Mertens (Napoli) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 42:14",
            "label": "",
            "description": "A free kick from the side was taken by Jonathan de Guzman (Chievo), but he didn't find any of his teammates with his lofted pass."
        },
        {
            "gameTime": "2 - 41:09",
            "label": "",
            "description": "The referee blows his whistle as Dries Mertens (Napoli) was too aggressive in his challenge. Another situation results in a direct free kick for Chievo."
        },
        {
            "gameTime": "2 - 38:04",
            "label": "",
            "description": "Jonathan de Guzman (Chievo) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 35:17",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 13:7."
        },
        {
            "gameTime": "2 - 35:08",
            "label": "substitution",
            "description": "Substitution. Lorenzo Insigne walks off the pitch and Dries Mertens (Napoli) comes on as a substitute."
        },
        {
            "gameTime": "2 - 34:01",
            "label": "",
            "description": "Roberto Inglese (Chievo) decided to shoot after receiving a sweet pass. If it wasn't for Pepe Reina's superb save the ball would have probably ended up in the bottom right corner."
        },
        {
            "gameTime": "2 - 30:26",
            "label": "y-card",
            "description": "Marco Di Bello shows a yellow card to Lucas Castro (Chievo) for his blatant foul."
        },
        {
            "gameTime": "2 - 29:32",
            "label": "corner",
            "description": "The corner kick from Jonathan de Guzman (Chievo) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 29:13",
            "label": "",
            "description": "Jonathan de Guzman (Chievo) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net. Chievo get a corner."
        },
        {
            "gameTime": "2 - 26:46",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) sends a long ball in, but Stefano Sorrentino comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 25:16",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 22:59",
            "label": "substitution",
            "description": "Maurizio Sarri decides to make a substitution. Jorginho will be replaced by Allan (Napoli)."
        },
        {
            "gameTime": "2 - 22:17",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Jose Callejon (Napoli), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "2 - 21:52",
            "label": "",
            "description": "Chievo are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Arkadiusz Milik (Napoli) comes onto the pitch for Manolo Gabbiadini."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "substitution",
            "description": "Substitution. Jonathan de Guzman (Chievo) receives a signal from the referee and is now allowed to enter the pitch as Valter Birsa walks off."
        },
        {
            "gameTime": "2 - 16:58",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Fabrizio Cacciatore leaves the pitch and Mariano Izco (Chievo) comes on."
        },
        {
            "gameTime": "2 - 14:21",
            "label": "",
            "description": "Valter Birsa (Chievo) produces a long range cannon of a shot after a nice pass. The ball heads under the crossbar, but is stopped by a great save from Pepe Reina."
        },
        {
            "gameTime": "2 - 12:16",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Riccardo Meggiorini walks off the pitch to be replaced by Antonio Floro Flores (Chievo)."
        },
        {
            "gameTime": "2 - 11:52",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 11:10",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. The ball is out of play. Napoli will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 10:31",
            "label": "",
            "description": "Lucas Castro (Chievo) swings a cross into the box, but it's far too close to Pepe Reina, who smothers the ball."
        },
        {
            "gameTime": "2 - 08:04",
            "label": "y-card",
            "description": "Dario Dainelli (Chievo) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "2 - 07:14",
            "label": "",
            "description": "Perparim Hetemaj (Chievo) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 03:39",
            "label": "",
            "description": "Jose Callejon (Napoli) strikes a volley towards goal, but one of the defenders blocks his effort."
        },
        {
            "gameTime": "2 - 02:33",
            "label": "",
            "description": "Chievo are happy showing off their ball keeping skills and that is only interrupted when the defender steps in. The linesman signals a throw in for Napoli."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Marco Di Bello starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Both sides have been very active in the first 45 minutes, providing the fans with an exciting show. Napoli were controlling the game for most of the first half. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:19",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) takes the free kick from mid range, but he balloons his effort high over the bar. What a miskick!"
        },
        {
            "gameTime": "1 - 43:43",
            "label": "y-card",
            "description": "It must be a yellow card. It is. Bostjan Cesar (Chievo) receives the caution after an awful tackle."
        },
        {
            "gameTime": "1 - 42:27",
            "label": "y-card",
            "description": "Raul Albiol (Napoli) is booked after bringing down an opponent. Marco Di Bello had an easy decision to make."
        },
        {
            "gameTime": "1 - 41:46",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "1 - 38:49",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Lorenzo Insigne, who plays a vital role in the build up. He squares it to Marek Hamsik (Napoli), who beats Stefano Sorrentino with a brilliant shot into the right side of the net. 2:0."
        },
        {
            "gameTime": "1 - 36:58",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) has a go from a long way out but it sails way over."
        },
        {
            "gameTime": "1 - 35:49",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) meets a cross inside the box, but Stefano Sorrentino wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "1 - 35:06",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 33:46",
            "label": "injury",
            "description": "The game is interrupted now, Kalidou Koulibaly (Napoli) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 33:09",
            "label": "corner",
            "description": "Valter Birsa (Chievo) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 32:57",
            "label": "",
            "description": "Roberto Inglese (Chievo) slaloms his way past challenges, but an opposing player does well to get the ball away. The referee points to the corner flag. It's a corner to Chievo."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "",
            "description": "Riccardo Meggiorini (Chievo) sent a pass onto Valter Birsa, who didn't get a chance to finish."
        },
        {
            "gameTime": "1 - 29:38",
            "label": "corner",
            "description": "Jose Callejon (Napoli) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 28:51",
            "label": "",
            "description": "Jorginho (Napoli) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. The referee and his assistant both point at the corner flag. Napoli will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 28:38",
            "label": "",
            "description": "Napoli control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 26:16",
            "label": "",
            "description": "Perparim Hetemaj (Chievo) sends a cross into the box, but Pepe Reina comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 23:37",
            "label": "soccer-ball",
            "description": "Goal! Manolo Gabbiadini (Napoli) finds himself some space inside the box to get on the end of a pass from Jose Callejon, then sends the ball inside the left post. 1:0."
        },
        {
            "gameTime": "1 - 20:08",
            "label": "",
            "description": "CHANCE! Marek Hamsik (Napoli) picks up a pass inside the box and has a sight of goal, but he blazes his shot well over the top."
        },
        {
            "gameTime": "1 - 19:28",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 19:04",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) strikes a promising volley towards goal, but one of the defenders is quick enough to step in and make a crucial block. The referee points to the corner flag and Napoli will take a corner."
        },
        {
            "gameTime": "1 - 16:49",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 16:12",
            "label": "",
            "description": "Stefano Sorrentino makes a superb save to deny a header which was nodded towards the roof of the net by Manolo Gabbiadini (Napoli) after a cross from the side. It will be a corner kick for Napoli."
        },
        {
            "gameTime": "1 - 14:13",
            "label": "",
            "description": "Valter Birsa (Chievo) dinks a cross into the box from the free kick. However, the opposition defence thwarts the attack, preventing anyone from finishing."
        },
        {
            "gameTime": "1 - 13:39",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Kalidou Koulibaly (Napoli) was quite harsh and Marco Di Bello didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 11:23",
            "label": "",
            "description": "Marek Hamsik (Napoli) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Stefano Sorrentino guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 10:47",
            "label": "y-card",
            "description": "The game has begun to heat up. Massimo Gobbi (Chievo) challenges an opponent and receives a deserved yellow card for his ugly tackle."
        },
        {
            "gameTime": "1 - 03:32",
            "label": "",
            "description": "Valter Birsa (Chievo) should know this behaviour is beyond the rules. He was too careless with his challenge and left Marco Di Bello no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 02:40",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) blasts the ball high over the crossbar."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Chievo will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Marco Di Bello will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Chievo have not lost for 3 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli have not tasted defeat in their last 8 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Napoli is Jose Callejon with 7 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. Great display from the home side, you have to say that they were the better side today. The home team attempted to leave the opposition defence outnumbered and hit them on the break. The visitors tried to keep the ball on the ground and play a passing game."
        }
    ],
    "gameAwayTeam": "Chievo",
    "gameDate": "24/09/2016 - 21:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "2 - 0"
}