{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2016-09-13 - 21-45 Dyn. Kiev 1 - 2 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. There wasn't any significant dominance by either side in this game. The home team played long ball football unlike the away side who attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 48:11",
            "label": "whistle",
            "description": "That's it for today, William Collum has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 45:54",
            "label": "",
            "description": "Vitorino Gabriel Pacheco Antunes (Dynamo Kiev) sends a lofted pass into the penalty area from a free kick, but the opposition's defence manages to control all the attacking players and thwart the threat."
        },
        {
            "gameTime": "2 - 45:29",
            "label": "",
            "description": "Allan (Napoli) makes a rough challenge and William Collum blows his whistle for a foul. A free kick is awarded to Dyn. Kiev."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:04",
            "label": "",
            "description": "The linesman raises his flag. Manolo Gabbiadini (Napoli) is adjudged offside."
        },
        {
            "gameTime": "2 - 42:33",
            "label": "",
            "description": "Andriy Yarmolenko (Dynamo Kiev) steps up and sends the mid range free kick miles over the bar. Strong but inaccurate shot."
        },
        {
            "gameTime": "2 - 41:51",
            "label": "",
            "description": "Raul Albiol (Napoli) fouls an opponent. At least that's what referee William Collum signals. That's a free kick to Dyn. Kiev."
        },
        {
            "gameTime": "2 - 41:20",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Oleksandr Gladky (Dynamo Kiev) replaces Junior Moraes."
        },
        {
            "gameTime": "2 - 39:41",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "2 - 36:53",
            "label": "substitution",
            "description": "Substitution. Arkadiusz Milik did his best and is replaced by Manolo Gabbiadini (Napoli)."
        },
        {
            "gameTime": "2 - 36:05",
            "label": "substitution",
            "description": "Sergiy Rebrov prepares a substitution. Sergiy Rybalka is replaced by Nikita Korzun (Dynamo Kiev)."
        },
        {
            "gameTime": "2 - 35:36",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "2 - 34:02",
            "label": "attendance",
            "description": "The attendance is 35137."
        },
        {
            "gameTime": "2 - 32:01",
            "label": "",
            "description": "Domagoj Vida (Dynamo Kiev) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the left post."
        },
        {
            "gameTime": "2 - 31:46",
            "label": "corner",
            "description": "Andriy Yarmolenko (Dynamo Kiev) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 31:36",
            "label": "",
            "description": "The ball is cleared after Junior Moraes (Dynamo Kiev) attempted to dribble past an opposing player. The ball is out of play. Dyn. Kiev win a corner kick."
        },
        {
            "gameTime": "2 - 30:45",
            "label": "corner",
            "description": "Andriy Yarmolenko (Dynamo Kiev) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "2 - 30:24",
            "label": "",
            "description": "Denys Garmash (Dynamo Kiev) sends a pass into the box, but his attempt is thwarted and cleared. The ball goes out of play. Dyn. Kiev are awarded a corner kick."
        },
        {
            "gameTime": "2 - 29:37",
            "label": "corner",
            "description": "The corner kick from Oleg Gusev (Dynamo Kiev) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 29:26",
            "label": "",
            "description": "A lofted cross from Vitorino Gabriel Pacheco Antunes (Dynamo Kiev) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The ball goes out of play. Dyn. Kiev are awarded a corner kick."
        },
        {
            "gameTime": "2 - 28:34",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) is adjudged offside."
        },
        {
            "gameTime": "2 - 27:40",
            "label": "substitution",
            "description": "Here is a change. Viktor Tsygankov is going off and Sergiy Rebrov gives the last tactical orders to Oleg Gusev (Dynamo Kiev)."
        },
        {
            "gameTime": "2 - 27:20",
            "label": "substitution",
            "description": "Substitution. Dries Mertens will be replaced by Lorenzo Insigne (Napoli)."
        },
        {
            "gameTime": "2 - 24:36",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Andriy Yarmolenko (Dynamo Kiev) takes it short."
        },
        {
            "gameTime": "2 - 24:10",
            "label": "",
            "description": "Andriy Yarmolenko (Dynamo Kiev) tries to slide the ball through to a teammate but it's well blocked by a defender. Dyn. Kiev earn a corner."
        },
        {
            "gameTime": "2 - 22:13",
            "label": "yr-card",
            "description": "Sergiy Sydorchuk (Dynamo Kiev) obviously dived. It's the second caution for Sergiy Sydorchuk (Dynamo Kiev) and that's the last we'll see of him in this game. There was no other option for William Collum."
        },
        {
            "gameTime": "2 - 20:58",
            "label": "",
            "description": "Flag goes up against Junior Moraes (Dynamo Kiev) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 19:56",
            "label": "y-card",
            "description": "That's a clear yellow card. Arkadiusz Milik (Napoli) goes into the book."
        },
        {
            "gameTime": "2 - 19:12",
            "label": "corner",
            "description": "Jose Callejon (Napoli) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 18:36",
            "label": "corner",
            "description": "Oleksandr Shovkovsky comes off his line to intercept the corner from Faouzi Ghoulam (Napoli). Napoli get a corner."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "",
            "description": "Dries Mertens (Napoli) serves up a nice cross, but the defence clears the danger. The ball is out of play and the linesman points at the corner flag. Corner to Napoli."
        },
        {
            "gameTime": "2 - 17:48",
            "label": "",
            "description": "Dries Mertens (Napoli) fires a brilliant shot from the edge of the box, but the effort rattles the right post! It could have been a superb goal."
        },
        {
            "gameTime": "2 - 16:18",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to substitute Marek Hamsik (Napoli) and he is replaced by ."
        },
        {
            "gameTime": "2 - 15:52",
            "label": "",
            "description": "Marek Hamsik (Napoli) strikes from the edge of the box, but hits it really poorly and sends the ball way over the bar."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 13:37",
            "label": "",
            "description": "Dries Mertens (Napoli) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. The referee signals a corner kick to Napoli."
        },
        {
            "gameTime": "2 - 10:02",
            "label": "y-card",
            "description": "Denys Garmash (Dynamo Kiev) gets a yellow card. The referee William Collum made the right call."
        },
        {
            "gameTime": "2 - 09:26",
            "label": "",
            "description": "Sergiy Rybalka (Dynamo Kiev) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "2 - 07:18",
            "label": "",
            "description": "Flag up against Andriy Yarmolenko (Dynamo Kiev). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 07:05",
            "label": "corner",
            "description": "Viktor Tsygankov (Dynamo Kiev) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 06:49",
            "label": "",
            "description": "Viktor Tsygankov (Dynamo Kiev) produces a dangerous lofted cross into the box which is intercepted. Now Dyn. Kiev have a corner."
        },
        {
            "gameTime": "2 - 04:57",
            "label": "",
            "description": "Vitorino Antunes (Dynamo Kiev) sends a teasing cross into the area, but Pepe Reina intercepts the ball."
        },
        {
            "gameTime": "2 - 04:29",
            "label": "",
            "description": "The foul by Arkadiusz Milik (Napoli) was seen by William Collum who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 02:30",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Arkadiusz Milik (Napoli). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "2 - 01:43",
            "label": "",
            "description": "A pass by Domagoj Vida (Dynamo Kiev) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee William Collum blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. There wasn't any evident superiority by either side during the first half. The home side are playing 'kick and rush' football, which is the exact opposite of the away team who are making a lot of passes and attempting to maintain possession."
        },
        {
            "gameTime": "1 - 47:26",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 46:40",
            "label": "soccer-ball",
            "description": "Arkadiusz Milik (Napoli) gets to the rebound in the goalmouth and plants a header home."
        },
        {
            "gameTime": "1 - 46:20",
            "label": "",
            "description": "Dries Mertens (Napoli) plants a goal bound header towards the top of the net after a nice cross inside the box, but one of the defenders manages to deflect it away."
        },
        {
            "gameTime": "1 - 45:12",
            "label": "",
            "description": "Denys Garmash (Dynamo Kiev) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 43:06",
            "label": "injury",
            "description": "Denys Garmash (Dynamo Kiev) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "1 - 42:40",
            "label": "",
            "description": "Dries Mertens (Napoli) misses a big opportunity to score after striking the ball wide of the right post."
        },
        {
            "gameTime": "1 - 40:56",
            "label": "",
            "description": "Dries Mertens (Napoli) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 40:02",
            "label": "",
            "description": "Junior Moraes (Dynamo Kiev) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 36:41",
            "label": "",
            "description": "Marek Hamsik (Napoli) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "1 - 35:41",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Faouzi Ghoulam sends a superb cross into the box. Arkadiusz Milik (Napoli) latches on to it and from near the penalty spot powers a header into the roof of the net, leaving Oleksandr Shovkovsky beaten. He displayed his eye for goal there excellent finish. The score is 1:1."
        },
        {
            "gameTime": "1 - 33:13",
            "label": "corner",
            "description": "Andriy Yarmolenko (Dynamo Kiev) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 33:06",
            "label": "",
            "description": "Andriy Yarmolenko (Dynamo Kiev) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Corner kick. Dyn. Kiev will have an opportunity."
        },
        {
            "gameTime": "1 - 32:46",
            "label": "",
            "description": "Jose Callejon (Napoli) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety."
        },
        {
            "gameTime": "1 - 31:57",
            "label": "",
            "description": "Marek Hamsik (Napoli) is in a clear offside position and the referee blows his whistle after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 30:22",
            "label": "",
            "description": "Viktor Tsygankov (Dynamo Kiev) manages to beat his opponent to the ball, but he commits a foul in the process."
        },
        {
            "gameTime": "1 - 28:11",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 25:05",
            "label": "soccer-ball",
            "description": "GOAL! Viktor Tsygankov meets a cross inside the box and heads the ball across the goal, where Denys Garmash (Dynamo Kiev) lurks and pokes it into the back of the net. 1:0."
        },
        {
            "gameTime": "1 - 24:27",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) and Dries Mertens try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 20:45",
            "label": "",
            "description": "Andriy Yarmolenko (Dynamo Kiev) takes a mid range free kick and fires the ball into the stands. His effort flew well wide of the right post and it's going to be a goal kick."
        },
        {
            "gameTime": "1 - 19:40",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) commits a rough foul. William Collum stops the game and makes a call. Free kick. Dyn. Kiev will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 18:34",
            "label": "corner",
            "description": "Andriy Yarmolenko (Dynamo Kiev) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 18:25",
            "label": "",
            "description": "Sergiy Rybalka (Dynamo Kiev) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away. The ball goes out of play and Dyn. Kiev have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 17:11",
            "label": "",
            "description": "Marek Hamsik (Napoli) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 14:00",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 13:34",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner, but one of the defenders reacts well and rises highest to head the ball away. Napoli will take a corner kick."
        },
        {
            "gameTime": "1 - 13:15",
            "label": "",
            "description": "Marek Hamsik (Napoli) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender. The referee points to the corner flag. It's a corner to Napoli."
        },
        {
            "gameTime": "1 - 12:18",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 10:47",
            "label": "",
            "description": "The linesman signals that Dries Mertens (Napoli) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 08:38",
            "label": "y-card",
            "description": "Serhij Sydorcuk (Dynamo Kiev) is booked after bringing down an opponent. William Collum had an easy decision to make."
        },
        {
            "gameTime": "1 - 06:09",
            "label": "",
            "description": "Jose Callejon (Napoli) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 04:32",
            "label": "corner",
            "description": "Jose Callejon (Napoli) sends the corner into the box, but Oleksandr Shovkovsky intercepts it and averts the threat."
        },
        {
            "gameTime": "1 - 04:17",
            "label": "",
            "description": "Marek Hamsik (Napoli) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The referee and one of his assistants signal for a corner kick to Napoli."
        },
        {
            "gameTime": "1 - 01:45",
            "label": "",
            "description": "Andriy Yarmolenko (Dynamo Kiev) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 01:06",
            "label": "corner",
            "description": "Andriy Yarmolenko (Dynamo Kiev) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 00:43",
            "label": "",
            "description": "Sergiy Sydorchuk (Dynamo Kiev) has a sight of goal, fires a shot in from distance towards the roof of the net and forces a good save out of Pepe Reina. Dyn. Kiev have a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's William Collum."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. There wasn't any significant dominance by either side in this game. The home team played long ball football unlike the away side who attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "13/09/2016 - 21:45",
    "gameHomeTeam": "Dyn. Kiev",
    "gameScore": "1 - 2"
}