{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-15 - 21-45 Sevilla 3 - 0 B. Monchengladbach/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:36",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. The host team were better throughout the game. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        },
        {
            "gameTime": "2 - 47:35",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 45:36",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) receives a low pass just outside the box and unleashes a fine strike towards the bottom right corner. Sergio Rico pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "2 - 44:59",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:00",
            "label": "y-card",
            "description": "Pavel Kralovec shows a yellow card to Steven N'Zonzi (Sevilla) for his blatant foul."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "",
            "description": "Evgen Konoplyanka (Sevilla) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 38:59",
            "label": "soccer-ball",
            "description": "What a beautiful moment! Evgen Konoplyanka (Sevilla) got to the ball and unleashed a strong shot from distance. It turned out to be a good decision as his effort found its way inside the right post. Yann Sommer just shakes his head in disbelief. The score changes to 3:0."
        },
        {
            "gameTime": "2 - 37:59",
            "label": "corner",
            "description": "Michael Krohn Dehli (Sevilla) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 37:58",
            "label": "substitution",
            "description": "That's the end of the game for Raffael, who is replaced by Josip Drmic (B. Monchengladbach)."
        },
        {
            "gameTime": "2 - 37:58",
            "label": "substitution",
            "description": "Substitution. Jose Antonio Reyes makes his way off the pitch and Evgen Konoplyanka (Sevilla) comes on as his replacement."
        },
        {
            "gameTime": "2 - 37:18",
            "label": "",
            "description": "Ciro Immobile (Sevilla) attempts to convert a lofted cross as he jumps high and heads the ball towards the roof of the net. Yann Sommer shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net. The ball is out of play. Sevilla will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 34:15",
            "label": "",
            "description": "A cross by Victor Vitolo (Sevilla) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "2 - 32:42",
            "label": "y-card",
            "description": "Pavel Kralovec has issued a yellow card to Jose Antonio Reyes (Sevilla)."
        },
        {
            "gameTime": "2 - 32:19",
            "label": "",
            "description": "Jose Antonio Reyes (Sevilla) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "2 - 30:17",
            "label": "substitution",
            "description": "We are about to witness a substitution. Michael Krohn Dehli (Sevilla) is replacing Ever Banega."
        },
        {
            "gameTime": "2 - 29:34",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 29:10",
            "label": "",
            "description": "It looks like Ever Banega (Sevilla) saw red with that tackle. Pavel Kralovec won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "",
            "description": "Thorgan Hazard (B. Monchengladbach) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 27:24",
            "label": "substitution",
            "description": "Substitution. Andre Hahn did his best and is replaced by Nico Schulz (B. Monchengladbach)."
        },
        {
            "gameTime": "2 - 25:46",
            "label": "substitution",
            "description": "Unai Emery Etxegoien has decided to make a change. Ciro Immobile (Sevilla) replaces Kevin Gameiro."
        },
        {
            "gameTime": "2 - 23:41",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) serves up a nice cross, but Sergio Rico punches the ball away."
        },
        {
            "gameTime": "2 - 21:59",
            "label": "substitution",
            "description": "It's time for a substitution. Mahmoud Dahoud (B. Monchengladbach) comes on in place of Lars Stindl."
        },
        {
            "gameTime": "2 - 20:59",
            "label": "soccer-ball",
            "description": "Ever Banega (Sevilla) makes no mistake from the penalty spot after firing the ball into the bottom left corner of the goal to give the goalkeeper no chance!"
        },
        {
            "gameTime": "2 - 20:56",
            "label": "penalty",
            "description": "Tony Jantschke (B. Monchengladbach) tackles a bit over zealously and Pavel Kralovec blows for a foul. The referee blows the whistle and gives a penalty to Sevilla!"
        },
        {
            "gameTime": "2 - 19:05",
            "label": "",
            "description": "Victor Vitolo (Sevilla) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "2 - 18:44",
            "label": "",
            "description": "Sevilla keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "2 - 17:29",
            "label": "",
            "description": "Jose Antonio Reyes (Sevilla) creates some space for himself to pick up a pass on the edge of the box and unleashes a decent strike which goes a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 15:26",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) commits a rough foul. Pavel Kralovec stops the game and makes a call."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "",
            "description": "Kevin Gameiro (Sevilla) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 13:52",
            "label": "",
            "description": "Ever Banega (Sevilla) is desperate to score a goal, but he misses the target after striking the ball well wide of the left post."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "",
            "description": "Ever Banega (Sevilla) has the opportunity to threaten the opponent's goal via a free kick on the edge of the box. He hits a fine strike towards the left side of the goal, but Yann Sommer denies him with a great save."
        },
        {
            "gameTime": "2 - 11:17",
            "label": "",
            "description": "Raffael (B. Monchengladbach) makes a bad challenge and the referee blows his whistle for a foul. Free kick. Sevilla will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 11:05",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Benoit Tremoulinas (Sevilla)."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "",
            "description": "Raffael (B. Monchengladbach) unleashes a decent effort from just outside the box which goes narrowly wide of the left post. The ball goes out of play and Sevilla will have a goal kick."
        },
        {
            "gameTime": "2 - 06:59",
            "label": "y-card",
            "description": "Lars Stindl (B. Monchengladbach) goes into the book for a horrible tackle. A yellow card is necessary in this case."
        },
        {
            "gameTime": "2 - 04:50",
            "label": "penalty-missed",
            "description": "Kevin Gameiro (Sevilla) fails to score from the penalty spot! His effort only crashes against the crossbar."
        },
        {
            "gameTime": "2 - 03:59",
            "label": "y-card",
            "description": "Yann Sommer (B. Monchengladbach) is awarded a yellow card for a sharp discussion with the referee. He should relax or he could be sent off."
        },
        {
            "gameTime": "2 - 03:57",
            "label": "y-card",
            "description": "Roel Brouwers (B. Monchengladbach) has tested the patience of referee Pavel Kralovec and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 03:37",
            "label": "penalty",
            "description": "Roel Brouwers (B. Monchengladbach) jumps into a tackle and Pavel Kralovec blows his whistle for a foul. A penalty is given to Sevilla!"
        },
        {
            "gameTime": "2 - 01:59",
            "label": "soccer-ball",
            "description": "Kevin Gameiro (Sevilla) leaves the keeper helpless with his precise penalty shot into the top right corner."
        },
        {
            "gameTime": "2 - 01:58",
            "label": "",
            "description": "Kevin Gameiro (Sevilla) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 01:17",
            "label": "penalty",
            "description": "Yann Sommer (B. Monchengladbach) was trying to get to the ball but clattered into the legs of the opponent as well. Pavel Kralovec blows his whistle for an infringement. Sevilla are given a huge opportunity to score it's a penalty kick!"
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Pavel Kralovec blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:21",
            "label": "",
            "description": "The performance from both teams could be described as average. There have been only a few exciting situations and the fans will be expecting more in the second half. The home side dominated the first half in most aspects of the game, but the visitors will surely attempt to turn the situation around in the second half. The home team is playing possession football and the away team is basing its game on a well organized defence."
        },
        {
            "gameTime": "1 - 45:20",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:34",
            "label": "corner",
            "description": "Jose Antonio Reyes (Sevilla) sends over a poor, overhit cross from the corner kick and the ball goes out of play."
        },
        {
            "gameTime": "1 - 44:23",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) sends a pass into the box, but his attempt is thwarted and cleared. The ball goes behind for a corner. Sevilla will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 44:02",
            "label": "",
            "description": "Tony Jantschke (B. Monchengladbach) jumps for a header from the corner kick, but fails to steer the ball into the goal as it flies high over the bar."
        },
        {
            "gameTime": "1 - 43:44",
            "label": "corner",
            "description": "Ibrahima Traore (B. Monchengladbach) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 43:24",
            "label": "",
            "description": "Andre Hahn (B. Monchengladbach) has an effort from distance but it's blocked. Now B. Monchengladbach have a corner."
        },
        {
            "gameTime": "1 - 42:43",
            "label": "",
            "description": "Kevin Gameiro (Sevilla) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the right side of the net, but Yann Sommer leaps like a salmon to deny him."
        },
        {
            "gameTime": "1 - 42:24",
            "label": "corner",
            "description": "Jose Antonio Reyes (Sevilla) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 42:12",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) sends a cross into the box, but the opposition's defence quickly intercepts the ball. Sevilla win a corner."
        },
        {
            "gameTime": "1 - 41:18",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 39:59",
            "label": "",
            "description": "Coke (Sevilla) skips perfectly past challenges but misdirects his shot from the edge of the box. The ball flies a few yards over the bar."
        },
        {
            "gameTime": "1 - 38:57",
            "label": "",
            "description": "Thorgan Hazard (B. Monchengladbach) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 38:04",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the right post. The ball is off of the pitch and it's a goal kick for Sevilla."
        },
        {
            "gameTime": "1 - 37:49",
            "label": "",
            "description": "Victor Vitolo (Sevilla) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 35:57",
            "label": "",
            "description": "Kevin Gameiro (Sevilla) should have done it better. He won the ball from the resulting free kick, but fired high over the crossbar."
        },
        {
            "gameTime": "1 - 35:29",
            "label": "",
            "description": "Jose Antonio Reyes (Sevilla) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 34:12",
            "label": "",
            "description": "Pavel Kralovec blows his whistle and signals a foul after Raffael (B. Monchengladbach) brought his opponent down. Sevilla win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 33:40",
            "label": "corner",
            "description": "Ever Banega (Sevilla) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 32:45",
            "label": "",
            "description": "Ever Banega (Sevilla) puts a cross into the box from the free kick, but the defender gets there first. Sevilla will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 32:31",
            "label": "",
            "description": "Pavel Kralovec couldn't ignore the rough tackle by Ibrahima Traore (B. Monchengladbach) and blew his whistle. Sevilla have a free kick."
        },
        {
            "gameTime": "1 - 30:56",
            "label": "",
            "description": "The linesman raises his flag. Coke (Sevilla) is adjudged offside."
        },
        {
            "gameTime": "1 - 30:01",
            "label": "",
            "description": "Great ball in from Jose Antonio Reyes. Kevin Gameiro (Sevilla) should really have done better with a close range header, but he heads it a whisker wide of the left post. The ball goes out of play and B. Monchengladbach will have a goal kick."
        },
        {
            "gameTime": "1 - 28:52",
            "label": "",
            "description": "Marco Andreolli (Sevilla) makes a reckless foul in order to win the ball from his opponent. Pavel Kralovec has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 26:06",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 25:48",
            "label": "",
            "description": "Sevilla are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 23:48",
            "label": "",
            "description": "Andre Hahn (B. Monchengladbach) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 23:10",
            "label": "",
            "description": "Grzegorz Krychowiak (Sevilla) brings his opponent down with a tackle and Pavel Kralovec blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 22:51",
            "label": "",
            "description": "Timothee Kolodziejczak (Sevilla) sends a long ball in, but Yann Sommer comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 21:08",
            "label": "corner",
            "description": "Jose Antonio Reyes (Sevilla) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 20:48",
            "label": "",
            "description": "Jose Antonio Reyes (Sevilla) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition. Sevilla have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:45",
            "label": "",
            "description": "Coke (Sevilla) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 18:55",
            "label": "",
            "description": "The ball is cleared after Raffael (B. Monchengladbach) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 15:56",
            "label": "",
            "description": "Ibrahima Traore (B. Monchengladbach) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post."
        },
        {
            "gameTime": "1 - 14:24",
            "label": "",
            "description": "The game is interrupted as Benoit Tremoulinas (Sevilla) is flagged offside."
        },
        {
            "gameTime": "1 - 13:36",
            "label": "",
            "description": "B. Monchengladbach restart play with a quick free kick."
        },
        {
            "gameTime": "1 - 13:22",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Grzegorz Krychowiak (Sevilla). Pavel Kralovec saw the sliding tackle and blows for a foul. B. Monchengladbach will take a free kick."
        },
        {
            "gameTime": "1 - 11:40",
            "label": "",
            "description": "Jose Antonio Reyes (Sevilla) is penalised for a foul. Pavel Kralovec had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 11:00",
            "label": "",
            "description": "Flag goes up against Andre Hahn (B. Monchengladbach) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 09:51",
            "label": "",
            "description": "Jose Antonio Reyes (Sevilla) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "1 - 09:35",
            "label": "",
            "description": "Raffael (B. Monchengladbach) should know this behaviour is beyond the rules. He was too careless with his challenge and left Pavel Kralovec no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 08:52",
            "label": "",
            "description": "Jose Antonio Reyes (Sevilla) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 06:43",
            "label": "",
            "description": "Coke (Sevilla) sends a teasing cross into the area, but Yann Sommer intercepts the ball."
        },
        {
            "gameTime": "1 - 06:05",
            "label": "",
            "description": "Roel Brouwers (B. Monchengladbach) leaps high deep inside the box to meet a beautiful cross from the resultant free kick. He glances a header goalwards, but it's not accurate and goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 05:25",
            "label": "",
            "description": "Jose Antonio Reyes (Sevilla) strikes the rebound, but it goes well over the bar."
        },
        {
            "gameTime": "1 - 05:08",
            "label": "",
            "description": "Victor Vitolo (Sevilla) expertly controls a neat clever pass on the edge of the penalty area, but his effort rattles the left post! What a shot that was!"
        },
        {
            "gameTime": "1 - 04:06",
            "label": "",
            "description": "A pass by Kevin Gameiro (Sevilla) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 03:33",
            "label": "",
            "description": "B. Monchengladbach try to speed play up by taking a quick free kick."
        },
        {
            "gameTime": "1 - 03:24",
            "label": "",
            "description": "Steven N'Zonzi (Sevilla) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again. B. Monchengladbach are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 02:30",
            "label": "",
            "description": "Andre Hahn (B. Monchengladbach) commits a rough challenge and Pavel Kralovec blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 01:20",
            "label": "",
            "description": "Benoit Tremoulinas (Sevilla) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sevilla will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pavel Kralovec will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have been watching a lacklustre game with only a few moments to excite the crowd. The players surely have better abilities, they just needed to motivate themselves a little more. The host team were better throughout the game. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        }
    ],
    "gameAwayTeam": "B. Monchengladbach",
    "gameDate": "15/09/2015 - 21:45",
    "gameHomeTeam": "Sevilla",
    "gameScore": "3 - 0"
}