{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2016-11-01 - 20-45 Besiktas 1 - 1 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The visitors controlled the game. The home team's main priority was a flawless defence. The tactic of the away side was slow build up play."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 47:36",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) has an effort on goal, but he misses to the right of the goal."
        },
        {
            "gameTime": "2 - 46:35",
            "label": "",
            "description": "Dries Mertens (Napoli) receives a low pass just outside the box and unleashes a fine strike towards the middle of the goal. Fabricio pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:42",
            "label": "",
            "description": "Ricardo Quaresma (Besiktas) swings a cross into the box, but it's far too close to Pepe Reina, who smothers the ball."
        },
        {
            "gameTime": "2 - 43:10",
            "label": "",
            "description": "Rough tackle by Elseid Hysaj (Napoli). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 41:05",
            "label": "",
            "description": "Dries Mertens (Napoli) collects an inch perfect pass and strikes the ball from far out, but his shot is blocked."
        },
        {
            "gameTime": "2 - 37:52",
            "label": "y-card",
            "description": "Mark Clattenburg shows the yellow card to Cenk Tosun (Besiktas) for a heavy challenge."
        },
        {
            "gameTime": "2 - 36:26",
            "label": "soccer-ball",
            "description": "Marek Hamsik (Napoli) latches on to a pass and controls it with a good first touch. He unleashes a deadly strike from around 22 metres out which goes inside the left post."
        },
        {
            "gameTime": "2 - 35:46",
            "label": "",
            "description": "Jose Callejon (Napoli) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 35:20",
            "label": "substitution",
            "description": "Here's the change. Allan (Napoli) leaves the pitch and comes on as a substitute."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to make a change. Amadou Diawara (Napoli) replaces Jorginho."
        },
        {
            "gameTime": "2 - 33:08",
            "label": "soccer-ball",
            "description": "Ricardo Quaresma (Besiktas) steps up and confidently directs the penalty into the left side of the goal!"
        },
        {
            "gameTime": "2 - 32:48",
            "label": "",
            "description": "Ricardo Quaresma (Besiktas) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 32:18",
            "label": "penalty",
            "description": "Nikola Maksimovic (Napoli) clearly handles the ball, but he is surprised when the referee blows his whistle. The referee makes a call and blows his whistle for an infringement. Besiktas are awarded a penalty."
        },
        {
            "gameTime": "2 - 31:22",
            "label": "",
            "description": "Oguzhan Ozyakup (Besiktas) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 31:06",
            "label": "corner",
            "description": "The corner from Ricardo Quaresma (Besiktas) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 30:39",
            "label": "",
            "description": "Ricardo Quaresma (Besiktas) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety. The referee points to the corner flag. It's a corner to Besiktas."
        },
        {
            "gameTime": "2 - 30:22",
            "label": "corner",
            "description": "The corner from Ricardo Quaresma (Besiktas) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 29:46",
            "label": "",
            "description": "The ball is cleared after Vincent Aboubakar (Besiktas) attempted to dribble past an opposing player. We are about to witness a corner kick, another promising situation."
        },
        {
            "gameTime": "2 - 28:45",
            "label": "",
            "description": "Nikola Maksimovic (Napoli) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "2 - 28:17",
            "label": "",
            "description": "Jose Callejon (Napoli) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 27:28",
            "label": "",
            "description": "Dries Mertens (Napoli) makes an overly aggressive challenge and Mark Clattenburg blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 27:18",
            "label": "corner",
            "description": "Jose Callejon (Napoli) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 26:43",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Dries Mertens (Napoli). The referee blows his whistle, Napoli are awarded a corner kick."
        },
        {
            "gameTime": "2 - 26:11",
            "label": "",
            "description": "Elseid Hysaj (Napoli) robs an opponent of the ball and explodes in anger when Mark Clattenburg blows for a foul."
        },
        {
            "gameTime": "2 - 23:04",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Lorenzo Insigne (Napoli), whose instinctive shot towards goal flashes inches over the top."
        },
        {
            "gameTime": "2 - 20:49",
            "label": "",
            "description": "The game is interrupted as Jose Callejon (Napoli) is flagged offside."
        },
        {
            "gameTime": "2 - 20:08",
            "label": "substitution",
            "description": "Senol Gunes has decided to substitute Gokhan Inler and he is replaced by Oguzhan Ozyakup (Besiktas)."
        },
        {
            "gameTime": "2 - 19:31",
            "label": "",
            "description": "Marek Hamsik (Napoli) plays a through ball which would have led to a great opportunity, if it hadn't been stopped by the defence."
        },
        {
            "gameTime": "2 - 17:41",
            "label": "substitution",
            "description": "Substitution. Manolo Gabbiadini will be replaced by Dries Mertens (Napoli)."
        },
        {
            "gameTime": "2 - 17:05",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 16:43",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Napoli have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 14:39",
            "label": "",
            "description": "A crossfield pass from Gokhan Inler (Besiktas) fails to find any of his teammates. The linesman signals a throw in for Napoli."
        },
        {
            "gameTime": "2 - 12:48",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) shows too much aggression while trying to break free from his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 11:41",
            "label": "y-card",
            "description": "Jorginho (Napoli) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Mark Clattenburg ignores the protests."
        },
        {
            "gameTime": "2 - 11:00",
            "label": "",
            "description": "Jose Callejon (Napoli) takes a mid range shot, but the ball sails high over the bar."
        },
        {
            "gameTime": "2 - 10:43",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 10:20",
            "label": "",
            "description": "Jose Callejon (Napoli) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. Napoli force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 08:33",
            "label": "",
            "description": "Ricardo Quaresma (Besiktas) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 08:17",
            "label": "",
            "description": "Mark Clattenburg has a clear sight and sees a foul from Allan (Napoli)."
        },
        {
            "gameTime": "2 - 07:13",
            "label": "injury",
            "description": "The game is interrupted now, Ricardo Quaresma (Besiktas) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 05:56",
            "label": "",
            "description": "Jose Callejon (Napoli) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the left post."
        },
        {
            "gameTime": "2 - 04:30",
            "label": "",
            "description": "Ricardo Quaresma (Besiktas) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 03:06",
            "label": "corner",
            "description": "Jose Callejon (Napoli) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 02:29",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) sends a cross into the box, but the opposition's defence clears the ball to safety. The ball is out of play. Napoli win a corner kick."
        },
        {
            "gameTime": "2 - 01:58",
            "label": "y-card",
            "description": "Mark Clattenburg shows a yellow card to Gokhan Inler (Besiktas) for a tough tackle."
        },
        {
            "gameTime": "2 - 01:43",
            "label": "",
            "description": "A cross, provided by Ricardo Quaresma (Besiktas), caused no threat to the opposition's defence as the ball was cleared out of danger."
        },
        {
            "gameTime": "2 - 01:17",
            "label": "",
            "description": "Elseid Hysaj (Napoli) was too fierce in his attempt to get the ball from his opponent and Mark Clattenburg blows for a foul. Besiktas earn a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. It's difficult to say if one side enjoyed any superiority over the other in the first half. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 46:56",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:57",
            "label": "",
            "description": "Mark Clattenburg couldn't ignore the rough tackle by Kalidou Koulibaly (Napoli) and blew his whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 43:56",
            "label": "",
            "description": "A pass from Lorenzo Insigne (Napoli) is intercepted by Fabri and the move breaks down."
        },
        {
            "gameTime": "1 - 42:51",
            "label": "",
            "description": "Andreas Beck (Besiktas) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety."
        },
        {
            "gameTime": "1 - 40:40",
            "label": "",
            "description": "Jose Callejon whips the ball in and it arrives at the feet of Lorenzo Insigne (Napoli), whose wild shot goes well wide of the left post."
        },
        {
            "gameTime": "1 - 39:59",
            "label": "",
            "description": "Ricardo Quaresma (Besiktas) is flagged for offside."
        },
        {
            "gameTime": "1 - 39:10",
            "label": "",
            "description": "Pepe Reina blocks a long range effort from Vincent Aboubakar (Besiktas) towards the middle of the goal."
        },
        {
            "gameTime": "1 - 38:29",
            "label": "",
            "description": "Mark Clattenburg blows for a foul after Faouzi Ghoulam (Napoli) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 35:57",
            "label": "",
            "description": "Allan (Napoli) commits a rough challenge and Mark Clattenburg blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 34:32",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) commits a rough foul. Mark Clattenburg stops the game and makes a call."
        },
        {
            "gameTime": "1 - 33:37",
            "label": "",
            "description": "Flag up against Lorenzo Insigne (Napoli). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 32:59",
            "label": "",
            "description": "Napoli players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "1 - 30:23",
            "label": "",
            "description": "Gokhan Inler (Besiktas) receives a pass and fires a shot in from long range, but it's blocked."
        },
        {
            "gameTime": "1 - 29:05",
            "label": "",
            "description": "Atiba Hutchinson (Besiktas) fails to score from inside the box as his rebound smashes against the left post!"
        },
        {
            "gameTime": "1 - 28:57",
            "label": "",
            "description": "Ricardo Quaresma (Besiktas) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 27:25",
            "label": "",
            "description": "Mark Clattenburg blows his whistle. Tolgay Arslan (Besiktas) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 25:18",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Jose Callejon (Napoli), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 24:52",
            "label": "",
            "description": "Elseid Hysaj (Napoli) looks to break free, but an opposing player clears the ball away. The linesman makes the right call and Napoli will have a corner."
        },
        {
            "gameTime": "1 - 23:02",
            "label": "substitution",
            "description": "Senol Gunes is forced to make a change. Dusko Tosic is unable to continue due to injury, Cenk Tosun (Besiktas) comes on."
        },
        {
            "gameTime": "1 - 21:32",
            "label": "",
            "description": "Marek Hamsik (Napoli) attempted to pick out a free teammate inside the box, but Fabri comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 20:20",
            "label": "",
            "description": "Tolgay Arslan whips the ball in and it arrives at the feet of Vincent Aboubakar (Besiktas), whose wild shot goes way over the crossbar."
        },
        {
            "gameTime": "1 - 19:32",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Ricardo Quaresma (Besiktas) takes it short."
        },
        {
            "gameTime": "1 - 19:15",
            "label": "",
            "description": "Ricardo Quaresma (Besiktas) serves up a nice cross, but the defence clears the danger. Now Besiktas have a corner."
        },
        {
            "gameTime": "1 - 17:44",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner, but he overhits it and none of his teammates are able to reach the ball. The ball goes out of play and Besiktas will have a goal kick."
        },
        {
            "gameTime": "1 - 17:20",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety. Napoli get a corner."
        },
        {
            "gameTime": "1 - 16:54",
            "label": "",
            "description": "A cross into the box from Elseid Hysaj (Napoli) is cleared. Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:05",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 15:47",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. The ball is out of play and Napoli manage to earn a corner."
        },
        {
            "gameTime": "1 - 14:45",
            "label": "",
            "description": "Dusko Tosic (Besiktas) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 14:25",
            "label": "",
            "description": "The linesman raises his flag for offside before Vincent Aboubakar (Besiktas) heads on."
        },
        {
            "gameTime": "1 - 13:50",
            "label": "injury",
            "description": "Dusko Tosic (Besiktas) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 12:58",
            "label": "",
            "description": "Elseid Hysaj swings in an inviting cross that finds Jose Callejon (Napoli). He doesn't take advantage as his effort goes harmlessly over the crossbar."
        },
        {
            "gameTime": "1 - 10:31",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) takes a great touch after receiving a pass inside the box. He immediately unleashes a low shot to the middle of the goal, but the keeper pulls off a decent save!"
        },
        {
            "gameTime": "1 - 09:27",
            "label": "",
            "description": "The Besiktas players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 08:15",
            "label": "",
            "description": "Marek Hamsik (Napoli) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 05:57",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) sends a teasing cross into the area, but Fabri intercepts the ball."
        },
        {
            "gameTime": "1 - 05:31",
            "label": "",
            "description": "Mark Clattenburg blows his whistle and it's Vincent Aboubakar (Besiktas) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 04:20",
            "label": "",
            "description": "It looks like Jorginho (Napoli) saw red with that tackle. Mark Clattenburg won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 03:15",
            "label": "",
            "description": "Napoli keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 01:46",
            "label": "",
            "description": "Flag goes up against Manolo Gabbiadini (Napoli) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 01:08",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) makes contact with a cross and strikes a shot that lacks the power to find the back of the net, but the goalkeeper still has to make a good save to keep his effort out."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Mark Clattenburg was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The visitors controlled the game. The home team's main priority was a flawless defence. The tactic of the away side was slow build up play."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "01/11/2016 - 20:45",
    "gameHomeTeam": "Besiktas",
    "gameScore": "1 - 1"
}