{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-05-14 - 21-00 Las Palmas 1 - 4 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:11",
            "label": "whistle",
            "description": "That's it for today, Gonzalez Gonzalez has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "",
            "description": "Jese (UD Las Palmas) found himself in a promising position. He ran towards the goal and unleashed a shot from just outside the penalty area which went towards the middle of the goal, but the goalkeeper was ready and made a decent save."
        },
        {
            "gameTime": "2 - 45:50",
            "label": "corner",
            "description": "Neymar (Barcelona) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 45:48",
            "label": "",
            "description": "Corner kick. Barcelona will have an opportunity. Javi Varas hears the fans clapping his superb goalkeeping. Lionel Messi (Barcelona) shoots from the edge of the box towards the top of the net, but the goalkeeper makes a magnificent save."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 41:52",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Neymar (Barcelona) sends it out of play."
        },
        {
            "gameTime": "2 - 41:40",
            "label": "",
            "description": "Denis Suarez (Barcelona) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender. The ball is out of play. Barcelona win a corner kick."
        },
        {
            "gameTime": "2 - 39:33",
            "label": "",
            "description": "Lionel Messi (Barcelona) decides to have a shot at goal from the free kick, but it hits the defensive wall."
        },
        {
            "gameTime": "2 - 39:20",
            "label": "substitution",
            "description": "The referee signals a substitution. Javi Castellano (UD Las Palmas) is brought on as a substitute for Jonathan Viera."
        },
        {
            "gameTime": "2 - 38:25",
            "label": "",
            "description": "Jonathan Viera (UD Las Palmas) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Gonzalez Gonzalez with no other option than to blow for a foul. Barcelona are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 36:48",
            "label": "attendance",
            "description": "The attendance is 22268."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "corner",
            "description": "Neymar (Barcelona) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 33:32",
            "label": "substitution",
            "description": "Substitution. Alcacer Paco (Barcelona) receives a signal from the referee and is now allowed to enter the pitch as Luis Suarez walks off."
        },
        {
            "gameTime": "2 - 33:20",
            "label": "substitution",
            "description": "Here is a change. Ivan Rakitic is going off and Luis Enrique gives the last tactical orders to Denis Suarez (Barcelona)."
        },
        {
            "gameTime": "2 - 32:36",
            "label": "",
            "description": "Lionel Messi (Barcelona) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The referee and one of his assistants signal for a corner kick to Barcelona."
        },
        {
            "gameTime": "2 - 32:33",
            "label": "corner",
            "description": "Jonathan Viera (UD Las Palmas) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 32:25",
            "label": "substitution",
            "description": "Substitution. Angel Montoro walks off the pitch and Hernan (UD Las Palmas) comes on as a substitute."
        },
        {
            "gameTime": "2 - 32:03",
            "label": "",
            "description": "Angel Montoro (UD Las Palmas) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball is out of play and Las Palmas manage to earn a corner."
        },
        {
            "gameTime": "2 - 31:20",
            "label": "",
            "description": "Lionel Messi (Barcelona) gets a shot from inside the penalty area and it flies just wide of the left post."
        },
        {
            "gameTime": "2 - 30:20",
            "label": "",
            "description": "Kevin Prince Boateng (UD Las Palmas) is adjudged offside."
        },
        {
            "gameTime": "2 - 26:07",
            "label": "substitution",
            "description": "The game has come to an end for Figueroa Cabrera Momo. He has contributed as much as he could today. He will be replaced by the fresh legs of Alen Halilovic (UD Las Palmas)."
        },
        {
            "gameTime": "2 - 26:00",
            "label": "soccer-ball",
            "description": "Goal! Jordi Alba displays great vision and sends a pass to Neymar (Barcelona), who shows brilliant composure inside the box to bury the ball into the bottom right corner. The score is 1:4."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Ivan Rakitic finds Neymar (Barcelona), who jumps highest and steers a close range header into the right side of the goal. His effort was both strong and precise, and Javi Varas had no chance of stopping that. 1:3."
        },
        {
            "gameTime": "2 - 21:06",
            "label": "",
            "description": "Pedro Bigas (UD Las Palmas) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 19:21",
            "label": "injury",
            "description": "Pedro Bigas (UD Las Palmas) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 17:54",
            "label": "soccer-ball",
            "description": "Goal! Jese produces a great pass that finds Pedro Bigas (UD Las Palmas) inside the penalty area, who takes advantage of the situation to rifle a shot low shot into the back of the net. 1:2."
        },
        {
            "gameTime": "2 - 15:08",
            "label": "corner",
            "description": "Jonathan Viera (UD Las Palmas) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 14:54",
            "label": "",
            "description": "Jese (UD Las Palmas) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders. Las Palmas win a corner."
        },
        {
            "gameTime": "2 - 14:38",
            "label": "",
            "description": "Jese (UD Las Palmas) is unlucky with a goal bound effort from the edge of the box. Some classy goalkeeping by Marc Andre ter Stegen stops the ball out of the bottom right corner."
        },
        {
            "gameTime": "2 - 12:36",
            "label": "substitution",
            "description": "Substitution. Lucas Digne makes his way off the pitch and Andre Gomes (Barcelona) comes on as his replacement."
        },
        {
            "gameTime": "2 - 12:16",
            "label": "",
            "description": "Luis Suarez (Barcelona) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "2 - 09:35",
            "label": "corner",
            "description": "The resulting corner from Neymar (Barcelona) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 09:11",
            "label": "",
            "description": "What a goal scoring opportunity! Lionel Messi (Barcelona) finds some space inside the box and gets in a strike, but the shot is brilliantly blocked by one of the defending players sliding in. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 07:34",
            "label": "",
            "description": "Jese (UD Las Palmas) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 06:01",
            "label": "",
            "description": "Figueroa Cabrera Momo (UD Las Palmas) takes the free kick from mid range, but he balloons his effort high over the bar. What a miskick!"
        },
        {
            "gameTime": "2 - 05:29",
            "label": "",
            "description": "Referee Gonzalez Gonzalez sees the trip by Sergio Busquets (Barcelona) and doesn't hesitate to blow his whistle. Las Palmas win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 03:52",
            "label": "",
            "description": "What a chance! Kevin Prince Boateng (UD Las Palmas) squanders a promising opportunity as he latches on to a perfect cross from the wing. He produces a bullet header from around the penalty spot which goes just wide of the right post!"
        },
        {
            "gameTime": "2 - 01:52",
            "label": "",
            "description": "Michel Macedo (UD Las Palmas) sends a cross into the box, but Marc Andre ter Stegen comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Gonzalez Gonzalez blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 46:08",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 42:12",
            "label": "",
            "description": "Luis Suarez (Barcelona) is caught offside!"
        },
        {
            "gameTime": "1 - 41:12",
            "label": "",
            "description": "That was a wasted opportunity to score by Neymar (Barcelona). He picks up the rebound and produces a poor effort which is easily saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 35:42",
            "label": "",
            "description": "Andres Iniesta (Barcelona) trips an opposition player and Gonzalez Gonzalez signals a foul."
        },
        {
            "gameTime": "1 - 30:48",
            "label": "",
            "description": "Roque Mesa (UD Las Palmas) unleashes a shot from the edge of the box, but it goes straight at Marc Andre ter Stegen."
        },
        {
            "gameTime": "1 - 30:05",
            "label": "",
            "description": "Flag goes up against Luis Suarez (Barcelona) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 29:19",
            "label": "",
            "description": "Jonathan Viera (UD Las Palmas) brings his opponent down. Gonzalez Gonzalez has a clear sight of it and blows his whistle for a foul. Barcelona have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 28:27",
            "label": "",
            "description": "The linesman raises his flag. Helder Lopes (UD Las Palmas) is adjudged offside."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "soccer-ball",
            "description": "Goal! Luis Suarez (Barcelona) picks up a pass and gets to the edge of the box before clipping a brilliant lob over the goalkeeper and into the empty net. He makes it 0:2."
        },
        {
            "gameTime": "1 - 24:43",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Luis Suarez sprays a pass out to Neymar (Barcelona), and he has an easy job to slot the ball into an empty net. The score is 0:1."
        },
        {
            "gameTime": "1 - 21:53",
            "label": "",
            "description": "Jonathan Viera (UD Las Palmas) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 21:18",
            "label": "",
            "description": "Lucas Digne (Barcelona) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 18:54",
            "label": "injury",
            "description": "The game is interrupted now, Lucas Digne (Barcelona) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 18:38",
            "label": "injury",
            "description": "Jonathan Viera (UD Las Palmas) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 18:04",
            "label": "",
            "description": "The linesman raises his flag for offside before Luis Suarez (Barcelona) heads on."
        },
        {
            "gameTime": "1 - 17:00",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 16:47",
            "label": "",
            "description": "Neymar (Barcelona) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee points to the corner flag and Barcelona will take a corner."
        },
        {
            "gameTime": "1 - 13:00",
            "label": "",
            "description": "Lionel Messi (Barcelona) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "1 - 08:17",
            "label": "",
            "description": "Neymar (Barcelona) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 07:06",
            "label": "",
            "description": "Mauricio Lemos (UD Las Palmas) stands over the free kick and opts to take it himself, but his low effort is straight at Marc Andre ter Stegen."
        },
        {
            "gameTime": "1 - 06:00",
            "label": "y-card",
            "description": "Today's referee Gonzalez Gonzalez rightly decides to book Lucas Digne (Barcelona) for his harsh tackle. Las Palmas will look to take advantage of a free kick in a promising position in the middle of the field."
        },
        {
            "gameTime": "1 - 05:22",
            "label": "",
            "description": "Lionel Messi (Barcelona) connects with the corner kick around the penalty spot, but steers his header inches over the bar. The ball is off of the pitch and it's a goal kick for Las Palmas."
        },
        {
            "gameTime": "1 - 05:07",
            "label": "corner",
            "description": "The linesman points to the corner flag, Barcelona are going to take it."
        },
        {
            "gameTime": "1 - 04:51",
            "label": "",
            "description": "Luis Suarez (Barcelona) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. Barcelona force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 01:13",
            "label": "corner",
            "description": "Las Palmas take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 00:57",
            "label": "",
            "description": "Jese (UD Las Palmas) fails to find any of his teammates inside the box as his pass is blocked. The ball goes out of play. Las Palmas are awarded a corner kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Barcelona will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gonzalez Gonzalez is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "In the last 5 games between these two teams there were 3 matches with over 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most prolific goal scorer for Barcelona is Lionel Messi with 35 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Las Palmas will try to end their 5 game winless streak."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's it for today, Gonzalez Gonzalez has blown his whistle and the game is over."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "14/05/2017 - 21:00",
    "gameHomeTeam": "Las Palmas",
    "gameScore": "1 - 4"
}