{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-04-09 - 16-00 Bologna 0 - 3 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:05",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:32",
            "label": "",
            "description": "Bruno Petkovic (Bologna) makes a good run with the ball, but his shot from the edge of the penalty area goes just wide of the left post. Terrific solo effort, though."
        },
        {
            "gameTime": "2 - 42:20",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) sends a poor cross in from the free kick that is cleared by the head of a defender."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Francesco Totti (AS Roma) is coming onto the pitch as Edin Dzeko cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 39:36",
            "label": "corner",
            "description": "Ladislav Krejci (Bologna) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "y-card",
            "description": "The game is interrupted. Bruno Petkovic (Bologna) is given a yellow card. He has to be more careful now."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "substitution",
            "description": "Luciano Spalletti prepares a substitution. Konstantinos Manolas is replaced by Thomas Vermaelen (AS Roma)."
        },
        {
            "gameTime": "2 - 30:41",
            "label": "substitution",
            "description": "Substitution. Vassilios Torosidis (Bologna) replaces Domenico Maietta."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "y-card",
            "description": "The referee gives a yellow card to Blerim Dzemaili (Bologna)."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Diego Perotti sprays a pass out to Edin Dzeko (AS Roma), and he has an easy job to slot the ball into an empty net. The score is 0:3."
        },
        {
            "gameTime": "2 - 25:15",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "y-card",
            "description": "Domenico Maietta (Bologna) will have to be careful for the rest of the match as he is shown a yellow card."
        },
        {
            "gameTime": "2 - 23:50",
            "label": "y-card",
            "description": "Kevin Strootman (AS Roma) gets a yellow card."
        },
        {
            "gameTime": "2 - 22:14",
            "label": "",
            "description": "Diego Perotti (AS Roma) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the bottom left corner. Antonio Mirante has a clear sight of it makes a comfortable save."
        },
        {
            "gameTime": "2 - 19:22",
            "label": "substitution",
            "description": "Stephan El Shaarawy will be replaced by Diego Perotti (AS Roma)."
        },
        {
            "gameTime": "2 - 18:20",
            "label": "",
            "description": "Daniele Gastaldello (Bologna) peeled away from his marker and got on the end of the resulting corner, but his fine header towards the underside of the crossbar is perfectly saved by the goalkeeper."
        },
        {
            "gameTime": "2 - 18:12",
            "label": "corner",
            "description": "Ladislav Krejci (Bologna) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 17:52",
            "label": "corner",
            "description": "Ladislav Krejci (Bologna) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 17:16",
            "label": "substitution",
            "description": "Substitution. Bruno Petkovic (Bologna) receives a signal from the referee and is now allowed to enter the pitch as Adam Nagy walks off."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "",
            "description": "Wojciech Szczesny blocks a long range effort from Erick Pulgar (Bologna) towards the roof of the net."
        },
        {
            "gameTime": "2 - 08:31",
            "label": "",
            "description": "Edin Dzeko (AS Roma) wins the ball from the resulting corner but blazes it well over the bar."
        },
        {
            "gameTime": "2 - 08:19",
            "label": "corner",
            "description": "Stephan El Shaarawy (AS Roma) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 05:29",
            "label": "",
            "description": "Federico Di Francesco (Bologna) muscles his way past two defenders but his shot from inside the box smashes against the left post!"
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Roberto Donadoni gives a chance to Federico Di Francesco (Bologna) and Simone Verdi is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:11",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 41:00",
            "label": "soccer-ball",
            "description": "Goal! Edin Dzeko gets to the ball, slips Mohamed Salah (AS Roma) into the area and he scores with a delightful chipped finish to make it 0:2."
        },
        {
            "gameTime": "1 - 37:47",
            "label": "y-card",
            "description": "Antonio Damato shows a yellow card to Konstantinos Manolas (AS Roma), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 34:14",
            "label": "",
            "description": "Ladislav Krejci (Bologna) is able to continue to play."
        },
        {
            "gameTime": "1 - 33:10",
            "label": "injury",
            "description": "Ladislav Krejci (Bologna) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 32:46",
            "label": "corner",
            "description": "Ladislav Krejci (Bologna) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 28:00",
            "label": "",
            "description": "Adam Masina (Bologna) tries his luck with a shot from long distance after receiving a good pass. He hits the ball poorly and sends it into orbit."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "soccer-ball",
            "description": "Goal! Federico Fazio (AS Roma) pounced on a loose ball inside the box and beats the goalkeeper with a shot inside the right post. He makes it 0:1."
        },
        {
            "gameTime": "1 - 24:30",
            "label": "corner",
            "description": "Stephan El Shaarawy (AS Roma) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 24:20",
            "label": "",
            "description": "Edin Dzeko (AS Roma) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. AS Roma get a corner."
        },
        {
            "gameTime": "1 - 20:27",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Erick Pulgar (Bologna)."
        },
        {
            "gameTime": "1 - 20:18",
            "label": "",
            "description": "Blerim Dzemaili (Bologna) serves up a nice cross, but Wojciech Szczesny punches the ball away. Bologna force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 18:50",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) was too fierce in his attempt to get the ball from his opponent and Antonio Damato blows for a foul."
        },
        {
            "gameTime": "1 - 12:50",
            "label": "",
            "description": "Simone Verdi (Bologna) receives a good pass and from just outside the box he unleashes a promising strike, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 11:16",
            "label": "corner",
            "description": "Stephan El Shaarawy (AS Roma) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 10:56",
            "label": "corner",
            "description": "Stephan El Shaarawy (AS Roma) takes the resulting corner which is well defended. AS Roma will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 10:32",
            "label": "",
            "description": "Mohamed Salah (AS Roma) races towards goal but the defender gets back well to make a challenge. The linesman points to the corner flag, AS Roma are going to take it."
        },
        {
            "gameTime": "1 - 04:48",
            "label": "",
            "description": "Flag goes up against Mohamed Salah (AS Roma) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 03:20",
            "label": "",
            "description": "Simone Verdi (Bologna) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Antonio Damato."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma have played 21 games so far this season that have had over 2.5 total goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma have celebrated at least one goal in each of their last 13 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "7 that's the number of matches that Bologna have lost at home so far this season, while they have lost 7x away."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "09/04/2017 - 16:00",
    "gameHomeTeam": "Bologna",
    "gameScore": "0 - 3"
}