{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2016-09-13 - 21-45 Barcelona 7 - 0 Celtic/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "",
            "label": "",
            "description": "What a terrific football game that was, with everything included. The game was controlled by the home side. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        },
        {
            "gameTime": "2 - 47:08",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 45:39",
            "label": "",
            "description": "Moussa Dembele (Celtic) is caught offside!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "soccer-ball",
            "description": "Goal! Luis Suarez (Barcelona) finds himself some space inside the box to get on the end of a pass from Lionel Messi, then sends the ball low into the middle of the net. 7:0."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "corner",
            "description": "Barcelona quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 42:57",
            "label": "",
            "description": "OFF THE POST! Lionel Messi (Barcelona) found himself some space to take a shot from just outside the box. His effort was headed to the left side of the goal, but Dorus de Vries came up with a save and tipped the ball onto the post. The referee points to the corner flag and Barcelona will take a corner."
        },
        {
            "gameTime": "2 - 39:02",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 15:4."
        },
        {
            "gameTime": "2 - 37:24",
            "label": "",
            "description": "Luis Suarez (Barcelona) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 36:26",
            "label": "",
            "description": "Lionel Messi (Barcelona) attempts to slip the ball through the defence, but is unable to find any of his teammates. The ball is off of the pitch and it's a goal kick for Celtic."
        },
        {
            "gameTime": "2 - 34:19",
            "label": "",
            "description": "Ovidiu Hategan blows his whistle for a foul after Rafinha (Barcelona) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 30:01",
            "label": "substitution",
            "description": "It is time for a substitution. Callum McGregor (Celtic) is on for Nir Bitton."
        },
        {
            "gameTime": "2 - 29:03",
            "label": "soccer-ball",
            "description": "Luis Suarez (Barcelona) meets a perfect cross from Neymar deep inside the box and controls it with a nice first touch. He produces an accurate strike into the top left corner. It's 6:0."
        },
        {
            "gameTime": "2 - 28:49",
            "label": "",
            "description": "Kieran Tierney (Celtic) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 28:24",
            "label": "",
            "description": "A player from Barcelona commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "2 - 28:10",
            "label": "",
            "description": "Barcelona show off their ball retention skills as they exchange one two passes and the move is only interrupted when the final pass is intercepted."
        },
        {
            "gameTime": "2 - 26:38",
            "label": "corner",
            "description": "The resulting corner from Lionel Messi (Barcelona) comes to nothing."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "",
            "description": "Luis Suarez (Barcelona) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee and one of his assistants signal for a corner kick to Barcelona."
        },
        {
            "gameTime": "2 - 26:12",
            "label": "",
            "description": "Rafinha (Barcelona) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 25:38",
            "label": "",
            "description": "Kieran Tierney (Celtic) fires the ball on goal, but his attempt goes well wide of the left post."
        },
        {
            "gameTime": "2 - 24:48",
            "label": "",
            "description": "Luis Suarez (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 22:56",
            "label": "substitution",
            "description": "Brendan Rodgers has decided to make a change. Eoghan O'Connell (Celtic) replaces Erik Sviatchenko."
        },
        {
            "gameTime": "2 - 22:33",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Stuart Armstrong (Celtic) for Patrick Roberts."
        },
        {
            "gameTime": "2 - 21:58",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Neymar (Barcelona) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "2 - 21:41",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 21:17",
            "label": "",
            "description": "The ball is cleared after Luis Suarez (Barcelona) attempted to dribble past an opposing player. Barcelona get a corner."
        },
        {
            "gameTime": "2 - 20:29",
            "label": "",
            "description": "An attempted cross from Neymar (Barcelona) is cleared."
        },
        {
            "gameTime": "2 - 19:39",
            "label": "",
            "description": "Nir Bitton (Celtic) gets into a good shooting position. He wins some space for himself and drills a long range daisy cutter towards the middle of the goal. His good effort is, however, superbly saved by Marc Andre ter Stegen!"
        },
        {
            "gameTime": "2 - 18:34",
            "label": "",
            "description": "Neymar (Barcelona) looks to break free, but an opposing player clears the ball away. The ball is out of play. Barcelona will take a throw in."
        },
        {
            "gameTime": "2 - 17:31",
            "label": "",
            "description": "Ovidiu Hategan blows his whistle. Jordi Alba (Barcelona) commits a foul after dangerous play."
        },
        {
            "gameTime": "2 - 15:15",
            "label": "substitution",
            "description": "Substitution. Sergio Busquets walks off the pitch and Rafinha (Barcelona) comes on as a substitute."
        },
        {
            "gameTime": "2 - 14:12",
            "label": "soccer-ball",
            "description": "Goal Lionel Messi (Barcelona)! Lionel Messi (Barcelona) was put through by Luis Suarez and he showed brilliant composure inside the box to bury the ball into the back of the net. 5:0."
        },
        {
            "gameTime": "2 - 13:51",
            "label": "soccer-ball",
            "description": "It's a goal! Neymar plays the ball to the feet of Andres Iniesta (Barcelona), who hits a tremendous first time shot into the roof of the net. The goalkeeper was unable to keep it out. 4:0."
        },
        {
            "gameTime": "2 - 10:54",
            "label": "y-card",
            "description": "Scott Brown (Celtic) picked up a yellow card from referee."
        },
        {
            "gameTime": "2 - 09:51",
            "label": "",
            "description": "Scott Sinclair (Celtic) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 09:14",
            "label": "",
            "description": "Lionel Messi (Barcelona) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 08:07",
            "label": "",
            "description": "Andres Iniesta (Barcelona) attempts a long crossfield pass, but the defence does well to intercept the ball."
        },
        {
            "gameTime": "2 - 07:33",
            "label": "funfact",
            "description": "67:33 – this is the current ball possession ratio."
        },
        {
            "gameTime": "2 - 04:25",
            "label": "soccer-ball",
            "description": "Neymar (Barcelona) stands over the free kick from 22 out and sends a wonderful curling shot that goes into the top left corner. What a goal that is!"
        },
        {
            "gameTime": "2 - 03:08",
            "label": "",
            "description": "Nir Bitton (Celtic) should know this behaviour is beyond the rules. He was too careless with his challenge and left Ovidiu Hategan no option but to blow his whistle. Barcelona are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 02:24",
            "label": "",
            "description": "Barcelona slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Luis Enrique makes a half time substitution. Andres Iniesta (Barcelona) comes on in place of Ivan Rakitic."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have seen an attractive offensive game so far and the fans have nothing to complain about. Barcelona dominated the opening period and easily created the most chances. The visitors have been very flat and lacked creativity in their attack. Let's see if they change something in the second period."
        },
        {
            "gameTime": "1 - 45:03",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 44:09",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives the ball inside the penalty box and immediately fires a first time effort, but it goes well over the top."
        },
        {
            "gameTime": "1 - 42:47",
            "label": "",
            "description": "Lionel Messi (Barcelona) plays a one two with Luis Suarez, but the move breaks down."
        },
        {
            "gameTime": "1 - 41:40",
            "label": "",
            "description": "A goal, which was scored by Scott Sinclair (Celtic), was disallowed due to offside."
        },
        {
            "gameTime": "1 - 39:19",
            "label": "y-card",
            "description": "Ivan Rakitic (Barcelona) sees a yellow card from Ovidiu Hategan after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 38:10",
            "label": "",
            "description": "The Barcelona players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition."
        },
        {
            "gameTime": "1 - 34:57",
            "label": "",
            "description": "What a sweet touch by Neymar (Barcelona) as he collects a pass deep inside the box and decides to go for goal. It's on target but easy for Dorus de Vries to hold."
        },
        {
            "gameTime": "1 - 33:48",
            "label": "",
            "description": "The ball from the corner kick lands at the feet of Ivan Rakitic (Barcelona) deep inside the box and he takes a shot. The strike heads towards the bottom left corner, but it's deflected away thanks to a brilliant intervention by one of the defenders."
        },
        {
            "gameTime": "1 - 33:37",
            "label": "corner",
            "description": "There's an opportunity for Neymar (Barcelona) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 33:17",
            "label": "",
            "description": "Neymar (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Corner kick. Barcelona will have an opportunity."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "",
            "description": "Andre Gomes (Barcelona) reacts well to latch onto a rebound inside the box, but his shot is well blocked."
        },
        {
            "gameTime": "1 - 32:26",
            "label": "",
            "description": "Moussa Dembele (Celtic) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 31:31",
            "label": "",
            "description": "Luis Suarez (Barcelona) receives a precise pass inside the box and takes a shot that flies just wide of the left post."
        },
        {
            "gameTime": "1 - 30:14",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 29:55",
            "label": "",
            "description": "Sergi Roberto (Barcelona) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "1 - 28:33",
            "label": "",
            "description": "Neymar (Barcelona) commits a rough foul. Ovidiu Hategan stops the game and makes a call."
        },
        {
            "gameTime": "1 - 26:58",
            "label": "soccer-ball",
            "description": "Goal! Neymar passes the ball to the feet of Lionel Messi (Barcelona), who has an empty net in front of him and has no problems in tapping the ball in. 2:0."
        },
        {
            "gameTime": "1 - 24:52",
            "label": "corner",
            "description": "Scott Sinclair (Celtic) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 24:40",
            "label": "",
            "description": "Moussa Dembele (Celtic) shoots from outside the box, but his effort is blocked. The ball is out of play. Celtic win a corner kick."
        },
        {
            "gameTime": "1 - 24:00",
            "label": "corner",
            "description": "Scott Sinclair (Celtic) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 23:55",
            "label": "penalty-missed",
            "description": "Moussa Dembele (Celtic) wastes a huge opportunity to score from the penalty spot. He attempts to slot into the left side of the target, but Marc Andre ter Stegen pulls off a superb save. Celtic force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 23:49",
            "label": "",
            "description": "Moussa Dembele (Celtic) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 22:56",
            "label": "y-card",
            "description": "A yellow card for a tackle by Marc Andre ter Stegen (Barcelona). Ovidiu Hategan doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 22:55",
            "label": "penalty",
            "description": "Marc Andre ter Stegen (Barcelona) was trying to get to the ball but clattered into the legs of the opponent as well. Ovidiu Hategan blows his whistle for an infringement. The referee blows his whistle and awards Celtic a penalty after chaos inside the box."
        },
        {
            "gameTime": "1 - 22:07",
            "label": "",
            "description": "Neymar (Barcelona) sends a chip pass into the box, but Dorus de Vries is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 20:46",
            "label": "",
            "description": "Good movement by Lionel Messi (Barcelona), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "1 - 20:34",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 20:03",
            "label": "",
            "description": "Lionel Messi (Barcelona) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession. The ball is out of play and Barcelona manage to earn a corner."
        },
        {
            "gameTime": "1 - 17:53",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Celtic was in an offside position."
        },
        {
            "gameTime": "1 - 17:04",
            "label": "",
            "description": "Lionel Messi (Barcelona) attempts to find Luis Suarez, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 16:51",
            "label": "corner",
            "description": "Neymar (Barcelona) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 16:02",
            "label": "",
            "description": "Luis Suarez (Barcelona) blasts the ball from just outside the box, but his attempt is blocked by the defender. The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 15:22",
            "label": "",
            "description": "Lionel Messi (Barcelona) jinks his way past two defenders and from the edge of the box has an effort which goes just wide of the left post."
        },
        {
            "gameTime": "1 - 13:13",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 12:44",
            "label": "",
            "description": "Sergio Busquets (Barcelona) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. Now Barcelona have a corner."
        },
        {
            "gameTime": "1 - 11:28",
            "label": "",
            "description": "Barcelona produce a short pass from the free kick."
        },
        {
            "gameTime": "1 - 11:13",
            "label": "",
            "description": "A player from Celtic brings down an opponent and commits a foul."
        },
        {
            "gameTime": "1 - 09:53",
            "label": "",
            "description": "Kieran Tierney (Celtic) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 07:06",
            "label": "",
            "description": "Sergio Busquets (Barcelona) fails to find a teammate across the pitch with a long ball. The ball goes out of play and Celtic will have a goal kick."
        },
        {
            "gameTime": "1 - 05:33",
            "label": "",
            "description": "Jordi Alba (Barcelona) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 02:55",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Lionel Messi (Barcelona) was set free in the area by Neymar and made no mistake with a lovely finish into the top of the net. 1:0."
        },
        {
            "gameTime": "1 - 02:37",
            "label": "corner",
            "description": "Neymar (Barcelona) takes a short corner kick."
        },
        {
            "gameTime": "1 - 02:09",
            "label": "",
            "description": "Lionel Messi (Barcelona) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off. Barcelona have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 00:34",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Kieran Tierney (Celtic) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Celtic will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ovidiu Hategan got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a terrific football game that was, with everything included. The game was controlled by the home side. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        }
    ],
    "gameAwayTeam": "Celtic",
    "gameDate": "13/09/2016 - 21:45",
    "gameHomeTeam": "Barcelona",
    "gameScore": "7 - 0"
}