{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-03 - 22-45 Manchester United 1 - 0 CSKA Moscow/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. Manchester United were dominant and more threatening of the two sides. It was a fairly one sided match. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        },
        {
            "gameTime": "2 - 49:06",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 49:00",
            "label": "",
            "description": "Memphis Depay (Manchester United) fires in an effort from the free kick from some 20 metres. His strike is very inaccurate and ends in row Z."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Sergey Ignashevich (CSKA Moscow). Szymon Marciniak saw the sliding tackle and blows for a foul. Manchester United are awarded a free kick."
        },
        {
            "gameTime": "2 - 47:35",
            "label": "",
            "description": "An accurate cross finds its way to Aleksey Berezutski (CSKA Moscow) who sends in a bullet header towards the middle of the target from just outside the box, but the goalkeeper makes the save."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "corner",
            "description": "Georgi Milanov (CSKA Moscow) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "The free kick from long range, taken by CSKA Moscow, is intercepted by one of the defenders. CSKA Moscow force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 46:11",
            "label": "",
            "description": "Marouane Fellaini (Manchester United) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision! There is a free kick near the sideline to CSKA Moscow."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:35",
            "label": "substitution",
            "description": "Louis van Gaal has decided to make a change. Ander Herrera (Manchester United) replaces Bastian Schweinsteiger."
        },
        {
            "gameTime": "2 - 42:46",
            "label": "",
            "description": "CSKA Moscow are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 40:43",
            "label": "",
            "description": "Pontus Wernbloom (CSKA Moscow) unleashes a shot from 20 metres out but is unable to find the target and it goes well wide of the left post."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "substitution",
            "description": "The substitution has been made. Kirill Panchenko (CSKA Moscow) has replaced Alan Dzagoev."
        },
        {
            "gameTime": "2 - 39:38",
            "label": "",
            "description": "Wayne Rooney (Manchester United) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 38:55",
            "label": "",
            "description": "Marouane Fellaini (Manchester United) is caught offside!"
        },
        {
            "gameTime": "2 - 37:49",
            "label": "funfact",
            "description": "10:2 – the corner kicks stats."
        },
        {
            "gameTime": "2 - 37:18",
            "label": "",
            "description": "Jesse Lingard (Manchester United) swings a cross into the box, but it's far too close to Igor Akinfeev, who smothers the ball."
        },
        {
            "gameTime": "2 - 36:00",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Memphis Depay (Manchester United) takes it short."
        },
        {
            "gameTime": "2 - 35:38",
            "label": "",
            "description": "Jesse Lingard (Manchester United) latches on to a precise pass and one on one with the keeper slams the ball towards the right hand post. Igor Akinfeev is alert, though, and leaps like a salmon to deny him. Manchester United earn a corner."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "soccer-ball",
            "description": "Goal! Jesse Lingard finds Wayne Rooney (Manchester United) and he shows great determination to get to the ball and plant a header into the back of the net. 1:0."
        },
        {
            "gameTime": "2 - 33:00",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Georgi Milanov (CSKA Moscow). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 32:19",
            "label": "",
            "description": "Seydou Doumbia (CSKA Moscow) breaks into the penalty area but his shot is blocked. The ball goes out of play and CSKA Moscow have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:04",
            "label": "substitution",
            "description": "Leonid Slutski has decided to substitute Zoran Tosic and he is replaced by Aleksandr Golovin (CSKA Moscow)."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "",
            "description": "What a chance for Michael Carrick (Manchester United) as he produced a stunning snap shot from the edge of the box! The goalkeeper was a bit lucky as the ball went just wide of the right post."
        },
        {
            "gameTime": "2 - 28:31",
            "label": "substitution",
            "description": "It is time for a substitution. Memphis Depay (Manchester United) is on for Mata."
        },
        {
            "gameTime": "2 - 27:36",
            "label": "",
            "description": "Ashley Young (Manchester United) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "2 - 25:07",
            "label": "",
            "description": "Zoran Tosic (CSKA Moscow) sprays a pass out to Seydou Doumbia, but he can't beat his man inside the box."
        },
        {
            "gameTime": "2 - 23:22",
            "label": "corner",
            "description": "The corner kick from Wayne Rooney (Manchester United) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 22:59",
            "label": "",
            "description": "Wayne Rooney (Manchester United) sends a sweet pass into the penalty area, but one of the defenders averts the danger. Manchester United win a corner."
        },
        {
            "gameTime": "2 - 22:36",
            "label": "",
            "description": "Manchester United keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "2 - 20:31",
            "label": "substitution",
            "description": "The manager makes a subsitution with Marouane Fellaini (Manchester United) coming on for Anthony Martial."
        },
        {
            "gameTime": "2 - 19:53",
            "label": "",
            "description": "Wayne Rooney (Manchester United) pulls the jersey of one of the opposition players and Szymon Marciniak blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 18:30",
            "label": "funfact",
            "description": "Here's the latest number of offsides – 12:1."
        },
        {
            "gameTime": "2 - 18:05",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 17:46",
            "label": "",
            "description": "Ahmed Musa (CSKA Moscow) attempts to surprise the keeper with a shot from distance, but it lacks accuracy and goes high over the crossbar."
        },
        {
            "gameTime": "2 - 16:14",
            "label": "",
            "description": "Ashley Young (Manchester United) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 14:25",
            "label": "y-card",
            "description": "A yellow card for a tackle by Pontus Wernbloom (CSKA Moscow). Szymon Marciniak doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 14:00",
            "label": "",
            "description": "Ahmed Musa (CSKA Moscow) sends a cross into the box, but David de Gea comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 13:28",
            "label": "",
            "description": "The Manchester United players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "2 - 11:44",
            "label": "",
            "description": "Dangerous play by Michael Carrick (Manchester United). Szymon Marciniak blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 11:11",
            "label": "",
            "description": "The linesman signals that Seydou Doumbia (CSKA Moscow) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 10:37",
            "label": "",
            "description": "Flag goes up against Anthony Martial (Manchester United) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "substitution",
            "description": "Bibras Natcho will be replaced by Seydou Doumbia (CSKA Moscow)."
        },
        {
            "gameTime": "2 - 09:46",
            "label": "",
            "description": "The game is interrupted as Jesse Lingard (Manchester United) is flagged offside."
        },
        {
            "gameTime": "2 - 08:48",
            "label": "corner",
            "description": "The resulting corner from Juan Manuel Mata (Manchester United) is cleared by the defence."
        },
        {
            "gameTime": "2 - 08:34",
            "label": "corner",
            "description": "Mata (Manchester United) takes the corner kick but the ball only finds the head of an opponent. The linesman points to the corner flag, Manchester United are going to take it."
        },
        {
            "gameTime": "2 - 08:14",
            "label": "",
            "description": "Anthony Martial (Manchester United) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out for a corner. Manchester United can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 07:27",
            "label": "",
            "description": "Jesse Lingard (Manchester United) meets a cross inside the box, but Igor Akinfeev wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "",
            "description": "Jesse Lingard (Manchester United) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 06:02",
            "label": "corner",
            "description": "Juan Manuel Mata (Manchester United) swings in the corner, but the goalkeeper does a brilliant job to intercept the effort."
        },
        {
            "gameTime": "2 - 05:48",
            "label": "",
            "description": "Ashley Young (Manchester United) flights in the cross, but the defender is alert and clears to safety. The ball is out of play. Manchester United will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 04:51",
            "label": "",
            "description": "A decent save by Igor Akinfeev. Anthony Martial (Manchester United) finds some space near the penalty spot to meet a cross and head it down to the middle of the goal, but the effort is saved by the goalkeeper."
        },
        {
            "gameTime": "2 - 03:46",
            "label": "",
            "description": "Manchester United keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "2 - 01:55",
            "label": "",
            "description": "Marcos Rojo (Manchester United) rises above the defence to meet a cross from the corner. His timing is good, but he directs his header just a few inches wide of the right post."
        },
        {
            "gameTime": "2 - 01:30",
            "label": "corner",
            "description": "The ball is out of play. Manchester United win a corner kick."
        },
        {
            "gameTime": "2 - 01:25",
            "label": "",
            "description": "Jesse Lingard (Manchester United) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 00:55",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. It was a fairly one sided opening 45 minutes, with Manchester United much the better side better so far. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "corner",
            "description": "Jesse Lingard (Manchester United) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 44:43",
            "label": "",
            "description": "Marcos Rojo (Manchester United) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball is out of play and Manchester United manage to earn a corner."
        },
        {
            "gameTime": "1 - 43:02",
            "label": "",
            "description": "Jesse Lingard (Manchester United) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 42:15",
            "label": "",
            "description": "Anthony Martial (Manchester United) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 40:32",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 15:5."
        },
        {
            "gameTime": "1 - 39:25",
            "label": "",
            "description": "The linesman raises his flag for offside before Wayne Rooney (Manchester United) heads on."
        },
        {
            "gameTime": "1 - 38:21",
            "label": "",
            "description": "Chris Smalling (Manchester United) is flagged for offside."
        },
        {
            "gameTime": "1 - 38:05",
            "label": "corner",
            "description": "Manchester United take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 37:42",
            "label": "",
            "description": "Bastian Schweinsteiger (Manchester United) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. Manchester United get a corner."
        },
        {
            "gameTime": "1 - 37:16",
            "label": "",
            "description": "Daley Blind (Manchester United) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Szymon Marciniak blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 36:42",
            "label": "corner",
            "description": "The corner from Jesse Lingard (Manchester United) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 36:26",
            "label": "",
            "description": "Jesse Lingard (Manchester United) fails to send a pass into the box as his effort is cut out. Manchester United will take a corner kick."
        },
        {
            "gameTime": "1 - 35:32",
            "label": "",
            "description": "Marcos Rojo (Manchester United) comes close to scoring. He peels away from his marker and gets on the end of a cross from Ashley Young, but he hits a shot just wide of the left post."
        },
        {
            "gameTime": "1 - 34:51",
            "label": "",
            "description": "Bastian Schweinsteiger (Manchester United) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 34:11",
            "label": "",
            "description": "Georgi Schennikov (CSKA Moscow) gets on the ball and beats an opponent, but his run is stopped by the referee Szymon Marciniak who sees an offensive foul."
        },
        {
            "gameTime": "1 - 33:30",
            "label": "",
            "description": "Flag up against Anthony Martial (Manchester United). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 31:45",
            "label": "",
            "description": "Igor Akinfeev doesn't have to worry about this one. Ashley Young plays a pass into the feet of Jesse Lingard (Manchester United), who is unable to find the target as his effort from inside the box goes high over the bar."
        },
        {
            "gameTime": "1 - 30:25",
            "label": "",
            "description": "Anthony Martial (Manchester United) is penalised for a foul. Szymon Marciniak had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 29:13",
            "label": "",
            "description": "Wayne Rooney (Manchester United) sends in a lofted cross from a mid range free kick. His effort, however, goes out of play."
        },
        {
            "gameTime": "1 - 28:16",
            "label": "",
            "description": "Sergey Ignashevich (CSKA Moscow) tackles a bit over zealously and Szymon Marciniak blows for a foul. Manchester United will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 27:30",
            "label": "",
            "description": "Neat link up play between Jesse Lingard (Manchester United) and Anthony Martial, but Igor Akinfeev reads the game well and the move breaks down."
        },
        {
            "gameTime": "1 - 26:28",
            "label": "",
            "description": "The game is interrupted, a clear handball by Bastian Schweinsteiger (Manchester United)."
        },
        {
            "gameTime": "1 - 26:08",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Marcos Rojo (Manchester United), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "1 - 24:43",
            "label": "",
            "description": "Manchester United are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 22:01",
            "label": "",
            "description": "Bastian Schweinsteiger (Manchester United) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 20:34",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "1 - 19:42",
            "label": "y-card",
            "description": "Szymon Marciniak shows a yellow card to Georgi Schennikov (CSKA Moscow), who isn't surprised as the tackle was really hard and late. It's a free kick to Manchester United, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 18:17",
            "label": "",
            "description": "Szymon Marciniak blows his whistle as Bibras Natcho (CSKA Moscow) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 17:06",
            "label": "",
            "description": "Marcos Rojo (Manchester United) unleashes a shot from 25 metres out but is unable to find the target and it goes well wide of the right post. The ball goes out of play and CSKA Moscow will have a goal kick."
        },
        {
            "gameTime": "1 - 15:54",
            "label": "",
            "description": "The linesman raises his flag. Anthony Martial (Manchester United) is adjudged offside."
        },
        {
            "gameTime": "1 - 15:00",
            "label": "",
            "description": "Juan Manuel Mata (Manchester United) wastes a great scoring opportunity! He receives a precise lofted cross inside the box and sends a quick low shot towards the middle of the goal. His effort lacks pace and that allows Igor Akinfeev to make a comfortable save."
        },
        {
            "gameTime": "1 - 14:37",
            "label": "",
            "description": "A cross from Marcos Rojo (Manchester United) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 13:38",
            "label": "",
            "description": "CSKA Moscow are showing great team chemistry. They are passing the ball around seamlessly but finally one of the defending players makes an interception."
        },
        {
            "gameTime": "1 - 11:46",
            "label": "",
            "description": "Anthony Martial (Manchester United) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 10:38",
            "label": "",
            "description": "Marcos Rojo (Manchester United) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "1 - 10:16",
            "label": "",
            "description": "Sergey Ignashevich (CSKA Moscow) makes a strong challenge and Szymon Marciniak blows for a foul."
        },
        {
            "gameTime": "1 - 09:31",
            "label": "",
            "description": "Jesse Lingard (Manchester United) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies into the stands."
        },
        {
            "gameTime": "1 - 08:51",
            "label": "corner",
            "description": "Wayne Rooney (Manchester United) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 08:37",
            "label": "",
            "description": "Marcos Rojo (Manchester United) fails to turn the rebound in from a promising position. The goalkeeper pulls off a superb save and denies his effort. Manchester United have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 06:34",
            "label": "",
            "description": "Jesse Lingard (Manchester United) wriggles into space and fires the ball from the edge of the area, but one of the defenders is there to block the effort."
        },
        {
            "gameTime": "1 - 05:42",
            "label": "",
            "description": "Anthony Martial (Manchester United) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 05:17",
            "label": "",
            "description": "Marcos Rojo (Manchester United) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "1 - 03:44",
            "label": "",
            "description": "Wasted opportunity. Wayne Rooney (Manchester United) gets to the rebound inside the box and smashes the ball just wide of the right post."
        },
        {
            "gameTime": "1 - 01:02",
            "label": "",
            "description": "Manchester United are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "CSKA Moscow will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Szymon Marciniak was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. Manchester United were dominant and more threatening of the two sides. It was a fairly one sided match. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        }
    ],
    "gameAwayTeam": "CSKA Moscow",
    "gameDate": "03/11/2015 - 22:45",
    "gameHomeTeam": "Manchester United",
    "gameScore": "1 - 0"
}