{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/france_ligue-1/2016-2017/2017-02-10 - 22-45 Bordeaux 0 - 3 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:25",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 42:40",
            "label": "",
            "description": "Some neat passing and movement from Paris SG as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "2 - 37:51",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Adrien Rabiot (Paris SG) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "2 - 35:47",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Bordeaux was in an offside position."
        },
        {
            "gameTime": "2 - 32:57",
            "label": "",
            "description": "Christopher Nkunku (Paris SG) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards over the bar."
        },
        {
            "gameTime": "2 - 32:37",
            "label": "substitution",
            "description": "Here's the change. Malcom leaves the pitch and Gaetan Laborde (Bordeaux) comes on as a substitute."
        },
        {
            "gameTime": "2 - 32:23",
            "label": "",
            "description": "Milan Gajic (Bordeaux) sends a long ball in, but Kevin Trapp comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 30:37",
            "label": "",
            "description": "Jeremy Toulalan sends a good ball to the edge of the box and Diego Rolan (Bordeaux) gets in a shot which goes narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 26:07",
            "label": "substitution",
            "description": "Here is a change. Edinson Cavani is going off and Unai Emery Etxegoien gives the last tactical orders to Hatem Ben Arfa (Paris SG)."
        },
        {
            "gameTime": "2 - 24:53",
            "label": "",
            "description": "Younousse Sankhare (Bordeaux) has a big opportunity to score! He climbs highest deep inside the penalty box and strikes a powerful header towards the goal. Next time he should aim better as his effort flies narrowly over the bar."
        },
        {
            "gameTime": "2 - 24:09",
            "label": "corner",
            "description": "Bordeaux didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 23:37",
            "label": "",
            "description": "Milan Gajic (Bordeaux) attempts a long crossfield pass, but the defence does well to intercept the ball. Now Bordeaux have a corner."
        },
        {
            "gameTime": "2 - 22:41",
            "label": "",
            "description": "Julian Draxler (Paris SG) passes the ball onto Edinson Cavani, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "",
            "description": "A pass from Francois Kamano (Bordeaux) is intercepted by Kevin Trapp and the move breaks down."
        },
        {
            "gameTime": "2 - 20:27",
            "label": "substitution",
            "description": "The game has come to an end for Jaroslav Plasil. He has contributed as much as he could today. He will be replaced by the fresh legs of Valentin Vada (Bordeaux)."
        },
        {
            "gameTime": "2 - 18:24",
            "label": "corner",
            "description": "The resulting set piece from Bordeaux is comfortably intercepted by one of the defending players."
        },
        {
            "gameTime": "2 - 17:35",
            "label": "",
            "description": "Bordeaux move the ball around well as they wait for an opportunity to shoot, but the attack is halted as they lose possession. The referee points to the corner flag. It's a corner to Bordeaux."
        },
        {
            "gameTime": "2 - 17:30",
            "label": "substitution",
            "description": "The referee signals a substitution. Julian Draxler (Paris SG) is brought on as a substitute for Angel Di Maria."
        },
        {
            "gameTime": "2 - 14:24",
            "label": "substitution",
            "description": "Unai Emery has decided to substitute Marco Verratti and he is replaced by Christopher Nkunku (Paris SG)."
        },
        {
            "gameTime": "2 - 11:41",
            "label": "substitution",
            "description": "Substitution. Francois Kamano (Bordeaux) in, Jeremy Menez out."
        },
        {
            "gameTime": "2 - 09:42",
            "label": "corner",
            "description": "None of the Paris SG players could reach the corner kick as the ball was overhit and goes out of play."
        },
        {
            "gameTime": "2 - 08:48",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) will deliver the ball into the penalty box from a corner kick. Angel Di Maria (Paris SG) launches an inaccurate corner kick into the penalty area. Paris SG have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 08:45",
            "label": "",
            "description": "Lucas (Paris SG) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. Paris SG have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 08:05",
            "label": "",
            "description": "Some patient build up play from Paris SG as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 01:58",
            "label": "soccer-ball",
            "description": "0:3. Edinson Cavani (Paris SG) latches on to a pass on the edge of the penalty area and immediately fires a fantastic first time shot into the left side of the net. What a finish that is! Cedric Carrasso did his best to stop it, but the shot was just too good. Angel Di Maria provided the assistance."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Nicolas Rainville blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:08",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 39:45",
            "label": "soccer-ball",
            "description": "Goal! Marco Verratti gets to the ball, slips Angel Di Maria (Paris SG) into the area and he scores with a delightful chipped finish to make it 0:2."
        },
        {
            "gameTime": "1 - 37:15",
            "label": "",
            "description": "Lucas (Paris SG) passes the ball and slows down the tempo so his team can continue with their combination play."
        },
        {
            "gameTime": "1 - 31:44",
            "label": "",
            "description": "Youssouf Sabaly (Bordeaux) sends a long ball in, but Kevin Trapp comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 28:23",
            "label": "",
            "description": "Adrien Rabiot (Paris SG) sprays a pass out to Angel Di Maria, but he can't beat his man inside the box."
        },
        {
            "gameTime": "1 - 25:20",
            "label": "",
            "description": "One of the players from Paris SG times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 22:08",
            "label": "",
            "description": "Diego Rolan (Bordeaux) shoots from the edge of the penalty area. The ball travels towards the target, but Kevin Trapp easily deals with the threat."
        },
        {
            "gameTime": "1 - 20:44",
            "label": "y-card",
            "description": "Thiago Motta (Paris SG) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "1 - 19:20",
            "label": "corner",
            "description": "Bordeaux take the corner, but their hopes of scoring a goal end with nice clearance by the defence."
        },
        {
            "gameTime": "1 - 19:12",
            "label": "",
            "description": "Nicolas Pallois (Bordeaux) unleashes a long range free kick, but the goalkeeper does well to make a fine save. The ball goes behind for a corner. Bordeaux will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 17:41",
            "label": "",
            "description": "Younousse Sankhare (Bordeaux) rises high on the edge of the box to meet a cross and plants a powerful header goalwards, but Kevin Trapp is alert and makes a decent save to deny him."
        },
        {
            "gameTime": "1 - 16:24",
            "label": "",
            "description": "Lucas (Paris SG) takes a long range free kick and whips it into the box. The goalkeeper reads it well and leaps high to intercept the ball."
        },
        {
            "gameTime": "1 - 14:55",
            "label": "",
            "description": "Cedric Carrasso earns applause from the crowd! He dives superbly to deny a dangerous first time effort from the edge of the box. Angel Di Maria (Paris SG) was the player who tested the keeper's reflexes. Nice goalkeeping skills, indeed."
        },
        {
            "gameTime": "1 - 13:17",
            "label": "",
            "description": "Jeremy Toulalan (Bordeaux) makes an unfair challenge by holding his opponent to prevent him from getting the ball. A free kick to Paris SG."
        },
        {
            "gameTime": "1 - 11:43",
            "label": "",
            "description": "A cross into the box from Vukasin Jovanovic (Bordeaux) is cleared."
        },
        {
            "gameTime": "1 - 07:40",
            "label": "",
            "description": "Jeremy Menez (Bordeaux) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "1 - 05:42",
            "label": "soccer-ball",
            "description": "Edinson Cavani (Paris SG) gets to the ball on the edge of the box and fires in a first time shot without any hesitation. The strike is excellent and goes inside the left post. He couldn't have done it any better. 0:1."
        },
        {
            "gameTime": "1 - 03:23",
            "label": "",
            "description": "Bordeaux hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Paris SG will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Nicolas Rainville will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's the end of the match."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "10/02/2017 - 22:45",
    "gameHomeTeam": "Bordeaux",
    "gameScore": "0 - 3"
}