{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-12-09 - 22-45 Real Madrid 4 - 0 Ludogorets/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The home side dominated this game. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        },
        {
            "gameTime": "2 - 48:47",
            "label": "whistle",
            "description": "Clement Turpin is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:17",
            "label": "corner",
            "description": "Asier Illarramendi (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "The Real Madrid players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition. Real Madrid earn a corner."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 42:49",
            "label": "soccer-ball",
            "description": "Alvaro Medran (Real Madrid) scores! He latches on to a pass and produces a perfect strike from the edge of the box that goes into the roof of the net and past the goalkeeper."
        },
        {
            "gameTime": "2 - 40:45",
            "label": "corner",
            "description": "The corner from Dani Abalo (Ludogorets) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 40:40",
            "label": "",
            "description": "A cross from a mid range free kick, taken by Ludogorets, is intercepted by one of the defenders. Ludogorets have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 40:38",
            "label": "y-card",
            "description": "The foul by Marcelo (Real Madrid) is worthy of a card and a yellow is duly shown by Clement Turpin. A free kick to Ludogorets."
        },
        {
            "gameTime": "2 - 38:55",
            "label": "",
            "description": "The linesman raises his flag. Yordan Minev (Ludogorets) is adjudged offside."
        },
        {
            "gameTime": "2 - 37:48",
            "label": "corner",
            "description": "Isco (Real Madrid) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 37:42",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Alvaro Medran (Real Madrid) will replace Gareth Bale."
        },
        {
            "gameTime": "2 - 36:49",
            "label": "",
            "description": "Gareth Bale (Real Madrid) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. Real Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 34:12",
            "label": "soccer-ball",
            "description": "Alvaro Arbeloa (Real Madrid) has a great chance inside the box and puts the ball into the back of the net."
        },
        {
            "gameTime": "2 - 33:56",
            "label": "corner",
            "description": "Isco (Real Madrid) will take the corner."
        },
        {
            "gameTime": "2 - 33:39",
            "label": "",
            "description": "Marcelo (Real Madrid) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. Real Madrid will take a corner kick."
        },
        {
            "gameTime": "2 - 31:51",
            "label": "",
            "description": "What a huge chance for Gareth Bale (Real Madrid). He collects a precise pass inside the box and slices a shot that goes a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 31:29",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a chip pass into the box, but Vladislav Stoyanov is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 30:56",
            "label": "",
            "description": "Juninho (Ludogorets) has a shot blocked from inside the box."
        },
        {
            "gameTime": "2 - 28:42",
            "label": "corner",
            "description": "Isco (Real Madrid) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 28:24",
            "label": "",
            "description": "Real Madrid are enjoying possession, but one of the opposition players steps in to end the sequence. Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 27:46",
            "label": "",
            "description": "Crossbar! Alvaro Arbeloa (Real Madrid) had a good opportunity when he latched on to a cross from the wing, but his header from around the penalty spot wasn't accurate enough and the ball crashed against the bar!"
        },
        {
            "gameTime": "2 - 27:26",
            "label": "corner",
            "description": "Jese (Real Madrid) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 27:06",
            "label": "",
            "description": "Gareth Bale (Real Madrid) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 26:07",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Juninho (Ludogorets) replaces Vura."
        },
        {
            "gameTime": "2 - 23:14",
            "label": "corner",
            "description": "Isco (Real Madrid) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 22:54",
            "label": "",
            "description": "Gareth Bale (Real Madrid) fires the ball at goal from inside the area, but it's well blocked. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 22:39",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Isco (Real Madrid). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 22:12",
            "label": "",
            "description": "Chicharito (Real Madrid) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Vladislav Stoyanov guesses his intention and denies him with a fine save. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "2 - 21:10",
            "label": "corner",
            "description": "A dangerous looking corner kick from Isco (Real Madrid) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 20:41",
            "label": "",
            "description": "Jese (Real Madrid) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. Real Madrid win a corner."
        },
        {
            "gameTime": "2 - 20:03",
            "label": "",
            "description": "The linesman signals that Junior Caicara (Ludogorets) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 17:47",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Fabio Espinho trots off the pitch and is replaced by Anicet (Ludogorets)."
        },
        {
            "gameTime": "2 - 17:00",
            "label": "",
            "description": "Marcelo (Real Madrid) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "2 - 15:15",
            "label": "substitution",
            "description": "Georgi Dermendzhiev decides to make a substitution. Mihail Aleksandrov will be replaced by Wanderson (Ludogorets)."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "substitution",
            "description": "Carlo Ancelotti has decided to make a change. Jese (Real Madrid) replaces Toni Kroos."
        },
        {
            "gameTime": "2 - 14:43",
            "label": "substitution",
            "description": "Substitution. Marcelo (Real Madrid) has come on for Fabio Coentrao."
        },
        {
            "gameTime": "2 - 13:02",
            "label": "corner",
            "description": "Fabio Espinho (Ludogorets) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 12:49",
            "label": "",
            "description": "Svetoslav Dyakov (Ludogorets) tested Keylor Navas with a strike from just outside the box, but the effort is saved. The ball is out of play. Ludogorets win a corner kick."
        },
        {
            "gameTime": "2 - 11:36",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) sends a teasing cross into the area, but Vladislav Stoyanov intercepts the ball."
        },
        {
            "gameTime": "2 - 10:49",
            "label": "",
            "description": "A crossfield pass from Vura (Ludogorets) fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 09:18",
            "label": "",
            "description": "A cross is clipped into the penalty area by Dani Abalo (Ludogorets) but poses no threat."
        },
        {
            "gameTime": "2 - 06:58",
            "label": "",
            "description": "This was a piece of cake for Vladislav Stoyanov. Gareth Bale (Real Madrid) found himself some space after latching on to a pass, but his strike only went low to the middle of the goal and into the gloves of the prepared keeper."
        },
        {
            "gameTime": "2 - 05:42",
            "label": "",
            "description": "Fabio Coentrao clips a neat ball into the box towards Alvaro Arbeloa (Real Madrid), whose header from the centre of the box goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 04:22",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Cosmin Moti (Ludogorets) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "2 - 01:42",
            "label": "",
            "description": "Isco (Real Madrid) unleashes a powerful shot towards goal, but the ball is blocked by one of his teammates."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. During the first half the home team held the upper hand and were much more precise and effective. The tactic of the home side is slow build up play, while the away team's main priority is a flawless defence."
        },
        {
            "gameTime": "1 - 45:25",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:20",
            "label": "",
            "description": "Raphael Varane (Real Madrid) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "1 - 45:15",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 44:30",
            "label": "",
            "description": "Gareth Bale (Real Madrid) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball. The ball is out of play. Real Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 42:09",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 40:30",
            "label": "",
            "description": "Unbelievable miss! Dani Abalo (Ludogorets) reacts superbly to latch on to a rebound, but he blazes the ball high over the crossbar!"
        },
        {
            "gameTime": "1 - 39:26",
            "label": "corner",
            "description": "Fabio Espinho (Ludogorets) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 38:58",
            "label": "",
            "description": "A dangerous attempt from Fabio Espinho (Ludogorets) was aimed towards the roof of the net, but Keylor Navas pulls off a superb save and stops this one. Ludogorets have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 37:43",
            "label": "soccer-ball",
            "description": "It's in the back of the net! The corner is whipped in and Gareth Bale (Real Madrid) finds himself some space to meet the cross. His stunning header from near the penalty spot goes in off the crossbar. The score is 2:0."
        },
        {
            "gameTime": "1 - 37:30",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 36:59",
            "label": "",
            "description": "Real Madrid are playing some nice combination football, sending it precisely from player to player, but a defender shows good anticipation and ends the move with a good block. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "1 - 36:21",
            "label": "",
            "description": "Dani Abalo (Ludogorets) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 34:12",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) swings a cross into the box, but it's far too close to Vladislav Stoyanov, who smothers the ball."
        },
        {
            "gameTime": "1 - 32:28",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Chicharito (Real Madrid)."
        },
        {
            "gameTime": "1 - 30:33",
            "label": "",
            "description": "Fabio Coentrao (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the left post. Vladislav Stoyanov is alert and denies him with a nice save."
        },
        {
            "gameTime": "1 - 28:29",
            "label": "",
            "description": "Gareth Bale (Real Madrid) receives a low pass just outside the box and drills a fine strike towards the middle of the goal. Vladislav Stoyanov pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 25:54",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "1 - 24:50",
            "label": "",
            "description": "Real Madrid move the ball around well as they wait for an opportunity to shoot, but the attack is halted as they lose possession. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "1 - 21:55",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 20:00",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) sends Vladislav Stoyanov the wrong way and fires the penalty into the middle of the goal!"
        },
        {
            "gameTime": "1 - 18:50",
            "label": "r-card",
            "description": "The referee shows a red card! Marcelinho (Ludogorets) has to leave the pitch."
        },
        {
            "gameTime": "1 - 18:47",
            "label": "penalty",
            "description": "The players claim that Marcelinho (Ludogorets) handled the ball and it seems they are right. PENALTY to Real Madrid!"
        },
        {
            "gameTime": "1 - 18:20",
            "label": "",
            "description": "Gareth Bale (Real Madrid) gets himself onto the end of the corner, but his header is blocked."
        },
        {
            "gameTime": "1 - 18:15",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 18:11",
            "label": "",
            "description": "Real Madrid spell of possession comes to an end after a mistake. The linesman points to the corner flag, Real Madrid are going to take it."
        },
        {
            "gameTime": "1 - 17:53",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes a short corner kick."
        },
        {
            "gameTime": "1 - 17:39",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. Real Madrid force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 17:04",
            "label": "",
            "description": "Keylor Navas blocks Vura (Ludogorets)'s effort from the edge of the box."
        },
        {
            "gameTime": "1 - 16:11",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 15:58",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) collects a pass and has an effort from distance which is blocked. It will be a corner kick for Real Madrid."
        },
        {
            "gameTime": "1 - 15:10",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) sends a cross into the box, but Vladislav Stoyanov comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 13:55",
            "label": "",
            "description": "Isco (Real Madrid) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Vladislav Stoyanov to get hold of the ball."
        },
        {
            "gameTime": "1 - 11:32",
            "label": "",
            "description": "Chicharito (Real Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 09:59",
            "label": "corner",
            "description": "The resulting corner, taken by Toni Kroos (Real Madrid), comes to nothing."
        },
        {
            "gameTime": "1 - 09:27",
            "label": "corner",
            "description": "The resulting corner from Toni Kroos (Real Madrid) is cleared. The referee points to the corner flag. It's a corner to Real Madrid."
        },
        {
            "gameTime": "1 - 09:10",
            "label": "",
            "description": "Gareth Bale (Real Madrid) crosses the ball into the box from the free kick, but the defence clears the danger. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 08:00",
            "label": "",
            "description": "Clement Turpin blows his whistle for a foul after Marcelinho (Ludogorets) hacks down one of his opponents. Real Madrid are awarded the free kick."
        },
        {
            "gameTime": "1 - 05:53",
            "label": "",
            "description": "The Real Madrid players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "Mihail Aleksandrov (Ludogorets) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 03:38",
            "label": "",
            "description": "Half chance! Gareth Bale (Real Madrid) plays a pass into the box, but Vladislav Stoyanov reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 02:33",
            "label": "",
            "description": "Marcelinho (Ludogorets) had a good opportunity from long range. His shot was directed towards the middle of the goal, but Keylor Navas was alert and made a comfortable save."
        },
        {
            "gameTime": "1 - 02:25",
            "label": "",
            "description": "Gareth Bale (Real Madrid) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "1 - 01:50",
            "label": "corner",
            "description": "Isco (Real Madrid) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 01:34",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) unleashes a long range free kick, but the goalkeeper does well to make a fine save. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "1 - 00:20",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Clement Turpin was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The home side dominated this game. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        }
    ],
    "gameAwayTeam": "Ludogorets",
    "gameDate": "09/12/2014 - 22:45",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "4 - 0"
}