{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2015-2016/2015-11-22 - 22-45 Inter 4 - 0 Frosinone/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Inter were dominant and more threatening of the two sides. It was a fairly one sided match. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        },
        {
            "gameTime": "2 - 47:53",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 46:06",
            "label": "soccer-ball",
            "description": "Goal Marcelo Brozovic (Inter)! Marcelo Brozovic (Inter) was put through by Adem Ljajic and he showed brilliant composure inside the box to fire into the left side of the net. 4:0."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 42:16",
            "label": "substitution",
            "description": "It is time for a substitution. Marcelo Brozovic (Inter) is on for Mauro Icardi."
        },
        {
            "gameTime": "2 - 41:46",
            "label": "soccer-ball",
            "description": "It's a goal! Stevan Jovetic plays a lovely pass into the box and finds Jeison Murillo (Inter). He tries his luck from close range and coolly strikes the ball into the back of the net. 3:0."
        },
        {
            "gameTime": "2 - 40:39",
            "label": "substitution",
            "description": "Roberto Mancini has decided to substitute Jonathan Biabiany and he is replaced by Ivan Perisic (Inter)."
        },
        {
            "gameTime": "2 - 39:57",
            "label": "",
            "description": "Stevan Jovetic (Inter) latches on to a precise pass and one on one with the keeper slams the ball towards the middle of the goal. Nicola Leali is alert, though, and makes an easy save to deny him."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "substitution",
            "description": "Substitution. Massimiliano Carlini (Frosinone) receives a signal from the referee and is now allowed to enter the pitch as Luca Paganini walks off."
        },
        {
            "gameTime": "2 - 37:03",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 22:12."
        },
        {
            "gameTime": "2 - 33:48",
            "label": "corner",
            "description": "Adem Ljajic (Inter) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "2 - 33:28",
            "label": "",
            "description": "Adem Ljajic (Inter) looks to break free, but an opposing player clears the ball away. The referee blows his whistle, Inter are awarded a corner kick."
        },
        {
            "gameTime": "2 - 31:53",
            "label": "substitution",
            "description": "Roberto Stellone has decided to make a change. Robert Gucher (Frosinone) replaces Mirko Gori."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Samuele Longo (Frosinone) is coming onto the pitch as Daniel Ciofani cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 29:53",
            "label": "",
            "description": "Mauro Icardi (Inter) gets on the end of a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Nicola Leali pulls off an easy save."
        },
        {
            "gameTime": "2 - 27:50",
            "label": "",
            "description": "Adem Ljajic (Inter) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender."
        },
        {
            "gameTime": "2 - 26:31",
            "label": "",
            "description": "Poor challenge! Nicolas Castillo (Frosinone) is penalised for tripping and Marco Guida blows his whistle."
        },
        {
            "gameTime": "2 - 24:49",
            "label": "corner",
            "description": "Adem Ljajic (Inter) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 24:31",
            "label": "",
            "description": "Alex Nicolao Telles (Inter) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee points to the corner flag and Inter will take a corner."
        },
        {
            "gameTime": "2 - 23:37",
            "label": "",
            "description": "Jonathan Biabiany (Inter) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 20:30",
            "label": "",
            "description": "Mauro Icardi (Inter) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "2 - 17:53",
            "label": "",
            "description": "Marco Guida blows his whistle and it's Mauro Icardi (Inter) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 17:30",
            "label": "corner",
            "description": "Adem Ljajic (Inter) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 17:10",
            "label": "",
            "description": "Jonathan Biabiany (Inter) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. Inter will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 16:31",
            "label": "y-card",
            "description": "Marco Guida shows a yellow card to Luca Paganini (Frosinone), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 14:50",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Andrea Ranocchia (Inter) comes onto the pitch for Yuto Nagatomo."
        },
        {
            "gameTime": "2 - 14:17",
            "label": "corner",
            "description": "The resulting corner, taken by Danilo Soddimo (Frosinone), comes to nothing."
        },
        {
            "gameTime": "2 - 14:16",
            "label": "",
            "description": "Nicolas Castillo (Frosinone) fires the ball at goal from inside the area, but it's well blocked. The ball goes out of play. Frosinone are awarded a corner kick."
        },
        {
            "gameTime": "2 - 13:45",
            "label": "corner",
            "description": "Danilo Soddimo (Frosinone) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 13:33",
            "label": "",
            "description": "Danilo Soddimo (Frosinone) sends a cross into the box, but the opposition's defence clears the ball to safety. Frosinone get a corner."
        },
        {
            "gameTime": "2 - 12:23",
            "label": "",
            "description": "Stevan Jovetic (Inter) produces a poor pass. He attempts to get the ball into the box but it's hacked away."
        },
        {
            "gameTime": "2 - 10:25",
            "label": "",
            "description": "Stevan Jovetic passes to Adem Ljajic (Inter), but he produces a wild shot from the edge of the box which goes well wide of the right post."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "soccer-ball",
            "description": "Goal! Mauro Icardi (Inter) scores after an assist by Adem Ljajic that allowed him to tap in the ball into an empty net. The score is 2:0."
        },
        {
            "gameTime": "2 - 06:06",
            "label": "",
            "description": "The free kick is taken by Danilo Soddimo (Frosinone), but ball is cleared."
        },
        {
            "gameTime": "2 - 05:36",
            "label": "",
            "description": "Alex Nicolao Telles (Inter) makes a reckless foul in order to win the ball from his opponent. Marco Guida has a clear sight of it and blows his whistle. Frosinone are awarded a free kick."
        },
        {
            "gameTime": "2 - 04:11",
            "label": "corner",
            "description": "Danilo Soddimo (Frosinone) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 03:13",
            "label": "corner",
            "description": "Danilo Soddimo (Frosinone) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety. Frosinone force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 02:59",
            "label": "",
            "description": "Roberto Crivello (Frosinone) races towards goal but the defender gets back well to make a challenge. The ball goes out for a corner. Frosinone can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 00:57",
            "label": "",
            "description": "Mauro Icardi plays a lovely pass into Jonathan Biabiany (Inter), but he can't find the target. His strike from inside the box goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Marco Guida blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. The hosts were superior in their performance in the first half. They were more active and precise. The home team tries to prevail using combination football, while the away team adopt a defensive style of play."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 43:18",
            "label": "",
            "description": "Adem Ljajic (Inter) collects a wonderful lead pass and as he has a lot of space, smashes a terrific shot from long range. His shot goes painfully close to the crossbar!"
        },
        {
            "gameTime": "1 - 42:09",
            "label": "funfact",
            "description": "The ball possession is 64:36."
        },
        {
            "gameTime": "1 - 39:43",
            "label": "y-card",
            "description": "Marco Guida shows a yellow card to Danilo Soddimo (Frosinone) for a tough tackle."
        },
        {
            "gameTime": "1 - 38:00",
            "label": "",
            "description": "Felipe Melo (Inter) takes a shot from the edge of the area, but it goes harmlessly wide of the right post."
        },
        {
            "gameTime": "1 - 34:03",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Alex Nicolao Telles (Inter). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 33:50",
            "label": "",
            "description": "Jonathan Biabiany (Inter) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball. Inter have a corner."
        },
        {
            "gameTime": "1 - 32:51",
            "label": "",
            "description": "Paolo Sammarco (Frosinone) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 32:36",
            "label": "corner",
            "description": "Danilo Soddimo (Frosinone) takes a short corner kick."
        },
        {
            "gameTime": "1 - 32:21",
            "label": "",
            "description": "Danilo Soddimo (Frosinone) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The linesman points to the corner flag, Frosinone are going to take it."
        },
        {
            "gameTime": "1 - 30:28",
            "label": "corner",
            "description": "Danilo Soddimo (Frosinone) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 30:16",
            "label": "",
            "description": "Leonardo Blanchard (Frosinone) sends a lofted cross into the box which is headed clear. The referee signals a corner kick to Frosinone."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "soccer-ball",
            "description": "Goal! Jonathan Biabiany (Inter) was in the right place at the right time to pounce on the rebound inside the box and gleefully rifles the ball home. It's 1:0."
        },
        {
            "gameTime": "1 - 28:58",
            "label": "",
            "description": "Alex Nicolao Telles (Inter) shoots from the edge of the penalty area. The ball travels towards the right side of the target, but Nicola Leali easily deals with the threat."
        },
        {
            "gameTime": "1 - 28:10",
            "label": "corner",
            "description": "Adem Ljajic (Inter) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 27:10",
            "label": "",
            "description": "Jonathan Biabiany (Inter) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The ball goes behind for a corner. Inter will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 25:59",
            "label": "y-card",
            "description": "A yellow card for a tackle by Miranda (Inter). Marco Guida doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 25:29",
            "label": "",
            "description": "Daniel Ciofani (Frosinone) finds himself beyond the last defender but the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 23:06",
            "label": "",
            "description": "Stevan Jovetic (Inter) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 20:41",
            "label": "",
            "description": "Danilo Soddimo (Frosinone) takes the resultant free kick from the edge of the box and tries to find one of his teammates with a cross, but the keeper climbs high and gets to it first, collecting the ball with ease."
        },
        {
            "gameTime": "1 - 20:26",
            "label": "",
            "description": "Geoffrey Kondogbia (Inter) commits a rough foul. Marco Guida stops the game and makes a call. A free kick is awarded to Frosinone."
        },
        {
            "gameTime": "1 - 19:15",
            "label": "",
            "description": "Yuto Nagatomo (Inter) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "1 - 18:25",
            "label": "",
            "description": "A lofted cross from Jonathan Biabiany (Inter) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 15:06",
            "label": "",
            "description": "Nicola Leali makes a brilliant save! Stevan Jovetic (Inter) easily weaves through the defence and unleashes a shot from just outside of the box. His effort goes towards the middle of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "1 - 12:31",
            "label": "",
            "description": "Adem Ljajic passes to Geoffrey Kondogbia (Inter), but he produces a wild shot from the edge of the box which goes well wide of the left post."
        },
        {
            "gameTime": "1 - 09:51",
            "label": "y-card",
            "description": "Marco Guida shows the yellow card to Modibo Diakite (Frosinone) for a heavy challenge."
        },
        {
            "gameTime": "1 - 08:25",
            "label": "",
            "description": "Daniel Ciofani (Frosinone) jumps for a header from the corner kick, but fails to steer the ball into the goal as it flies high over the bar."
        },
        {
            "gameTime": "1 - 07:56",
            "label": "corner",
            "description": "Danilo Soddimo (Frosinone) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 07:32",
            "label": "",
            "description": "Danilo Soddimo (Frosinone) meets a cross inside the penalty area and unloads a good attempt towards the right side of the goal. Samir Handanovic is prepared, though, and denies him with a fantastic save. The ball is out of play. Frosinone win a corner kick."
        },
        {
            "gameTime": "1 - 06:34",
            "label": "",
            "description": "Nicolas Castillo (Frosinone) had a good opportunity from long range. His shot was directed towards the middle of the goal, but Samir Handanovic was alert and made a comfortable save."
        },
        {
            "gameTime": "1 - 04:40",
            "label": "",
            "description": "Alex Nicolao Telles (Inter) serves up a nice cross, but Nicola Leali punches the ball away."
        },
        {
            "gameTime": "1 - 02:28",
            "label": "corner",
            "description": "Alex Nicolao Telles (Inter) will take the corner."
        },
        {
            "gameTime": "1 - 02:01",
            "label": "",
            "description": "Jonathan Biabiany (Inter) sends a cross into the box, but the opposition's defence quickly intercepts the ball. Inter force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 01:20",
            "label": "",
            "description": "Adem Ljajic (Inter) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Inter will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Marco Guida will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Inter were dominant and more threatening of the two sides. It was a fairly one sided match. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        }
    ],
    "gameAwayTeam": "Frosinone",
    "gameDate": "22/11/2015 - 22:45",
    "gameHomeTeam": "Inter",
    "gameScore": "4 - 0"
}