{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-12-22 - 22-45 AS Roma 3 - 1 Chievo/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side dominated the game. Short passing and possession was the style of the home side, while the visiting side tried to hit their opposition on the break."
        },
        {
            "gameTime": "2 - 48:04",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 47:07",
            "label": "soccer-ball",
            "description": "Goal! Diego Perotti (AS Roma) slams home the penalty with a precise low shot into the bottom left corner."
        },
        {
            "gameTime": "2 - 46:56",
            "label": "",
            "description": "Diego Perotti (AS Roma) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 46:28",
            "label": "penalty",
            "description": "Gianpaolo Calvarese blows the whistle, Filippo Costa (Chievo) is penalised for a foul. No point in arguing there. AS Roma will take a penalty kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:59",
            "label": "substitution",
            "description": "It's time for a substitution. Juan Iturbe (AS Roma) comes on in place of Edin Dzeko."
        },
        {
            "gameTime": "2 - 44:24",
            "label": "",
            "description": "Diego Perotti (AS Roma) misses a big chance! He fires the ball high over the crossbar from inside the 6 yard box after the ball rebounded to him."
        },
        {
            "gameTime": "2 - 44:19",
            "label": "",
            "description": "Edin Dzeko (AS Roma) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Stefano Sorrentino is alert and denies him."
        },
        {
            "gameTime": "2 - 43:35",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 42:57",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Diego Perotti (AS Roma). AS Roma have a corner."
        },
        {
            "gameTime": "2 - 42:22",
            "label": "y-card",
            "description": "A yellow card for a tackle by Nicola Rigoni (Chievo). Gianpaolo Calvarese doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "",
            "description": "Gianpaolo Calvarese has a clear sight and sees a foul from Edin Dzeko (AS Roma)."
        },
        {
            "gameTime": "2 - 38:49",
            "label": "",
            "description": "A dangerous towering header by Antonio Rudiger (AS Roma) from around the penalty spot goes just wide of the right post. This corner kick didn't change the score."
        },
        {
            "gameTime": "2 - 38:34",
            "label": "corner",
            "description": "There's an opportunity for Bruno Peres (AS Roma) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 37:53",
            "label": "",
            "description": "Edin Dzeko (AS Roma) receives a precise pass and is given time inside the box to send a promising strike towards the left post. Stefano Sorrentino guesses his intentions and denies him with a fine save. AS Roma have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 36:44",
            "label": "substitution",
            "description": "Mohamed Salah goes off the pitch and Diego Perotti (AS Roma) comes on."
        },
        {
            "gameTime": "2 - 36:05",
            "label": "",
            "description": "A cross is clipped into the penalty area by Stephan El Shaarawy (AS Roma) but poses no threat."
        },
        {
            "gameTime": "2 - 35:44",
            "label": "",
            "description": "Edin Dzeko (AS Roma) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "",
            "description": "Edin Dzeko (AS Roma) tries to find Mohamed Salah, but he puts too much power on the through ball."
        },
        {
            "gameTime": "2 - 32:36",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) commits a foul and Gianpaolo Calvarese immediately signals a free kick."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "funfact",
            "description": "The total number of attempts is 25:6."
        },
        {
            "gameTime": "2 - 30:40",
            "label": "",
            "description": "Sergio Pellissier (Chievo) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety."
        },
        {
            "gameTime": "2 - 30:05",
            "label": "",
            "description": "Ambitious effort from Edin Dzeko (AS Roma). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well wide of the right post."
        },
        {
            "gameTime": "2 - 29:38",
            "label": "substitution",
            "description": "Rolando Maran has decided to make a change. Sergio Pellissier (Chievo) replaces Roberto Inglese."
        },
        {
            "gameTime": "2 - 29:07",
            "label": "",
            "description": "Edin Dzeko (AS Roma) leaps high to meet a lofted pass around the penalty spot, but his header crashes against the right post!"
        },
        {
            "gameTime": "2 - 28:20",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) misses a good chance to score. An inch perfect cross into the box finds Radja Nainggolan (AS Roma) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 26:58",
            "label": "",
            "description": "Bruno Peres (AS Roma) skips past his man but can't keep the ball in play. The ball is off of the pitch and it's a goal kick for Chievo."
        },
        {
            "gameTime": "2 - 25:50",
            "label": "",
            "description": "The game is interrupted as Edin Dzeko (AS Roma) is flagged offside."
        },
        {
            "gameTime": "2 - 24:37",
            "label": "",
            "description": "Mohamed Salah (AS Roma) strikes a promising volley towards goal, but one of the defenders is quick enough to step in and make a crucial block."
        },
        {
            "gameTime": "2 - 24:09",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 23:30",
            "label": "",
            "description": "Mohamed Salah (AS Roma) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The referee and one of his assistants signal for a corner kick to AS Roma."
        },
        {
            "gameTime": "2 - 23:13",
            "label": "",
            "description": "Nicola Rigoni (Chievo) unleashed a powerful long range strike, but the ball was blocked by a defender on its way."
        },
        {
            "gameTime": "2 - 21:59",
            "label": "",
            "description": "The game is pretty dull as AS Roma are just passing the ball from player to player. Nothing lasts forever, though, and they finally make a mistake, allowing the opposition to pick up the ball."
        },
        {
            "gameTime": "2 - 20:00",
            "label": "",
            "description": "Filippo Costa (Chievo) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 17:37",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) takes the corner kick, but Stefano Sorrentino reads it well and stops the effort."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "",
            "description": "Kevin Strootman (AS Roma) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. AS Roma have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 14:32",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) receives a pass and decides to smash the ball from long range. His poor effort sails well wide of the left post."
        },
        {
            "gameTime": "2 - 13:24",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Valter Birsa walks off the pitch to be replaced by Samuel Bastien (Chievo)."
        },
        {
            "gameTime": "2 - 12:28",
            "label": "",
            "description": "Bruno Peres (AS Roma) receives a quality pass and releases a rocket of a shot from distance, but his amazing effort goes just wide of the left post! The goalkeeper probably wouldn't have saved this one."
        },
        {
            "gameTime": "2 - 10:42",
            "label": "",
            "description": "Edin Dzeko (AS Roma) produces a lovely chip pass into the box, but one of the opposition players cuts it out."
        },
        {
            "gameTime": "2 - 09:35",
            "label": "",
            "description": "Jonathan de Guzman (Chievo) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 08:45",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 06:55",
            "label": "soccer-ball",
            "description": "Goal! Edin Dzeko (AS Roma) was in the right place at the right time to pounce on the rebound inside the box and gleefully rifles the ball home. It's 2:1."
        },
        {
            "gameTime": "2 - 06:50",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 05:53",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) is clearly in an offside position and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 05:45",
            "label": "corner",
            "description": "Edin Dzeko (AS Roma) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 05:26",
            "label": "",
            "description": "Edin Dzeko (AS Roma) receives a clever long through ball and finds himself in a promising position inside the box, but the defence is alert to the danger and clears. AS Roma win a corner."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "",
            "description": "AS Roma control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 02:10",
            "label": "",
            "description": "Riccardo Meggiorini (Chievo) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 01:30",
            "label": "corner",
            "description": "Valter Birsa (Chievo) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 01:06",
            "label": "",
            "description": "Riccardo Meggiorini (Chievo) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. The ball goes out of play. Chievo are awarded a corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Gianpaolo Calvarese blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The fans in the stadium won't regret buying tickets for today's game as they have witnessed a great game so far, and nothing suggests it's going to change in the second half. The home team were mostly in control in the first half. The home side are keeping possession of the ball with some short passes, while the visitors are waiting to open up their defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 47:43",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 47:38",
            "label": "",
            "description": "Thomas Vermaelen (AS Roma) finds himself some space around the penalty spot and leaps high to meet the free kick. He tries to put his header into the right side of the goal, but Stefano Sorrentino keeps it out."
        },
        {
            "gameTime": "1 - 46:55",
            "label": "",
            "description": "One of the Chievo players commits a holding foul and the referee reaches for his whistle. AS Roma are awarded the free kick."
        },
        {
            "gameTime": "1 - 45:48",
            "label": "soccer-ball",
            "description": "Stephan El Shaarawy (AS Roma) sets the ball for the 23 metre free kick. He unleashes a wonderful strike that goes inside the left post. What a goal!"
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "y-card",
            "description": "Gianpaolo Calvarese shows the yellow card to Dario Dainelli (Chievo) for a heavy challenge. AS Roma earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 44:00",
            "label": "",
            "description": "The players claim that Bruno Peres (AS Roma) handled the ball and it seems they are right."
        },
        {
            "gameTime": "1 - 42:42",
            "label": "funfact",
            "description": "The ball possession is 68:32."
        },
        {
            "gameTime": "1 - 41:21",
            "label": "",
            "description": "Edin Dzeko (AS Roma) almost finds himself in a very promising position, but he is flagged offside by the linesman."
        },
        {
            "gameTime": "1 - 40:39",
            "label": "substitution",
            "description": "Rolando Maran is forced to make a change. Mariano Izco is unable to continue due to injury, Filippo Costa (Chievo) comes on."
        },
        {
            "gameTime": "1 - 39:39",
            "label": "injury",
            "description": "Mariano Izco (Chievo) picks up an injury."
        },
        {
            "gameTime": "1 - 39:08",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) tries his luck with a long range shot from a rebound, but it isn't precise at all and the ball flies well wide of the left post towards the corner flag. Very poor shot."
        },
        {
            "gameTime": "1 - 38:58",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) meets a cross just outside the area and gets in a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 36:40",
            "label": "soccer-ball",
            "description": "Mariano Izco launches a beautiful lofted cross into the box, where Jonathan de Guzman (Chievo) rises high to head the ball into the right side of the goal and beyond the goalkeeper. 0:1."
        },
        {
            "gameTime": "1 - 34:10",
            "label": "",
            "description": "Edin Dzeko (AS Roma) receives an accurate pass and finds some space for a shot. The keeper is prepared and denies his long range attempt straight to the middle of the goal."
        },
        {
            "gameTime": "1 - 31:50",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 30:13",
            "label": "",
            "description": "Thomas Vermaelen (AS Roma) commits a rough challenge and Gianpaolo Calvarese blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 28:24",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) fails to find a teammate across the pitch with a long ball. The ball goes out of play and Chievo will have a goal kick."
        },
        {
            "gameTime": "1 - 27:10",
            "label": "",
            "description": "OFF THE POST! Bruno Peres (AS Roma) decides to direct the free kick at goal from about 25 out. His effort was almost perfect, but to his disappointment only rattled the left post."
        },
        {
            "gameTime": "1 - 26:05",
            "label": "",
            "description": "Gianpaolo Calvarese blows for a foul after Ivan Radovanovic (Chievo) was too aggressive in the battle for the ball. AS Roma are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 25:09",
            "label": "",
            "description": "Ivan Radovanovic (Chievo) collects a pass and has an effort from distance to the left side of the goal, but Wojciech Szczesny answers with a superb save to deny him."
        },
        {
            "gameTime": "1 - 23:57",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) takes the ball on and fires in a shot from 30 metres out. Stefano Sorrentino stops the effort which is headed to the middle of the target."
        },
        {
            "gameTime": "1 - 23:54",
            "label": "",
            "description": "Emerson (AS Roma) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "1 - 22:44",
            "label": "",
            "description": "Nicola Rigoni (Chievo) makes a rough challenge and Gianpaolo Calvarese blows his whistle for a foul. A free kick is awarded to AS Roma."
        },
        {
            "gameTime": "1 - 21:40",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) shoots from the edge of the penalty area. The ball travels towards the middle of the target, but Stefano Sorrentino easily deals with the threat."
        },
        {
            "gameTime": "1 - 21:06",
            "label": "",
            "description": "What a sensational goal that would have been! Jonathan de Guzman (Chievo) picks up the ball inside the box and fires a beautiful first time shot, but it goes just a few inches wide of the right post."
        },
        {
            "gameTime": "1 - 19:57",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Radja Nainggolan (AS Roma) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "1 - 18:43",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 18:20",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Emerson (AS Roma), is intercepted by the opposition's defence. Good work from AS Roma as they win a corner."
        },
        {
            "gameTime": "1 - 17:32",
            "label": "",
            "description": "Mohamed Salah (AS Roma) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball sails well over the bar!"
        },
        {
            "gameTime": "1 - 16:55",
            "label": "",
            "description": "AS Roma seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 14:57",
            "label": "",
            "description": "Emerson sprays a pass out to Mohamed Salah (AS Roma), but he produces a poor effort from inside the box which goes high over the bar."
        },
        {
            "gameTime": "1 - 13:00",
            "label": "",
            "description": "The foul by Antonio Rudiger (AS Roma) was seen by Gianpaolo Calvarese who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 12:54",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 12:14",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) got on the end of the corner and rifles a low shot from the edge of the box towards the left post, but the goalkeeper makes a stunning diving save. The linesman makes the right call and AS Roma will have a corner."
        },
        {
            "gameTime": "1 - 12:06",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 11:33",
            "label": "",
            "description": "Mohamed Salah (AS Roma) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety. The ball goes behind for a corner. AS Roma will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 10:39",
            "label": "",
            "description": "What a big chance! Edin Dzeko (AS Roma) picks up an inch perfect pass inside the box and fires the ball well wide of the left post."
        },
        {
            "gameTime": "1 - 09:34",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 08:55",
            "label": "",
            "description": "The ball is cleared after Stephan El Shaarawy (AS Roma) attempted to dribble past an opposing player. AS Roma earn a corner."
        },
        {
            "gameTime": "1 - 06:52",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) and Radja Nainggolan try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 06:10",
            "label": "",
            "description": "Roberto Inglese (Chievo) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 05:14",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 04:00",
            "label": "",
            "description": "Edin Dzeko (AS Roma) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "",
            "description": "A cross from Emerson (AS Roma) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "",
            "description": "Roberto Inglese (Chievo) unleashes a shot, but his effort is poor and flies well wide of the left post."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! AS Roma will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gianpaolo Calvarese got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Chievo players have already lost 10 away matches this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko from AS Roma will look to add to his goal tally, he has netted 12 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side dominated the game. Short passing and possession was the style of the home side, while the visiting side tried to hit their opposition on the break."
        }
    ],
    "gameAwayTeam": "Chievo",
    "gameDate": "22/12/2016 - 22:45",
    "gameHomeTeam": "AS Roma",
    "gameScore": "3 - 1"
}