{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-08-29 - 17-00 Chelsea 1 - 2 Crystal Palace/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. There wasn't any significant dominance by either side in this game. The home side played possession football, while long balls and crosses were the main weapons of the away team."
        },
        {
            "gameTime": "2 - 50:14",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 49:58",
            "label": "",
            "description": "Crystal Palace quickly take the free kick with a short pass."
        },
        {
            "gameTime": "2 - 49:52",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) tackles a bit over zealously and Craig Pawson blows for a foul. A free kick is awarded to Crystal Palace."
        },
        {
            "gameTime": "2 - 48:51",
            "label": "",
            "description": "Craig Pawson blows his whistle and signals a foul after Falcao (Chelsea) brought his opponent down."
        },
        {
            "gameTime": "2 - 48:30",
            "label": "",
            "description": "Chelsea seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 45:54",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "2 - 45:36",
            "label": "",
            "description": "Yannick Bolasie (Crystal Palace) commits a rough foul. Craig Pawson stops the game and makes a call. Free kick. Chelsea will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:53",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "2 - 43:46",
            "label": "",
            "description": "One of the Crystal Palace players unfairly tackled his opponent and conceded a foul. Chelsea are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 43:11",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 42:38",
            "label": "",
            "description": "Chelsea enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 40:09",
            "label": "",
            "description": "had an opportunity from long range. His low shot was directed towards the middle of the goal, but Alex McCarthy (Crystal Palace) was alert and made a comfortable save."
        },
        {
            "gameTime": "2 - 39:33",
            "label": "",
            "description": "peeled away from his marker and got on the end of a cross inside the box. He attempted to head the ball towards the middle of the goal, but the keeper made a block."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "substitution",
            "description": "Alan Pardew has decided to make a change. Chung Yong Lee (Crystal Palace) replaces Bakary Sako."
        },
        {
            "gameTime": "2 - 36:25",
            "label": "substitution",
            "description": "Today's match ends for Yohan Cabaye who will be replaced by Joe Ledley (Crystal Palace)."
        },
        {
            "gameTime": "2 - 35:17",
            "label": "soccer-ball",
            "description": "Goal! Bakary Sako plays the ball into the area and Joel Ward (Crystal Palace) gets on the end of it to glance a header into the back of the net. He makes it 1:2."
        },
        {
            "gameTime": "2 - 34:30",
            "label": "",
            "description": "The Crystal Palace players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 33:19",
            "label": "soccer-ball",
            "description": "Pedro launches a beautiful lofted cross into the box, where Falcao (Chelsea) rises high to head the ball into the right side of the goal and beyond the goalkeeper. 0:0."
        },
        {
            "gameTime": "2 - 32:39",
            "label": "corner",
            "description": "Yohan Cabaye (Crystal Palace) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 31:53",
            "label": "",
            "description": "Pape Souare (Crystal Palace) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The ball goes behind for a corner. Crystal Palace will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "attendance",
            "description": "The attendance is 41581."
        },
        {
            "gameTime": "2 - 29:58",
            "label": "",
            "description": "Yannick Bolasie (Crystal Palace) makes a good run with the ball, but his shot from the edge of the penalty area goes narrowly over the bar. Terrific solo effort, though. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "2 - 28:59",
            "label": "",
            "description": "Yannick Bolasie (Crystal Palace) connects with a pass inside the box, but his effort goes well wide of the left post. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "2 - 27:58",
            "label": "substitution",
            "description": "The manager makes a subsitution with Ruben Loftus Cheek (Chelsea) coming on for Nemanja Matic."
        },
        {
            "gameTime": "2 - 27:44",
            "label": "y-card",
            "description": "Yohan Cabaye (Crystal Palace) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 25:59",
            "label": "y-card",
            "description": "Gary Cahill (Chelsea) is booked after bringing down an opponent. Craig Pawson had an easy decision to make."
        },
        {
            "gameTime": "2 - 24:57",
            "label": "",
            "description": "Eden Hazard (Chelsea) gets the ball and drives a shot high over the bar from the edge of the area. The ball goes out of play and Crystal Palace will have a goal kick."
        },
        {
            "gameTime": "2 - 23:59",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) finds himself some space inside the penalty box and immediately unleashes a first time effort. The shot sails well wide of the right post. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "2 - 22:32",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Cesar Azpilicueta will be replaced by Kenedy (Chelsea)."
        },
        {
            "gameTime": "2 - 20:25",
            "label": "substitution",
            "description": "Here is a change. Willian is going off and Jose Mourinho gives the last tactical orders to Falcao (Chelsea)."
        },
        {
            "gameTime": "2 - 19:28",
            "label": "soccer-ball",
            "description": "Goal! Bakary Sako (Crystal Palace) is quickest to react to the rebound and stabs the ball into the back of the net. It's 0:1."
        },
        {
            "gameTime": "2 - 19:25",
            "label": "",
            "description": "Bakary Sako (Crystal Palace) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 18:50",
            "label": "",
            "description": "Gary Cahill (Chelsea) gets his head on the corner, but he sees his header blocked."
        },
        {
            "gameTime": "2 - 18:40",
            "label": "corner",
            "description": "Pedro (Chelsea) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 18:26",
            "label": "",
            "description": "Pedro (Chelsea) connects with a pass but sees his shot from the edge of the box blocked. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 16:58",
            "label": "",
            "description": "Kurt Zouma (Chelsea) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 16:48",
            "label": "",
            "description": "Eden Hazard (Chelsea) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 16:23",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "2 - 16:00",
            "label": "",
            "description": "Bakary Sako (Crystal Palace) fouls an opponent. At least that's what referee Craig Pawson signals. There is a free kick near the sideline to Chelsea."
        },
        {
            "gameTime": "2 - 15:01",
            "label": "",
            "description": "Eden Hazard (Chelsea) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 14:47",
            "label": "",
            "description": "Craig Pawson blows the whistle, James McArthur (Crystal Palace) is penalised for a foul. Chelsea have a free kick."
        },
        {
            "gameTime": "2 - 14:17",
            "label": "",
            "description": "The resulting free kick from Cesc Fabregas (Chelsea) ends up in the gloves of the keeper."
        },
        {
            "gameTime": "2 - 13:49",
            "label": "",
            "description": "Damien Delaney (Crystal Palace) brings his opponent down with a tackle and Craig Pawson blows his whistle for a foul. Chelsea have a free kick."
        },
        {
            "gameTime": "2 - 11:59",
            "label": "corner",
            "description": "Diego Costa (Chelsea) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 11:53",
            "label": "",
            "description": "Diego Costa (Chelsea) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. Chelsea have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "corner",
            "description": "Yohan Cabaye (Crystal Palace) swings in a cross from the corner, but Thibaut Courtois reads it well and gathers the ball."
        },
        {
            "gameTime": "2 - 09:59",
            "label": "substitution",
            "description": "Substitution. Wilfried Zaha makes way for Yannick Bolasie (Crystal Palace)."
        },
        {
            "gameTime": "2 - 09:53",
            "label": "",
            "description": "Bakary Sako (Crystal Palace) picks up the ball, dribbles to the edge of the penalty area and unleashes a brilliant shot to the bottom left corner, but is thwarted by a great save from Thibaut Courtois. Crystal Palace force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 09:34",
            "label": "",
            "description": "Diego Costa (Chelsea) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance."
        },
        {
            "gameTime": "2 - 09:18",
            "label": "",
            "description": "Chelsea are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "2 - 07:10",
            "label": "",
            "description": "A pass into the penalty area from Eden Hazard (Chelsea) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 05:53",
            "label": "corner",
            "description": "Pedro (Chelsea) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 05:43",
            "label": "",
            "description": "The ball is cleared after Diego Costa (Chelsea) attempted to dribble past an opposing player. It will be a corner kick for Chelsea."
        },
        {
            "gameTime": "2 - 02:34",
            "label": "",
            "description": "Chelsea are passing the ball across the pitch and keep possession. However, an opponent intercepts a pass and the situation changes."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Craig Pawson blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. Neither side is enjoying any significant control of the game. The home team are making a lot of passes and attempting to maintain possession, while the away side's tactic is 'kick and rush' football."
        },
        {
            "gameTime": "1 - 46:12",
            "label": "whistle",
            "description": "Craig Pawson has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "That didn't go as planned! Nemanja Matic (Chelsea) tried his luck from the edge of the box, but his effort low towards the middle of the goal was too weak to get past Alex McCarthy, who easily kept it out."
        },
        {
            "gameTime": "1 - 41:30",
            "label": "",
            "description": "Alex McCarthy makes a sensational save to thwart a great chance. A rebound falls to Cesc Fabregas (Chelsea) inside the box and he drills a strike goalwards, but the ball ends up in the keeper's gloves instead of the middle of the target."
        },
        {
            "gameTime": "1 - 41:26",
            "label": "",
            "description": "Diego Costa (Chelsea) receives a pass inside the box, controls the ball and drills it towards the left post. Unfortunately for him, Alex McCarthy makes a great save to stop his effort."
        },
        {
            "gameTime": "1 - 40:48",
            "label": "corner",
            "description": "Jason Puncheon (Crystal Palace) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 40:28",
            "label": "",
            "description": "Bakary Sako (Crystal Palace) tries to slide the ball through to a teammate but it's well blocked by a defender. Crystal Palace force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 38:55",
            "label": "",
            "description": "Diego Costa (Chelsea) does his best to latch onto a cross into the box, but he can't get to the ball. The ball is off of the pitch and it's a goal kick for Crystal Palace."
        },
        {
            "gameTime": "1 - 36:54",
            "label": "",
            "description": "Diego Costa (Chelsea) gets on the ball and beats an opponent, but his run is stopped by the referee Craig Pawson who sees an offensive foul."
        },
        {
            "gameTime": "1 - 35:58",
            "label": "",
            "description": "Willian (Chelsea) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender."
        },
        {
            "gameTime": "1 - 35:55",
            "label": "corner",
            "description": "Pedro (Chelsea) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 35:37",
            "label": "",
            "description": "Willian (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee and one of his assistants signal for a corner kick to Chelsea."
        },
        {
            "gameTime": "1 - 32:20",
            "label": "",
            "description": "Gary Cahill (Chelsea) connects with the corner but his looping header goes well over. The ball goes out of play and Crystal Palace will have a goal kick."
        },
        {
            "gameTime": "1 - 32:09",
            "label": "corner",
            "description": "Pedro (Chelsea) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 31:41",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) sends a cross into the box, but the opposition's defence clears the ball to safety. Corner kick. Chelsea will have an opportunity."
        },
        {
            "gameTime": "1 - 30:23",
            "label": "",
            "description": "Bakary Sako (Crystal Palace) unleashes a shot from 23 metres out but is unable to find the target and it goes well wide of the right post. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 28:47",
            "label": "",
            "description": "Yohan Cabaye (Crystal Palace) latches on to an accurate pass into the box and immediately unleashes a low shot goalwards. His effort is well saved by the keeper."
        },
        {
            "gameTime": "1 - 28:30",
            "label": "",
            "description": "The linesman signals that Bakary Sako (Crystal Palace) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 28:06",
            "label": "",
            "description": "A cross from Wilfried Zaha (Crystal Palace) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 27:40",
            "label": "",
            "description": "Nice passing game by Crystal Palace. They are increasing their possession with a series of long passes and waiting for the right moment to create an attacking opportunity."
        },
        {
            "gameTime": "1 - 25:31",
            "label": "",
            "description": "Yohan Cabaye (Crystal Palace) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box into the stands. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "1 - 25:05",
            "label": "corner",
            "description": "The corner from Jason Puncheon (Crystal Palace) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 24:40",
            "label": "",
            "description": "Bakary Sako (Crystal Palace) unleashes a shot from the edge of the box, but it goes straight at Thibaut Courtois. Crystal Palace win a corner."
        },
        {
            "gameTime": "1 - 22:31",
            "label": "",
            "description": "Willian (Chelsea) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar. The ball goes out of play and Crystal Palace will have a goal kick."
        },
        {
            "gameTime": "1 - 22:00",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 21:31",
            "label": "",
            "description": "Eden Hazard (Chelsea) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. Now Chelsea have a corner."
        },
        {
            "gameTime": "1 - 20:39",
            "label": "corner",
            "description": "Pedro (Chelsea) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 19:44",
            "label": "",
            "description": "Diego Costa (Chelsea) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. Chelsea earn a corner."
        },
        {
            "gameTime": "1 - 18:58",
            "label": "",
            "description": "Pedro (Chelsea) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post. The ball is off of the pitch and it's a goal kick for Crystal Palace."
        },
        {
            "gameTime": "1 - 17:57",
            "label": "",
            "description": "Bakary Sako (Crystal Palace) attempts to send a pass but the effort is blocked. It's a throw in for Crystal Palace."
        },
        {
            "gameTime": "1 - 17:07",
            "label": "",
            "description": "Kurt Zouma (Chelsea) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "1 - 16:21",
            "label": "",
            "description": "Chelsea hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "1 - 13:48",
            "label": "",
            "description": "Eden Hazard (Chelsea) wastes a good opportunity as his pass into the box is blocked by the defence. The ball is behind the touchline and Chelsea will take a throw in."
        },
        {
            "gameTime": "1 - 13:28",
            "label": "",
            "description": "Willian (Chelsea) makes a strong challenge and Craig Pawson blows for a foul."
        },
        {
            "gameTime": "1 - 12:46",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) aims a low effort to the middle of the goal, but the goalkeeper makes a comfortable save."
        },
        {
            "gameTime": "1 - 12:25",
            "label": "",
            "description": "Eden Hazard (Chelsea) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 11:20",
            "label": "",
            "description": "Chelsea are showing great team chemistry. They are passing the ball around seamlessly but finally one of the defending players makes an interception."
        },
        {
            "gameTime": "1 - 10:24",
            "label": "",
            "description": "The Chelsea players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 09:18",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 07:22",
            "label": "",
            "description": "The foul by Connor Wickham (Crystal Palace) was seen by Craig Pawson who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 06:34",
            "label": "corner",
            "description": "The resulting corner from Jason Puncheon (Crystal Palace) is cleared by the defence."
        },
        {
            "gameTime": "1 - 05:53",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Wilfried Zaha (Crystal Palace). The referee points to the corner flag and Crystal Palace will take a corner."
        },
        {
            "gameTime": "1 - 03:53",
            "label": "",
            "description": "Pedro (Chelsea) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 02:59",
            "label": "",
            "description": "The Chelsea players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 01:54",
            "label": "",
            "description": "Crystal Palace are ruled offside."
        },
        {
            "gameTime": "1 - 01:33",
            "label": "corner",
            "description": "Jason Puncheon (Crystal Palace) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 01:07",
            "label": "",
            "description": "A lofted cross from Bakary Sako (Crystal Palace) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Crystal Palace get a corner."
        },
        {
            "gameTime": "1 - 00:56",
            "label": "corner",
            "description": "Yohan Cabaye (Crystal Palace) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 00:34",
            "label": "",
            "description": "Bakary Sako (Crystal Palace) tries to send a pass but it's blocked. The ball is out of play and the linesman points at the corner flag. Corner to Crystal Palace."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Crystal Palace will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Craig Pawson is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. There wasn't any significant dominance by either side in this game. The home side played possession football, while long balls and crosses were the main weapons of the away team."
        }
    ],
    "gameAwayTeam": "Crystal Palace",
    "gameDate": "29/08/2015 - 17:00",
    "gameHomeTeam": "Chelsea",
    "gameScore": "1 - 2"
}