{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-09-19 - 19-30 Manchester City 1 - 2 West Ham/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The hosts looked more lively and played better football. The tactic of the home side was slow build up play and the away side was creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "2 - 49:33",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 49:03",
            "label": "",
            "description": "One of the players from West Ham times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 48:08",
            "label": "",
            "description": "Dimitri Payet (West Ham) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "2 - 47:14",
            "label": "",
            "description": "Yaya Toure (Manchester City) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 46:51",
            "label": "",
            "description": "West Ham concede a free kick after one of their players holds onto an opposition player."
        },
        {
            "gameTime": "2 - 45:40",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 45:06",
            "label": "",
            "description": "Jesus Navas (Manchester City) tries to send a pass but it's blocked. The referee signals a corner kick to Manchester City."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:33",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) swings the ball into the box from the corner kick but it's a bit too strong and it goes out of play."
        },
        {
            "gameTime": "2 - 43:43",
            "label": "",
            "description": "Joe Hart makes a good save! Dimitri Payet (West Ham) easily weaves through the defence and unleashes a shot from long range. His effort is directed towards the bottom left corner, but the goalkeeper is alert and stops it. The ball goes out of play. West Ham are awarded a corner kick."
        },
        {
            "gameTime": "2 - 42:55",
            "label": "",
            "description": "The foul by Yaya Toure (Manchester City) was seen by Robert Madley who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 40:38",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 40:02",
            "label": "",
            "description": "Sergio Aguero (Manchester City) wins himself just enough space inside the box to connect with the corner. His header flies towards the roof of the net, but the goalkeeper leaps from the ground and makes a stunning save. The referee points to the corner flag and Manchester City will take a corner."
        },
        {
            "gameTime": "2 - 39:35",
            "label": "substitution",
            "description": "It's time for a substitution. James Collins (West Ham) comes on in place of Carl Jenkinson."
        },
        {
            "gameTime": "2 - 39:01",
            "label": "corner",
            "description": "The referee points to the corner flag. It's a corner to Manchester City."
        },
        {
            "gameTime": "2 - 38:45",
            "label": "substitution",
            "description": "Manuel Pellegrini prepares a substitution. Aleksandar Kolarov is replaced by Kelechi Iheanacho (Manchester City)."
        },
        {
            "gameTime": "2 - 38:35",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Kevin De Bruyne (Manchester City)."
        },
        {
            "gameTime": "2 - 38:11",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 36:27",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) clutches his head after wasting a good opportunity. He expertly collected the ball from a rebound and fired from long range, but his effort wasn't accurate at all and the ball went miles over the crossbar."
        },
        {
            "gameTime": "2 - 36:00",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 35:47",
            "label": "",
            "description": "Wilfried Bony (Manchester City) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. The referee and one of his assistants signal for a corner kick to Manchester City."
        },
        {
            "gameTime": "2 - 34:13",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 31:20",
            "label": "",
            "description": "Jesus Navas (Manchester City) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 30:05",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) makes a driving run into the box but he cannot work any space for a shot."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "corner",
            "description": "The corner from Jesus Navas (Manchester City) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "",
            "description": "Bacary Sagna (Manchester City) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. The referee blows his whistle, Manchester City are awarded a corner kick."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "2 - 24:52",
            "label": "",
            "description": "Wilfried Bony (Manchester City) tries to slide the ball through to a teammate but it's well blocked by a defender. The ball goes out of play and Manchester City have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 24:35",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety. The ball goes behind for a corner. Manchester City will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 23:24",
            "label": "substitution",
            "description": "Manuel Lanzini will be replaced by Nikica Jelavic (West Ham)."
        },
        {
            "gameTime": "2 - 23:14",
            "label": "",
            "description": "Yaya Toure (Manchester City) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. Manchester City earn a corner."
        },
        {
            "gameTime": "2 - 21:55",
            "label": "",
            "description": "Diafra Sakho (West Ham) swings a cross into the box, but it's far too close to Joe Hart, who smothers the ball."
        },
        {
            "gameTime": "2 - 21:39",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 21:21",
            "label": "",
            "description": "Jesus Navas (Manchester City) fails to find any of his teammates inside the box as his pass is blocked. It will be a corner kick for Manchester City."
        },
        {
            "gameTime": "2 - 20:52",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 20:35",
            "label": "substitution",
            "description": "Manuel Pellegrini has decided to make a change. Wilfried Bony (Manchester City) replaces Raheem Sterling."
        },
        {
            "gameTime": "2 - 19:56",
            "label": "",
            "description": "Jesus Navas (Manchester City) bursts inside the box, beats two defenders and produces a strike from the penalty spot. The shot has power, but lacks precision and the goalkeeper stops it easily. The scoreline remains the same. The ball is out of play. Manchester City win a corner kick."
        },
        {
            "gameTime": "2 - 19:30",
            "label": "",
            "description": "A pass from Aleksandar Kolarov (Manchester City) is intercepted by Adrian and the move breaks down."
        },
        {
            "gameTime": "2 - 17:41",
            "label": "",
            "description": "What a huge chance for Yaya Toure (Manchester City). He collects a precise pass inside the box and slices a shot that goes a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 16:35",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "2 - 16:25",
            "label": "corner",
            "description": "The ball is out of play and the linesman points at the corner flag. Corner to Manchester City."
        },
        {
            "gameTime": "2 - 16:14",
            "label": "",
            "description": "Raheem Sterling (Manchester City) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 15:31",
            "label": "",
            "description": "The ball is cleared after Sergio Aguero (Manchester City) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 14:50",
            "label": "substitution",
            "description": "That's the end of the game for Victor Moses, who is replaced by Michail Antonio (West Ham)."
        },
        {
            "gameTime": "2 - 13:43",
            "label": "",
            "description": "Jesus Navas (Manchester City) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 12:12",
            "label": "",
            "description": "Diafra Sakho (West Ham) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the right post."
        },
        {
            "gameTime": "2 - 11:02",
            "label": "",
            "description": "Jesus Navas (Manchester City) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "2 - 10:27",
            "label": "",
            "description": "Yaya Toure (Manchester City) receives an accurate pass and finds some space for a shot. The keeper is prepared and denies his low, long range blast aimed directly at the bottom of the net."
        },
        {
            "gameTime": "2 - 09:54",
            "label": "",
            "description": "Yaya Toure (Manchester City) unleashes a promising shot towards the middle of the goal after his wonderful solo run, but Adrian thwarts the effort with a fabulous save. The score remains the same."
        },
        {
            "gameTime": "2 - 08:25",
            "label": "y-card",
            "description": "Aleksandar Kolarov (Manchester City) is given a fully deserved yellow card."
        },
        {
            "gameTime": "2 - 08:20",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) trips an opposition player and Robert Madley signals a foul."
        },
        {
            "gameTime": "2 - 07:55",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) sends over a poor, overhit cross from the corner kick and the ball goes out of play."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "",
            "description": "A cross into the box from Jesus Navas (Manchester City) is cleared. The referee and his assistant both point at the corner flag. Manchester City will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 06:56",
            "label": "",
            "description": "Sergio Aguero (Manchester City) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 06:34",
            "label": "",
            "description": "Yaya Toure (Manchester City) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety."
        },
        {
            "gameTime": "2 - 04:20",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "2 - 03:42",
            "label": "corner",
            "description": "Jesus Navas (Manchester City) puts a dangerous cross into the box, but the corner is cleared by the first man. The linesman makes the right call and Manchester City will have a corner."
        },
        {
            "gameTime": "2 - 03:22",
            "label": "",
            "description": "Manchester City force a corner. They send men into the box. Jesus Navas (Manchester City) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 02:17",
            "label": "",
            "description": "That was close by Yaya Toure (Manchester City)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "2 - 01:00",
            "label": "",
            "description": "Victor Moses (West Ham) latches on to a lofted pass and strikes a snap shot from outside the box. His effort curls way wide of the left post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Manuel Pellegrini has decided to substitute Eliaquim Mangala and he is replaced by Martin Demichelis (Manchester City)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Robert Madley blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 50:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. No side has really dominated in this first half. The home side are keeping possession of the ball with some short passes, while the visitors are waiting to open up their defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 50:46",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 50:25",
            "label": "corner",
            "description": "Aleksandar Kolarov (Manchester City) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 50:08",
            "label": "",
            "description": "Raheem Sterling (Manchester City) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. The ball is out of play and Manchester City manage to earn a corner."
        },
        {
            "gameTime": "1 - 49:07",
            "label": "y-card",
            "description": "Pedro Obiang (West Ham) picks up a yellow card."
        },
        {
            "gameTime": "1 - 48:40",
            "label": "",
            "description": "Pedro Obiang (West Ham) fouls an opponent. At least that's what referee Robert Madley signals."
        },
        {
            "gameTime": "1 - 46:32",
            "label": "soccer-ball",
            "description": "Nice piece of skill by Kevin De Bruyne (Manchester City). He perfectly collected a pass from Sergio Aguero and unleashed a fantastic long range strike which went into the bottom left corner. The score is 1:2."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:36",
            "label": "",
            "description": "Sergio Aguero (Manchester City) picks up the ball inside the penalty box and immediately fires a first time effort that sails well over the crossbar and ends in the stands."
        },
        {
            "gameTime": "1 - 43:02",
            "label": "",
            "description": "Diafra Sakho (West Ham) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "1 - 40:48",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) sends a cross into the box, but Adrian comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 40:02",
            "label": "",
            "description": "Sergio Aguero (Manchester City) receives a precise low pass inside the box, controls the ball and drills it towards the right post. Unfortunately for him, Adrian makes a great save to stop his effort."
        },
        {
            "gameTime": "1 - 38:44",
            "label": "",
            "description": "Sergio Aguero (Manchester City) creates a good chance for himself and goes for goal from mid range, but the effort is well wide of the right post."
        },
        {
            "gameTime": "1 - 38:14",
            "label": "",
            "description": "Adrian gets a well deserved ovation! Jesus Navas (Manchester City) produces a decent first time strike towards the right post, but the goalkeeper is positioned well to block it. Nice goalkeeping skills."
        },
        {
            "gameTime": "1 - 37:22",
            "label": "",
            "description": "Nicolas Otamendi (Manchester City) makes a slide tackle, but referee Robert Madley blows for a foul."
        },
        {
            "gameTime": "1 - 37:11",
            "label": "",
            "description": "Jesus Navas (Manchester City) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "1 - 35:17",
            "label": "",
            "description": "Flag up against Sergio Aguero (Manchester City). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 33:48",
            "label": "",
            "description": "Yaya Toure (Manchester City) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 30:35",
            "label": "soccer-ball",
            "description": "Goal! Diafra Sakho (West Ham) fires the rebound low into the middle of the goal after the ball breaks to him in the box. The score is 0:2."
        },
        {
            "gameTime": "1 - 30:35",
            "label": "",
            "description": "Manuel Lanzini (West Ham) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 30:27",
            "label": "corner",
            "description": "The ball is out of play. A goal scoring opportunity from a corner for West Ham."
        },
        {
            "gameTime": "1 - 30:06",
            "label": "",
            "description": "Carl Jenkinson (West Ham) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 29:17",
            "label": "",
            "description": "Jesus Navas (Manchester City) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 27:59",
            "label": "",
            "description": "Raheem Sterling (Manchester City) is forced to stop his forward run after being caught in an offside position by the linesman."
        },
        {
            "gameTime": "1 - 27:20",
            "label": "",
            "description": "Some neat passing and movement from Manchester City as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 25:25",
            "label": "",
            "description": "Good movement by Bacary Sagna (Manchester City), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "1 - 24:57",
            "label": "",
            "description": "Jesus Navas (Manchester City) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "1 - 24:08",
            "label": "",
            "description": "Bacary Sagna (Manchester City) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 21:30",
            "label": "y-card",
            "description": "Manuel Lanzini (West Ham) makes it easy for the referee to show him a yellow card."
        },
        {
            "gameTime": "1 - 21:20",
            "label": "",
            "description": "Manuel Lanzini (West Ham) tackles a bit over zealously and Robert Madley blows for a foul."
        },
        {
            "gameTime": "1 - 20:59",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 20:55",
            "label": "",
            "description": "Dimitri Payet (West Ham) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. West Ham have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 18:19",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Kevin De Bruyne (Manchester City)."
        },
        {
            "gameTime": "1 - 16:23",
            "label": "",
            "description": "A pass by Dimitri Payet (West Ham) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 15:52",
            "label": "",
            "description": "Victor Moses (West Ham) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 12:57",
            "label": "",
            "description": "Nicolas Otamendi (Manchester City) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "1 - 12:40",
            "label": "corner",
            "description": "Good work from Manchester City as they win a corner."
        },
        {
            "gameTime": "1 - 12:30",
            "label": "",
            "description": "A pass by Raheem Sterling (Manchester City) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 11:25",
            "label": "",
            "description": "Yaya Toure (Manchester City) whips the ball into the box and Raheem Sterling takes a perfect touch to control it, but one of the defenders does well to intercept."
        },
        {
            "gameTime": "1 - 10:53",
            "label": "",
            "description": "Bacary Sagna (Manchester City) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 08:39",
            "label": "",
            "description": "Sergio Aguero (Manchester City) latches on to an accurate pass on the edge of the box and immediately unleashes a shot which is wide of the mark."
        },
        {
            "gameTime": "1 - 05:59",
            "label": "soccer-ball",
            "description": "Victor Moses (West Ham) scores an incredible goal! He receives a pass, makes some space for himself and unleashes a long range thunderbolt of a shot past the goalkeeper into the bottom right corner."
        },
        {
            "gameTime": "1 - 03:15",
            "label": "",
            "description": "Fernandinho (Manchester City) wastes a great chance from the resulting corner. He times his header superbly when he leaps high to meet a precise cross, but can't aim better than into the middle of the goal, straight into the arms of the goalkeeper."
        },
        {
            "gameTime": "1 - 03:02",
            "label": "corner",
            "description": "Manchester City will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 02:56",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 02:40",
            "label": "",
            "description": "Manchester City hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 01:10",
            "label": "",
            "description": "Diafra Sakho (West Ham) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and West Ham will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Robert Madley."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "West Ham have already earned 28 points from away matches and overall 62."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "0:0 That's the most common Manchester City's result of the season. Already 5 times their match ended with that score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let's have a look at Manchester City's goals for and against 71:41."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The hosts looked more lively and played better football. The tactic of the home side was slow build up play and the away side was creating their opportunities using lightning fast counter attacks."
        }
    ],
    "gameAwayTeam": "West Ham",
    "gameDate": "19/09/2015 - 19:30",
    "gameHomeTeam": "Manchester City",
    "gameScore": "1 - 2"
}