{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-02-26 - 18-15 Atl. Madrid 1 - 2 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:22",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 40:55",
            "label": "soccer-ball",
            "description": "Goal! Lionel Messi (Barcelona) is quickest to react to the rebound and stabs the ball into the back of the net. It's 1:2."
        },
        {
            "gameTime": "2 - 40:50",
            "label": "",
            "description": "Lionel Messi (Barcelona) misses a good chance to score. An inch perfect cross into the box finds Lionel Messi (Barcelona) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 40:46",
            "label": "",
            "description": "Lionel Messi (Barcelona) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "2 - 39:18",
            "label": "substitution",
            "description": "Andre Gomes (Barcelona) joins the action as a substitute, replacing Sergi Roberto."
        },
        {
            "gameTime": "2 - 36:46",
            "label": "y-card",
            "description": "The main referee, Antonio Mateu Lahoz, is apparently not going to tolerate any discussions. Lionel Messi (Barcelona) is given a yellow card for dissent."
        },
        {
            "gameTime": "2 - 36:20",
            "label": "attendance",
            "description": "The attendance for today's match is 52573."
        },
        {
            "gameTime": "2 - 33:50",
            "label": "",
            "description": "Lionel Messi (Barcelona) takes the free kick and sends the ball into the penalty area, but the opposition's defence is ready."
        },
        {
            "gameTime": "2 - 32:59",
            "label": "",
            "description": "A player from Atl. Madrid brings down an opponent and commits a foul. Barcelona win a free kick."
        },
        {
            "gameTime": "2 - 31:50",
            "label": "substitution",
            "description": "Problems for Luis Enrique as Jeremy Mathieu is not able to play anymore. His injury is too serious and Lucas Digne (Barcelona) replaces him."
        },
        {
            "gameTime": "2 - 29:20",
            "label": "injury",
            "description": "Jeremy Mathieu (Barcelona) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 28:55",
            "label": "y-card",
            "description": "Angel Correa (Atl. Madrid) sees a yellow card from Antonio Mateu Lahoz after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 27:50",
            "label": "y-card",
            "description": "Gabi (Atl. Madrid) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Antonio Mateu Lahoz ignores the protests."
        },
        {
            "gameTime": "2 - 26:50",
            "label": "substitution",
            "description": "Diego Simeone prepares a substitution. Kevin Gameiro is replaced by Angel Correa (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 25:55",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Andres Iniesta will be replaced by Ivan Rakitic (Barcelona)."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Koke flights the free kick into the box, where Diego Godin (Atl. Madrid) peels off his marker and heads straight inside the upright from the edge of the six yard box. He makes it 1:1."
        },
        {
            "gameTime": "2 - 24:41",
            "label": "",
            "description": "Koke (Atl. Madrid) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "2 - 24:23",
            "label": "",
            "description": "One of the Barcelona players tripped an opponent and conceded a foul. Atl. Madrid will take a free kick."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "substitution",
            "description": "The manager makes a subsitution with Fernando Torres (Atl. Madrid) coming on for Yannick Carrasco."
        },
        {
            "gameTime": "2 - 19:43",
            "label": "y-card",
            "description": "Stefan Savic (Atl. Madrid) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Antonio Mateu Lahoz didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 18:46",
            "label": "soccer-ball",
            "description": "Goal! Rafinha (Barcelona) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball low inside the left post. It's 0:1."
        },
        {
            "gameTime": "2 - 18:40",
            "label": "",
            "description": "Luis Suarez (Barcelona) misses a good chance to score. An inch perfect cross into the box finds Luis Suarez (Barcelona) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 16:52",
            "label": "corner",
            "description": "The corner from Koke (Atl. Madrid) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 16:34",
            "label": "",
            "description": "Kevin Gameiro (Atl. Madrid) misses a good chance to score. An inch perfect cross into the box finds Kevin Gameiro (Atl. Madrid) who rises for a header, but sends the ball well over the bar. The ball is out of play. A goal scoring opportunity from a corner for Atl. Madrid."
        },
        {
            "gameTime": "2 - 15:12",
            "label": "corner",
            "description": "The corner from Neymar (Barcelona) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 15:02",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Lionel Messi (Barcelona) is thwarted and cleared to safety. The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "2 - 14:16",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 14:03",
            "label": "",
            "description": "Lionel Messi (Barcelona) slides a pass forward, but one of the defenders cuts it out. Barcelona have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 10:55",
            "label": "y-card",
            "description": "Antonio Mateu Lahoz shows the yellow card to Saul Niguez (Atl. Madrid) for a heavy challenge."
        },
        {
            "gameTime": "2 - 10:18",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) jumps for a cross and produces a fine header from near the penalty spot, but it goes a whisker over the bar! What a huge opportunity!"
        },
        {
            "gameTime": "2 - 09:19",
            "label": "y-card",
            "description": "A yellow card for a tackle by Sergio Busquets (Barcelona). Antonio Mateu Lahoz doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 08:37",
            "label": "corner",
            "description": "Neymar (Barcelona) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 07:53",
            "label": "",
            "description": "Neymar (Barcelona) takes the free kick which is dealt with by the opposition defence. The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 07:35",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul. A free kick to Barcelona."
        },
        {
            "gameTime": "2 - 06:48",
            "label": "",
            "description": "Gabi (Atl. Madrid) tries his luck with a long range effort after receiving a precise pass. It goes to the bottom left corner, but Marc Andre ter Stegen has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 06:19",
            "label": "",
            "description": "Marc Andre ter Stegen pulls off a great save to deny Antoine Griezmann (Atl. Madrid), who makes himself some space inside the box and unleashes a quick shot to the left side of the goal."
        },
        {
            "gameTime": "2 - 04:21",
            "label": "",
            "description": "Filipe Luis (Atl. Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 03:25",
            "label": "",
            "description": "Luis Suarez (Barcelona) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the right post."
        },
        {
            "gameTime": "2 - 02:41",
            "label": "",
            "description": "Kevin Gameiro (Atl. Madrid) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 01:05",
            "label": "",
            "description": "Flag goes up against Kevin Gameiro (Atl. Madrid) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:07",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 42:49",
            "label": "",
            "description": "Gerard Pique (Barcelona) rises highest from the corner to head at goal, but his effort towards the left side of the goal is brilliantly kept out by the goalkeeper."
        },
        {
            "gameTime": "1 - 42:39",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 38:08",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 37:27",
            "label": "",
            "description": "Lionel Messi (Barcelona) has the opportunity to threaten the opponent's goal via a free kick on the edge of the box. He hits a fine strike towards the underside of the bar, but Jan Oblak denies him with a great save. The referee and one of his assistants signal for a corner kick to Barcelona."
        },
        {
            "gameTime": "1 - 33:39",
            "label": "",
            "description": "Wonderful pass from Antoine Griezmann (Atl. Madrid) for Koke, but they can't profit from it as Marc Andre ter Stegen comes off his line to collect."
        },
        {
            "gameTime": "1 - 31:19",
            "label": "corner",
            "description": "Koke (Atl. Madrid) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 31:03",
            "label": "",
            "description": "Koke (Atl. Madrid) sends a teasing cross into the area, but Marc Andre ter Stegen intercepts the ball. Atl. Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 28:57",
            "label": "",
            "description": "Lionel Messi (Barcelona) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Jan Oblak was alert and the score remained the same."
        },
        {
            "gameTime": "1 - 26:05",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Koke (Atl. Madrid) takes it short."
        },
        {
            "gameTime": "1 - 19:10",
            "label": "corner",
            "description": "Koke (Atl. Madrid) swings in the corner, but the goalkeeper does a brilliant job to intercept the effort."
        },
        {
            "gameTime": "1 - 18:07",
            "label": "corner",
            "description": "Koke (Atl. Madrid) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 15:49",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) connects with an accurate pass inside the box and fires the ball to the bottom right corner, but one of the defending players steps in to block the effort."
        },
        {
            "gameTime": "1 - 15:19",
            "label": "",
            "description": "Gabi (Atl. Madrid) attempts to score with a first time shot from the edge of the box. His effort towards the middle of the goal is saved by Marc Andre ter Stegen."
        },
        {
            "gameTime": "1 - 07:33",
            "label": "",
            "description": "Lionel Messi (Barcelona) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "1 - 05:43",
            "label": "",
            "description": "Lionel Messi (Barcelona) crosses the ball from the free kick, but his attempt is overhit and it goes well out of play."
        },
        {
            "gameTime": "1 - 03:27",
            "label": "corner",
            "description": "Antoine Griezmann (Atl. Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Atl. Madrid will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Mateu Lahoz will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "11 the number of consecutive matches that Barcelona scored at least one goal."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Atl. Madrid haven't lost in their last 8 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "26/02/2017 - 18:15",
    "gameHomeTeam": "Atl. Madrid",
    "gameScore": "1 - 2"
}