{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2014-2015/2015-02-22 - 23-00 Elche 0 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The away team was superior today. The home side focused on defending and let the opposition enjoy possession of the ball."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 47:43",
            "label": "substitution",
            "description": "Carlo Ancelotti has decided to introduce fresh legs, with Jese (Real Madrid) replacing Karim Benzema."
        },
        {
            "gameTime": "2 - 45:55",
            "label": "",
            "description": "Toni Kroos (Real Madrid) and Alvaro Arbeloa matched up again to find some space for an unmarked teammate."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:26",
            "label": "substitution",
            "description": "Substitution. Alvaro Arbeloa (Real Madrid) replaces Isco."
        },
        {
            "gameTime": "2 - 41:43",
            "label": "",
            "description": "Gareth Bale (Real Madrid) and Isco attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 40:17",
            "label": "funfact",
            "description": "The total number of attempts is 4:17."
        },
        {
            "gameTime": "2 - 38:34",
            "label": "substitution",
            "description": "Carlo Ancelotti has decided to substitute Lucas Silva and he is replaced by Asier Illarramendi (Real Madrid)."
        },
        {
            "gameTime": "2 - 36:21",
            "label": "",
            "description": "Garry Rodrigues (Elche) probably handled the ball."
        },
        {
            "gameTime": "2 - 35:32",
            "label": "substitution",
            "description": "Substitution. Adrian makes way for Cristian Herrera (Elche)."
        },
        {
            "gameTime": "2 - 34:05",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 32:22",
            "label": "",
            "description": "Toni Kroos (Real Madrid) pounces on the rebound on the edge of the box but his wild shot goes high over the crossbar."
        },
        {
            "gameTime": "2 - 31:58",
            "label": "",
            "description": "Karim Benzema (Real Madrid) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort."
        },
        {
            "gameTime": "2 - 30:56",
            "label": "",
            "description": "A pass by Marcelo (Real Madrid) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 29:15",
            "label": "substitution",
            "description": "Substitution. Totally exhausted Mario Pasalic (Elche) is leaving the pitch, and Rafael Galvez (Elche) will replace him."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "The free kick from a promising distance is taken by Cristiano Ronaldo (Real Madrid), who fires in a direct effort just wide of the left post. What a chance!"
        },
        {
            "gameTime": "2 - 26:27",
            "label": "",
            "description": "Real Madrid earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 25:04",
            "label": "y-card",
            "description": "A yellow card for a tackle by Enzo Roco (Elche). Ignacio Iglesias Villanueva doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 23:15",
            "label": "soccer-ball",
            "description": "It's in the back of the net! A perfect cross from Isco finds Cristiano Ronaldo (Real Madrid) who jumps highest and steers a bullet header from the centre of the box into the top left corner. His effort was both powerful and precise. Przemyslaw Tyton had no chance of stopping it. 0:0."
        },
        {
            "gameTime": "2 - 22:39",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Toni Kroos (Real Madrid), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 22:07",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 21:18",
            "label": "",
            "description": "A perfect long pass by Pepe (Real Madrid) finds Daniel Carvajal. He latches on to the pass and continues his attacking run."
        },
        {
            "gameTime": "2 - 20:24",
            "label": "",
            "description": "Karim Benzema (Real Madrid) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "2 - 18:39",
            "label": "substitution",
            "description": "The substitution has been made. Garry Rodrigues (Elche) has replaced Aaron Niguez."
        },
        {
            "gameTime": "2 - 17:30",
            "label": "",
            "description": "An unsuccessful long range effort by Cristiano Ronaldo (Real Madrid) after he collected a pass and unleashed his low drive. The ball was directed towards the left post, but the goalkeeper made an easy save."
        },
        {
            "gameTime": "2 - 15:53",
            "label": "corner",
            "description": "Przemyslaw Tyton comes off his line to intercept the corner from Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "2 - 14:18",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. The linesman points to the corner flag, Real Madrid are going to take it."
        },
        {
            "gameTime": "2 - 11:36",
            "label": "",
            "description": "Real Madrid hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 10:35",
            "label": "soccer-ball",
            "description": "Karim Benzema (Real Madrid) is in the right place at the right time. He picks up the rebound after the goalkeeper's poor save and scores easily!"
        },
        {
            "gameTime": "2 - 10:34",
            "label": "",
            "description": "Isco (Real Madrid) tries to send a low pass into the box, but it's blocked and cleared."
        },
        {
            "gameTime": "2 - 10:23",
            "label": "",
            "description": "Gareth Bale (Real Madrid) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 08:02",
            "label": "",
            "description": "Karim Benzema (Real Madrid) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him."
        },
        {
            "gameTime": "2 - 06:36",
            "label": "y-card",
            "description": "Yellow card. Aaron Niguez (Elche) goes into the referee's book after a bad challenge."
        },
        {
            "gameTime": "2 - 05:09",
            "label": "",
            "description": "Poor challenge! Damian Suarez (Elche) is penalised for tripping and Ignacio Iglesias Villanueva blows his whistle."
        },
        {
            "gameTime": "2 - 03:55",
            "label": "",
            "description": "Gareth Bale (Real Madrid) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 02:35",
            "label": "corner",
            "description": "Edu Albacar (Elche) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 01:55",
            "label": "",
            "description": "Aaron Niguez (Elche) takes a wonderful touch after collecting a pass inside the box. He steers his low drive towards the left post, but the keeper dives low to keep the ball out. The referee points to the corner flag and Elche will take a corner."
        },
        {
            "gameTime": "2 - 01:39",
            "label": "",
            "description": "Raphael Varane (Real Madrid) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We are watching a run of the mill game with only a few moments to ignite the crowd. The players surely can surely perform better, they just need to motivate themselves. The visiting team dominated in most aspects of the game and the home side struggled to keep up. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "Ignacio Iglesias Villanueva has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:55",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 43:27",
            "label": "",
            "description": "Mario Pasalic (Elche) collects a pass and strikes from about 19 metres out. It's a poor attempt which flies well wide of the left post."
        },
        {
            "gameTime": "1 - 41:21",
            "label": "",
            "description": "Isco (Real Madrid) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Przemyslaw Tyton was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 39:57",
            "label": "y-card",
            "description": "Ignacio Iglesias Villanueva shows a yellow card to Jonathas (Elche) for a tough tackle."
        },
        {
            "gameTime": "1 - 39:00",
            "label": "",
            "description": "GOAL DISALLOWED! Controversy and anger as Karim Benzema (Real Madrid) has a goal ruled out, incredibly, for offside."
        },
        {
            "gameTime": "1 - 37:18",
            "label": "y-card",
            "description": "The expression of the referee Ignacio Iglesias Villanueva is crystal clear. This behaviour won't be tolerated. Marcelo (Real Madrid) is shown a yellow card."
        },
        {
            "gameTime": "1 - 35:56",
            "label": "",
            "description": "A long pass, executed by Jonathas (Elche), missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 33:44",
            "label": "",
            "description": "The linesman signals that Gareth Bale (Real Madrid) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 32:02",
            "label": "",
            "description": "Victor Rodriguez (Elche) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 30:20",
            "label": "",
            "description": "Raphael Varane (Real Madrid) is able to continue to play."
        },
        {
            "gameTime": "1 - 30:19",
            "label": "injury",
            "description": "Raphael Varane (Real Madrid) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 29:20",
            "label": "",
            "description": "Isco (Real Madrid) sends a teasing cross into the area, but Przemyslaw Tyton intercepts the ball."
        },
        {
            "gameTime": "1 - 28:24",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) was trying to get to the ball but clattered into the legs of the opponent as well. Ignacio Iglesias Villanueva blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 27:30",
            "label": "",
            "description": "The linesman raises his flag. Karim Benzema (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "1 - 26:46",
            "label": "",
            "description": "Lucas Silva (Real Madrid) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "1 - 25:07",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) gets in a header from the resulting free kick. It lacks accuracy, however, to bother the keeper and the ball goes a few metres over the bar."
        },
        {
            "gameTime": "1 - 23:24",
            "label": "",
            "description": "Real Madrid will look to benefit from a promising free kick near the touchline."
        },
        {
            "gameTime": "1 - 23:23",
            "label": "y-card",
            "description": "Ignacio Iglesias Villanueva shows the yellow card to Edu Albacar (Elche) for a heavy challenge."
        },
        {
            "gameTime": "1 - 22:54",
            "label": "",
            "description": "Faycal Fajr (Elche) sends a long ball in, but Iker Casillas comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 20:37",
            "label": "",
            "description": "Edu Albacar (Elche) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 17:46",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 16:25",
            "label": "",
            "description": "Marcelo sends a lofted pass into the box, Cristiano Ronaldo (Real Madrid) shows good awareness to connect with it but drags his shot well wide of the left post."
        },
        {
            "gameTime": "1 - 15:40",
            "label": "",
            "description": "A crossfield pass from Aaron Niguez (Elche) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 14:02",
            "label": "corner",
            "description": "A dangerous looking corner kick from Toni Kroos (Real Madrid) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 13:42",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) picks up a pass, lines up a shot and strikes from 18 metres out, but Przemyslaw Tyton thwarts the effort which is headed to the right side of the goal. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "1 - 12:44",
            "label": "",
            "description": "Faycal Fajr (Elche) plays a one two with Jonathas, but the move breaks down."
        },
        {
            "gameTime": "1 - 10:52",
            "label": "",
            "description": "Gareth Bale (Real Madrid) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 09:52",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "1 - 09:33",
            "label": "",
            "description": "Gareth Bale (Real Madrid) delivers a low pass into the box which is intercepted. Real Madrid force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 08:26",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 07:12",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 06:28",
            "label": "",
            "description": "Some patient build up play from Real Madrid as they look to unlock the defence."
        },
        {
            "gameTime": "1 - 05:32",
            "label": "",
            "description": "Karim Benzema (Real Madrid) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "1 - 04:12",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 03:40",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) accepts a pass deep inside the box and after a nice touch sends the ball towards the right side of the goal. It is a pretty sweet shot, but one of the defenders changes the trajectory of the ball and deflects it onto the post. What an unlucky moment for Cristiano Ronaldo (Real Madrid). He must have smashed a mirror recently. Real Madrid earn a corner."
        },
        {
            "gameTime": "1 - 02:42",
            "label": "",
            "description": "A goal, which was scored by Gareth Bale (Real Madrid), was disallowed due to offside."
        },
        {
            "gameTime": "1 - 01:14",
            "label": "",
            "description": "Gareth Bale (Real Madrid) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Real Madrid will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ignacio Iglesias Villanueva is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The away team was superior today. The home side focused on defending and let the opposition enjoy possession of the ball."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "22/02/2015 - 23:00",
    "gameHomeTeam": "Elche",
    "gameScore": "0 - 2"
}