{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-05-08 - 18-00 Real Madrid 3 - 2 Valencia/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. There wasn't any significant dominance by either side in this game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        },
        {
            "gameTime": "2 - 48:11",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "",
            "description": "Shkodran Mustafi (Valencia) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "2 - 46:56",
            "label": "",
            "description": "Dangerous play by Sergio Ramos (Real Madrid). David Fernandez Borbalan blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:36",
            "label": "",
            "description": "Marcelo (Real Madrid) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball."
        },
        {
            "gameTime": "2 - 42:49",
            "label": "corner",
            "description": "Daniel Parejo (Valencia) works the corner short."
        },
        {
            "gameTime": "2 - 42:37",
            "label": "",
            "description": "Andre Gomes (Valencia) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The referee and his assistant both point at the corner flag. Valencia will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 41:33",
            "label": "",
            "description": "Goal disallowed! Alvaro Arbeloa (Real Madrid) scores but David Fernandez Borbalan blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 40:24",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Enzo Perez leaves the pitch and Pablo Piatti (Valencia) comes on."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "r-card",
            "description": "David Fernandez Borbalan interrupts the game and punishes the behaviour of Rodrigo (Valencia) with a red card."
        },
        {
            "gameTime": "2 - 35:56",
            "label": "soccer-ball",
            "description": "Andre Gomes (Valencia) latches on to a superb pass and breaks through the defence before firing a shot from mid range that goes past the goalkeeper inside the right post."
        },
        {
            "gameTime": "2 - 35:29",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Daniel Parejo (Valencia) takes it short."
        },
        {
            "gameTime": "2 - 34:55",
            "label": "",
            "description": "Francisco Casilla gets a well deserved ovation! Rodrigo (Valencia) produces a decent first time strike towards the left post, but the goalkeeper is positioned well to block it. Nice goalkeeping skills. Good work from Valencia as they win a corner."
        },
        {
            "gameTime": "2 - 33:39",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to make a change. Alvaro Arbeloa (Real Madrid) replaces Cristiano Ronaldo."
        },
        {
            "gameTime": "2 - 32:23",
            "label": "",
            "description": "Rodrigo (Valencia) serves up a nice cross, but Francisco Casilla punches the ball away."
        },
        {
            "gameTime": "2 - 30:39",
            "label": "substitution",
            "description": "The manager makes a subsitution with Jese (Real Madrid) coming on for Lucas."
        },
        {
            "gameTime": "2 - 29:37",
            "label": "",
            "description": "CHANCE! Andre Gomes (Valencia) picks up a pass inside the box and has a sight of goal, but he blazes his shot well over the top."
        },
        {
            "gameTime": "2 - 29:15",
            "label": "",
            "description": "Lucas (Real Madrid) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 28:53",
            "label": "corner",
            "description": "The resulting corner from Toni Kroos (Real Madrid) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 28:25",
            "label": "",
            "description": "Lucas (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The linesman points to the corner flag, Real Madrid are going to take it."
        },
        {
            "gameTime": "2 - 28:07",
            "label": "injury",
            "description": "Lucas (Real Madrid) is writhing in pain and can now receive medical treatment after the referee decides to stop play."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "corner",
            "description": "Rodrigo (Valencia) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 25:59",
            "label": "",
            "description": "CHANCE! Alcacer Paco (Valencia) goes very close! He gathers a cross inside the box and fires a sublime shot to the left side of the goal, but Francisco Casilla produces an excellent save. The ball is out of play and the linesman points at the corner flag. Corner to Valencia."
        },
        {
            "gameTime": "2 - 23:39",
            "label": "y-card",
            "description": "Javi Fuego (Valencia) is booked after bringing down an opponent. David Fernandez Borbalan had an easy decision to make."
        },
        {
            "gameTime": "2 - 22:32",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is flagged for offside."
        },
        {
            "gameTime": "2 - 20:16",
            "label": "attendance",
            "description": "The attendance is 72987."
        },
        {
            "gameTime": "2 - 19:18",
            "label": "substitution",
            "description": "Here is a change. Karim Benzema is going off and Zinedine Zidane gives the last tactical orders to Mateo Kovacic (Real Madrid)."
        },
        {
            "gameTime": "2 - 18:42",
            "label": "",
            "description": "Andre Gomes (Valencia) creates some space for himself to pick up a pass on the edge of the box and unleashes a decent strike which goes a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 16:23",
            "label": "corner",
            "description": "Santi Mina (Valencia) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 15:39",
            "label": "",
            "description": "Daniel Parejo (Valencia) latches on to a pin point pass on the edge of the box and unleashes a daisy cutter shot towards the bottom left corner, but the goalkeeper produces an amazing acrobatic dive to deny him. The ball bounces off his gloves and hits the post. Corner kick. Valencia will have an opportunity."
        },
        {
            "gameTime": "2 - 13:21",
            "label": "soccer-ball",
            "description": "Goal Cristiano Ronaldo (Real Madrid)! Cristiano Ronaldo (Real Madrid) was put through by James Rodriguez and he showed brilliant composure to tuck it home from inside the box. 3:1."
        },
        {
            "gameTime": "2 - 11:45",
            "label": "",
            "description": "Lucas (Real Madrid) latches on to a precise pass and one on one with the keeper slams the ball towards the right hand post. Diego Alves is alert, though, and leaps like a salmon to deny him."
        },
        {
            "gameTime": "2 - 09:58",
            "label": "soccer-ball",
            "description": "The ball rebounds and arrives at the feet of Rodrigo (Valencia) just outside the box. He doesn't think twice and fires a shot towards the middle of the goal, which Francisco Casilla was unable to keep it out. 2:0."
        },
        {
            "gameTime": "2 - 09:38",
            "label": "",
            "description": "Andre Gomes (Valencia) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear."
        },
        {
            "gameTime": "2 - 09:30",
            "label": "corner",
            "description": "Daniel Parejo (Valencia) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 09:10",
            "label": "corner",
            "description": "Daniel Parejo (Valencia) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 09:07",
            "label": "",
            "description": "Andre Gomes (Valencia) picks up a pass, lines up a shot and strikes from 18 metres out, but Francisco Casilla thwarts the effort which is headed to the bottom right corner. Valencia win a corner."
        },
        {
            "gameTime": "2 - 08:21",
            "label": "",
            "description": "Wow, what an escape. Karim Benzema (Real Madrid) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "2 - 07:32",
            "label": "",
            "description": "Daniel Parejo (Valencia) takes the resulting free kick from the edge of the box. His rocket of a shot crashes against the crossbar! What a shot."
        },
        {
            "gameTime": "2 - 06:43",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Casemiro (Real Madrid) was quite harsh and David Fernandez Borbalan didn't hesitate to show him a yellow card. Valencia win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 05:48",
            "label": "",
            "description": "The game is interrupted as Cristiano Ronaldo (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "2 - 04:57",
            "label": "",
            "description": "That was a brilliant piece of goalkeeping! Diego Alves dived superbly to block a header by Karim Benzema (Real Madrid) from around the penalty spot. His effort was directed straight towards the right post, but Diego Alves pulled off a remarkable save!"
        },
        {
            "gameTime": "2 - 04:43",
            "label": "",
            "description": "Casemiro (Real Madrid) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "2 - 02:35",
            "label": "corner",
            "description": "Diego Alves comes off his line to intercept the corner from Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "2 - 02:09",
            "label": "",
            "description": "Lucas (Real Madrid) connects with a pass but sees his shot from the edge of the box blocked. The ball is out of play. A goal scoring opportunity from a corner for Real Madrid."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here is a change after the half time break. Joao Cancelo is replaced by Andre Gomes (Valencia)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "There will be a change on the pitch for the second half. Pako Ayestaran probably wasn't satisfied with the performance of Aymen Abdennour. He is replaced by Santi Mina (Valencia)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "David Fernandez Borbalan blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "There was certainly plenty of action during that opening 45 minutes. The home side were more active and dominant in the first half. The opposition found it tough to keep up. The home team makes a lot of passes and attempts to maintain possession. The same goes for the away side."
        },
        {
            "gameTime": "1 - 46:13",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 42:50",
            "label": "y-card",
            "description": "Having seen unsporting behavior, David Fernandez Borbalan shows a yellow card to one of the players sitting on the bench. And Andre Gomes (Valencia) is the recipient."
        },
        {
            "gameTime": "1 - 41:51",
            "label": "soccer-ball",
            "description": "Goal! A mistake from the defence gifted a chance to a lurking Karim Benzema (Real Madrid), who keeps his cool and rolls the ball into the net from close range. 2:0."
        },
        {
            "gameTime": "1 - 41:42",
            "label": "",
            "description": "Karim Benzema (Real Madrid) was close to scoring a goal after unleashing a first time effort from inside the six yard box. The ball was aimed towards the middle of the net, but the goalkeeper read it well and pulled off a brilliant save to thwart the attempt."
        },
        {
            "gameTime": "1 - 40:37",
            "label": "",
            "description": "Marcelo (Real Madrid) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "1 - 39:58",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 39:36",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Cristiano Ronaldo (Real Madrid). Real Madrid have a corner."
        },
        {
            "gameTime": "1 - 38:53",
            "label": "y-card",
            "description": "The whistle blows and Guilherme Siqueira (Valencia) is booked for an infringement."
        },
        {
            "gameTime": "1 - 38:52",
            "label": "",
            "description": "The game is interrupted, a clear handball by Guilherme Siqueira (Valencia)."
        },
        {
            "gameTime": "1 - 37:36",
            "label": "",
            "description": "Rodrigo (Valencia) takes the ball on and fires in a low shot from 20 metres. Francisco Casilla stops the effort which is headed to the middle of the target."
        },
        {
            "gameTime": "1 - 36:33",
            "label": "",
            "description": "What a big chance! Joao Cancelo (Valencia) picks up an inch perfect pass inside the box and fires the ball just over the crossbar."
        },
        {
            "gameTime": "1 - 34:48",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 33:38",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 33:11",
            "label": "",
            "description": "Diego Alves pulls off a fantastic save! Lucas (Real Madrid) attempts to head home after a precise cross into the box. He aims his header low towards the right post, but the effort is kept out. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 31:45",
            "label": "",
            "description": "He should have done better. Karim Benzema (Real Madrid) is afforded space to connect with a Danilo cross, but his header from the centre of the box flies well wide of the left post."
        },
        {
            "gameTime": "1 - 30:37",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) finds himself some space around the penalty spot to connect with a fine free kick. His header is slightly mistimed and sails inches past the right post."
        },
        {
            "gameTime": "1 - 30:18",
            "label": "",
            "description": "James Rodriguez (Real Madrid) takes a direct free kick."
        },
        {
            "gameTime": "1 - 29:33",
            "label": "",
            "description": "Referee David Fernandez Borbalan sees the trip by Antonio Barragan (Valencia) and doesn't hesitate to blow his whistle. Real Madrid have a free kick."
        },
        {
            "gameTime": "1 - 27:20",
            "label": "corner",
            "description": "The corner from Daniel Parejo (Valencia) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 26:57",
            "label": "",
            "description": "Joao Cancelo (Valencia) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. It will be a corner kick for Valencia."
        },
        {
            "gameTime": "1 - 25:40",
            "label": "soccer-ball",
            "description": "Goal 1:0! Cristiano Ronaldo (Real Madrid) gets a shot away from the edge of the box and scores into the bottom left corner. Marcelo provided an assist for the goal."
        },
        {
            "gameTime": "1 - 24:24",
            "label": "",
            "description": "Diego Alves pulls off a great save to deny Cristiano Ronaldo (Real Madrid), who makes himself some space inside the box and unleashes a quick low drive to the bottom left corner."
        },
        {
            "gameTime": "1 - 23:55",
            "label": "",
            "description": "Rodrigo (Valencia) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "1 - 21:55",
            "label": "",
            "description": "Today's clash hasn't been that attractive up to now, but it hasn't been a total borefest. There have been a few nice movements for both sides."
        },
        {
            "gameTime": "1 - 18:55",
            "label": "",
            "description": "A dangerous towering header by Karim Benzema (Real Madrid) from around the penalty spot goes just wide of the right post. This corner kick didn't change the score."
        },
        {
            "gameTime": "1 - 18:44",
            "label": "corner",
            "description": "Corner kick. James Rodriguez (Real Madrid) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 18:25",
            "label": "",
            "description": "Danilo (Real Madrid) tries to send a pass but it's blocked. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 15:38",
            "label": "corner",
            "description": "Daniel Parejo (Valencia) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 15:11",
            "label": "",
            "description": "Alcacer Paco (Valencia) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. The referee signals a corner kick to Valencia."
        },
        {
            "gameTime": "1 - 13:54",
            "label": "",
            "description": "Karim Benzema (Real Madrid) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "1 - 12:55",
            "label": "y-card",
            "description": "Enzo Perez (Valencia) has tested the patience of referee David Fernandez Borbalan and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 11:32",
            "label": "",
            "description": "Rodrigo (Valencia) picks up the ball inside the penalty box and immediately fires a first time effort that sails well over the crossbar and ends in the stands."
        },
        {
            "gameTime": "1 - 10:12",
            "label": "",
            "description": "Casemiro (Real Madrid) slams the ball goalwards from 18 metres out, but his decent effort flies a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 09:15",
            "label": "",
            "description": "It looks like Joao Cancelo (Valencia) saw red with that tackle. David Fernandez Borbalan won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 05:43",
            "label": "",
            "description": "Toni Kroos (Real Madrid) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 04:03",
            "label": "",
            "description": "Javi Fuego (Valencia) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again. Real Madrid will take a free kick."
        },
        {
            "gameTime": "1 - 03:14",
            "label": "",
            "description": "Karim Benzema (Real Madrid) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 01:22",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Valencia will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "David Fernandez Borbalan will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. There wasn't any significant dominance by either side in this game. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks, while the away team played possession football."
        }
    ],
    "gameAwayTeam": "Valencia",
    "gameDate": "08/05/2016 - 18:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "3 - 2"
}