{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2016-12-06 - 22-45 Benfica 1 - 2 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. An impressive display from the visitors, they had the better of it. The home team played long passes and crosses into the box, while the away side created their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "2 - 48:10",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 47:31",
            "label": "",
            "description": "Konstantinos Mitroglou makes a nice run and receives a pin point long through ball from Pizzi (Benfica). It would probably have put him one on one with the keeper, but one of the defenders makes a great block."
        },
        {
            "gameTime": "2 - 46:40",
            "label": "",
            "description": "slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:35",
            "label": "",
            "description": "Luisao (Benfica) commits a foul and Antonio Mateu Lahoz immediately signals a free kick."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "y-card",
            "description": "Pizzi (Benfica) goes into the referee's book for dissent."
        },
        {
            "gameTime": "2 - 41:59",
            "label": "soccer-ball",
            "description": "Goal! The ball breaks to Raul Jimenez (Benfica) after some poor defending, he finds himself one on one with the goalkeeper and calmly puts the ball into the back of the net! He makes it 1:2."
        },
        {
            "gameTime": "2 - 40:30",
            "label": "",
            "description": "Antonio Mateu Lahoz blows his whistle and it's Ljubomir Fejsa (Benfica) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 39:40",
            "label": "",
            "description": "Amadou Diawara (Napoli) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play."
        },
        {
            "gameTime": "2 - 38:47",
            "label": "",
            "description": "darts into the penalty area to latch on to a pass, and he unleashes a shot in the direction of the top left corner. Ederson (Benfica) is alert and denies him with a nice save."
        },
        {
            "gameTime": "2 - 38:09",
            "label": "",
            "description": "The ball is cleared after attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 37:27",
            "label": "corner",
            "description": "Andre Carrillo (Benfica) swings in a cross from the corner, but Pepe Reina reads it well and gathers the ball."
        },
        {
            "gameTime": "2 - 37:04",
            "label": "corner",
            "description": "Pizzi (Benfica) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "2 - 36:34",
            "label": "",
            "description": "Marko Rog (Napoli) handles the ball and everyone in the stadium shouts 'handball'."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "substitution",
            "description": "Maurizio Sarri decides to make a substitution. Lorenzo Insigne will be replaced by Marko Rog (Napoli)."
        },
        {
            "gameTime": "2 - 34:59",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Konstantinos Mitroglou (Benfica) for Eduardo Salvio."
        },
        {
            "gameTime": "2 - 33:33",
            "label": "soccer-ball",
            "description": "Dries Mertens (Napoli) makes a great solo run and pulls the trigger from inside the box, beating Ederson with a precise strike which bounces off the bottom of the left post and into the back of the net. He makes it 0:2."
        },
        {
            "gameTime": "2 - 32:59",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 31:44",
            "label": "",
            "description": "Pizzi (Benfica) stands over the resultant free kick from 20 metres out and his shot goes well wide of the left post."
        },
        {
            "gameTime": "2 - 30:07",
            "label": "",
            "description": "Raul Albiol (Napoli) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "2 - 29:40",
            "label": "",
            "description": "Eduardo Salvio (Benfica) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "2 - 28:59",
            "label": "attendance",
            "description": "The attendance for today's match is 55634."
        },
        {
            "gameTime": "2 - 27:47",
            "label": "",
            "description": "Andre Almeida (Benfica) is penalised for holding. Antonio Mateu Lahoz signals a set piece."
        },
        {
            "gameTime": "2 - 27:24",
            "label": "",
            "description": "The ball is cleared after Raul Jimenez (Benfica) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 26:42",
            "label": "substitution",
            "description": "Here is a change. Marek Hamsik (Napoli) is going off and Maurizio Sarri gives the last tactical orders to ."
        },
        {
            "gameTime": "2 - 24:52",
            "label": "",
            "description": "Dries Mertens (Napoli) is caught offside, but it was a really close call."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Franco Emanuel Cervi as he is replaced by Andre Carrillo (Benfica)."
        },
        {
            "gameTime": "2 - 21:53",
            "label": "",
            "description": "Ederson dives like superman to thwart a rebound from Lorenzo Insigne (Napoli) which would probably have ended up in the left side of the goal."
        },
        {
            "gameTime": "2 - 21:07",
            "label": "corner",
            "description": "The corner kick from Jose Callejon (Napoli) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 21:06",
            "label": "",
            "description": "Jose Callejon (Napoli) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 20:07",
            "label": "injury",
            "description": "Jose Callejon (Napoli) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 19:25",
            "label": "",
            "description": "Allan (Napoli) unleashes a shot from distance but his effort is well blocked."
        },
        {
            "gameTime": "2 - 17:57",
            "label": "",
            "description": "Rafa Silva (Benfica) breaks past challenges inside the box, but puts too much pace on his pass to Eduardo Salvio. The ball is off of the pitch and it's a goal kick for Napoli."
        },
        {
            "gameTime": "2 - 17:07",
            "label": "",
            "description": "Flag up against Elseid Hysaj (Napoli). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 14:24",
            "label": "soccer-ball",
            "description": "GOAL 0:1! Dries Mertens found Jose Callejon (Napoli) inside the box, he spotted goalkeeper Ederson off his line and chipped the ball into the net. What a cheeky lob!"
        },
        {
            "gameTime": "2 - 13:27",
            "label": "",
            "description": "Andre Almeida (Benfica) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Antonio Mateu Lahoz with no other option than to blow for a foul."
        },
        {
            "gameTime": "2 - 13:16",
            "label": "",
            "description": "Rafa Silva (Benfica) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "2 - 12:20",
            "label": "",
            "description": "Marek Hamsik (Napoli) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "2 - 11:47",
            "label": "substitution",
            "description": "Rui Vitoria has decided to make a change. Rafa Silva (Benfica) replaces Goncalo Guedes."
        },
        {
            "gameTime": "2 - 11:36",
            "label": "substitution",
            "description": "We are about to witness a substitution. Dries Mertens (Napoli) is replacing Manolo Gabbiadini."
        },
        {
            "gameTime": "2 - 11:09",
            "label": "",
            "description": "Jose Callejon (Napoli) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "2 - 10:28",
            "label": "",
            "description": "Jose Callejon (Napoli) plays a one two with Manolo Gabbiadini, but the move breaks down."
        },
        {
            "gameTime": "2 - 08:01",
            "label": "",
            "description": "Nice passing game by Benfica. They are increasing their possession with a series of long passes and waiting for the right moment to create an attacking opportunity."
        },
        {
            "gameTime": "2 - 06:22",
            "label": "",
            "description": "Franco Emanuel Cervi (Benfica) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The referee and the linesman both signal a throw in for Benfica."
        },
        {
            "gameTime": "2 - 05:27",
            "label": "",
            "description": "Eduardo Salvio (Benfica) received a clever through ball which could have put him in a promising position, but the defence was alert to the danger."
        },
        {
            "gameTime": "2 - 03:28",
            "label": "",
            "description": "Jose Callejon (Napoli) threw away a promising scoring opportunity. He received a fine cross inside the 6 yard box, but his shot missed the target close to the right post."
        },
        {
            "gameTime": "2 - 02:30",
            "label": "",
            "description": "Ljubomir Fejsa (Benfica) should know this behaviour is beyond the rules. He was too careless with his challenge and left Antonio Mateu Lahoz no option but to blow his whistle."
        },
        {
            "gameTime": "2 - 01:05",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Manolo Gabbiadini (Napoli). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Antonio Mateu Lahoz blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. The visitors were superior in their performance through the first half. They were more active and precise. The home side attempts to create scoring opportunities mainly with long balls. The away team, however, mostly uses counter attacks to penetrate the home defence."
        },
        {
            "gameTime": "1 - 45:06",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 43:47",
            "label": "",
            "description": "Marek Hamsik (Napoli) finds himself in an offside position and the referee stops play after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 42:28",
            "label": "",
            "description": "Ljubomir Fejsa (Benfica) was too forceful with his tackle and Antonio Mateu Lahoz interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 42:28",
            "label": "",
            "description": "Jose Callejon (Napoli) is penalised for a foul. Antonio Mateu Lahoz had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 41:30",
            "label": "",
            "description": "Antonio Mateu Lahoz blows the whistle, Pizzi (Benfica) is penalised for a foul."
        },
        {
            "gameTime": "1 - 40:54",
            "label": "",
            "description": "It could have been a good chance to score! Faouzi Ghoulam (Napoli) fails to release Eduardo Salvio with a through ball as the defence is alert and clears."
        },
        {
            "gameTime": "1 - 40:54",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 38:14",
            "label": "corner",
            "description": "Benfica have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "1 - 36:33",
            "label": "",
            "description": "Jose Callejon (Napoli) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 36:07",
            "label": "",
            "description": "A neat pass is well received by Manolo Gabbiadini (Napoli), who is lurking on the edge of the box and strikes the ball towards the middle of the target. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "1 - 34:29",
            "label": "",
            "description": "Jose Callejon (Napoli) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the bottom left corner. Ederson has a clear sight of it makes a comfortable save."
        },
        {
            "gameTime": "1 - 33:34",
            "label": "",
            "description": "Pizzi (Benfica) whips the ball into the box and Franco Emanuel Cervi takes a perfect touch to control it, but one of the defenders does well to intercept."
        },
        {
            "gameTime": "1 - 32:07",
            "label": "",
            "description": "Nelson Semedo (Benfica) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "1 - 31:28",
            "label": "",
            "description": "Pizzi (Benfica) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "1 - 31:10",
            "label": "corner",
            "description": "Franco Emanuel Cervi (Benfica) takes a short corner kick."
        },
        {
            "gameTime": "1 - 29:54",
            "label": "",
            "description": "Nelson Semedo (Benfica) attempts to put the ball in from a rebound with his long range shot, but it isn't accurate enough and the ball goes wide of the left post."
        },
        {
            "gameTime": "1 - 29:22",
            "label": "corner",
            "description": "Pizzi (Benfica) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 29:04",
            "label": "",
            "description": "Franco Emanuel Cervi (Benfica) slaloms his way past challenges, but an opposing player does well to get the ball away. Benfica force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 27:17",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) misses a good chance to score. An inch perfect cross into the box finds Lorenzo Insigne (Napoli) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 25:50",
            "label": "",
            "description": "A through ball from Amadou Diawara (Napoli) fails to reach Manolo Gabbiadini as one of the defending players reacts brilliantly to intercept the effort. If the pass had been produced a little bit earlier, Manolo Gabbiadini could have got into a promising position."
        },
        {
            "gameTime": "1 - 25:08",
            "label": "",
            "description": "Antonio Mateu Lahoz blows his whistle after Ljubomir Fejsa (Benfica) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 23:33",
            "label": "corner",
            "description": "Pizzi (Benfica) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "1 - 23:16",
            "label": "",
            "description": "Pepe Reina makes a brilliant save! Raul Jimenez (Benfica) easily weaves through the defence and unleashes a shot from just outside of the box. His low shot goes towards the middle of the goal but is saved by keeper! Benfica have a corner."
        },
        {
            "gameTime": "1 - 21:42",
            "label": "",
            "description": "Goncalo Guedes (Benfica) is furious with himself as he misses a golden opportunity from inside the six yard box. He sends a rebound a few inches wide of the left post. The ball goes out of play and Napoli will have a goal kick."
        },
        {
            "gameTime": "1 - 20:34",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Manolo Gabbiadini (Napoli) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "1 - 20:30",
            "label": "",
            "description": "Ederson makes a brilliant save! Marek Hamsik (Napoli) easily weaves through the defence and fires the ball from mid range. His effort goes towards the right side of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "1 - 19:26",
            "label": "",
            "description": "Nelson Semedo (Benfica) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 16:33",
            "label": "",
            "description": "Raul Jimenez (Benfica) receives a pass and decides to smash the ball from long range. His poor effort sails well wide of the right post. The ball is off of the pitch and it's a goal kick for Napoli."
        },
        {
            "gameTime": "1 - 16:16",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) sends a long cross over to Jose Callejon, but Ederson comes forward to gather the ball."
        },
        {
            "gameTime": "1 - 15:35",
            "label": "",
            "description": "Marek Hamsik (Napoli) crosses the ball forward but it is intercepted."
        },
        {
            "gameTime": "1 - 14:50",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) is deemed to be in an offside position by the linesman and it looks like it is the right decision despite being a very close call."
        },
        {
            "gameTime": "1 - 14:26",
            "label": "y-card",
            "description": "Kalidou Koulibaly (Napoli) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "1 - 13:49",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 12:01",
            "label": "",
            "description": "Raul Jimenez (Benfica) missed a great opportunity! He finds himself some space near the penalty spot and plants a header goalwards which lacks both power and accuracy. The ball sails well over the bar!"
        },
        {
            "gameTime": "1 - 11:11",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Lorenzo Insigne (Napoli), but the defence gets it clear."
        },
        {
            "gameTime": "1 - 10:03",
            "label": "corner",
            "description": "Pizzi (Benfica) launches a cross from the corner, but Pepe Reina is alert to thwart the effort."
        },
        {
            "gameTime": "1 - 09:35",
            "label": "",
            "description": "Goncalo Guedes (Benfica) latches on to a brilliant through ball in a promising position, but one of the defenders is alert to the danger and dispossess him. The ball goes out of play. Benfica are awarded a corner kick."
        },
        {
            "gameTime": "1 - 08:50",
            "label": "",
            "description": "Raul Jimenez (Benfica) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball has crossed the sideline. Benfica are taking a throw in."
        },
        {
            "gameTime": "1 - 07:52",
            "label": "",
            "description": "Victor Lindelof (Benfica) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 07:07",
            "label": "",
            "description": "Elseid Hysaj (Napoli) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "1 - 06:09",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) strikes the ball harmlessly from a long range free kick and it goes high over the bar. It's not easy to score from a distance like that."
        },
        {
            "gameTime": "1 - 04:54",
            "label": "",
            "description": "The referee blows his whistle as Ljubomir Fejsa (Benfica) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 04:18",
            "label": "",
            "description": "Allan (Napoli) latches on to a pin point through ball, but one of the defending players dispossess him. Brilliant defending. The ball is behind the touchline and Napoli will take a throw in."
        },
        {
            "gameTime": "1 - 03:15",
            "label": "",
            "description": "Goncalo Guedes (Benfica) trips an opposition player and Antonio Mateu Lahoz signals a foul."
        },
        {
            "gameTime": "1 - 01:56",
            "label": "",
            "description": "The ball is cleared after Franco Emanuel Cervi (Benfica) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 01:16",
            "label": "",
            "description": "Allan (Napoli) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Napoli will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Mateu Lahoz is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. An impressive display from the visitors, they had the better of it. The home team played long passes and crosses into the box, while the away side created their opportunities using lightning fast counter attacks."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "06/12/2016 - 22:45",
    "gameHomeTeam": "Benfica",
    "gameScore": "1 - 2"
}