{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-29 - 21-45 Lyon 0 - 1 Valencia/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Neither of the teams could take the initiative and dominate today's game. The home side attempted to hold onto the ball for as long as possible. The away team, on the other hand, played long ball football."
        },
        {
            "gameTime": "2 - 48:27",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 48:10",
            "label": "",
            "description": "Pablo Piatti (Valencia) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play. Valencia are awarded a corner kick."
        },
        {
            "gameTime": "2 - 47:30",
            "label": "",
            "description": "Valencia take the free kick with a short pass."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "y-card",
            "description": "This is a yellow card! Jordan Ferri (Lyon) is not happy with the decision, but from our point of view it was clear. Valencia are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 46:55",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "Samuel Umtiti (Lyon) sends a rebound goalwards, low to the right hand post, but the goalkeeper stretches to stop it. The ball goes behind for a corner. Lyon will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 46:48",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 46:25",
            "label": "",
            "description": "Corentin Tolisso (Lyon) misses a big chance from point blank range as he struck the ball towards the top right corner. His promising effort following the corner kick was, to his disappointment, thwarted by Jaume Domenech with a fabulous save. The referee and his assistant both point at the corner flag. Lyon will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 46:17",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 46:01",
            "label": "",
            "description": "Aldo Kalulu (Lyon) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. Lyon get a corner."
        },
        {
            "gameTime": "2 - 45:20",
            "label": "y-card",
            "description": "Jaume Domenech (Valencia) infringed the rules and goes into the book. Milorad Mazic pulls out a yellow card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:52",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 21:6."
        },
        {
            "gameTime": "2 - 44:06",
            "label": "",
            "description": "Aldo Kalulu (Lyon) has a shot blocked from inside the box."
        },
        {
            "gameTime": "2 - 43:36",
            "label": "",
            "description": "Corentin Tolisso (Lyon) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him."
        },
        {
            "gameTime": "2 - 42:05",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 41:51",
            "label": "",
            "description": "Christophe Jallet (Lyon) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. Lyon earn a corner."
        },
        {
            "gameTime": "2 - 40:43",
            "label": "",
            "description": "Maxime Gonalons (Lyon) fires a powerful shot which is blocked."
        },
        {
            "gameTime": "2 - 40:13",
            "label": "",
            "description": "Christophe Jallet (Lyon) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 38:43",
            "label": "substitution",
            "description": "Substitution. Danilo (Valencia) in, Enzo Perez out."
        },
        {
            "gameTime": "2 - 37:26",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Rodrigo (Valencia) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "2 - 36:03",
            "label": "",
            "description": "Lyon exchange some short passes over a small area and control the game. Now they make a mistake and lose the ball and the whole situation changes completely."
        },
        {
            "gameTime": "2 - 34:55",
            "label": "",
            "description": "Rodrigo (Valencia) fails to beat the offside trap. The flag goes up and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 33:11",
            "label": "",
            "description": "Corentin Tolisso (Lyon) is unable to feed an accurate cross into the box. It's a throw in for Valencia."
        },
        {
            "gameTime": "2 - 32:47",
            "label": "substitution",
            "description": "The referee signals a substitution. Rachid Ghezzal (Lyon) is brought on as a substitute for Jeremy Morel."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "",
            "description": "Rodrigo (Valencia) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 30:58",
            "label": "",
            "description": "Sofiane Feghouli (Valencia) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "2 - 29:55",
            "label": "",
            "description": "Lyon are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 28:36",
            "label": "substitution",
            "description": "Hubert Fournier has decided to introduce fresh legs, with Claudio Beauvue (Lyon) replacing Alexandre Lacazette."
        },
        {
            "gameTime": "2 - 28:06",
            "label": "",
            "description": "Maxime Gonalons (Lyon) commits a foul during an attacking move."
        },
        {
            "gameTime": "2 - 27:50",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 27:38",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) looks to break free, but an opposing player clears the ball away. It will be a corner kick for Lyon."
        },
        {
            "gameTime": "2 - 25:29",
            "label": "substitution",
            "description": "It is time for a substitution. Rodrigo (Valencia) is on for Alvaro Negredo."
        },
        {
            "gameTime": "2 - 24:15",
            "label": "corner",
            "description": "Pablo Piatti (Valencia) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 23:39",
            "label": "",
            "description": "Enzo Perez (Valencia) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The ball goes out for a corner. Valencia can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 22:27",
            "label": "",
            "description": "Jordan Ferri (Lyon) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 21:42",
            "label": "y-card",
            "description": "The game is interrupted because of a yellow card that is shown to Aldo Kalulu (Lyon)."
        },
        {
            "gameTime": "2 - 19:37",
            "label": "",
            "description": "What a poor attempt! Samuel Umtiti (Lyon) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "2 - 18:21",
            "label": "",
            "description": "Aldo Kalulu picks out Christophe Jallet (Lyon) unmarked inside the box, but he blazes the ball well over the bar."
        },
        {
            "gameTime": "2 - 17:32",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Enzo Perez (Valencia) was quite harsh and Milorad Mazic didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "",
            "description": "Good movement by Christophe Jallet (Lyon), but he can't find any of his teammates as the cross is poor. The ball goes out of play and Valencia will have a goal kick."
        },
        {
            "gameTime": "2 - 15:42",
            "label": "y-card",
            "description": "Maxime Gonalons (Lyon) is booked after bringing down an opponent. Milorad Mazic had an easy decision to make."
        },
        {
            "gameTime": "2 - 14:57",
            "label": "",
            "description": "Sofiane Feghouli (Valencia) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 13:32",
            "label": "substitution",
            "description": "Substitution. Aderlan Santos (Valencia) replaces Aymen Abdennour."
        },
        {
            "gameTime": "2 - 12:22",
            "label": "injury",
            "description": "Sofiane Feghouli (Valencia) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 11:53",
            "label": "",
            "description": "Pablo Piatti (Valencia) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 10:05",
            "label": "corner",
            "description": "Pablo Piatti (Valencia) takes the corner kick, but Anthony Lopes reads it well and stops the effort."
        },
        {
            "gameTime": "2 - 09:43",
            "label": "",
            "description": "Sofiane Feghouli (Valencia) wastes a good opportunity as his pass into the box is blocked by the defence. Valencia have a corner."
        },
        {
            "gameTime": "2 - 07:49",
            "label": "",
            "description": "Corentin Tolisso (Lyon) creates himself some space in front of goal and connects with the resulting free kick. His header is badly mistimed and sails high over the bar."
        },
        {
            "gameTime": "2 - 07:32",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) takes a direct free kick."
        },
        {
            "gameTime": "2 - 06:51",
            "label": "y-card",
            "description": "Milorad Mazic shows a yellow card to Javi Fuego (Valencia) for his blatant foul."
        },
        {
            "gameTime": "2 - 05:52",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 05:20",
            "label": "",
            "description": "Pablo Piatti (Valencia) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 04:53",
            "label": "",
            "description": "Jordan Ferri (Lyon) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 03:29",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) has a go from a long way out but it sails way over."
        },
        {
            "gameTime": "2 - 02:47",
            "label": "",
            "description": "Jeremy Morel (Lyon) attempts to put the ball in from a rebound with his long range shot, but it isn't accurate enough, and the ball goes high over the crossbar."
        },
        {
            "gameTime": "2 - 02:36",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 01:58",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) latches on to a precise pass and finds himself one on one with the keeper, but his effort is straight at Jaume Domenech, who is alert and makes an easy save to deny him. The referee blows his whistle, Lyon are awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:40",
            "label": "",
            "description": "A cross from Christophe Jallet (Lyon) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 01:28",
            "label": "",
            "description": "Christophe Jallet (Lyon) sends a killer pass through the opponent's defence in an effort to find a space for Mathieu Valbuena, who is lurking close to the offside line."
        },
        {
            "gameTime": "2 - 01:05",
            "label": "",
            "description": "Lyon hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Milorad Mazic starts the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. We are witnessing quite a balanced game with both teams struggling to prevail. The tactic of the home side is slow build up play, while the away team's game is based on long passes and crosses into the box."
        },
        {
            "gameTime": "1 - 47:18",
            "label": "whistle",
            "description": "Milorad Mazic has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 47:15",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 46:53",
            "label": "",
            "description": "What a great touch by Jordan Ferri (Lyon) as he controls a fine pass into the box and takes a shot to the bottom left corner, but an opposing player makes a clearance. Great defending. The referee signals a corner kick to Lyon."
        },
        {
            "gameTime": "1 - 45:57",
            "label": "",
            "description": "CHANCE! Alexandre Lacazette (Lyon) has a shot from inside the box which is deflected and crashes against the crossbar!"
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:51",
            "label": "",
            "description": "Lyon keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 42:55",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Jordan Ferri (Lyon) is coming onto the pitch as Sergi Darder cannot continue after picking up an injury."
        },
        {
            "gameTime": "1 - 41:46",
            "label": "soccer-ball",
            "description": "Pablo Piatti looks around to decide who he is going to pass to. He picks out Sofiane Feghouli (Valencia), who collects the ball perfectly and unleashes a terrific shot that ricochets in off the crossbar. The score is 0:1."
        },
        {
            "gameTime": "1 - 41:21",
            "label": "",
            "description": "The ball is cleared after Alexandre Lacazette (Lyon) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 39:37",
            "label": "",
            "description": "CHANCE! Sofiane Feghouli (Valencia) fires just over the crossbar from inside the box after running onto a splendid pass from Joao Cancelo."
        },
        {
            "gameTime": "1 - 38:40",
            "label": "",
            "description": "Sergi Darder (Lyon) is able to continue to play."
        },
        {
            "gameTime": "1 - 37:30",
            "label": "injury",
            "description": "Sergi Darder (Lyon) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 37:09",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) smashes the ball towards goal from the edge of the penalty box, but it fails to bother the goalkeeper as it hits the defensive wall."
        },
        {
            "gameTime": "1 - 36:07",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 35:47",
            "label": "",
            "description": "Javi Fuego (Valencia) commits a rough challenge and Milorad Mazic blows his whistle for an infringement. Lyon earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 34:54",
            "label": "",
            "description": "Aymen Abdennour (Valencia) sees his header crash off the right post after meeting a corner kick inside the six yard box. The goalkeeper would have been helpless."
        },
        {
            "gameTime": "1 - 34:44",
            "label": "corner",
            "description": "Pablo Piatti (Valencia) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 34:18",
            "label": "",
            "description": "Pablo Piatti (Valencia) sends a cross into the box, but the opposition's defence quickly intercepts the ball. Good work from Valencia as they win a corner."
        },
        {
            "gameTime": "1 - 33:12",
            "label": "corner",
            "description": "Pablo Piatti (Valencia) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 32:56",
            "label": "",
            "description": "Joao Cancelo (Valencia) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Valencia force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 31:00",
            "label": "",
            "description": "Corentin Tolisso (Lyon) receives a quality pass and unleashes a rocket of a shot from distance, but his amazing effort goes just over the crossbar. The goalkeeper probably wouldn't have saved this one."
        },
        {
            "gameTime": "1 - 29:59",
            "label": "",
            "description": "Some patient build up play from Valencia as they look to unlock the defence."
        },
        {
            "gameTime": "1 - 27:41",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 27:31",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) whips a promising cross into the box, but the opposition's defence intercepts the ball. Lyon will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 27:13",
            "label": "corner",
            "description": "A quickly taken corner by Lyon."
        },
        {
            "gameTime": "1 - 26:49",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) takes a mid range free kick, but Jaume Domenech stops the ball from reaching the left side of the target by tipping it onto the post. Great save! The ball is out of play. A goal scoring opportunity from a corner for Lyon."
        },
        {
            "gameTime": "1 - 26:12",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) will take the free kick."
        },
        {
            "gameTime": "1 - 25:44",
            "label": "",
            "description": "Daniel Parejo (Valencia) commits an ugly tackle on his opponent, but there is no caution from the referee. Lyon win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 25:04",
            "label": "",
            "description": "Pablo Piatti (Valencia) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "1 - 24:34",
            "label": "",
            "description": "Christophe Jallet (Lyon) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 23:19",
            "label": "",
            "description": "Some great controlled play and passing from Valencia. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 21:36",
            "label": "",
            "description": "The free kick is taken by Mathieu Valbuena (Lyon), but ball is cleared."
        },
        {
            "gameTime": "1 - 20:19",
            "label": "",
            "description": "Lucas Orban (Valencia) trips an opposition player and Milorad Mazic signals a foul. Lyon have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 19:35",
            "label": "",
            "description": "Aldo Kalulu (Lyon) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 19:10",
            "label": "",
            "description": "Lyon are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. The referee and the linesman both signal a throw in for Valencia."
        },
        {
            "gameTime": "1 - 18:01",
            "label": "",
            "description": "Sofiane Feghouli (Valencia) fails to send a pass into the box as his effort is cut out. The ball has crossed the sideline. Valencia are taking a throw in."
        },
        {
            "gameTime": "1 - 17:03",
            "label": "",
            "description": "Well positioned Pablo Piatti (Valencia) was first to the rebound and fired in a shot low towards the middle of the goal, but Anthony Lopes reacted superbly to keep the ball out. The fans could not believe their eyes. It was a miraculous stop!"
        },
        {
            "gameTime": "1 - 15:56",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 15:10",
            "label": "",
            "description": "Jeremy Morel (Lyon) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 14:10",
            "label": "",
            "description": "Lucas Orban (Valencia) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 12:13",
            "label": "",
            "description": "A cross from a mid range free kick, taken by Lyon, is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 11:45",
            "label": "",
            "description": "The game is interrupted, a clear handball by Shkodran Mustafi (Valencia). Lyon win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 09:45",
            "label": "",
            "description": "Joao Cancelo (Valencia) skips past his man but can't keep the ball in play. The ball is off of the pitch and it's a goal kick for Lyon."
        },
        {
            "gameTime": "1 - 08:47",
            "label": "",
            "description": "Aymen Abdennour (Valencia) rises above the defence to meet the corner. His timing is good, but he arrows his header just a few inches wide of the right post. The ball goes out of play and Lyon will have a goal kick."
        },
        {
            "gameTime": "1 - 08:35",
            "label": "corner",
            "description": "Pablo Piatti (Valencia) will take a corner kick."
        },
        {
            "gameTime": "1 - 08:05",
            "label": "",
            "description": "Joao Cancelo (Valencia) floats the free kick into the box, but it's easily cleared by the first man. The linesman makes the right call and Valencia will have a corner."
        },
        {
            "gameTime": "1 - 07:15",
            "label": "",
            "description": "Christophe Jallet (Lyon) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Milorad Mazic with no other option than to blow for a foul. Valencia are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 07:15",
            "label": "",
            "description": "Milan Bisevac (Lyon) handles the ball and everyone in the stadium shouts 'handball'. Valencia earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "Jeremy Morel (Lyon) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 04:16",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "1 - 04:02",
            "label": "",
            "description": "Enzo Perez (Valencia) carelessly plunged himself under the feet of his opponent and couldn't expect to avoid punishment. This time, Milorad Mazic keeps the cards in his pocket, but he blows for the foul. A free kick to Lyon."
        },
        {
            "gameTime": "1 - 03:46",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) smashes the ball upfield and Maxime Gonalons brings it down with a fine first touch."
        },
        {
            "gameTime": "1 - 02:20",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 01:15",
            "label": "",
            "description": "Valencia exchange some short passes over a small area and control the game. Now they make a mistake and lose the ball and the whole situation changes completely."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Valencia will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Milorad Mazic will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Neither of the teams could take the initiative and dominate today's game. The home side attempted to hold onto the ball for as long as possible. The away team, on the other hand, played long ball football."
        }
    ],
    "gameAwayTeam": "Valencia",
    "gameDate": "29/09/2015 - 21:45",
    "gameHomeTeam": "Lyon",
    "gameScore": "0 - 1"
}