{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2016-12-20 - 22-00 Dortmund 1 - 1 FC Augsburg/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The home side were superior in this game. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        },
        {
            "gameTime": "2 - 48:11",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:42",
            "label": "",
            "description": "One of the players from FC Augsburg times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 47:25",
            "label": "corner",
            "description": "Jonathan Schmid (Augsburg) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "",
            "description": "Halil Altintop (Augsburg) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Roman Weidenfeller guesses his intention and denies him with a fine save. The referee and one of his assistants signal for a corner kick to FC Augsburg."
        },
        {
            "gameTime": "2 - 46:15",
            "label": "attendance",
            "description": "The attendance is 81360."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:08",
            "label": "substitution",
            "description": "Today's match ends for Dong Won Ji who will be replaced by Halil Altintop (Augsburg)."
        },
        {
            "gameTime": "2 - 42:41",
            "label": "",
            "description": "Andre Schurrle (Dortmund) is furious with himself as he misses a golden opportunity from inside the six yard box. He sends a rebound a few inches wide of the left post."
        },
        {
            "gameTime": "2 - 42:11",
            "label": "",
            "description": "Marwin Hitz pulls off a great save to deny Pierre Emerick Aubameyang (Dortmund) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "2 - 41:26",
            "label": "",
            "description": "Christian Pulisic (Dortmund) latches on to a pass on the edge of the box, but he can't get any power into the shot and fails to trouble Marwin Hitz."
        },
        {
            "gameTime": "2 - 41:10",
            "label": "",
            "description": "Christian Pulisic (Dortmund) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 37:38",
            "label": "",
            "description": "Matthias Ginter (Dortmund) tries to send a pass but it's blocked. The ball goes out of play. Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "2 - 36:28",
            "label": "",
            "description": "Andre Schurrle (Dortmund) attempts to curl the ball over the defensive wall from the free kick, but his effort fails to reach the goal."
        },
        {
            "gameTime": "2 - 35:59",
            "label": "",
            "description": "Guido Winkmann blows his whistle and signals a foul after Jeffrey Gouweleeuw (Augsburg) brought his opponent down. Dortmund have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 35:41",
            "label": "substitution",
            "description": "Here is a change. Ousmane Dembele is going off and Thomas Tuchel gives the last tactical orders to Andre Schurrle (Dortmund)."
        },
        {
            "gameTime": "2 - 35:13",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety."
        },
        {
            "gameTime": "2 - 34:50",
            "label": "",
            "description": "The Dortmund players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 32:33",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Dominik Kohr trots off the pitch and is replaced by Gojko Kacar (Augsburg)."
        },
        {
            "gameTime": "2 - 31:37",
            "label": "",
            "description": "Marwin Hitz doesn't have to worry about this one. Gonzalo Castro plays a pass into the feet of Pierre Emerick Aubameyang (Dortmund), who is unable to find the target as his effort from inside the box goes high over the bar."
        },
        {
            "gameTime": "2 - 30:34",
            "label": "corner",
            "description": "Mario Gotze (Dortmund) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 30:11",
            "label": "",
            "description": "Christian Pulisic (Dortmund) crosses the ball into the box, but one of the defending players averts the threat. Corner kick. Dortmund will have an opportunity."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "",
            "description": "Dominik Kohr (Augsburg) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 27:49",
            "label": "substitution",
            "description": "Manuel Baum has decided to make a change. Markus Feulner (Augsburg) replaces Jan Moravek."
        },
        {
            "gameTime": "2 - 27:40",
            "label": "injury",
            "description": "The game is interrupted now, Dominik Kohr (Augsburg) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 25:43",
            "label": "substitution",
            "description": "The game has come to an end for Shinji Kagawa. He has contributed as much as he could today. He will be replaced by the fresh legs of Gonzalo Castro (Dortmund)."
        },
        {
            "gameTime": "2 - 25:10",
            "label": "",
            "description": "Paul Verhaegh (Augsburg) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 23:16",
            "label": "y-card",
            "description": "Guido Winkmann shows a yellow card to Shinji Kagawa (Dortmund) for a tough tackle."
        },
        {
            "gameTime": "2 - 21:23",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 21:01",
            "label": "",
            "description": "Pierre Emerick Aubameyang plays a pass to Mikel Merino (Dortmund), but he fails to get a decent shot away from inside the box and the ball flies well wide of the right post."
        },
        {
            "gameTime": "2 - 19:56",
            "label": "injury",
            "description": "Ousmane Dembele (Dortmund) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 19:33",
            "label": "y-card",
            "description": "Konstantinos Stafylidis (Augsburg) is booked after bringing down an opponent. Guido Winkmann had an easy decision to make."
        },
        {
            "gameTime": "2 - 18:12",
            "label": "",
            "description": "The most active player in today's match is definitely Ousmane Dembele (Dortmund). He's trying to be on the ball as much as possible and you can literally see the enthusiasm in his play. He keeps exchanging some one touch passes and waits for the right moment to send a killer pass. What a player!"
        },
        {
            "gameTime": "2 - 17:54",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 15:50",
            "label": "funfact",
            "description": "The total number of attempts is 23:8."
        },
        {
            "gameTime": "2 - 15:16",
            "label": "",
            "description": "Jonathan Schmid (Augsburg) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 14:42",
            "label": "",
            "description": "The referee blows his whistle as Mikel Merino (Dortmund) was too aggressive in his challenge. A free kick is awarded to FC Augsburg."
        },
        {
            "gameTime": "2 - 13:11",
            "label": "",
            "description": "Half chance! Shinji Kagawa (Dortmund) plays a pass into the box, but Marwin Hitz reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 12:06",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) wasted an opportunity to score from the free kick from about 25 metres out. His attempt hit the defensive wall."
        },
        {
            "gameTime": "2 - 11:18",
            "label": "",
            "description": "Jeffrey Gouweleeuw (Augsburg) makes an overly aggressive challenge and Guido Winkmann blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 10:41",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "2 - 09:54",
            "label": "",
            "description": "Jan Moravek (Augsburg) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Guido Winkmann with no other option than to blow for a foul. Dortmund win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 09:30",
            "label": "",
            "description": "Dong Won Ji (Augsburg) picks up a long through ball, but Roman Weidenfeller deserves praise for a brilliant reaction and interception."
        },
        {
            "gameTime": "2 - 08:18",
            "label": "",
            "description": "Guido Winkmann blows his whistle after Jan Moravek (Augsburg) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "2 - 06:59",
            "label": "",
            "description": "What a chance that is! Matthias Ginter (Dortmund) displays good awareness near the penalty spot to get on the end of a cross from the free kick, but he steers his header narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 06:32",
            "label": "y-card",
            "description": "Daniel Baier (Augsburg) has tested the patience of referee Guido Winkmann and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 05:57",
            "label": "",
            "description": "Pierre Emerick Aubameyang almost found himself in a promising position after Ousmane Dembele (Dortmund) tried to send a defence splitting pass, but one of the defenders reacts well and makes a timely interception."
        },
        {
            "gameTime": "2 - 04:49",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) gets on the end of a pass and produces a promising first time shot at goal. His effort is blocked by Marwin Hitz with a brilliant diving save!"
        },
        {
            "gameTime": "2 - 03:41",
            "label": "",
            "description": "A brilliant individual effort! Dong Won Ji (Augsburg) tricks his way past challenges into the box and drags his shot narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 02:17",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) gives away a foul for a clumsy challenge. Referee Guido Winkmann saw the whole situation."
        },
        {
            "gameTime": "2 - 01:28",
            "label": "soccer-ball",
            "description": "Goal! Shinji Kagawa produces a great pass that finds Ousmane Dembele (Dortmund) inside the penalty area, who takes advantage of the situation to rifle a shot into the bottom left corner. 1:1."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Thomas Tuchel makes a half time substitution. Sven Bender (Dortmund) comes on in place of Marc Bartra."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Guido Winkmann starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Both sides have been very active in the first 45 minutes, providing the fans with an exciting show. Even first half from both sides, and they've both had chances. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 45:06",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 43:41",
            "label": "corner",
            "description": "The resulting corner from Shinji Kagawa (Dortmund) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 43:11",
            "label": "",
            "description": "Christian Pulisic (Dortmund) fires the ball at goal from inside the area, but it's well blocked. Dortmund win a corner."
        },
        {
            "gameTime": "1 - 42:52",
            "label": "",
            "description": "Christian Pulisic (Dortmund) attempts to find Pierre Emerick Aubameyang, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "",
            "description": "Marcel Schmelzer clips a neat ball into the box towards Pierre Emerick Aubameyang (Dortmund), whose header from the centre of the box goes a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 37:32",
            "label": "",
            "description": "Chance! Pierre Emerick Aubameyang (Dortmund) gets to the rebound on the edge of the box and smashes the ball towards the bottom left corner, but Marwin Hitz is alert and makes a great save to deny him."
        },
        {
            "gameTime": "1 - 37:12",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 37:03",
            "label": "",
            "description": "Matthias Ginter (Dortmund) fails to find any of his teammates inside the box as his pass is blocked. Dortmund have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 35:20",
            "label": "",
            "description": "Georg Teigl (Augsburg) meets a cross inside the box, but Roman Weidenfeller wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "1 - 32:53",
            "label": "soccer-ball",
            "description": "Goal! Dong Won Ji (Augsburg) fires the rebound into the roof of the net after the ball breaks to him in the box. The score is 0:1."
        },
        {
            "gameTime": "1 - 32:50",
            "label": "",
            "description": "Dong Won Ji (Augsburg) produces a ferocious strike from the edge of the box. His dangerous effort towards the middle of the goal is blocked by Roman Weidenfeller, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 31:46",
            "label": "",
            "description": "Jan Moravek (Augsburg) brings an opponent down and Guido Winkmann interrupts the game."
        },
        {
            "gameTime": "1 - 30:51",
            "label": "",
            "description": "Georg Teigl (Augsburg) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 29:17",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) fires a strong shot to the middle of the goal and the save is unexpectedly difficult for Marwin Hitz."
        },
        {
            "gameTime": "1 - 28:48",
            "label": "",
            "description": "Mario Gotze (Dortmund) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 27:19",
            "label": "",
            "description": "Mikel Merino (Dortmund) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box well wide of the left post."
        },
        {
            "gameTime": "1 - 26:59",
            "label": "corner",
            "description": "The corner kick from Ousmane Dembele (Dortmund) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 26:15",
            "label": "",
            "description": "Matthias Ginter (Dortmund) finds himself some space around the penalty spot and leaps high to meet the free kick. He tries to put his header into the right side of the goal, but Marwin Hitz keeps it out. Dortmund get a corner."
        },
        {
            "gameTime": "1 - 25:29",
            "label": "",
            "description": "Jan Moravek (Augsburg) knocks his opponent down with an over the top tackle."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "",
            "description": "Mario Gotze (Dortmund) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 23:21",
            "label": "",
            "description": "Dong Won Ji (Augsburg) is picked out by one of his teammates with a great cross, but his poor control allows the defence to clear and avert the threat."
        },
        {
            "gameTime": "1 - 20:51",
            "label": "",
            "description": "Guido Winkmann blows for a foul after Dong Won Ji (Augsburg) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 18:52",
            "label": "",
            "description": "Georg Teigl (Augsburg) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "1 - 18:08",
            "label": "",
            "description": "What a goal scoring opportunity! Jan Moravek (Augsburg) makes a good run into the box to meet a cross and fires the ball in on goal, but the shot is amazingly blocked by a defender."
        },
        {
            "gameTime": "1 - 17:50",
            "label": "",
            "description": "The linesman raises his flag as one of the players from FC Augsburg was in an offside position."
        },
        {
            "gameTime": "1 - 17:32",
            "label": "",
            "description": "Jonathan Schmid (Augsburg) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "1 - 16:54",
            "label": "",
            "description": "Matthias Ginter (Dortmund) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play. That's a free kick to FC Augsburg."
        },
        {
            "gameTime": "1 - 15:08",
            "label": "",
            "description": "Martin Hinteregger (Augsburg) reacts well and displays good awareness near the penalty spot to get on the end of a cross from the free kick. He jumps high and produces a header which goes well over the crossbar."
        },
        {
            "gameTime": "1 - 14:37",
            "label": "",
            "description": "Christian Pulisic (Dortmund) brings his opponent down. Guido Winkmann has a clear sight of it and blows his whistle for a foul. FC Augsburg are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 13:56",
            "label": "",
            "description": "Marc Bartra (Dortmund) makes a rough challenge and Guido Winkmann blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 13:02",
            "label": "",
            "description": "Dominik Kohr (Augsburg) brings down his opponent with a very late tackle."
        },
        {
            "gameTime": "1 - 11:30",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) sets the ball for the free kick from 25 metres out. His attempt is aimed towards the left side of the goal, but Marwin Hitz is alert and makes a comfortable save."
        },
        {
            "gameTime": "1 - 10:48",
            "label": "",
            "description": "Jeffrey Gouweleeuw (Augsburg) fouls an opponent. At least that's what referee Guido Winkmann signals. Dortmund are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 09:01",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 08:11",
            "label": "",
            "description": "Mario Gotze (Dortmund) fires in a shot from the edge of the box which deflects off one of the defending players and hits the left post! Dortmund will take a corner kick."
        },
        {
            "gameTime": "1 - 06:05",
            "label": "",
            "description": "Georg Teigl (Augsburg) finds himself behind the opposition's defence, but the game is stopped for offside."
        },
        {
            "gameTime": "1 - 04:21",
            "label": "corner",
            "description": "The corner from Jonathan Schmid (Augsburg) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 03:46",
            "label": "",
            "description": "Dong Won Ji (Augsburg) has a shot blocked from inside the box. The referee points to the corner flag. It's a corner to FC Augsburg."
        },
        {
            "gameTime": "1 - 03:32",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort."
        },
        {
            "gameTime": "1 - 02:36",
            "label": "",
            "description": "Dortmund showcase their great team work by exchanging one two passes, but one wayward pass sees them lose possession. The ball goes out of play and FC Augsburg will have a goal kick."
        },
        {
            "gameTime": "1 - 01:29",
            "label": "",
            "description": "Dominik Kohr (Augsburg) is penalised for holding. Guido Winkmann signals a set piece."
        },
        {
            "gameTime": "1 - 00:51",
            "label": "",
            "description": "Mikel Merino (Dortmund) commits a foul after bringing down his opponent with a slide tackle."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Dortmund will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Guido Winkmann was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "3 That's how many FC Augsburg matches finished with a 0:0 score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ousmane Dembele from Dortmund is in good form this season, he's assisted in a goal 7 times."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang have rippled the net 16x and is the top scorer for Dortmund this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The home side were superior in this game. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        }
    ],
    "gameAwayTeam": "FC Augsburg",
    "gameDate": "20/12/2016 - 22:00",
    "gameHomeTeam": "Dortmund",
    "gameScore": "1 - 1"
}