{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-03 - 18-00 FC Astana 0 - 0 Atl. Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. It was an even match on the whole, with both sides enjoying spells in the ascendancy. Long balls and crosses were the main weapons of the home team, while the away team played possession football."
        },
        {
            "gameTime": "2 - 48:17",
            "label": "whistle",
            "description": "Anthony Taylor is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 48:01",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) makes contact with a cross but fails to connect perfectly. His low drive heads straight towards the middle of the goal where the goalkeeper makes a decent save to deny him."
        },
        {
            "gameTime": "2 - 47:22",
            "label": "",
            "description": "Georgiy Zhukov (FC Astana) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 45:26",
            "label": "",
            "description": "Jose Maria Gimenez (Atl. Madrid) makes a slide tackle, but referee Anthony Taylor blows for a foul. That's a free kick to FC Astana."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:10",
            "label": "substitution",
            "description": "Substitution. Abzal Beysebekov (FC Astana) receives a signal from the referee and is now allowed to enter the pitch as walks off."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "corner",
            "description": "The corner from Gabi (Atl. Madrid) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 42:57",
            "label": "",
            "description": "A cross into the box from Antoine Griezmann (Atl. Madrid) is cleared. The ball is out of play and Atl. Madrid manage to earn a corner."
        },
        {
            "gameTime": "2 - 42:25",
            "label": "",
            "description": "Anthony Taylor blows his whistle for a foul after Roger Canas (FC Astana) hacks down one of his opponents. There is a free kick near the sideline to Atl. Madrid."
        },
        {
            "gameTime": "2 - 40:27",
            "label": "",
            "description": "dribbles into space and finds himself in a shooting position, but his shot from the edge of the box is bravely blocked."
        },
        {
            "gameTime": "2 - 39:09",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 38:52",
            "label": "y-card",
            "description": "Anthony Taylor shows a yellow card to Georgiy Zhukov (FC Astana) for a tough tackle."
        },
        {
            "gameTime": "2 - 37:11",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) jumps for a header from the resulting set piece, but it goes way wide of the right post. The ball goes out of play and FC Astana will have a goal kick."
        },
        {
            "gameTime": "2 - 36:52",
            "label": "corner",
            "description": "Yannick Carrasco (Atl. Madrid) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 36:42",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) sends a cross into the box, but the opposition's defence clears the ball to safety. The referee blows his whistle, Atl. Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 36:10",
            "label": "substitution",
            "description": "The substitution is prepared. Oliver Torres (Atl. Madrid) joins the action as a substitute, replacing Koke."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "substitution",
            "description": "Stanimir Stoilov has decided to substitute Junior Kabananga and he is replaced by Aleksey Shchetkin (FC Astana)."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "2 - 32:04",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Georgiy Zhukov (FC Astana) for Serikzan Muzhikov."
        },
        {
            "gameTime": "2 - 31:22",
            "label": "",
            "description": "Jose Maria Gimenez (Atl. Madrid) arrives first to a high rebound and directs a header low towards the middle of the target. The goalkeeper is alert and comfortably denies him."
        },
        {
            "gameTime": "2 - 31:11",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 30:53",
            "label": "",
            "description": "Juanfran (Atl. Madrid) wastes a good opportunity as his pass into the box is blocked by the defence. Atl. Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 30:14",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 29:27",
            "label": "",
            "description": "Jan Oblak displays his ability to read the game and clears the danger after Foxi Kethevoama (FC Astana) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "2 - 28:54",
            "label": "",
            "description": "CHANCE! Antoine Griezmann (Atl. Madrid) fires just wide of the right post from inside the box after running onto a splendid pass from Koke."
        },
        {
            "gameTime": "2 - 27:50",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Saul Niguez walks off the pitch to be replaced by Yannick Carrasco (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 26:32",
            "label": "",
            "description": "Dmitri Shomko (FC Astana) sends a long ball in, but Jan Oblak comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 25:13",
            "label": "",
            "description": "Foxi Kethevoama (FC Astana) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 24:09",
            "label": "",
            "description": "Dmitri Shomko (FC Astana) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 22:36",
            "label": "",
            "description": "Roger Canas (FC Astana) gets the ball from a rebound and shoots from long range, but sends the ball miles wide of the right post. The goalkeeper doesn't have to worry about this one. Very poor attempt."
        },
        {
            "gameTime": "2 - 21:02",
            "label": "",
            "description": "Saul Niguez (Atl. Madrid) jumps for a header from a cross on the edge of the box and produces a decent effort towards the underside of the crossbar, but the goalkeeper manages to block the attempt."
        },
        {
            "gameTime": "2 - 20:34",
            "label": "",
            "description": "Roger Canas (FC Astana) trips an opposition player and Anthony Taylor signals a foul. A free kick to Atl. Madrid."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "",
            "description": "looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 18:19",
            "label": "substitution",
            "description": "It will be a substitution. Jackson Martinez (Atl. Madrid) is ready to enter the pitch as Fernando Torres walks off."
        },
        {
            "gameTime": "2 - 16:03",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) is penalised for a foul. Anthony Taylor had a clear view and blows his whistle. It's a free kick to FC Astana, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 16:00",
            "label": "funfact",
            "description": "The total number of attempts is 9:14. The shots on goal statistics – 3:3."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "",
            "description": "Tiago (Atl. Madrid) receives a pass and decides to smash the ball from long range. His poor effort sails well wide of the left post. The ball goes out of play and FC Astana will have a goal kick."
        },
        {
            "gameTime": "2 - 14:31",
            "label": "y-card",
            "description": "can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Anthony Taylor didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 13:35",
            "label": "",
            "description": "That's a well played offside trap. Guilherme Siqueira (Atl. Madrid) is flagged for offside, ending the attack."
        },
        {
            "gameTime": "2 - 13:13",
            "label": "",
            "description": "Marin Anicic (FC Astana) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 12:08",
            "label": "",
            "description": "Junior Kabananga (FC Astana) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 10:50",
            "label": "injury",
            "description": "Marin Anicic (FC Astana) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 10:18",
            "label": "",
            "description": "Diego Godin (Atl. Madrid) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "2 - 10:08",
            "label": "corner",
            "description": "Koke (Atl. Madrid) will take the corner."
        },
        {
            "gameTime": "2 - 09:45",
            "label": "",
            "description": "Juanfran (Atl. Madrid) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. The referee and one of his assistants signal for a corner kick to Atl. Madrid."
        },
        {
            "gameTime": "2 - 08:43",
            "label": "",
            "description": "Dmitri Shomko (FC Astana) blazes a shot from a long range free kick and the ball ends somewhere in row Z."
        },
        {
            "gameTime": "2 - 07:44",
            "label": "",
            "description": "Jose Maria Gimenez (Atl. Madrid) makes an overly aggressive challenge and Anthony Taylor blows his whistle for a foul. FC Astana will take a free kick."
        },
        {
            "gameTime": "2 - 06:04",
            "label": "",
            "description": "Branko Ilic (FC Astana) sends the ball into the penalty area from a throw in as if it's a corner kick."
        },
        {
            "gameTime": "2 - 05:34",
            "label": "",
            "description": "Junior Kabananga (FC Astana) looks to break free, but an opposing player clears the ball away. It's a throw in for FC Astana."
        },
        {
            "gameTime": "2 - 04:05",
            "label": "",
            "description": "Junior Kabananga (FC Astana) is picked out by one of his teammates with a brilliant long range cross, but he doesn't control the ball well and the defence eliminates the danger without any problem."
        },
        {
            "gameTime": "2 - 03:16",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play. Atl. Madrid will take a throw in."
        },
        {
            "gameTime": "2 - 02:12",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) brings an opponent down and Anthony Taylor interrupts the game. A free kick has been awarded to FC Astana."
        },
        {
            "gameTime": "2 - 01:53",
            "label": "",
            "description": "Dmitri Shomko (FC Astana) takes the ball on and fires in a low shot from 33 metres. Jan Oblak stops the effort which is headed to the middle of the target."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We can hope that the managers will be able to motivate the players and stir them to improve their performance for after the half time break. We haven't seen really exciting football in the previous 45 minutes. Neither side is enjoying any significant control of the game. The home side are attempting to create scoring opportunities mainly with long balls, while the away team are trying to prevail using combination football."
        },
        {
            "gameTime": "1 - 45:07",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:49",
            "label": "",
            "description": "Koke (Atl. Madrid) takes a mid range free kick and his stunning strike crashes against the crossbar."
        },
        {
            "gameTime": "1 - 43:38",
            "label": "y-card",
            "description": "The foul by Evgeni Postnikov (FC Astana) is worthy of a card and a yellow is duly shown by Anthony Taylor. Atl. Madrid have a free kick."
        },
        {
            "gameTime": "1 - 42:29",
            "label": "",
            "description": "Anthony Taylor blows for a foul after Marin Anicic (FC Astana) was too aggressive in the battle for the ball. Atl. Madrid are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 41:52",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 39:52",
            "label": "",
            "description": "Foxi Kethevoama (FC Astana) unleashes a shot from 35 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 38:39",
            "label": "",
            "description": "The game is interrupted as Guilherme Siqueira (Atl. Madrid) is flagged offside."
        },
        {
            "gameTime": "1 - 36:49",
            "label": "",
            "description": "Junior Kabananga (FC Astana) has an effort from the edge of the area, but he skies the ball over the top. The ball is off of the pitch and it's a goal kick for Atl. Madrid."
        },
        {
            "gameTime": "1 - 34:01",
            "label": "corner",
            "description": "Foxi Kethevoama (FC Astana) sends in a poor cross from the corner and Jan Oblak has no trouble gathering it."
        },
        {
            "gameTime": "1 - 33:28",
            "label": "",
            "description": "Junior Kabananga (FC Astana) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. Good work from FC Astana as they win a corner."
        },
        {
            "gameTime": "1 - 31:48",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) gets on the end of a cross from Juanfran, but his shot goes a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 31:22",
            "label": "",
            "description": "Foxi Kethevoama (FC Astana) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "1 - 29:42",
            "label": "",
            "description": "Atl. Madrid are seeing far more of the ball now."
        },
        {
            "gameTime": "1 - 27:43",
            "label": "",
            "description": "Foxi Kethevoama (FC Astana) controls a nice lofted pass and shoots from the edge of the box, but his attempt only went low to the middle of the goal, so Jan Oblak stops it easily."
        },
        {
            "gameTime": "1 - 27:06",
            "label": "",
            "description": "Marin Anicic (FC Astana) probably handled the ball. A free kick has been awarded to Atl. Madrid."
        },
        {
            "gameTime": "1 - 26:35",
            "label": "corner",
            "description": "Foxi Kethevoama (FC Astana) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 26:13",
            "label": "",
            "description": "Serikzan Muzhikov (FC Astana) races towards goal but the defender gets back well to make a challenge. The ball goes out of play. FC Astana are awarded a corner kick."
        },
        {
            "gameTime": "1 - 24:54",
            "label": "",
            "description": "Saul Niguez (Atl. Madrid) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "1 - 22:01",
            "label": "",
            "description": "Evgeni Postnikov (FC Astana) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "1 - 21:23",
            "label": "corner",
            "description": "Foxi Kethevoama (FC Astana) takes the corner."
        },
        {
            "gameTime": "1 - 21:04",
            "label": "",
            "description": "Junior Kabananga (FC Astana) slaloms his way past challenges, but an opposing player does well to get the ball away. FC Astana win a corner."
        },
        {
            "gameTime": "1 - 20:31",
            "label": "",
            "description": "Evgeni Postnikov (FC Astana) rises high to meet a perfect corner kick and sends in a long range header from the edge of the box. The effort goes straight at the goalkeeper's gloves, causing him little trouble."
        },
        {
            "gameTime": "1 - 19:53",
            "label": "corner",
            "description": "The referee awards a corner and Foxi Kethevoama (FC Astana) goes over to take it."
        },
        {
            "gameTime": "1 - 19:28",
            "label": "",
            "description": "Junior Kabananga (FC Astana) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety. FC Astana force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 19:14",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort."
        },
        {
            "gameTime": "1 - 18:38",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Juanfran (Atl. Madrid). The ball is out of play. Atl. Madrid will have a throw in."
        },
        {
            "gameTime": "1 - 17:25",
            "label": "",
            "description": "A long pass, executed by Foxi Kethevoama (FC Astana), missed the precision to reach his teammates. The ball is behind the touchline and Atl. Madrid will take a throw in."
        },
        {
            "gameTime": "1 - 16:22",
            "label": "",
            "description": "Saul Niguez (Atl. Madrid) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "1 - 16:01",
            "label": "corner",
            "description": "Koke (Atl. Madrid) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 15:33",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) connects with a pass but sees his shot from the edge of the box blocked. Atl. Madrid earn a corner."
        },
        {
            "gameTime": "1 - 14:38",
            "label": "",
            "description": "Koke (Atl. Madrid) sends a long ball in, but Nenad Eric comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 12:54",
            "label": "",
            "description": "The foul by Fernando Torres (Atl. Madrid) was seen by Anthony Taylor who didn't hesitate to blow the whistle. Free kick. FC Astana will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 11:01",
            "label": "",
            "description": "A rebound falls at the feet of Juanfran (Atl. Madrid) who unleashes a shot from long range towards the goal. However, his effort is poor and it flies high over the crossbar."
        },
        {
            "gameTime": "1 - 10:42",
            "label": "",
            "description": "Tiago (Atl. Madrid) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "1 - 10:24",
            "label": "corner",
            "description": "Koke (Atl. Madrid) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 10:06",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) delivers a low pass into the box which is intercepted. The ball goes out of play. Atl. Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 09:33",
            "label": "",
            "description": "Gabi (Atl. Madrid) receives the ball from the set piece on the edge of the box, but fails to score because his shot is blocked."
        },
        {
            "gameTime": "1 - 08:56",
            "label": "",
            "description": "Koke (Atl. Madrid) takes a short free kick."
        },
        {
            "gameTime": "1 - 08:30",
            "label": "",
            "description": "Serikzan Muzhikov (FC Astana) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul. A free kick is awarded to Atl. Madrid."
        },
        {
            "gameTime": "1 - 07:55",
            "label": "",
            "description": "The free kick is delivered by Gabi (Atl. Madrid) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "1 - 07:47",
            "label": "",
            "description": "Foxi Kethevoama (FC Astana) commits a foul after unfairly battling his opponent for the ball. Atl. Madrid have been awarded a free kick."
        },
        {
            "gameTime": "1 - 06:35",
            "label": "",
            "description": "Dmitri Shomko (FC Astana) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Jan Oblak."
        },
        {
            "gameTime": "1 - 05:47",
            "label": "",
            "description": "Foxi Kethevoama (FC Astana) takes a direct free kick."
        },
        {
            "gameTime": "1 - 05:21",
            "label": "",
            "description": "Guilherme Siqueira (Atl. Madrid) brings down his opponent with a very late tackle. FC Astana win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 04:55",
            "label": "",
            "description": "Dmitri Shomko (FC Astana) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession. The ball has crossed the sideline. FC Astana are taking a throw in."
        },
        {
            "gameTime": "1 - 03:33",
            "label": "corner",
            "description": "Gabi (Atl. Madrid) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "1 - 02:52",
            "label": "",
            "description": "The ball is cleared after Saul Niguez (Atl. Madrid) attempted to dribble past an opposing player. Atl. Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 01:01",
            "label": "",
            "description": "Dmitri Shomko (FC Astana) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. Atl. Madrid win a free kick."
        },
        {
            "gameTime": "1 - 00:22",
            "label": "",
            "description": "FC Astana will kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to a rather ordinary game without many stirring moments. There is definitely room for improvement in future games. It was an even match on the whole, with both sides enjoying spells in the ascendancy. Long balls and crosses were the main weapons of the home team, while the away team played possession football."
        }
    ],
    "gameAwayTeam": "Atl. Madrid",
    "gameDate": "03/11/2015 - 18:00",
    "gameHomeTeam": "FC Astana",
    "gameScore": "0 - 0"
}