{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-02-21 - 18-00 Malaga 1 - 1 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. There wasn't any significant dominance by either side in this game. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 49:09",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 48:21",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 48:08",
            "label": "",
            "description": "An attempted cross from Lucas (Real Madrid) is cleared."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "",
            "description": "James Rodriguez (Real Madrid) attempts a volley low towards the middle of the target, but it's saved by the keeper."
        },
        {
            "gameTime": "2 - 46:29",
            "label": "",
            "description": "Duda (Malaga) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 46:12",
            "label": "",
            "description": "Marcelo (Real Madrid) brings his opponent down. Ignacio Iglesias Villanueva has a clear sight of it and blows his whistle for a foul. A free kick has been awarded to Malaga."
        },
        {
            "gameTime": "2 - 45:26",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a teasing cross into the area, but Idriss Carlos Kameni intercepts the ball."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:22",
            "label": "y-card",
            "description": "Idriss Carlos Kameni (Malaga) is shown a yellow card by the referee."
        },
        {
            "gameTime": "2 - 43:59",
            "label": "substitution",
            "description": "Juanpi comes off the pitch to be replaced by Duda (Malaga)."
        },
        {
            "gameTime": "2 - 43:08",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 42:09",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 41:47",
            "label": "",
            "description": "James Rodriguez (Real Madrid) serves up a nice cross, but the defence clears the danger. Now Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 41:20",
            "label": "",
            "description": "Weligton (Malaga) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 39:56",
            "label": "injury",
            "description": "Weligton (Malaga) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 38:46",
            "label": "",
            "description": "Roque Santa Cruz (Malaga) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "2 - 38:02",
            "label": "",
            "description": "Juanpi (Malaga) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 36:28",
            "label": "injury",
            "description": "Juanpi (Malaga) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 35:54",
            "label": "substitution",
            "description": "Substitution. Roque Santa Cruz (Malaga) receives a signal from the referee and is now allowed to enter the pitch as Duje Cop walks off."
        },
        {
            "gameTime": "2 - 35:08",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 34:02",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a precise pass inside the box and takes a shot that flies just wide of the right post."
        },
        {
            "gameTime": "2 - 32:40",
            "label": "",
            "description": "Marcelo (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 32:09",
            "label": "",
            "description": "Weligton (Malaga) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him."
        },
        {
            "gameTime": "2 - 31:04",
            "label": "corner",
            "description": "Recio (Malaga) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 30:34",
            "label": "corner",
            "description": "Juanpi (Malaga) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear. Malaga get a corner."
        },
        {
            "gameTime": "2 - 30:16",
            "label": "",
            "description": "That was a brilliant piece of goalkeeping! Keylor Navas dived superbly to block a header by Charles (Malaga) from around the penalty spot. His effort was directed straight towards the roof of the net, but Keylor Navas pulled off a remarkable save! Malaga earn a corner."
        },
        {
            "gameTime": "2 - 29:27",
            "label": "substitution",
            "description": "Substitution. James Rodriguez (Real Madrid) has come on for Isco."
        },
        {
            "gameTime": "2 - 26:59",
            "label": "",
            "description": "Marcelo (Real Madrid) sends in a pass which fails to reach any of his teammates. The ball goes out of play and Malaga will have a goal kick."
        },
        {
            "gameTime": "2 - 25:20",
            "label": "y-card",
            "description": "Ignacio Iglesias Villanueva shows a yellow card to Luka Modric (Real Madrid), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 24:30",
            "label": "",
            "description": "Isco (Real Madrid) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "2 - 24:06",
            "label": "",
            "description": "A cross into the box from Juanpi (Malaga) is cleared."
        },
        {
            "gameTime": "2 - 23:26",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "2 - 20:58",
            "label": "soccer-ball",
            "description": "It's a goal! Weligton plays a lovely pass into the box and finds Raul Albentosa (Malaga). He tries his luck from close range and coolly strikes the ball into the back of the net. 1:1."
        },
        {
            "gameTime": "2 - 20:32",
            "label": "corner",
            "description": "The resulting corner from Recio (Malaga) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 20:08",
            "label": "",
            "description": "Pablo Fornals (Malaga) creates himself some space on the edge of the box and unleashes a strong shot which is blocked by a defender. The ball goes out of play. Malaga are awarded a corner kick."
        },
        {
            "gameTime": "2 - 19:16",
            "label": "",
            "description": "Marcelo (Real Madrid) makes a run beyond the last defender, but he's offside."
        },
        {
            "gameTime": "2 - 18:59",
            "label": "",
            "description": "Marcelo (Real Madrid) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "2 - 18:45",
            "label": "",
            "description": "Isco (Real Madrid) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "substitution",
            "description": "Javier Gracia Carlos has decided to make a change. Pablo Fornals (Malaga) replaces Ricardo Horta."
        },
        {
            "gameTime": "2 - 17:31",
            "label": "",
            "description": "A precise cross towards the penalty spot was latched onto by Isco (Real Madrid). He outjumped the defence and produced a decent header which went a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 17:13",
            "label": "",
            "description": "Roberto Rosales (Malaga) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the roof of the net, but Keylor Navas is alert and denies him with a nice save."
        },
        {
            "gameTime": "2 - 15:20",
            "label": "substitution",
            "description": "Here's the change. Jese leaves the pitch and Lucas (Real Madrid) comes on as a substitute."
        },
        {
            "gameTime": "2 - 14:27",
            "label": "",
            "description": "Isco (Real Madrid) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 13:49",
            "label": "",
            "description": "Duje Cop (Malaga) strikes the rebound, but it goes well over the bar."
        },
        {
            "gameTime": "2 - 13:45",
            "label": "",
            "description": "Juanpi (Malaga) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 13:14",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is caught offside!"
        },
        {
            "gameTime": "2 - 12:36",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Toni Kroos (Real Madrid), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 12:18",
            "label": "",
            "description": "Jese (Real Madrid) fails to send a pass into the box as his effort is cut out. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:13",
            "label": "attendance",
            "description": "The attendance is 30372."
        },
        {
            "gameTime": "2 - 10:30",
            "label": "",
            "description": "Idriss Carlos Kameni hears the fans clapping his superb goalkeeping. Cristiano Ronaldo (Real Madrid) shoots from the edge of the box towards the right side of the goal, but the goalkeeper makes a magnificent save."
        },
        {
            "gameTime": "2 - 09:50",
            "label": "y-card",
            "description": "Ignacio Camacho (Malaga) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "",
            "description": "The free kick is taken by Juanpi (Malaga), but ball is cleared."
        },
        {
            "gameTime": "2 - 07:52",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) commits a rough challenge and Ignacio Iglesias Villanueva blows his whistle for an infringement. Malaga earn a free kick."
        },
        {
            "gameTime": "2 - 05:49",
            "label": "corner",
            "description": "Recio (Malaga) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 05:37",
            "label": "",
            "description": "Ricardo Horta (Malaga) produces a good strike towards the roof of the net, but the goalkeeper shows great reflexes and dives to keep the effort from hitting the net. The ball goes behind for a corner. Malaga will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 03:58",
            "label": "",
            "description": "Jese (Real Madrid) gets on the ball and beats an opponent, but his run is stopped by the referee Ignacio Iglesias Villanueva who sees an offensive foul."
        },
        {
            "gameTime": "2 - 02:41",
            "label": "",
            "description": "Miguel Torres (Malaga) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "2 - 02:19",
            "label": "",
            "description": "Juanpi (Malaga) is picked out by one of his teammates with a brilliant long range cross, but he doesn't control the ball well and the defence eliminates the danger without any problem."
        },
        {
            "gameTime": "2 - 00:26",
            "label": "",
            "description": "A pass into the penalty area from Jese (Real Madrid) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Ignacio Iglesias Villanueva blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "",
            "description": "Both sides have been very active in the first half, providing the fans with an exciting show. Even first half from both sides, and they've both had chances. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 44:58",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:34",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 43:12",
            "label": "",
            "description": "Juanpi (Malaga) is adjudged offside."
        },
        {
            "gameTime": "1 - 43:01",
            "label": "",
            "description": "Toni Kroos (Real Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "1 - 42:52",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 42:21",
            "label": "",
            "description": "Jese (Real Madrid) looks to break free, but an opposing player clears the ball away. Real Madrid have a corner."
        },
        {
            "gameTime": "1 - 40:32",
            "label": "y-card",
            "description": "Charles (Malaga) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "1 - 40:01",
            "label": "corner",
            "description": "Recio (Malaga) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 39:46",
            "label": "",
            "description": "Keylor Navas was forced into action to thwart Juanpi (Malaga). He found himself some space after latching on to a pass and unleashed a shot to the bottom left corner but couldn't beat the keeper. The ball goes out for a corner. Malaga can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 37:14",
            "label": "",
            "description": "A cross from Ricardo Horta (Malaga) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 35:29",
            "label": "penalty-missed",
            "description": "Cristiano Ronaldo (Real Madrid) sends the penalty to the bottom right corner, but Idriss Carlos Kameni pulls off a wonderful save to deny him."
        },
        {
            "gameTime": "1 - 35:22",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 34:48",
            "label": "y-card",
            "description": "Weligton (Malaga) is booked after bringing down an opponent. Ignacio Iglesias Villanueva had an easy decision to make."
        },
        {
            "gameTime": "1 - 34:15",
            "label": "penalty",
            "description": "Ignacio Iglesias Villanueva blows the whistle, Weligton (Malaga) is penalised for a foul. The referee gives a penalty kick to Real Madrid!"
        },
        {
            "gameTime": "1 - 33:42",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 32:43",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) outjumps the defence in the centre of the box and connects with the free kick from Toni Kroos. He sends the ball inside the left post with his towering header and alters the score to 0:0."
        },
        {
            "gameTime": "1 - 32:27",
            "label": "",
            "description": "Toni Kroos (Real Madrid) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 31:47",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Ricardo Horta (Malaga). Ignacio Iglesias Villanueva saw the sliding tackle and blows for a foul. Real Madrid will take a free kick."
        },
        {
            "gameTime": "1 - 30:25",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 30:01",
            "label": "injury",
            "description": "The game is interrupted now, Cristiano Ronaldo (Real Madrid) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 29:47",
            "label": "",
            "description": "Marcelo (Real Madrid) tries his luck with a shot from long distance after receiving a good pass. His poorly placed effort flies miles wide of the right post."
        },
        {
            "gameTime": "1 - 27:05",
            "label": "",
            "description": "Miguel Torres (Malaga) sends a cross into the box, but Keylor Navas comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 26:07",
            "label": "",
            "description": "Roberto Rosales (Malaga) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 25:44",
            "label": "",
            "description": "Ignacio Iglesias Villanueva blows his whistle and signals a foul after Nacho (Real Madrid) brought his opponent down. Malaga are awarded a free kick."
        },
        {
            "gameTime": "1 - 23:55",
            "label": "y-card",
            "description": "Marcelo (Real Madrid) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "1 - 23:54",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 23:10",
            "label": "",
            "description": "Idriss Carlos Kameni pulls off a great save to deny Jese (Real Madrid) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal. The ball is out of play. Real Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 20:50",
            "label": "",
            "description": "Golden chance! Ricardo Horta (Malaga) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the left post."
        },
        {
            "gameTime": "1 - 20:20",
            "label": "",
            "description": "Luka Modric (Real Madrid) was trying to get to the ball but clattered into the legs of the opponent as well. Ignacio Iglesias Villanueva blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 19:14",
            "label": "",
            "description": "Juanpi (Malaga) runs with the ball towards the keeper and pulls the trigger from close range, but Keylor Navas anticipates his intention and makes an amazing save to stop the shot going low into the middle of the target."
        },
        {
            "gameTime": "1 - 17:38",
            "label": "",
            "description": "Isco (Real Madrid) makes some space to meet a perfect cross inside the box, but he blazes his shot over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "1 - 17:24",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 17:06",
            "label": "",
            "description": "Jese (Real Madrid) receives a precise low pass inside the box, controls the ball and drills it towards the right post. Unfortunately for him, Idriss Carlos Kameni makes a great save to stop his effort. The ball is out of play. A goal scoring opportunity from a corner for Real Madrid."
        },
        {
            "gameTime": "1 - 15:43",
            "label": "",
            "description": "Ricardo Horta (Malaga) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 14:55",
            "label": "",
            "description": "A pass by Isco (Real Madrid) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 14:06",
            "label": "",
            "description": "The linesman raises his flag for offside before Charles (Malaga) heads on."
        },
        {
            "gameTime": "1 - 13:25",
            "label": "",
            "description": "Duje Cop (Malaga) unleashes a shot from 20 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 12:41",
            "label": "",
            "description": "Isco (Real Madrid) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Ignacio Iglesias Villanueva blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 09:03",
            "label": "",
            "description": "Jese (Real Madrid) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 08:03",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) outjumps the defence to meet the resulting corner and heads the ball towards the left side of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "1 - 07:39",
            "label": "corner",
            "description": "There's an opportunity for Toni Kroos (Real Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 07:16",
            "label": "",
            "description": "Isco (Real Madrid) sends a cross into the box, but the opposition's defence clears the ball to safety. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 07:02",
            "label": "",
            "description": "Ignacio Iglesias Villanueva blows his whistle and it's Juanpi (Malaga) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 06:40",
            "label": "corner",
            "description": "Recio (Malaga) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 05:45",
            "label": "",
            "description": "Charles (Malaga) tries to slide the ball through to a teammate but it's well blocked by a defender. Malaga will take a corner kick."
        },
        {
            "gameTime": "1 - 05:13",
            "label": "",
            "description": "Jese (Real Madrid) tackles a bit over zealously and Ignacio Iglesias Villanueva blows for a foul."
        },
        {
            "gameTime": "1 - 03:08",
            "label": "",
            "description": "Isco (Real Madrid) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety."
        },
        {
            "gameTime": "1 - 01:32",
            "label": "y-card",
            "description": "What was Miguel Torres (Malaga) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ignacio Iglesias Villanueva is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. There wasn't any significant dominance by either side in this game. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "21/02/2016 - 18:00",
    "gameHomeTeam": "Malaga",
    "gameScore": "1 - 1"
}