{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-08-14 - 18-00 Arsenal 3 - 4 Liverpool/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. There wasn't any significant dominance by either side in this game. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 48:55",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 48:06",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 47:39",
            "label": "",
            "description": "Jordan Henderson (Liverpool) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. The linesman points to the corner flag, Liverpool are going to take it."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:28",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 43:17",
            "label": "",
            "description": "Divock Origi (Liverpool) looks to break free, but an opposing player clears the ball away. Liverpool have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 42:34",
            "label": "substitution",
            "description": "That's the end of the game for Georginio Wijnaldum, who is replaced by Kevin Stewart (Liverpool)."
        },
        {
            "gameTime": "2 - 40:52",
            "label": "y-card",
            "description": "Michael Oliver shows the yellow card to Granit Xhaka (Arsenal) for a heavy challenge."
        },
        {
            "gameTime": "2 - 40:29",
            "label": "",
            "description": "Flag goes up against Roberto Firmino (Liverpool) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 39:48",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 39:31",
            "label": "",
            "description": "Wow, what an escape. Roberto Firmino (Liverpool) has an effort from inside the box but it's brilliantly blocked. Liverpool win a corner."
        },
        {
            "gameTime": "2 - 36:47",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 36:27",
            "label": "",
            "description": "Theo Walcott (Arsenal) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. Good work from Arsenal as they win a corner."
        },
        {
            "gameTime": "2 - 33:45",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) is penalised for a foul. Michael Oliver had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 30:25",
            "label": "substitution",
            "description": "A substitution has been made. Adam Lallana goes off and Divock Origi (Liverpool) comes on."
        },
        {
            "gameTime": "2 - 29:49",
            "label": "soccer-ball",
            "description": "The ball is whipped in from the free kick and finds the head of Calum Chambers (Arsenal), who rises and produces an amazing header inside the right post."
        },
        {
            "gameTime": "2 - 29:48",
            "label": "",
            "description": "Santi Cazorla (Arsenal) takes a direct free kick."
        },
        {
            "gameTime": "2 - 29:47",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) robs an opponent of the ball and explodes in anger when Michael Oliver blows for a foul. Arsenal are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 27:05",
            "label": "attendance",
            "description": "The attendance is 60033."
        },
        {
            "gameTime": "2 - 24:15",
            "label": "substitution",
            "description": "Philippe Coutinho is substituted due to injury. Jurgen Klopp gives a chance to Emre Can (Liverpool)."
        },
        {
            "gameTime": "2 - 23:23",
            "label": "injury",
            "description": "Philippe Coutinho (Liverpool) picks up an injury."
        },
        {
            "gameTime": "2 - 21:39",
            "label": "substitution",
            "description": "The game has come to an end for Mohamed Elneny. He has contributed as much as he could today. He will be replaced by the fresh legs of Granit Xhaka (Arsenal)."
        },
        {
            "gameTime": "2 - 20:42",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Santi Cazorla (Arsenal)."
        },
        {
            "gameTime": "2 - 20:31",
            "label": "",
            "description": "Nacho Monreal (Arsenal) delivers a low pass into the box which is intercepted. Corner kick. Arsenal will have an opportunity."
        },
        {
            "gameTime": "2 - 18:33",
            "label": "soccer-ball",
            "description": "It's a goal! Alex Oxlade Chamberlain (Arsenal) displays superb quick feet and dribbling as he jinks his way through multiple challenges and takes a shot from inside the box, which is deflected and goes past stranded Simon Mignolet. 2:4."
        },
        {
            "gameTime": "2 - 18:32",
            "label": "",
            "description": "Arsenal hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "soccer-ball",
            "description": "Sadio Mane (Liverpool) finishes his beautiful individual effort with a superb strike from inside the box. Petr Cech is just a bystander as the ball flies into the top left corner. The score is 1:4."
        },
        {
            "gameTime": "2 - 17:01",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) takes a short corner kick."
        },
        {
            "gameTime": "2 - 16:52",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) tries to send the ball in front of the goal, but the opposition's defence averts the threat. The ball goes out of play. Liverpool are awarded a corner kick."
        },
        {
            "gameTime": "2 - 15:59",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Santi Cazorla (Arsenal) is coming onto the pitch as Aaron Ramsey cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 13:59",
            "label": "substitution",
            "description": "Substitution. Alex Oxlade Chamberlain (Arsenal) on for Alex Iwobi."
        },
        {
            "gameTime": "2 - 13:18",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) collects a great pass inside the box and misses a golden opportunity. His low shot was directed into the middle of the goal, but the goalkeeper does well to stop his effort."
        },
        {
            "gameTime": "2 - 11:32",
            "label": "y-card",
            "description": "A yellow card for a tackle by Alex Iwobi (Arsenal). Michael Oliver doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 10:34",
            "label": "soccer-ball",
            "description": "Goal 1:3! Nathaniel Clyne laid the ball off to Philippe Coutinho (Liverpool), who slots it into the back of the net from close range, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 08:11",
            "label": "",
            "description": "Hector Bellerin (Arsenal) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "2 - 06:01",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) attempts to create a scoring opportunity with a wonderful long ball, but his pass is blocked."
        },
        {
            "gameTime": "2 - 03:14",
            "label": "soccer-ball",
            "description": "Goal! Georginio Wijnaldum displays great vision and sends a pass to Adam Lallana (Liverpool), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 1:2."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "There has been no time for the supporters to get bored during an eventful opening 45 minutes. Both teams provided some breathtaking moments. Neither side is enjoying any significant control of the game. The home team makes a lot of passes and attempts to maintain possession. The same goes for the away side."
        },
        {
            "gameTime": "1 - 46:55",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:31",
            "label": "soccer-ball",
            "description": "Philippe Coutinho (Liverpool) scores a beautiful goal from the resulting free kick. He bends the ball into the top left corner. A technically stunning goal."
        },
        {
            "gameTime": "1 - 45:21",
            "label": "",
            "description": "Rob Holding (Arsenal) pulls the jersey of one of the opposition players and Michael Oliver blows his whistle for a foul. Liverpool are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:16",
            "label": "",
            "description": "Calum Chambers (Arsenal) jumps for a header from the resulting set piece, but it goes way wide of the right post."
        },
        {
            "gameTime": "1 - 44:12",
            "label": "corner",
            "description": "Corner kick. Theo Walcott (Arsenal) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 43:31",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) attempts to curl the ball over the defensive wall from the free kick, but his effort fails to reach the goal. Arsenal will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 42:45",
            "label": "",
            "description": "Jordan Henderson (Liverpool) pulls the shirt of his opponent and the referee stops play for a foul. Arsenal have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 42:14",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) sends a teasing cross into the area, but Petr Cech intercepts the ball."
        },
        {
            "gameTime": "1 - 40:17",
            "label": "y-card",
            "description": "Michael Oliver shows a yellow card to Dejan Lovren (Liverpool) for a tough tackle."
        },
        {
            "gameTime": "1 - 39:24",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) picks up a pass and unleashes a low shot towards goal, but he can't generate enough power to trouble Petr Cech."
        },
        {
            "gameTime": "1 - 38:34",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 36:55",
            "label": "y-card",
            "description": "The foul by Francis Coquelin (Arsenal) is worthy of a card and a yellow is duly shown by Michael Oliver."
        },
        {
            "gameTime": "1 - 34:50",
            "label": "",
            "description": "Roberto Firmino (Liverpool) unleashes a shot from 22 metres out but is unable to find the target and it goes well wide of the left post."
        },
        {
            "gameTime": "1 - 32:03",
            "label": "",
            "description": "Jordan Henderson (Liverpool) makes a reckless foul in order to win the ball from his opponent. Michael Oliver has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 30:38",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Alex Iwobi, who plays a vital role in the build up. He squares it to Theo Walcott (Arsenal), who beats Simon Mignolet with a brilliant shot into the left side of the net. 1:0."
        },
        {
            "gameTime": "1 - 29:23",
            "label": "penalty-missed",
            "description": "Theo Walcott (Arsenal) has a great chance to score from the penalty. He shoots to the left post, but Simon Mignolet leaps out to thwart his attempt."
        },
        {
            "gameTime": "1 - 29:01",
            "label": "",
            "description": "Theo Walcott (Arsenal) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 28:43",
            "label": "y-card",
            "description": "Alberto Moreno (Liverpool) got a yellow card."
        },
        {
            "gameTime": "1 - 27:59",
            "label": "penalty",
            "description": "Alberto Moreno (Liverpool) was trying to get to the ball but clattered into the legs of the opponent as well. Michael Oliver blows his whistle for an infringement. PENALTY! Wonderful opportunity to score for Arsenal."
        },
        {
            "gameTime": "1 - 25:48",
            "label": "y-card",
            "description": "Michael Oliver shows a yellow card to Adam Lallana (Liverpool), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "Roberto Firmino (Liverpool) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "1 - 21:42",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "1 - 20:47",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) is caught offside!"
        },
        {
            "gameTime": "1 - 20:17",
            "label": "",
            "description": "Theo Walcott (Arsenal) plays a one two with Alexis Sanchez, but the move breaks down."
        },
        {
            "gameTime": "1 - 17:23",
            "label": "",
            "description": "Roberto Firmino (Liverpool) knocks his opponent down with an over the top tackle."
        },
        {
            "gameTime": "1 - 15:36",
            "label": "",
            "description": "Ragnar Klavan (Liverpool) makes a strong challenge and Michael Oliver blows for a foul."
        },
        {
            "gameTime": "1 - 14:17",
            "label": "corner",
            "description": "Theo Walcott (Arsenal) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 12:53",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee and one of his assistants signal for a corner kick to Arsenal."
        },
        {
            "gameTime": "1 - 09:42",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Simon Mignolet is alert and denies him."
        },
        {
            "gameTime": "1 - 07:25",
            "label": "",
            "description": "Arsenal are seeing far more of the ball now."
        },
        {
            "gameTime": "1 - 04:04",
            "label": "corner",
            "description": "Theo Walcott (Arsenal) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 03:50",
            "label": "",
            "description": "Nacho Monreal (Arsenal) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. Arsenal force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 01:57",
            "label": "",
            "description": "The game is interrupted as Sadio Mane (Liverpool) is flagged offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Michael Oliver."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Several players have joined Liverpool in the latest transfer window: . Certainly, some of them will participate in the upcoming clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have seen many goals in the previous 5 matches between these two teams, with an average of 3.8 goals per game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Arsenal will miss a few players for this clash: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. There wasn't any significant dominance by either side in this game. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Liverpool",
    "gameDate": "14/08/2016 - 18:00",
    "gameHomeTeam": "Arsenal",
    "gameScore": "3 - 4"
}