{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-10-25 - 21-45 Genoa 3 - 0 AC Milan/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side dominated this game. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 48:14",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:53",
            "label": "",
            "description": "Diego Laxalt (Genoa) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 47:01",
            "label": "corner",
            "description": "Genoa quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 46:11",
            "label": "",
            "description": "Ezequiel Munoz (Genoa) sends a cross into the box, but the opposition's defence clears the ball to safety. The ball goes out for a corner. Genoa can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:59",
            "label": "",
            "description": "Luca Rigoni (Genoa) has a goal ruled out for offside!"
        },
        {
            "gameTime": "2 - 42:51",
            "label": "",
            "description": "Genoa are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "2 - 40:58",
            "label": "soccer-ball",
            "description": "Leonardo Pavoletti (Genoa) makes a great solo run and pulls the trigger from inside the box, beating Gianluigi Donnarumma with a strike into the right side of the goal. He makes it 3:0."
        },
        {
            "gameTime": "2 - 39:29",
            "label": "y-card",
            "description": "Miguel Veloso (Genoa) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Luca Banti didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) unleashes a shot from 23 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 37:11",
            "label": "funfact",
            "description": "46:54 – the ratio of ball possession. The current number of shots on goal is 3:3."
        },
        {
            "gameTime": "2 - 36:42",
            "label": "",
            "description": "Miguel Veloso (Genoa) gets on the end of a pass and takes a low shot from the edge of the box which is straight at Gianluigi Donnarumma, who makes a comfortable save."
        },
        {
            "gameTime": "2 - 34:13",
            "label": "soccer-ball-own",
            "description": "This is definitely not what Juraj Kucka (AC Milan) wanted. Attempting to intercept an offensive pass, he scored an own goal and made it 2:0."
        },
        {
            "gameTime": "2 - 32:36",
            "label": "substitution",
            "description": "The substitution has been made. Riccardo Fiamozzi (Genoa) has replaced Edenilson."
        },
        {
            "gameTime": "2 - 30:52",
            "label": "",
            "description": "Suso (AC Milan) hammers the ball goalwards from about 23 metres. The shot is directed low to the middle of the target but is thwarted by a save from Mattia Perin."
        },
        {
            "gameTime": "2 - 30:26",
            "label": "",
            "description": "AC Milan hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "2 - 28:53",
            "label": "y-card",
            "description": "Luca Banti shows a yellow card to Leonardo Pavoletti (Genoa) for a tough tackle."
        },
        {
            "gameTime": "2 - 28:26",
            "label": "",
            "description": "Juraj Kucka (AC Milan) attempts to score from 24 metres out, but his decent effort flies towards the middle of the target and is stopped by Mattia Perin. It didn't really trouble him."
        },
        {
            "gameTime": "2 - 27:23",
            "label": "",
            "description": "Half chance! Suso (AC Milan) plays a pass into the box, but Mattia Perin reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 26:25",
            "label": "",
            "description": "Leonardo Pavoletti (Genoa) attempts to test the goalkeeper after receiving a cross inside the penalty area. He hits the ball poorly and his shot goes well wide of the right post."
        },
        {
            "gameTime": "2 - 25:54",
            "label": "",
            "description": "Suso (AC Milan) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "substitution",
            "description": "Suso (AC Milan) joins the action as a substitute, replacing M'Baye Niang."
        },
        {
            "gameTime": "2 - 24:27",
            "label": "",
            "description": "M'Baye Niang (AC Milan) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it. It's a throw in for Genoa."
        },
        {
            "gameTime": "2 - 23:40",
            "label": "corner",
            "description": "Darko Lazovic (Genoa) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 23:09",
            "label": "",
            "description": "Darko Lazovic (Genoa) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety. The referee and one of his assistants signal for a corner kick to Genoa."
        },
        {
            "gameTime": "2 - 22:39",
            "label": "",
            "description": "Good team movement sets up Tomas Rincon (Genoa) on the edge of the box, but he slices the ball narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 21:43",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Leonardo Pavoletti (Genoa) comes onto the pitch for Giovanni Simeone."
        },
        {
            "gameTime": "2 - 20:53",
            "label": "",
            "description": "Juraj Kucka (AC Milan) brings his opponent down with a tackle and Luca Banti blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 19:44",
            "label": "corner",
            "description": "M'Baye Niang (AC Milan) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 19:30",
            "label": "",
            "description": "M'Baye Niang (AC Milan) looks to break free, but an opposing player clears the ball away. The ball is out of play and AC Milan manage to earn a corner."
        },
        {
            "gameTime": "2 - 18:17",
            "label": "",
            "description": "Some neat passing and movement from AC Milan as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "2 - 16:38",
            "label": "substitution",
            "description": "Vincenzo Montella has decided to introduce fresh legs, with Luiz Adriano (AC Milan) replacing Keisuke Honda."
        },
        {
            "gameTime": "2 - 15:32",
            "label": "corner",
            "description": "Darko Lazovic (Genoa) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 14:53",
            "label": "",
            "description": "Luca Rigoni (Genoa) flights in the cross, but the defender is alert and clears to safety. The ball goes out of play and Genoa have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 13:38",
            "label": "",
            "description": "Andrea Poli (AC Milan) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 12:25",
            "label": "substitution",
            "description": "Substitution. Gustavo Gomez (AC Milan) in, Carlos Bacca out."
        },
        {
            "gameTime": "2 - 10:59",
            "label": "r-card",
            "description": "Luca Banti shows a red card with no hesitation. Gabriel Paletta (AC Milan) can have an early bath and think about his challenge."
        },
        {
            "gameTime": "2 - 10:09",
            "label": "corner",
            "description": "Darko Lazovic (Genoa) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 09:50",
            "label": "",
            "description": "Darko Lazovic (Genoa) tries to send a pass but it's blocked. The ball is out of play. Genoa will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 08:47",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Nikola Ninkovic trots off the pitch and is replaced by Darko Lazovic (Genoa)."
        },
        {
            "gameTime": "2 - 05:58",
            "label": "",
            "description": "Gabriel Paletta (AC Milan) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "2 - 05:54",
            "label": "corner",
            "description": "M'Baye Niang (AC Milan) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 05:15",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) takes the ball on and fires in a shot from 23 metres out. Mattia Perin stops the effort which is headed for the bottom left corner. Good work from AC Milan as they win a corner."
        },
        {
            "gameTime": "2 - 03:15",
            "label": "",
            "description": "The linesman raises his flag for offside before Luca Rigoni (Genoa) heads on."
        },
        {
            "gameTime": "2 - 02:13",
            "label": "",
            "description": "Gabriel Paletta (AC Milan) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "2 - 01:19",
            "label": "",
            "description": "The effort by Giacomo Bonaventura (AC Milan) failed to give the goalkeeper anything to worry about. He unleashed a poor shot from 26 metres which flew well wide of the right post."
        },
        {
            "gameTime": "2 - 00:42",
            "label": "",
            "description": "Carlos Bacca (AC Milan) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Luca Banti blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We can hope that the managers will be able to motivate the players and stir them to improve their performance for after the half time break. We haven't seen really exciting football in the previous 45 minutes. Both teams are unsuccessfully trying to control the game and it's pretty even so far. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 46:13",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "Keisuke Honda (AC Milan) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 44:34",
            "label": "",
            "description": "A player from Genoa pulled an opponent down, forcing the referee to blow his whistle. AC Milan are awarded the free kick."
        },
        {
            "gameTime": "1 - 43:21",
            "label": "corner",
            "description": "Nikola Ninkovic (Genoa) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "1 - 42:29",
            "label": "",
            "description": "A lofted cross from Miguel Veloso (Genoa) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Genoa will take a corner kick."
        },
        {
            "gameTime": "1 - 41:15",
            "label": "",
            "description": "M'Baye Niang (AC Milan) got the ball on the edge of the box and fired in a first time shot on goal, but his effort floated well over the bar. High, wide and not at all handsome."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "y-card",
            "description": "Armando Izzo (Genoa) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Luca Banti ignores the protests."
        },
        {
            "gameTime": "1 - 37:59",
            "label": "",
            "description": "The AC Milan players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 34:52",
            "label": "",
            "description": "The AC Milan players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession."
        },
        {
            "gameTime": "1 - 32:35",
            "label": "",
            "description": "Andrea Poli (AC Milan) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "1 - 30:07",
            "label": "",
            "description": "Edenilson (Genoa) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "1 - 29:46",
            "label": "",
            "description": "Neat passing move from AC Milan in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 26:41",
            "label": "",
            "description": "A clumsy foul by Miguel Veloso (Genoa) and Luca Banti blows his whistle."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "",
            "description": "Giovanni Simeone (Genoa) sends a cross into the box, but Gianluigi Donnarumma comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 24:59",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) unleashes a shot from the edge of the box, but it goes straight at Mattia Perin."
        },
        {
            "gameTime": "1 - 24:29",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "1 - 23:59",
            "label": "",
            "description": "Luca Rigoni (Genoa) commits a foul after making a slide tackle on his opponent. Free kick. AC Milan will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 23:13",
            "label": "",
            "description": "The referee blows his whistle as Miguel Veloso (Genoa) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 22:31",
            "label": "",
            "description": "Luca Banti blows his whistle after Manuel Locatelli (AC Milan) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 21:50",
            "label": "",
            "description": "Lovely skill from Alessio Romagnoli (AC Milan) as he gets away from defenders and unleashes a shot from 24 metres out, but his effort goes just wide of the left post."
        },
        {
            "gameTime": "1 - 20:32",
            "label": "",
            "description": "M'Baye Niang (AC Milan) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "1 - 19:49",
            "label": "",
            "description": "Giovanni Simeone (Genoa) is caught offside!"
        },
        {
            "gameTime": "1 - 19:04",
            "label": "",
            "description": "Diego Laxalt (Genoa) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 18:11",
            "label": "",
            "description": "Edenilson (Genoa) did his best to latch on to a crossfield pass, but it was too long and it goes out of play. The ball goes out of play and AC Milan will have a goal kick."
        },
        {
            "gameTime": "1 - 16:56",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned M'Baye Niang (AC Milan), but the defence gets it clear."
        },
        {
            "gameTime": "1 - 15:46",
            "label": "",
            "description": "Manuel Locatelli (AC Milan) trips an opposition player and Luca Banti signals a foul."
        },
        {
            "gameTime": "1 - 14:43",
            "label": "corner",
            "description": "Keisuke Honda (AC Milan) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 14:27",
            "label": "",
            "description": "Keisuke Honda (AC Milan) races towards goal but the defender gets back well to make a challenge. The referee points to the corner flag. It's a corner to AC Milan."
        },
        {
            "gameTime": "1 - 13:31",
            "label": "",
            "description": "Genoa try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "1 - 12:59",
            "label": "",
            "description": "Luca Banti blows for a foul after M'Baye Niang (AC Milan) was too aggressive in the battle for the ball. A free kick has been awarded to Genoa."
        },
        {
            "gameTime": "1 - 10:23",
            "label": "soccer-ball",
            "description": "It's a goal! Nikola Ninkovic (Genoa) makes it 0:0. He jumped highest to connect with a perfect cross from Tomas Rincon and planted his close range header into the bottom left corner. Gianluigi Donnarumma was helpless."
        },
        {
            "gameTime": "1 - 09:55",
            "label": "",
            "description": "Giovanni Simeone (Genoa) fails to find any of his teammates inside the box as his pass is blocked. The linesman signals a throw in for Genoa."
        },
        {
            "gameTime": "1 - 07:36",
            "label": "",
            "description": "A cross is clipped into the penalty area by Edenilson (Genoa) but poses no threat."
        },
        {
            "gameTime": "1 - 06:13",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) launches into a thunderous tackle on his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 05:21",
            "label": "",
            "description": "Edenilson (Genoa) crosses the ball forward but it is intercepted."
        },
        {
            "gameTime": "1 - 03:55",
            "label": "",
            "description": "A cross from Miguel Veloso (Genoa) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 02:54",
            "label": "",
            "description": "AC Milan players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and AC Milan will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Luca Banti."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AC Milan haven't lost in their last 4 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Bacca is the biggest threat to an opponent! He has already scored 8 goals and is top scorer in this AC Milan team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Nicolas Burdisso from Genoa has already played 630 minutes this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side dominated this game. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "AC Milan",
    "gameDate": "25/10/2016 - 21:45",
    "gameHomeTeam": "Genoa",
    "gameScore": "3 - 0"
}