{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2016-10-19 - 21-45 Paris SG 3 - 0 Basel/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. There wasn't any evident superiority by either side today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        },
        {
            "gameTime": "2 - 48:13",
            "label": "whistle",
            "description": "That's it for today, Deniz Aytekin has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 47:26",
            "label": "soccer-ball",
            "description": "Edinson Cavani (Paris SG) finds the back of the net after sending the ball to the opposite side of the goal to which the goalkeeper dives!"
        },
        {
            "gameTime": "2 - 47:20",
            "label": "",
            "description": "Edinson Cavani (Paris SG) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 46:52",
            "label": "penalty",
            "description": "Michael Lang (Basel) brings an opponent down and Deniz Aytekin interrupts the game. It's a penalty! What an opportunity to score for Paris SG."
        },
        {
            "gameTime": "2 - 45:53",
            "label": "",
            "description": "Jese (Paris SG) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Tomas Vaclik."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:17",
            "label": "",
            "description": "Hatem Ben Arfa (Paris SG) takes a mid range shot, but it lacks accuracy and it goes way over the bar."
        },
        {
            "gameTime": "2 - 40:06",
            "label": "substitution",
            "description": "The manager makes a subsitution with Jese (Paris SG) coming on for Angel Di Maria."
        },
        {
            "gameTime": "2 - 38:34",
            "label": "",
            "description": "Adrien Rabiot (Paris SG) sends a quick through ball into space for his teammate who is lurking close to the offside line, but one of the defenders intercepts and clears the danger."
        },
        {
            "gameTime": "2 - 37:13",
            "label": "substitution",
            "description": "Unai Emery Etxegoien has decided to make a change. Grzegorz Krychowiak (Paris SG) replaces Blaise Matuidi."
        },
        {
            "gameTime": "2 - 35:22",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Hatem Ben Arfa (Paris SG) for Lucas."
        },
        {
            "gameTime": "2 - 34:29",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 33:58",
            "label": "",
            "description": "Angel Di Maria (Paris SG) produces a poor pass. He attempts to get the ball into the box but it's hacked away. Paris SG get a corner."
        },
        {
            "gameTime": "2 - 33:43",
            "label": "corner",
            "description": "Renato Steffen (Basel) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 33:25",
            "label": "",
            "description": "Renato Steffen (Basel) swings in a cross, but the ball is cleared to safety by one of the defending players. It will be a corner kick for Basel."
        },
        {
            "gameTime": "2 - 33:06",
            "label": "",
            "description": "Renato Steffen (Basel) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 32:31",
            "label": "substitution",
            "description": "Substitution. Marc Janko (Basel) receives a signal from the referee and is now allowed to enter the pitch as Serey Die walks off."
        },
        {
            "gameTime": "2 - 32:25",
            "label": "",
            "description": "Flag goes up against Blaise Matuidi (Paris SG) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 30:15",
            "label": "y-card",
            "description": "Deniz Aytekin shows a yellow card to Michael Lang (Basel) for his blatant foul."
        },
        {
            "gameTime": "2 - 26:13",
            "label": "",
            "description": "Serge Aurier (Paris SG) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 25:53",
            "label": "",
            "description": "Lucas (Paris SG) sends a killer pass through the opponent's defence in an effort to find a space for Serge Aurier, who is lurking close to the offside line."
        },
        {
            "gameTime": "2 - 24:23",
            "label": "substitution",
            "description": "The game has come to an end for Matias Delgado. He has contributed as much as he could today. He will be replaced by the fresh legs of Luca Zuffi (Basel)."
        },
        {
            "gameTime": "2 - 20:40",
            "label": "y-card",
            "description": "Renato Steffen (Basel) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Deniz Aytekin didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 20:26",
            "label": "",
            "description": "Marek Suchy (Basel) wastes a great chance as he climbs high around the penalty spot to connect with a cross from the resulting free kick. He plants his header against the left post!"
        },
        {
            "gameTime": "2 - 19:28",
            "label": "corner",
            "description": "Renato Steffen (Basel) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "2 - 19:11",
            "label": "",
            "description": "Matias Delgado (Basel) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players. The ball is out of play. Basel win a corner kick."
        },
        {
            "gameTime": "2 - 19:10",
            "label": "",
            "description": "A cross from a mid range free kick, taken by Basel, is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 18:55",
            "label": "y-card",
            "description": "Adrien Rabiot (Paris SG) attempts to discuss the decision with Deniz Aytekin, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "2 - 18:52",
            "label": "",
            "description": "Deniz Aytekin blows his whistle after Serge Aurier (Paris SG) brings one of his opponents down with a strong tackle. Basel will take a free kick near the side line."
        },
        {
            "gameTime": "2 - 16:54",
            "label": "soccer-ball",
            "description": "Goal! Lucas (Paris SG) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball low inside the right post. It's 2:0."
        },
        {
            "gameTime": "2 - 16:11",
            "label": "",
            "description": "Edinson Cavani (Paris SG) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Tomas Vaclik."
        },
        {
            "gameTime": "2 - 15:53",
            "label": "substitution",
            "description": "Here comes a substitution. Andraz Sporar (Basel) is brought on as a substitute for Seydou Doumbia."
        },
        {
            "gameTime": "2 - 15:31",
            "label": "",
            "description": "The foul by Layvin Kurzawa (Paris SG) was seen by Deniz Aytekin who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 14:36",
            "label": "",
            "description": "Seydou Doumbia (Basel) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 14:00",
            "label": "",
            "description": "Birkir Bjarnason (Basel) is adjudged offside."
        },
        {
            "gameTime": "2 - 11:15",
            "label": "",
            "description": "Michael Lang (Basel) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. The ball is out of play. Basel will take a throw in."
        },
        {
            "gameTime": "2 - 09:17",
            "label": "",
            "description": "Matias Delgado (Basel) fires the ball in from a mid range free kick, but it blazes over the bar."
        },
        {
            "gameTime": "2 - 08:57",
            "label": "",
            "description": "Marco Verratti (Paris SG) brings his opponent down. Deniz Aytekin has a clear sight of it and blows his whistle for a foul. A free kick to Basel."
        },
        {
            "gameTime": "2 - 08:38",
            "label": "",
            "description": "Lucas (Paris SG) wins the ball after the corner kick and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 08:14",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) will take the corner."
        },
        {
            "gameTime": "2 - 07:40",
            "label": "",
            "description": "It could have been a good chance to score! Lucas (Paris SG) fails to release Serge Aurier with a through ball as the defence is alert and clears. The ball goes out of play and Paris SG have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "",
            "description": "Angel Di Maria (Paris SG) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The linesman signals a throw in for Basel."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "",
            "description": "Edinson Cavani (Paris SG) creates himself some space around the penalty spot and connects with the free kick. His almost perfect header hits the right post and ricochets away off it."
        },
        {
            "gameTime": "2 - 01:35",
            "label": "",
            "description": "Adama Traore (Basel) is penalised after knocking an opponent down. Paris SG are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Both sides have been very active in the first half, providing the fans with an exciting show. It has been a tight contest so far. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 46:02",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:40",
            "label": "",
            "description": "Layvin Kurzawa (Paris SG) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "1 - 43:00",
            "label": "",
            "description": "Paris SG are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 39:48",
            "label": "soccer-ball",
            "description": "Angel Di Maria (Paris SG) receives a killer pass, finds himself one on one with the goalkeeper and coolly sends the ball into the back of the net."
        },
        {
            "gameTime": "1 - 36:37",
            "label": "corner",
            "description": "Lucas (Paris SG) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "1 - 36:18",
            "label": "",
            "description": "Tomas Vaclik hears the fans clapping his superb goalkeeping. Adrien Rabiot (Paris SG) shoots from the edge of the box towards the top of the net, but the goalkeeper makes a magnificent save."
        },
        {
            "gameTime": "1 - 35:47",
            "label": "",
            "description": "Seydou Doumbia (Basel) latches on to a superb cross into the box and hits the right post with his header. A stroke of luck for the goalkeeper!"
        },
        {
            "gameTime": "1 - 35:25",
            "label": "",
            "description": "Birkir Bjarnason (Basel) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "1 - 32:44",
            "label": "",
            "description": "Edinson Cavani (Paris SG) gets on the ball and beats an opponent, but his run is stopped by the referee Deniz Aytekin who sees an offensive foul."
        },
        {
            "gameTime": "1 - 30:00",
            "label": "",
            "description": "CHANCE! Angel Di Maria (Paris SG) fires just wide of the right post from inside the box after running onto a splendid pass from Lucas."
        },
        {
            "gameTime": "1 - 28:39",
            "label": "",
            "description": "Birkir Bjarnason (Basel) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the right post."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "",
            "description": "Adrien Rabiot (Paris SG) was close to scoring after he unleashed a powerful shot which went a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 24:00",
            "label": "",
            "description": "Renato Steffen (Basel) takes a mid range shot, but the ball sails high over the bar."
        },
        {
            "gameTime": "1 - 20:50",
            "label": "",
            "description": "Deniz Aytekin blows his whistle and it's Marek Suchy (Basel) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 20:36",
            "label": "corner",
            "description": "Renato Steffen (Basel) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 20:18",
            "label": "corner",
            "description": "Matias Delgado (Basel) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat. The referee and one of his assistants signal for a corner kick to Basel."
        },
        {
            "gameTime": "1 - 19:56",
            "label": "",
            "description": "Renato Steffen (Basel) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The ball goes out for a corner. Basel can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 18:56",
            "label": "",
            "description": "Angel Di Maria (Paris SG) is caught offside!"
        },
        {
            "gameTime": "1 - 18:13",
            "label": "",
            "description": "Matias Delgado (Basel) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 17:00",
            "label": "",
            "description": "Serge Aurier (Paris SG) commits a foul and Deniz Aytekin immediately signals a free kick."
        },
        {
            "gameTime": "1 - 15:00",
            "label": "",
            "description": "Serge Aurier (Paris SG) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 11:20",
            "label": "",
            "description": "Close! Seydou Doumbia (Basel) is a whisker away from finishing off the move he started. His close range effort flies just over the bar."
        },
        {
            "gameTime": "1 - 11:05",
            "label": "",
            "description": "Great touch by Renato Steffen (Basel) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "1 - 09:00",
            "label": "",
            "description": "Paris SG enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "Edinson Cavani (Paris SG) clearly handles the ball, but he is surprised when the referee blows his whistle."
        },
        {
            "gameTime": "1 - 05:05",
            "label": "",
            "description": "Michael Lang (Basel) only hits the crossbar with a bullet header!"
        },
        {
            "gameTime": "1 - 04:44",
            "label": "corner",
            "description": "Matias Delgado (Basel) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 04:23",
            "label": "",
            "description": "Matias Delgado (Basel) fails to find any of his teammates inside the box as his pass is blocked. The referee and his assistant both point at the corner flag. Basel will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 03:05",
            "label": "",
            "description": "Taulant Xhaka (Basel) fouls an opponent. At least that's what referee Deniz Aytekin signals."
        },
        {
            "gameTime": "1 - 02:06",
            "label": "",
            "description": "Angel Di Maria (Paris SG) is flagged for offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "",
            "description": "Basel will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Deniz Aytekin will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This hugely entertaining encounter was a wonderful experience for every football lover to behold. The players did their utmost to make the game very enjoyable. There wasn't any evident superiority by either side today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        }
    ],
    "gameAwayTeam": "Basel",
    "gameDate": "19/10/2016 - 21:45",
    "gameHomeTeam": "Paris SG",
    "gameScore": "3 - 0"
}