{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-01-24 - 19-00 Arsenal 0 - 1 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. We saw a very balanced game over the 90 minutes. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 50:12",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 49:50",
            "label": "",
            "description": "Willian (Chelsea) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 49:28",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 48:57",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Arsenal have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 48:05",
            "label": "",
            "description": "What a big chance! Willian (Chelsea) picks up an inch perfect pass inside the box and fires the ball well wide of the left post."
        },
        {
            "gameTime": "2 - 47:25",
            "label": "",
            "description": "Loic Remy receives a short pass from Eden Hazard (Chelsea), but the opposition's defence thwarts his effort."
        },
        {
            "gameTime": "2 - 45:47",
            "label": "",
            "description": "The ball spins up and hits the hand of Aaron Ramsey (Arsenal) after he fails to control it and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 45:04",
            "label": "",
            "description": "Nacho Monreal (Arsenal) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 5 min. of added time."
        },
        {
            "gameTime": "2 - 44:40",
            "label": "",
            "description": "The flag is raised and Loic Remy (Chelsea) is offside again, not for the first time today."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "",
            "description": "Loic Remy (Chelsea) finds himself in a promising position after receiving an excellent pass into the box, but one of the defenders produces a timely intervention to avert the threat."
        },
        {
            "gameTime": "2 - 41:14",
            "label": "",
            "description": "Mathieu Flamini (Arsenal) has a great chance inside the six yard box, shoots to the right side of the goal, but Thibaut Courtois pulls off an exquisite save to deny him."
        },
        {
            "gameTime": "2 - 39:49",
            "label": "",
            "description": "Mesut Ozil (Arsenal) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 39:18",
            "label": "",
            "description": "Eden Hazard (Chelsea) should know this behaviour is beyond the rules. He was too careless with his challenge and left Mark Clattenburg no option but to blow his whistle. A free kick to Arsenal."
        },
        {
            "gameTime": "2 - 38:56",
            "label": "corner",
            "description": "The corner kick from Mesut Ozil (Arsenal) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 38:36",
            "label": "",
            "description": "Mesut Ozil (Arsenal) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball. The linesman points to the corner flag, Arsenal are going to take it."
        },
        {
            "gameTime": "2 - 36:10",
            "label": "",
            "description": "Half chance! Eden Hazard (Chelsea) plays a pass into the box, but Petr Cech reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 34:37",
            "label": "attendance",
            "description": "The attendance for today's match is 60072."
        },
        {
            "gameTime": "2 - 33:55",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 33:25",
            "label": "",
            "description": "Loic Remy (Chelsea) is caught offside!"
        },
        {
            "gameTime": "2 - 32:47",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 32:11",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) receives a clever long through ball and finds himself in a promising position inside the box, but the defence is alert to the danger and clears. Arsenal will take a corner kick."
        },
        {
            "gameTime": "2 - 31:05",
            "label": "substitution",
            "description": "Guus Hiddink prepares a substitution. Oscar is replaced by Eden Hazard (Chelsea)."
        },
        {
            "gameTime": "2 - 29:56",
            "label": "",
            "description": "Loic Remy (Chelsea) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 29:03",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Theo Walcott leaves the pitch and Alex Oxlade Chamberlain (Arsenal) comes on."
        },
        {
            "gameTime": "2 - 28:11",
            "label": "",
            "description": "Hector Bellerin (Arsenal) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 27:43",
            "label": "",
            "description": "A pass from Cesc Fabregas (Chelsea) is intercepted by Petr Cech and the move breaks down."
        },
        {
            "gameTime": "2 - 26:40",
            "label": "y-card",
            "description": "John Obi Mikel (Chelsea) is booked after bringing down an opponent. Mark Clattenburg had an easy decision to make."
        },
        {
            "gameTime": "2 - 24:28",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) gets on the end of a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Petr Cech pulls off an easy save."
        },
        {
            "gameTime": "2 - 23:12",
            "label": "substitution",
            "description": "Problems for Guus Hiddink as Diego Costa is not able to play anymore. His injury is too serious and Loic Remy (Chelsea) replaces him."
        },
        {
            "gameTime": "2 - 21:48",
            "label": "injury",
            "description": "Diego Costa (Chelsea) picks up an injury."
        },
        {
            "gameTime": "2 - 21:28",
            "label": "corner",
            "description": "Thibaut Courtois leaps to collect the ball from the corner which was sent over by Mesut Ozil (Arsenal)."
        },
        {
            "gameTime": "2 - 21:04",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Hector Bellerin (Arsenal). Arsenal have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 20:28",
            "label": "",
            "description": "Oscar (Chelsea) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "2 - 18:25",
            "label": "",
            "description": "Gabriel (Arsenal) receives the ball inside the box from the resulting free kick, but fails to score as his shot is blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 18:11",
            "label": "",
            "description": "Mesut Ozil (Arsenal) will take the free kick."
        },
        {
            "gameTime": "2 - 17:21",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) makes a reckless foul in order to win the ball from his opponent. Mark Clattenburg has a clear sight of it and blows his whistle. Arsenal have a free kick."
        },
        {
            "gameTime": "2 - 14:43",
            "label": "y-card",
            "description": "Nemanja Matic (Chelsea) has received a yellow card for his foul."
        },
        {
            "gameTime": "2 - 12:36",
            "label": "",
            "description": "Nemanja Matic (Chelsea) is penalised for a foul. Mark Clattenburg had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 11:56",
            "label": "",
            "description": "Diego Costa (Chelsea) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 11:28",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Alexis Sanchez (Arsenal) for Joel Campbell."
        },
        {
            "gameTime": "2 - 10:50",
            "label": "corner",
            "description": "Willian (Chelsea) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 10:38",
            "label": "",
            "description": "Nemanja Matic (Chelsea) rises high to connect with a lofted pass inside the box, but one of his opponents is in the right place at the right time to thwart him. The ball is out of play. Chelsea win a corner kick."
        },
        {
            "gameTime": "2 - 10:24",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Willian (Chelsea) takes it short."
        },
        {
            "gameTime": "2 - 10:20",
            "label": "",
            "description": "Oscar (Chelsea) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. Chelsea force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Willian (Chelsea)."
        },
        {
            "gameTime": "2 - 09:44",
            "label": "",
            "description": "Good clearance! Nemanja Matic (Chelsea) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him. The referee blows his whistle, Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 09:20",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "",
            "description": "The ball is cleared after Cesar Azpilicueta (Chelsea) attempted to dribble past an opposing player. Corner kick. Chelsea will have an opportunity."
        },
        {
            "gameTime": "2 - 06:24",
            "label": "",
            "description": "Willian (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 04:23",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Diego Costa (Chelsea) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "2 - 03:48",
            "label": "",
            "description": "Flag up against Diego Costa (Chelsea). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 01:43",
            "label": "corner",
            "description": "The corner from Willian (Chelsea) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 01:15",
            "label": "",
            "description": "Oscar (Chelsea) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it. The ball is out of play. Chelsea will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 01:07",
            "label": "",
            "description": "Willian (Chelsea) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 00:43",
            "label": "",
            "description": "Mathieu Flamini (Arsenal) makes an overly aggressive challenge and Mark Clattenburg blows his whistle for a foul. It's a free kick to Chelsea in a dangerous position."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "There was certainly plenty of action during that opening 45 minutes. The visitors were superior in their performance through the first half. They were more active and precise. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 46:14",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "",
            "description": "Mathieu Flamini (Arsenal) blows a golden chance from inside the box, volleying the ball narrowly over the crossbar. What a miss!"
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:17",
            "label": "y-card",
            "description": "Mathieu Flamini (Arsenal) is cautioned by the referee for a foul that he committed a little earlier. Chelsea have been awarded a free kick."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) meets a cross and produces a header towards the right side of the goal, but one of the defending players blocks the effort."
        },
        {
            "gameTime": "1 - 42:15",
            "label": "corner",
            "description": "Willian (Chelsea) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 41:46",
            "label": "",
            "description": "Diego Costa (Chelsea) receives a precise pass and is given time inside the box to send a promising strike towards the right post. Petr Cech guesses his intention and denies him with a fine save. Chelsea force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 40:58",
            "label": "",
            "description": "Dangerous play by Willian (Chelsea). Mark Clattenburg blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 39:53",
            "label": "",
            "description": "Hector Bellerin (Arsenal) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 39:00",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) sends a superb lead pass into the penalty area and finds Theo Walcott, who fails to shoot."
        },
        {
            "gameTime": "1 - 37:30",
            "label": "",
            "description": "Gabriel (Arsenal) gives away a foul for a clumsy challenge. Referee Mark Clattenburg saw the whole situation."
        },
        {
            "gameTime": "1 - 36:03",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) and Oscar combine well with some one touch passing and are gradually building up to an attack."
        },
        {
            "gameTime": "1 - 35:11",
            "label": "",
            "description": "A precise low pass is received by Aaron Ramsey (Arsenal), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the left post."
        },
        {
            "gameTime": "1 - 34:20",
            "label": "",
            "description": "Theo Walcott (Arsenal) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 33:26",
            "label": "",
            "description": "Nacho Monreal (Arsenal) fails to find any of his teammates inside the box as his pass is blocked. Arsenal get a corner."
        },
        {
            "gameTime": "1 - 32:53",
            "label": "",
            "description": "Willian (Chelsea) plays a through ball which would have led to a great opportunity, if it hadn't been stopped by the defence."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 30:00",
            "label": "",
            "description": "The Chelsea players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 28:10",
            "label": "",
            "description": "Diego Costa (Chelsea) decides to try his luck with a first time bullet of a shot. Unfortunately for him, he doesn't hit the ball perfectly and his effort ends well wide of the left post."
        },
        {
            "gameTime": "1 - 26:50",
            "label": "",
            "description": "The referee blows his whistle after Diego Costa (Chelsea) does a good impression of a basketball player and handles the ball."
        },
        {
            "gameTime": "1 - 25:10",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 24:43",
            "label": "",
            "description": "Hector Bellerin (Arsenal) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The referee points to the corner flag. It's a corner to Arsenal."
        },
        {
            "gameTime": "1 - 22:49",
            "label": "soccer-ball",
            "description": "Branislav Ivanovic sends a precise lofted cross into the box. Diego Costa (Chelsea) latches on to it and finishes with a quick shot inside the right post. The goalkeeper had no chance. The score changes to 0:1."
        },
        {
            "gameTime": "1 - 21:04",
            "label": "substitution",
            "description": "The manager has decided to make a tactical substitution following the red card and Gabriel (Arsenal) enters the field of play to replace Olivier Giroud."
        },
        {
            "gameTime": "1 - 19:12",
            "label": "",
            "description": "Flag goes up against Diego Costa (Chelsea) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 18:40",
            "label": "",
            "description": "Willian (Chelsea) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 17:54",
            "label": "r-card",
            "description": "Per Mertesacker (Arsenal) is being sent off by the referee for a foul that he committed a little earlier! Chelsea will take a free kick."
        },
        {
            "gameTime": "1 - 15:31",
            "label": "",
            "description": "Olivier Giroud (Arsenal) attempts to surprise the keeper with a shot from distance, but it lacks accuracy and goes high over the crossbar."
        },
        {
            "gameTime": "1 - 14:44",
            "label": "",
            "description": "Willian (Chelsea) is first to latch onto the rebound inside the penalty area. He drills a low shot towards the middle of the goal, but it is denied by the goalkeeper who pulls off a superb save."
        },
        {
            "gameTime": "1 - 14:17",
            "label": "",
            "description": "Willian (Chelsea) strikes a promising volley towards goal, but one of the defenders is quick enough to step in and make a crucial block."
        },
        {
            "gameTime": "1 - 13:28",
            "label": "",
            "description": "Willian (Chelsea) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 11:01",
            "label": "",
            "description": "Mesut Ozil (Arsenal) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "1 - 10:19",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Oscar (Chelsea) was quite harsh and Mark Clattenburg didn't hesitate to show him a yellow card. There is a free kick near the sideline to Arsenal."
        },
        {
            "gameTime": "1 - 09:19",
            "label": "",
            "description": "Mathieu Flamini received a sweet pass from Joel Campbell (Arsenal), but the advance is stopped."
        },
        {
            "gameTime": "1 - 08:48",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) sends in a pass which fails to reach any of his teammates. The linesman signals a throw in for Chelsea."
        },
        {
            "gameTime": "1 - 06:10",
            "label": "",
            "description": "Mesut Ozil (Arsenal) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 04:26",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) tries to pass the ball into the penalty area but it's blocked."
        },
        {
            "gameTime": "1 - 03:24",
            "label": "",
            "description": "Mark Clattenburg blows his whistle and it's Mathieu Flamini (Arsenal) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 02:27",
            "label": "corner",
            "description": "Willian (Chelsea) sends in a poor cross from the corner and Petr Cech has no trouble gathering it."
        },
        {
            "gameTime": "1 - 01:54",
            "label": "",
            "description": "Oscar (Chelsea) has a sight of goal and shoots towards the bottom left corner, but the goalkeeper makes a superb save. The referee signals a corner kick to Chelsea."
        },
        {
            "gameTime": "1 - 01:25",
            "label": "",
            "description": "A promising first time strike from inside the box by Joel Campbell (Arsenal), but his attempt goes just wide of the target."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Arsenal will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Mark Clattenburg was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. We saw a very balanced game over the 90 minutes. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "24/01/2016 - 19:00",
    "gameHomeTeam": "Arsenal",
    "gameScore": "0 - 1"
}