{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-03-11 - 22-45 Bayern Munich 7 - 0 Shakhtar Donetsk/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The hosts were largely in control of the game today. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        },
        {
            "gameTime": "2 - 46:06",
            "label": "whistle",
            "description": "That's it for today, William Collum has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 45:29",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) rises above the opponent's defence and heads a precise cross towards the bottom left corner. The effort, however, is blocked by Andrij Pyatov, who pulls off a stunning save! The ball is out of play and the linesman points at the corner flag. Corner to Bayern Munich."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) gets a shot from inside the penalty area and it flies just wide of the left post."
        },
        {
            "gameTime": "2 - 41:50",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Mario Gotze (Bayern Munich) was set free in the area by Jerome Boateng and he made no mistake with a lovely finish into the bottom left corner. 7:0."
        },
        {
            "gameTime": "2 - 41:20",
            "label": "corner",
            "description": "Darijo Srna (Shakhtar) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 41:07",
            "label": "",
            "description": "Luiz Adriano (Shakhtar) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. Shakhtar Donetsk win a corner."
        },
        {
            "gameTime": "2 - 38:42",
            "label": "attendance",
            "description": "The attendance for today's match is 70000."
        },
        {
            "gameTime": "2 - 38:01",
            "label": "",
            "description": "Vyacheslav Shevchuk (Shakhtar) lashes the ball towards goal from outside the penalty area, but it goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 37:05",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) misses a great chance! He latches on to a fine cross into the box, but his effort misses the right post by a whisker."
        },
        {
            "gameTime": "2 - 33:01",
            "label": "substitution",
            "description": "Douglas Costa goes off the pitch and Wellington Silva Sanches Agular (Shakhtar) comes on."
        },
        {
            "gameTime": "2 - 32:40",
            "label": "",
            "description": "Rodrigues Fred (Shakhtar) attempts to surprise the keeper with a shot from distance, but it lacks more accuracy and it goes high over the crossbar."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "soccer-ball",
            "description": "Goal! Bastian Schweinsteiger puts a cross into the box and finds Robert Lewandowski (Bayern Munich), who latches on to it and strikes the ball into the bottom left corner. He makes it 6:0."
        },
        {
            "gameTime": "2 - 28:23",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 25:15",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 24:01",
            "label": "substitution",
            "description": "Substitution. Alex Teixeira makes way for Ilson Pereira Dias Junior (Shakhtar)."
        },
        {
            "gameTime": "2 - 23:29",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 21:18",
            "label": "substitution",
            "description": "Pep Guardiola has decided to substitute Holger Badstuber and he is replaced by Dante (Bayern Munich)."
        },
        {
            "gameTime": "2 - 20:38",
            "label": "",
            "description": "Luiz Adriano (Shakhtar) tries to find the head of a teammate in the box but overhits the cross. The ball is off of the pitch and it's a goal kick for Bayern Munich."
        },
        {
            "gameTime": "2 - 17:58",
            "label": "soccer-ball",
            "description": "Holger Badstuber (Bayern Munich) latched on to a superb cross and knocked the ball past the goalkeeper with a fantastic header, bouncing in off the goalpost."
        },
        {
            "gameTime": "2 - 17:06",
            "label": "corner",
            "description": "Mario Gotze (Bayern Munich) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 16:34",
            "label": "",
            "description": "Andrij Pyatov can hear the fans clapping for his superb goalkeeping after he magnificently stops the close range effort from Juan Bernat (Bayern Munich). The ball would have probably ended up in the bottom left corner. The ball goes behind for a corner. Bayern Munich will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 13:59",
            "label": "substitution",
            "description": "The manager has been forced to make a substitution and the injured Franck Ribery limps off the pitch to be replaced by Juan Bernat (Bayern Munich)."
        },
        {
            "gameTime": "2 - 13:23",
            "label": "",
            "description": "Taras Stepanenko (Shakhtar) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 13:17",
            "label": "funfact",
            "description": "The ball possession at the moment is 66:34."
        },
        {
            "gameTime": "2 - 12:39",
            "label": "injury",
            "description": "The game is interrupted now, Taras Stepanenko (Shakhtar) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 10:35",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Douglas Costa (Shakhtar), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 09:55",
            "label": "",
            "description": "Wow, what an escape. Luiz Adriano (Shakhtar) has an effort from inside the box but it's brilliantly blocked. The ball goes out of play and Shakhtar Donetsk have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 06:10",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Thomas Muller (Bayern Munich) and he fired home from close range. The score is 4:0."
        },
        {
            "gameTime": "2 - 06:05",
            "label": "",
            "description": "A pass from Franck Ribery (Bayern Munich) is intercepted by Andrij Pyatov and the move breaks down."
        },
        {
            "gameTime": "2 - 05:10",
            "label": "",
            "description": "Darijo Srna (Shakhtar) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 05:05",
            "label": "",
            "description": "The linesman signals that Alex Teixeira (Shakhtar) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 03:55",
            "label": "soccer-ball",
            "description": "Goal! David Alaba displays great vision and sends a pass to Franck Ribery (Bayern Munich), who shows brilliant composure inside the box to bury the ball into the bottom right corner. The score is 3:0."
        },
        {
            "gameTime": "2 - 03:39",
            "label": "corner",
            "description": "Mario Gotze (Bayern Munich) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 02:54",
            "label": "injury",
            "description": "Darijo Srna (Shakhtar) is down injured and the referee stops play so that he can receive medical treatment."
        },
        {
            "gameTime": "2 - 02:39",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat. The ball goes out for a corner. Bayern Munich can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 01:39",
            "label": "",
            "description": "William Collum blows his whistle and it's Sebastian Rode (Bayern Munich) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "There was plenty of entertainment during the first 45 minutes. Hopefully more of the same in the second half. The host team has dominated the game in almost all aspects so far and their opponents have struggled to keep up. The home team makes a lot of passes and attempts to maintain possession, while the visitors look to counter attack."
        },
        {
            "gameTime": "1 - 46:11",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:32",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 25:4."
        },
        {
            "gameTime": "1 - 42:04",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) produced a promising shot low towards the middle of the goal after his wonderful solo run, but Andrij Pyatov thwarted him with a fabulous save and the score remains the same."
        },
        {
            "gameTime": "1 - 37:43",
            "label": "y-card",
            "description": "Jerome Boateng (Bayern Munich) will have to be careful for the rest of the match as he is shown a yellow card."
        },
        {
            "gameTime": "1 - 37:29",
            "label": "y-card",
            "description": "A yellow card for a tackle by Douglas Costa (Shakhtar). William Collum doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 35:15",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) makes space inside the box for a shot, but his effort goes just wide of the right post."
        },
        {
            "gameTime": "1 - 33:28",
            "label": "soccer-ball",
            "description": "Goal! Jerome Boateng (Bayern Munich) is quickest to react to the rebound and stabs the ball into the back of the net. It's 2:0."
        },
        {
            "gameTime": "1 - 33:25",
            "label": "",
            "description": "Andrij Pyatov pulls off a great save to deny Robert Lewandowski (Bayern Munich) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "1 - 31:49",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) wins the ball from the resulting corner but blazes it well over the bar. The ball goes out of play and Shakhtar Donetsk will have a goal kick."
        },
        {
            "gameTime": "1 - 31:37",
            "label": "corner",
            "description": "There's an opportunity for Mario Gotze (Bayern Munich) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 31:08",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) tries to send a low pass into the box, but it's blocked and cleared. The ball is out of play and Bayern Munich manage to earn a corner."
        },
        {
            "gameTime": "1 - 28:41",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) is well placed to meet a cross and sends a difficult header towards the middle of the goal, but the goalkeeper reacts well to stop the effort."
        },
        {
            "gameTime": "1 - 27:48",
            "label": "",
            "description": "Andrij Pyatov can hear the fans clapping for his superb goalkeeping after he magnificently stops the close range effort from Franck Ribery (Bayern Munich). The ball would have probably ended up in the middle of the net."
        },
        {
            "gameTime": "1 - 25:11",
            "label": "y-card",
            "description": "William Collum shows a yellow card to Holger Badstuber (Bayern Munich), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 23:59",
            "label": "corner",
            "description": "Mario Gotze (Bayern Munich) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 23:40",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) strikes a promising volley towards goal, but one of the defenders is quick enough to step in and make a crucial block. The referee points to the corner flag and Bayern Munich will take a corner."
        },
        {
            "gameTime": "1 - 23:04",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) latches on to a superb cross into the box and hits the right post with his header. A stroke of luck for the goalkeeper!"
        },
        {
            "gameTime": "1 - 21:15",
            "label": "corner",
            "description": "Franck Ribery (Bayern Munich) takes a short corner kick."
        },
        {
            "gameTime": "1 - 21:11",
            "label": "",
            "description": "The ball is cleared after David Alaba (Bayern Munich) attempted to dribble past an opposing player. The referee and his assistant both point at the corner flag. Bayern Munich will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 18:42",
            "label": "substitution",
            "description": "Pep Guardiola is forced to make a change. Arjen Robben is unable to continue due to injury, Sebastian Rode (Bayern Munich) comes on."
        },
        {
            "gameTime": "1 - 17:56",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) tries to send the ball in front of the goal, but the opposition's defence averts the threat. The ball is out of play. Bayern Munich will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 16:41",
            "label": "",
            "description": "The game is interrupted as Thomas Muller (Bayern Munich) is flagged offside."
        },
        {
            "gameTime": "1 - 14:55",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) strikes a volley towards goal, but one of the defenders blocks his effort."
        },
        {
            "gameTime": "1 - 14:26",
            "label": "corner",
            "description": "Mario Gotze (Bayern Munich) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 13:47",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) crosses the ball into the box, but one of the defending players averts the threat. Good work from Bayern Munich as they win a corner."
        },
        {
            "gameTime": "1 - 12:17",
            "label": "corner",
            "description": "The resulting corner from Mario Gotze (Bayern Munich) comes to nothing."
        },
        {
            "gameTime": "1 - 11:52",
            "label": "",
            "description": "A pass by Andrij Pyatov (Shakhtar) ends up in no man's land, and the attacking effort comes to an end. Bayern Munich earn a corner."
        },
        {
            "gameTime": "1 - 11:07",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) takes a shot after receiving a good pass, but his effort from the edge of the box goes just over the crossbar."
        },
        {
            "gameTime": "1 - 11:00",
            "label": "corner",
            "description": "Mario Gotze (Bayern Munich) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 10:13",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) sends the ball into the box from the side of the pitch, but his cross is blocked. Bayern Munich have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 08:25",
            "label": "substitution",
            "description": "Mircea Lucescu has decided to make a change due to the red card. Sergey Kryvtsov (Shakhtar) is brought on as a substitute for Taison."
        },
        {
            "gameTime": "1 - 07:48",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) breaks past challenges inside the box, but puts too much pace on his pass to Arjen Robben."
        },
        {
            "gameTime": "1 - 06:42",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) goes for goal, but his effort isn't precise at all and it flies yards wide of the right post."
        },
        {
            "gameTime": "1 - 06:10",
            "label": "corner",
            "description": "Darijo Srna (Shakhtar) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 06:02",
            "label": "",
            "description": "Luiz Adriano (Shakhtar) gets himself onto the end of the corner, but his header is blocked. The linesman makes the right call and Shakhtar Donetsk will have a corner."
        },
        {
            "gameTime": "1 - 05:21",
            "label": "corner",
            "description": "Darijo Srna (Shakhtar) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 05:06",
            "label": "",
            "description": "Luiz Adriano (Shakhtar) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Shakhtar Donetsk have a corner."
        },
        {
            "gameTime": "1 - 04:30",
            "label": "",
            "description": "Luiz Adriano (Shakhtar) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 03:48",
            "label": "soccer-ball",
            "description": "Thomas Muller (Bayern Munich) fires the penalty inside the left post."
        },
        {
            "gameTime": "1 - 03:00",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 02:50",
            "label": "r-card",
            "description": "Olexandr Kucher (Shakhtar) expresses his disappointment as he receives a straight red card."
        },
        {
            "gameTime": "1 - 02:24",
            "label": "penalty",
            "description": "Olexandr Kucher (Shakhtar) commits an ugly challenge. The referee sees it and immediately blows his whistle. PENALTY to Bayern Munich! Let's see who will take responsibility."
        },
        {
            "gameTime": "1 - 01:10",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) was trying to get to the ball but clattered into the legs of the opponent as well. William Collum blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Shakhtar Donetsk will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "William Collum is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The hosts were largely in control of the game today. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        }
    ],
    "gameAwayTeam": "Shakhtar Donetsk",
    "gameDate": "11/03/2015 - 22:45",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "7 - 0"
}