{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-12-04 - 17-00 Lazio 0 - 2 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:40",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. AS Roma had more of the game and were superior. Their manager will certainly be the happier of the two managers. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 49:38",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 49:00",
            "label": "y-card",
            "description": "Luca Banti shows a yellow card to Cristiano Lombardi (Lazio) for his blatant foul."
        },
        {
            "gameTime": "2 - 47:48",
            "label": "substitution",
            "description": "Here is a change. Bruno Peres is going off and Luciano Spalletti gives the last tactical orders to Juan Jesus (AS Roma)."
        },
        {
            "gameTime": "2 - 46:47",
            "label": "corner",
            "description": "Senad Lulic (Lazio) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 42:16",
            "label": "",
            "description": "The linesman raises his flag for offside before Cristiano Lombardi (Lazio) heads on."
        },
        {
            "gameTime": "2 - 39:42",
            "label": "substitution",
            "description": "That's the end of the game for Balde Keita, who is replaced by Ricardo Kishna (Lazio)."
        },
        {
            "gameTime": "2 - 38:41",
            "label": "y-card",
            "description": "Bruno Peres (AS Roma) is awarded a yellow card for his behaviour."
        },
        {
            "gameTime": "2 - 34:55",
            "label": "substitution",
            "description": "Simone Inzaghi has decided to make a change. Cristiano Lombardi (Lazio) replaces Lucas Biglia."
        },
        {
            "gameTime": "2 - 34:13",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Patric Gabarron (Lazio) replaces Dusan Basta."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "y-card",
            "description": "Marco Parolo (Lazio) has tested the patience of referee Luca Banti and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 31:45",
            "label": "soccer-ball",
            "description": "Radja Nainggolan (AS Roma) collected a pass and decided to shoot from about 27 metres out. He hit it perfectly! The ball zoomed around the goalkeeper and ended up in the bottom right corner."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "",
            "description": "Marco Parolo (Lazio) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the right post."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "",
            "description": "Sergej Milinkovic Savic (Lazio) blows a clear opportunity! He sends a rebound from close range narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "y-card",
            "description": "The referee had an easy decision to make. A yellow card is given to Senad Lulic (Lazio) for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 21:54",
            "label": "y-card",
            "description": "A yellow card is awarded to Kevin Strootman (AS Roma)."
        },
        {
            "gameTime": "2 - 21:01",
            "label": "r-card",
            "description": "Danilo Cataldi (Lazio) is given a red card for some unsportsmanlike conduct off the pitch. Luca Banti is doing a good job."
        },
        {
            "gameTime": "2 - 19:00",
            "label": "soccer-ball",
            "description": "Goal! It's a catastrophic error from the opponent which has gifted a chance to Kevin Strootman (AS Roma), who rolls the ball into the back of the net from close range. 0:1."
        },
        {
            "gameTime": "2 - 18:34",
            "label": "corner",
            "description": "Lucas Biglia (Lazio) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 17:50",
            "label": "",
            "description": "Ciro Immobile (Lazio) misses a good chance to score. An inch perfect cross into the box finds Ciro Immobile (Lazio) who rises for a header, but sends the ball well over the bar. Now Lazio have a corner."
        },
        {
            "gameTime": "2 - 16:31",
            "label": "corner",
            "description": "The resulting corner from Diego Perotti (AS Roma) comes to nothing."
        },
        {
            "gameTime": "2 - 15:59",
            "label": "",
            "description": "peeled away from his marker and got on the end of a cross inside the box. He attempted to head the ball towards the middle of the goal, but the keeper made a block. It will be a corner kick for AS Roma."
        },
        {
            "gameTime": "2 - 13:22",
            "label": "",
            "description": "Federico Marchetti was forced into action to thwart Emerson (AS Roma). He found himself some space after latching on to a pass and unleashed a shot to the bottom left corner but couldn't beat the keeper."
        },
        {
            "gameTime": "2 - 11:12",
            "label": "",
            "description": "The ball is cleared after Diego Perotti (AS Roma) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 09:39",
            "label": "",
            "description": "Felipe Anderson (Lazio) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it."
        },
        {
            "gameTime": "2 - 09:20",
            "label": "corner",
            "description": "The resulting corner from Lucas Biglia (Lazio) is cleared by the defence."
        },
        {
            "gameTime": "2 - 08:55",
            "label": "",
            "description": "Marco Parolo (Lazio) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. The ball goes behind for a corner. Lazio will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 07:46",
            "label": "",
            "description": "That was a brilliant piece of goalkeeping! Federico Marchetti dived superbly to block a header by Edin Dzeko (AS Roma) from around the penalty spot. His effort was directed straight towards the left post, but Federico Marchetti pulled off a remarkable save!"
        },
        {
            "gameTime": "2 - 06:00",
            "label": "y-card",
            "description": "Antonio Rudiger (AS Roma) goes into the book for a horrible tackle. A yellow card is necessary in this case."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "",
            "description": "Marco Parolo (Lazio) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Wojciech Szczesny was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 03:54",
            "label": "",
            "description": "Bruno Peres (AS Roma) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 47:13",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. The game is quite balanced. Both teams are attempting to play possession football."
        },
        {
            "gameTime": "1 - 47:12",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Luca Banti has ended it."
        },
        {
            "gameTime": "1 - 46:52",
            "label": "",
            "description": "Felipe Anderson (Lazio) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:35",
            "label": "",
            "description": "Diego Perotti (AS Roma) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 41:07",
            "label": "",
            "description": "Bruno Peres (AS Roma) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 38:18",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 36:28",
            "label": "injury",
            "description": "Konstantinos Manolas (AS Roma) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 34:23",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Emerson (AS Roma) takes it short."
        },
        {
            "gameTime": "1 - 34:09",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) races towards goal but the defender gets back well to make a challenge. The referee signals a corner kick to AS Roma."
        },
        {
            "gameTime": "1 - 30:17",
            "label": "",
            "description": "A free kick into the box, taken by Diego Perotti (AS Roma), is comfortably cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "y-card",
            "description": "Lucas Biglia (Lazio) is booked after bringing down an opponent. Luca Banti had an easy decision to make."
        },
        {
            "gameTime": "1 - 27:50",
            "label": "",
            "description": "Edin Dzeko (AS Roma) gets his head on the corner, but he sees his header blocked."
        },
        {
            "gameTime": "1 - 27:27",
            "label": "corner",
            "description": "Diego Perotti (AS Roma) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "1 - 27:09",
            "label": "",
            "description": "Diego Perotti (AS Roma) looks to break free, but an opposing player clears the ball away. AS Roma force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 24:07",
            "label": "",
            "description": "Diego Perotti (AS Roma) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play."
        },
        {
            "gameTime": "1 - 22:03",
            "label": "",
            "description": "Felipe Anderson (Lazio) commits a foul and Luca Banti immediately signals a free kick."
        },
        {
            "gameTime": "1 - 19:40",
            "label": "",
            "description": "Close! Ciro Immobile (Lazio) picks up the ball in space and from inside the penalty area sends a shot inches wide of the right post."
        },
        {
            "gameTime": "1 - 18:54",
            "label": "",
            "description": "Diego Perotti (AS Roma) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 18:35",
            "label": "",
            "description": "It seems like Emerson (AS Roma) is about to take a free kick. The goalkeeper has to be alert and careful how to position the defensive wall. This is the perfect distance for a direct shot."
        },
        {
            "gameTime": "1 - 18:05",
            "label": "",
            "description": "The referee blows his whistle as Felipe Anderson (Lazio) was too aggressive in his challenge. AS Roma have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 17:21",
            "label": "",
            "description": "Edin Dzeko (AS Roma) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 16:24",
            "label": "",
            "description": "Ciro Immobile (Lazio) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 13:49",
            "label": "",
            "description": "Felipe Anderson (Lazio) looks to break free, but his touch lets him down and he loses the ball. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "1 - 13:12",
            "label": "",
            "description": "Balde Keita (Lazio) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 12:18",
            "label": "",
            "description": "Ciro Immobile (Lazio) receives a well played pass inside the penalty area and shoots. He sends the ball into orbit. The ball is off of the pitch and it's a goal kick for AS Roma."
        },
        {
            "gameTime": "1 - 10:34",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 08:54",
            "label": "",
            "description": "Ciro Immobile (Lazio) collects a rebound a long way out and doesn't hesitate to release a goal bound hammer of a shot. His attempt is precise and low towards the middle of the target. It would have ended in the back of the net if it wasn't for Wojciech Szczesny and his nice save."
        },
        {
            "gameTime": "1 - 08:29",
            "label": "corner",
            "description": "Felipe Anderson (Lazio) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 08:10",
            "label": "",
            "description": "Wojciech Szczesny displays his ability to read the game and clears the danger after Balde Keita (Lazio) threatened to latch onto a through ball from just outside the box. The referee and one of his assistants signal for a corner kick to Lazio."
        },
        {
            "gameTime": "1 - 07:17",
            "label": "",
            "description": "Dusan Basta (Lazio) crosses the ball forward but it is intercepted."
        },
        {
            "gameTime": "1 - 06:53",
            "label": "",
            "description": "Ciro Immobile (Lazio) produces a lovely chip pass into the box, but one of the opposition players cuts it out. The referee and the linesman both signal a throw in for Lazio."
        },
        {
            "gameTime": "1 - 05:23",
            "label": "",
            "description": "Great touch by Sergej Milinkovic Savic (Lazio) as he latched on to a stunning crossfield cross, but he fails to find the target and sends the ball from long range well wide of the right post."
        },
        {
            "gameTime": "1 - 04:47",
            "label": "corner",
            "description": "Balde Keita (Lazio) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 04:30",
            "label": "",
            "description": "Balde Keita (Lazio) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. Lazio earn a corner."
        },
        {
            "gameTime": "1 - 04:10",
            "label": "corner",
            "description": "Felipe Anderson (Lazio) works the corner short."
        },
        {
            "gameTime": "1 - 03:49",
            "label": "",
            "description": "The ball is cleared after Felipe Anderson (Lazio) attempted to dribble past an opposing player. Good work from Lazio as they win a corner."
        },
        {
            "gameTime": "1 - 02:15",
            "label": "",
            "description": "AS Roma string together a series of short passes."
        },
        {
            "gameTime": "1 - 01:23",
            "label": "",
            "description": "The free kick into the penalty area from Daniele De Rossi (AS Roma) is cleared."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Luca Banti."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko from AS Roma will look to add to his goal tally, he has netted 12 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lazio have not lost for 3 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ciro Immobile is the leading goal scorer for Lazio with 9 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. AS Roma had more of the game and were superior. Their manager will certainly be the happier of the two managers. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "04/12/2016 - 17:00",
    "gameHomeTeam": "Lazio",
    "gameScore": "0 - 2"
}