{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2016-09-17 - 16-30 Dortmund 6 - 0 Darmstadt/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. Dortmund were better today and displayed masterful control and movement. The visitors couldn't keep pace with the hosts, who excelled in virtually every aspect of the game. They fully deserved their win."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 42:50",
            "label": "soccer-ball",
            "description": "Goal! Christian Pulisic puts a cross into the box and finds Emre Mor (Dortmund), who latches on to it and strikes the ball into the bottom left corner. He makes it 6:0."
        },
        {
            "gameTime": "2 - 41:30",
            "label": "attendance",
            "description": "The attendance is 81360."
        },
        {
            "gameTime": "2 - 40:50",
            "label": "",
            "description": "Dortmund keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "2 - 38:42",
            "label": "soccer-ball",
            "description": "Goal! Gonzalo Castro passes the ball to the feet of Sebastian Rode (Dortmund), who has an empty net in front of him and has no problems in tapping the ball in. 5:0."
        },
        {
            "gameTime": "2 - 34:50",
            "label": "corner",
            "description": "Leon Guwara (Darmstadt) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 34:30",
            "label": "",
            "description": "Sandro Sirigu (Darmstadt) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. Darmstadt force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 32:32",
            "label": "soccer-ball",
            "description": "Christian Pulisic provides Gonzalo Castro (Dortmund) with a nice pass inside the box. It allows him to finish with a low shot into the middle of the goal."
        },
        {
            "gameTime": "2 - 32:10",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 29:30",
            "label": "corner",
            "description": "Gonzalo Castro (Dortmund) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 29:10",
            "label": "",
            "description": "Emre Mor (Dortmund) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play and the linesman points at the corner flag. Corner to Dortmund."
        },
        {
            "gameTime": "2 - 26:15",
            "label": "corner",
            "description": "The resulting corner from Emre Mor (Dortmund) is cleared by the defence."
        },
        {
            "gameTime": "2 - 25:58",
            "label": "corner",
            "description": "Emre Mor (Dortmund) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance. Dortmund win a corner."
        },
        {
            "gameTime": "2 - 25:47",
            "label": "corner",
            "description": "The corner kick from Shinji Kagawa (Dortmund) is headed out of the penalty area by one of the defenders. Dortmund will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 25:30",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to make a change. Sebastian Rode (Dortmund) replaces Marcel Schmelzer."
        },
        {
            "gameTime": "2 - 25:27",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) races towards goal but the defender gets back well to make a challenge. The linesman makes the right call and Dortmund will have a corner."
        },
        {
            "gameTime": "2 - 24:45",
            "label": "substitution",
            "description": "The manager makes a subsitution with Antonio Mirko Colak (Darmstadt) coming on for Sven Schipplock."
        },
        {
            "gameTime": "2 - 24:15",
            "label": "",
            "description": "Emre Mor (Dortmund) strikes from the edge of the box after a brilliant solo effort. The ball heads towards the roof of the net, but the goalkeeper denies him with a fantastic save."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) attempted to send a defence splitting pass into space where Emre Mor was lurking. It could have put him one on one with the goalkeeper, but one of the defending players somehow manages to avert the threat."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "",
            "description": "The Dortmund players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 18:15",
            "label": "substitution",
            "description": "Thomas Tuchel prepares a substitution. Ousmane Dembele is replaced by Emre Mor (Dortmund)."
        },
        {
            "gameTime": "2 - 17:54",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Shinji Kagawa (Dortmund) comes onto the pitch so that Raphael Guerreiro can be given a rest."
        },
        {
            "gameTime": "2 - 11:50",
            "label": "yr-card",
            "description": "Peter Niemeyer (Darmstadt) should have been more careful. He commits a bad foul, receives his second yellow card and is sent off!"
        },
        {
            "gameTime": "2 - 08:57",
            "label": "soccer-ball",
            "description": "Goal! Christian Pulisic (Dortmund) fires the rebound into the middle of the goal after the ball breaks to him in the box. The score is 3:0."
        },
        {
            "gameTime": "2 - 08:50",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) sends a pass into the penalty area, but the opponent manages to cut it out."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "",
            "description": "Roman Bezjak (Darmstadt) is unlucky with a goal bound effort from the edge of the box. A fortuitous save from Roman Burki stops the ball from going into the middle of the goal."
        },
        {
            "gameTime": "2 - 04:50",
            "label": "corner",
            "description": "The corner from Leon Guwara (Darmstadt) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 04:29",
            "label": "y-card",
            "description": "The foul by Florian Jungwirth (Darmstadt) is worthy of a card and a yellow is duly shown by Benjamin Brand."
        },
        {
            "gameTime": "2 - 02:57",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Adrian Ramos (Dortmund) and he fired home from close range. The score is 2:0."
        },
        {
            "gameTime": "2 - 01:10",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 00:35",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) takes the corner but it's cleared. The referee and his assistant both point at the corner flag. Dortmund will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 00:20",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. Dortmund have a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Norbert Meier has decided to make a substitution during the half time break. Roman Bezjak (Darmstadt) comes on the pitch for Mario Vrancic."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. It was a fairly one sided opening 45 minutes, with Dortmund much the better side better so far. The visitors have been very flat and lacked creativity in their attack. Let's see if they change something in the second period."
        },
        {
            "gameTime": "1 - 45:09",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 43:58",
            "label": "y-card",
            "description": "Peter Niemeyer (Darmstadt) sees a yellow card from Benjamin Brand after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "Dortmund enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 41:00",
            "label": "y-card",
            "description": "Benjamin Brand shows a yellow card to Immanuel Hohn (Darmstadt), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 39:52",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) releases a promising shot from the set piece from around 23 metres out, driving the ball towards the middle of the goal. The goalkeeper, however, makes a save and denies him."
        },
        {
            "gameTime": "1 - 39:03",
            "label": "",
            "description": "Peter Niemeyer (Darmstadt) brings his opponent down. Benjamin Brand has a clear sight of it and blows his whistle for a foul. That's a free kick to Dortmund."
        },
        {
            "gameTime": "1 - 38:33",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Anis Ben Hatira as he is replaced by Sandro Sirigu (Darmstadt)."
        },
        {
            "gameTime": "1 - 38:06",
            "label": "",
            "description": "Flag goes up against Adrian Ramos (Dortmund) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 36:04",
            "label": "corner",
            "description": "Dortmund take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 35:50",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) looks to break free, but an opposing player clears the ball away. The ball is out of play and Dortmund manage to earn a corner."
        },
        {
            "gameTime": "1 - 32:23",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) smashes the ball towards goal from the edge of the penalty box, but it fails to bother the goalkeeper as it hits the defensive wall."
        },
        {
            "gameTime": "1 - 31:32",
            "label": "y-card",
            "description": "A yellow card for a tackle by Alexander Milosevic (Darmstadt). Benjamin Brand doesn't hesitate at all to make this decision. Dortmund earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 29:28",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 28:53",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) fails to send a pass into the box as his effort is cut out. The ball is out of play. Dortmund win a corner kick."
        },
        {
            "gameTime": "1 - 27:10",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) is picked out by one of his teammates with a great cross, but his poor control allows the defence to clear and avert the threat."
        },
        {
            "gameTime": "1 - 24:30",
            "label": "",
            "description": "Darmstadt players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 21:29",
            "label": "y-card",
            "description": "Benjamin Brand shows the yellow card to Anis Ben Hatira (Darmstadt) for a heavy challenge."
        },
        {
            "gameTime": "1 - 20:18",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 19:42",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) receives a low pass just outside the box and unleashes a fine strike towards the roof of the net. Michael Esser pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed. Dortmund will take a corner kick."
        },
        {
            "gameTime": "1 - 18:51",
            "label": "corner",
            "description": "Ousmane Dembele (Dortmund) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 18:46",
            "label": "",
            "description": "Adrian Ramos (Dortmund) produces a dangerous low pass into the penalty area, but the defence manage to cut it out. Now Dortmund have a corner."
        },
        {
            "gameTime": "1 - 17:43",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 15:20",
            "label": "",
            "description": "Matthias Ginter (Dortmund) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 14:43",
            "label": "",
            "description": "Dortmund players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "1 - 13:31",
            "label": "",
            "description": "What a chance that is! Adrian Ramos (Dortmund) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 12:28",
            "label": "",
            "description": "A pass from Christian Pulisic (Dortmund) is intercepted by Michael Esser and the move breaks down."
        },
        {
            "gameTime": "1 - 11:25",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "1 - 10:50",
            "label": "",
            "description": "The referee blows his whistle as Mario Vrancic (Darmstadt) was too aggressive in his challenge. Dortmund will take a free kick."
        },
        {
            "gameTime": "1 - 09:05",
            "label": "",
            "description": "Adrian Ramos (Dortmund) leaps highest in the penalty area to get on the end of a cross from the set piece, and he produces a promising goal bound header towards the middle of the goal, but Michael Esser pulls off a comfortable save to deny him."
        },
        {
            "gameTime": "1 - 08:40",
            "label": "",
            "description": "A player from Darmstadt brings down an opponent and commits a foul. Dortmund get a free kick."
        },
        {
            "gameTime": "1 - 06:29",
            "label": "soccer-ball",
            "description": "Goal! Gonzalo Castro (Dortmund) finishes from close range with an easy finish and he makes it 1:0. He was ably assisted there by Ousmane Dembele."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "",
            "description": "Marcel Heller (Darmstadt) swings a cross into the box, but it's far too close to Roman Burki, who smothers the ball."
        },
        {
            "gameTime": "1 - 04:54",
            "label": "",
            "description": "Florian Jungwirth (Darmstadt) sends the ball into the penalty area from a throw in as if it's a corner kick."
        },
        {
            "gameTime": "1 - 03:00",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) goes for goal, but his effort isn't precise at all and it flies yards wide of the right post."
        },
        {
            "gameTime": "1 - 02:21",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Raphael Guerreiro (Dortmund), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 01:57",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) fails to find any of his teammates inside the box as his pass is blocked. The ball goes out of play. Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 01:30",
            "label": "",
            "description": "The Dortmund players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Benjamin Brand is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 4:1 in the last game between Dortmund and B. Monchengladbach."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund will miss a few players for this clash: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Darmstadt will miss a few players for this clash: Jan Rosenthal (Achilles Tendon Injury), Victor Obinna (Suspended)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. Dortmund were better today and displayed masterful control and movement. The visitors couldn't keep pace with the hosts, who excelled in virtually every aspect of the game. They fully deserved their win."
        }
    ],
    "gameAwayTeam": "Darmstadt",
    "gameDate": "17/09/2016 - 16:30",
    "gameHomeTeam": "Dortmund",
    "gameScore": "6 - 0"
}