{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-05-05 - 21-45 Juventus 2 - 1 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. It was an even match on the whole, with both sides enjoying spells in the ascendancy. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 48:10",
            "label": "whistle",
            "description": "Martin Atkinson is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 48:05",
            "label": "",
            "description": "Toni Kroos (Real Madrid) whips a long ball in from the free kick which is intercepted by Gianluigi Buffon."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "",
            "description": "Roberto Pereyra (Juventus) probably handled the ball. Real Madrid are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 47:41",
            "label": "",
            "description": "Toni Kroos (Real Madrid) sends over a free kick from long range but the defence is alert."
        },
        {
            "gameTime": "2 - 47:07",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Giorgio Chiellini (Juventus) was quite harsh and Martin Atkinson didn't hesitate to show him a yellow card. There is a free kick near the sideline to Real Madrid."
        },
        {
            "gameTime": "2 - 46:14",
            "label": "",
            "description": "Fernando Llorente (Juventus) creates himself some space inside the goalmouth and connects with the resulting free kick. His header would have probably ended up in the middle of the goal, but Iker Casillas pulls off a superb reflex save to thwart him."
        },
        {
            "gameTime": "2 - 45:32",
            "label": "",
            "description": "Dangerous play by Sergio Ramos (Real Madrid). Martin Atkinson blows his whistle for a foul. Juventus are awarded the free kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him."
        },
        {
            "gameTime": "2 - 44:22",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 43:52",
            "label": "",
            "description": "Andrea Pirlo (Juventus) sends a long ball in, but Iker Casillas comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 41:41",
            "label": "",
            "description": "Fernando Llorente (Juventus) tries to send a low pass into the box, but it's blocked and cleared."
        },
        {
            "gameTime": "2 - 40:51",
            "label": "substitution",
            "description": "Carlo Ancelotti has decided to make a change. Jese (Real Madrid) replaces Gareth Bale."
        },
        {
            "gameTime": "2 - 40:16",
            "label": "substitution",
            "description": "Here comes a substitution. Carlos Tevez is given a rest as he is replaced by Roberto Pereyra (Juventus)."
        },
        {
            "gameTime": "2 - 39:34",
            "label": "y-card",
            "description": "James Rodriguez (Real Madrid) is booked after bringing down an opponent. Martin Atkinson had an easy decision to make."
        },
        {
            "gameTime": "2 - 38:19",
            "label": "",
            "description": "Marcelo (Real Madrid) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 36:43",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Real Madrid."
        },
        {
            "gameTime": "2 - 36:00",
            "label": "",
            "description": "Chicharito (Real Madrid) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 33:09",
            "label": "corner",
            "description": "The resulting corner from Toni Kroos (Real Madrid) is cleared."
        },
        {
            "gameTime": "2 - 32:40",
            "label": "substitution",
            "description": "The game has come to an end for Alvaro Morata. He has contributed as much as he could today. He will be replaced by the fresh legs of Fernando Llorente (Juventus)."
        },
        {
            "gameTime": "2 - 32:06",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) wins some space for himself around the penalty spot and manages to produce a promising header. One of the defenders stops his effort before it gets to the goalkeeper, making him redundant. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 31:28",
            "label": "",
            "description": "James Rodriguez (Real Madrid) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 29:44",
            "label": "y-card",
            "description": "Martin Atkinson shows a yellow card to Daniel Carvajal (Real Madrid), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 28:43",
            "label": "",
            "description": "Toni Kroos (Real Madrid) gets the ball from a rebound and shoots from long range, but sends the ball high over the crossbar. The goalkeeper doesn't have to worry about this one. Very poor attempt."
        },
        {
            "gameTime": "2 - 28:30",
            "label": "",
            "description": "Gareth Bale (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 27:56",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball is behind the touchline and Juventus will take a throw in."
        },
        {
            "gameTime": "2 - 27:09",
            "label": "",
            "description": "Rough tackle by Cristiano Ronaldo (Real Madrid). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 26:26",
            "label": "",
            "description": "Chicharito (Real Madrid) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "2 - 25:38",
            "label": "",
            "description": "Patrice Evra (Juventus) was too forceful with his tackle and Martin Atkinson interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 24:28",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "",
            "description": "Giorgio Chiellini (Juventus) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 20:48",
            "label": "injury",
            "description": "Giorgio Chiellini (Juventus) is asking for medical treatment after picking up an injury."
        },
        {
            "gameTime": "2 - 20:22",
            "label": "",
            "description": "The cross into the penalty area from Gareth Bale (Real Madrid) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "2 - 18:59",
            "label": "substitution",
            "description": "Massimiliano Allegri has decided to substitute Stefano Sturaro and he is replaced by Andrea Barzagli (Juventus)."
        },
        {
            "gameTime": "2 - 18:46",
            "label": "",
            "description": "Chicharito (Real Madrid) takes the chance to have an effort at goal from inside the box but misses to the left of the target."
        },
        {
            "gameTime": "2 - 17:45",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Isco leaves the pitch and Chicharito (Real Madrid) comes on."
        },
        {
            "gameTime": "2 - 16:47",
            "label": "",
            "description": "Stefano Sturaro (Juventus) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "2 - 15:24",
            "label": "corner",
            "description": "Andrea Pirlo (Juventus) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 14:50",
            "label": "",
            "description": "Patrice Evra (Juventus) produces a dangerous low pass into the penalty area, but the defence manage to cut it out. Juventus force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 13:14",
            "label": "",
            "description": "Arturo Vidal (Juventus) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 12:03",
            "label": "soccer-ball",
            "description": "Carlos Tevez (Juventus) sends Iker Casillas the wrong way and fires the penalty into the middle of the goal!"
        },
        {
            "gameTime": "2 - 11:55",
            "label": "",
            "description": "Carlos Tevez (Juventus) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 11:34",
            "label": "y-card",
            "description": "A yellow card for a tackle by Marcelo (Real Madrid). Martin Atkinson doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 10:58",
            "label": "y-card",
            "description": "Arturo Vidal (Juventus) kept talking out of turn to the referee until Martin Atkinson lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "2 - 10:40",
            "label": "penalty",
            "description": "Martin Atkinson blows the whistle, Daniel Carvajal (Real Madrid) is penalised for a foul. Joy for one side, despair for the other as the referee gives a penalty to Juventus!"
        },
        {
            "gameTime": "2 - 10:10",
            "label": "",
            "description": "Marcelo (Real Madrid) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 09:59",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 09:38",
            "label": "",
            "description": "Toni Kroos (Real Madrid) takes the free kick from a long way out but the defender manages to get it clear. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 08:51",
            "label": "",
            "description": "Stefano Sturaro (Juventus) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul. Real Madrid have a free kick."
        },
        {
            "gameTime": "2 - 07:51",
            "label": "",
            "description": "Carlos Tevez (Juventus) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 07:00",
            "label": "",
            "description": "The referee blows his whistle as Daniel Carvajal (Real Madrid) was too aggressive in his challenge."
        },
        {
            "gameTime": "2 - 06:22",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) is penalised for holding. Martin Atkinson signals a set piece."
        },
        {
            "gameTime": "2 - 05:56",
            "label": "",
            "description": "Leonardo Bonucci (Juventus) commits a rough foul. Martin Atkinson stops the game and makes a call."
        },
        {
            "gameTime": "2 - 03:58",
            "label": "",
            "description": "Andrea Pirlo (Juventus) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 03:03",
            "label": "",
            "description": "Marcelo (Real Madrid) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "2 - 02:07",
            "label": "",
            "description": "Iker Casillas blocks Carlos Tevez (Juventus)'s effort from the edge of the box."
        },
        {
            "gameTime": "2 - 00:55",
            "label": "y-card",
            "description": "Carlos Tevez (Juventus) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. Even first half from both sides, and they've both had chances. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 46:13",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:38",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 43:43",
            "label": "",
            "description": "Alvaro Morata (Juventus) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 42:01",
            "label": "",
            "description": "The referee blows his whistle after Leonardo Bonucci (Juventus) does a good impression of a basketball player and handles the ball."
        },
        {
            "gameTime": "1 - 41:29",
            "label": "",
            "description": "Marcelo (Real Madrid) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Martin Atkinson with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 41:00",
            "label": "",
            "description": "Close! Marcelo (Real Madrid) is a whisker away from finishing off the move he started. His close range effort flies just over the bar."
        },
        {
            "gameTime": "1 - 40:40",
            "label": "",
            "description": "What a chance that is! James Rodriguez (Real Madrid) leaps high to meet a lofted pass inside the six yard box, but his header crashes off the crossbar!"
        },
        {
            "gameTime": "1 - 39:55",
            "label": "",
            "description": "The Real Madrid players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 38:23",
            "label": "",
            "description": "A pass by Patrice Evra (Juventus) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 37:00",
            "label": "",
            "description": "Claudio Marchisio (Juventus) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "1 - 36:45",
            "label": "",
            "description": "Isco (Real Madrid) gives away a foul for a clumsy challenge. Referee Martin Atkinson saw the whole situation."
        },
        {
            "gameTime": "1 - 36:00",
            "label": "funfact",
            "description": "The fouls committed statistics – 20:13."
        },
        {
            "gameTime": "1 - 35:15",
            "label": "",
            "description": "Isco (Real Madrid) was too fierce in his attempt to get the ball from his opponent and Martin Atkinson blows for a foul."
        },
        {
            "gameTime": "1 - 34:38",
            "label": "",
            "description": "Carlos Tevez (Juventus) is caught offside!"
        },
        {
            "gameTime": "1 - 33:49",
            "label": "",
            "description": "Claudio Marchisio (Juventus) was close to scoring after he unleashed a powerful shot which went a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "",
            "description": "Andrea Pirlo (Juventus) attempts a long crossfield pass, but the defence does well to intercept the ball."
        },
        {
            "gameTime": "1 - 31:44",
            "label": "",
            "description": "Claudio Marchisio (Juventus) pulls the jersey of one of the opposition players and Martin Atkinson blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 29:52",
            "label": "",
            "description": "A cross into the box from Isco (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 29:29",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "",
            "description": "James Rodriguez (Real Madrid) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee points to the corner flag. It's a corner to Real Madrid."
        },
        {
            "gameTime": "1 - 26:39",
            "label": "soccer-ball",
            "description": "Goal! James Rodriguez plays the ball into the area and Cristiano Ronaldo (Real Madrid) gets on the end of it to glance a header into the back of the net. He makes it 1:1."
        },
        {
            "gameTime": "1 - 25:47",
            "label": "",
            "description": "Real Madrid enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 23:56",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) bursts into the penalty area with the ball at his feet after a wonderful individual effort that left fans breathless and in awe. However, he sends the ball in a completely different direction than intended, well wide of the target."
        },
        {
            "gameTime": "1 - 22:59",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the right post."
        },
        {
            "gameTime": "1 - 22:19",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a cross into the box, but Gianluigi Buffon comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 21:40",
            "label": "",
            "description": "Arturo Vidal (Juventus) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 19:39",
            "label": "",
            "description": "Raphael Varane (Real Madrid) climbs high to connect with a cross near the penalty spot but plants a header high over the bar."
        },
        {
            "gameTime": "1 - 19:23",
            "label": "",
            "description": "James Rodriguez (Real Madrid) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "1 - 18:52",
            "label": "",
            "description": "Claudio Marchisio (Juventus) makes a rough challenge and the referee blows for a foul. Real Madrid have a free kick."
        },
        {
            "gameTime": "1 - 18:00",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Carlos Tevez (Juventus) sacrificed accuracy for power, and thus his attempt went well wide of the left post."
        },
        {
            "gameTime": "1 - 17:41",
            "label": "",
            "description": "The linesman signals that Stefano Sturaro (Juventus) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 16:32",
            "label": "",
            "description": "Martin Atkinson couldn't ignore the rough tackle by Arturo Vidal (Juventus) and blew his whistle."
        },
        {
            "gameTime": "1 - 14:45",
            "label": "",
            "description": "Isco (Real Madrid) slams the ball towards the middle of the goal, but it fails to surprise Gianluigi Buffon and he's equal to it."
        },
        {
            "gameTime": "1 - 13:52",
            "label": "",
            "description": "A crossfield pass from Patrice Evra (Juventus) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 12:16",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 11:49",
            "label": "",
            "description": "Toni Kroos (Real Madrid) produces a long range cannon of a shot after a nice pass. The ball heads towards the bottom left corner, but is stopped by a great save from Gianluigi Buffon and the score remains the same. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "1 - 11:18",
            "label": "corner",
            "description": "The resulting corner from James Rodriguez (Real Madrid) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 10:52",
            "label": "",
            "description": "James Rodriguez (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "1 - 10:00",
            "label": "",
            "description": "Marcelo (Real Madrid) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 07:55",
            "label": "soccer-ball",
            "description": "Alvaro Morata (Juventus) finds his way to a rebound right in front of goal and finishes with unerring precision into the back of the net. The assistance goes to Carlos Tevez. It's 0:0."
        },
        {
            "gameTime": "1 - 07:50",
            "label": "",
            "description": "Iker Casillas was forced into action to thwart Carlos Tevez (Juventus). He found himself some space after latching on to a pass and unleashed a shot to the bottom left corner but couldn't beat the keeper."
        },
        {
            "gameTime": "1 - 06:50",
            "label": "",
            "description": "Alvaro Morata (Juventus) picks up a pass, lines up a shot and strikes from 25 metres out, but Iker Casillas thwarts the effort which is headed to the middle of the goal."
        },
        {
            "gameTime": "1 - 05:53",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to produce a decent enough free kick for a player of his ability and the only target that he finds is the wall of defenders in front of him."
        },
        {
            "gameTime": "1 - 05:00",
            "label": "y-card",
            "description": "Leonardo Bonucci (Juventus) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Martin Atkinson didn't think twice about pulling it out of his pocket. Real Madrid earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 04:26",
            "label": "",
            "description": "Marcelo (Real Madrid) swings a cross into the box, but it's far too close to Gianluigi Buffon, who smothers the ball."
        },
        {
            "gameTime": "1 - 02:58",
            "label": "",
            "description": "Stefano Sturaro (Juventus) latches on to an accurate pass into the box and immediately unleashes a low shot goalwards. His effort is well saved by the keeper."
        },
        {
            "gameTime": "1 - 02:11",
            "label": "",
            "description": "James Rodriguez (Real Madrid) whips a long ball in from the free kick which is intercepted by Gianluigi Buffon."
        },
        {
            "gameTime": "1 - 01:34",
            "label": "",
            "description": "Martin Atkinson has a clear sight and sees a foul from Arturo Vidal (Juventus). Real Madrid have a free kick."
        },
        {
            "gameTime": "1 - 00:58",
            "label": "",
            "description": "Good clearance! Arturo Vidal (Juventus) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Juventus will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Martin Atkinson."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. It was an even match on the whole, with both sides enjoying spells in the ascendancy. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "05/05/2015 - 21:45",
    "gameHomeTeam": "Juventus",
    "gameScore": "2 - 1"
}