{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-04-21 - 21-45 Barcelona 2 - 0 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side were dominant and dictated the tempo of the game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 46:55",
            "label": "",
            "description": "Lionel Messi (Barcelona) unleashes a decent effort from just outside the box which goes narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 45:24",
            "label": "",
            "description": "Lionel Messi (Barcelona) is penalised for a foul. Svein Moen had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:21",
            "label": "",
            "description": "Ezequiel Lavezzi (Paris SG) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Marc Andre ter Stegen."
        },
        {
            "gameTime": "2 - 42:15",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety."
        },
        {
            "gameTime": "2 - 40:33",
            "label": "",
            "description": "Lucas (Paris SG) receives a reproachful look from Javier Pastore. He latches on to his pass, but the effort from the edge of the box sails high over the crossbar."
        },
        {
            "gameTime": "2 - 39:29",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 11:8."
        },
        {
            "gameTime": "2 - 37:38",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Ezequiel Lavezzi (Paris SG), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 37:27",
            "label": "",
            "description": "The ball is cleared after Javier Pastore (Paris SG) attempted to dribble past an opposing player. Paris SG force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 36:54",
            "label": "",
            "description": "Lucas (Paris SG) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "2 - 36:13",
            "label": "",
            "description": "Neymar (Barcelona) tries to send a low pass into the box, but it's blocked and cleared."
        },
        {
            "gameTime": "2 - 35:28",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) gives away a foul for a clumsy challenge. Referee Svein Moen saw the whole situation."
        },
        {
            "gameTime": "2 - 34:31",
            "label": "substitution",
            "description": "The substitution is prepared. Adrien Rabiot (Paris SG) joins the action as a substitute, replacing Blaise Matuidi."
        },
        {
            "gameTime": "2 - 34:16",
            "label": "substitution",
            "description": "Substitution. Ezequiel Lavezzi (Paris SG) on for Edinson Cavani."
        },
        {
            "gameTime": "2 - 33:46",
            "label": "",
            "description": "The linesman raises his flag. Edinson Cavani (Paris SG) is adjudged offside."
        },
        {
            "gameTime": "2 - 32:14",
            "label": "attendance",
            "description": "The attendance is 84477."
        },
        {
            "gameTime": "2 - 30:14",
            "label": "corner",
            "description": "Neymar (Barcelona) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 30:04",
            "label": "",
            "description": "Neymar (Barcelona) sends a sweet pass into the penalty area, but one of the defenders averts the danger. The ball goes out of play. Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "2 - 29:21",
            "label": "substitution",
            "description": "That's the end of the game for Luis Suarez, who is replaced by Pedro (Barcelona)."
        },
        {
            "gameTime": "2 - 28:49",
            "label": "",
            "description": "Flag up against Blaise Matuidi (Paris SG). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 27:30",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) produces a ferocious strike from the edge of the box. His dangerous effort towards the middle of the goal is blocked by Marc Andre ter Stegen, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "2 - 26:11",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes a short corner kick."
        },
        {
            "gameTime": "2 - 25:55",
            "label": "",
            "description": "Dani Alves (Barcelona) delivers a promising cross into the box, but it's cleared. The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "2 - 25:38",
            "label": "",
            "description": "A clumsy foul by Blaise Matuidi (Paris SG) and Svein Moen blows his whistle."
        },
        {
            "gameTime": "2 - 24:31",
            "label": "",
            "description": "Javier Pastore (Paris SG) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "2 - 23:13",
            "label": "",
            "description": "Xavi (Barcelona) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "2 - 22:33",
            "label": "",
            "description": "Marco Verratti (Paris SG) was holding his opponent and can be glad he didn't receive a yellow card. Barcelona earn a free kick."
        },
        {
            "gameTime": "2 - 21:00",
            "label": "substitution",
            "description": "The substitution has been made. Lucas (Paris SG) has replaced Yohan Cabaye."
        },
        {
            "gameTime": "2 - 20:33",
            "label": "",
            "description": "Luis Suarez (Barcelona) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "2 - 18:55",
            "label": "",
            "description": "Javier Pastore (Paris SG) attempts to create a scoring opportunity with a wonderful long ball, but his pass is blocked."
        },
        {
            "gameTime": "2 - 17:57",
            "label": "",
            "description": "Luis Suarez (Barcelona) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "",
            "description": "Dani Alves (Barcelona) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 16:00",
            "label": "",
            "description": "Marco Verratti (Paris SG) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "2 - 15:21",
            "label": "",
            "description": "Neymar (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 13:49",
            "label": "",
            "description": "Zlatan Ibrahimovic sprays a wonderful pass out to Marco Verratti (Paris SG), who cannot get enough power or direction to cause Marc Andre ter Stegen problems and the goalkeeper is able to watch the ball go just wide of the left post."
        },
        {
            "gameTime": "2 - 10:56",
            "label": "",
            "description": "Javier Pastore (Paris SG) sends a teasing cross into the area, but Marc Andre ter Stegen intercepts the ball."
        },
        {
            "gameTime": "2 - 09:34",
            "label": "substitution",
            "description": "Substitution. Sergi Roberto (Barcelona) has come on for Sergio Busquets."
        },
        {
            "gameTime": "2 - 09:15",
            "label": "",
            "description": "Marco Verratti (Paris SG) brings down his opponent with a very late tackle."
        },
        {
            "gameTime": "2 - 08:01",
            "label": "",
            "description": "Lionel Messi (Barcelona) sends a pass into the penalty area, but the opponent manages to cut it out."
        },
        {
            "gameTime": "2 - 07:49",
            "label": "",
            "description": "Yohan Cabaye (Paris SG) commits a rough challenge and Svein Moen blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 06:50",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "2 - 06:14",
            "label": "",
            "description": "Lionel Messi (Barcelona) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Salvatore Sirigu was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 05:45",
            "label": "",
            "description": "Jordi Alba (Barcelona) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 04:33",
            "label": "",
            "description": "Yohan Cabaye (Paris SG) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the right post."
        },
        {
            "gameTime": "2 - 03:28",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) picks up a pass, lines up a shot and strikes from 25 metres out, but Salvatore Sirigu thwarts the effort which is headed low to the middle of the goal."
        },
        {
            "gameTime": "2 - 01:48",
            "label": "",
            "description": "The ball is cleared after Jordi Alba (Barcelona) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 00:42",
            "label": "",
            "description": "Yohan Cabaye (Paris SG) sends a chip pass into the box, but Marc Andre ter Stegen is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Luis Enrique decided to make a change. Andres Iniesta is replaced by Xavi (Barcelona)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Svein Moen starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "There has been no time for the supporters to get bored during an eventful opening 45 minutes. Both teams provided some breathtaking moments. The hosts are enjoying a clear advantage over the opposition. The home side are keeping possession of the ball with some short passes, while the visitors are waiting to open up their defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:00",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Dani Alves (Barcelona) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 42:47",
            "label": "corner",
            "description": "The corner kick from Ivan Rakitic (Barcelona) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "Dani Alves (Barcelona) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 41:08",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Maxwell (Paris SG), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "1 - 40:44",
            "label": "",
            "description": "Gerard Pique (Barcelona) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "1 - 39:33",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 39:07",
            "label": "",
            "description": "Gerard Pique (Barcelona) outjumps his marker inside the box and heads the resulting corner way wide of the right post."
        },
        {
            "gameTime": "1 - 38:30",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 38:14",
            "label": "",
            "description": "Neymar (Barcelona) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net. Good work from Barcelona as they win a corner."
        },
        {
            "gameTime": "1 - 36:52",
            "label": "",
            "description": "Marquinhos (Paris SG) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 35:30",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 33:49",
            "label": "soccer-ball",
            "description": "Dani Alves showcases his great technique and produces a beautiful lofted cross into the box. Neymar (Barcelona) gets onto the scoresheet by heading inside the left post. It's 2:0."
        },
        {
            "gameTime": "1 - 32:34",
            "label": "",
            "description": "Neymar (Barcelona) produces a lovely chip pass into the box, but one of the opposition players cuts it out."
        },
        {
            "gameTime": "1 - 31:44",
            "label": "",
            "description": "Lionel Messi (Barcelona) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 30:59",
            "label": "",
            "description": "Javier Pastore (Paris SG) was trying to get to the ball but clattered into the legs of the opponent as well. Svein Moen blows his whistle for an infringement. It's a free kick to Barcelona, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 29:27",
            "label": "",
            "description": "Neymar (Barcelona) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "1 - 28:08",
            "label": "",
            "description": "Sergio Busquets (Barcelona) is unable to feed a through ball into the path of his teammates."
        },
        {
            "gameTime": "1 - 26:39",
            "label": "",
            "description": "Luis Suarez (Barcelona) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 25:39",
            "label": "",
            "description": "Svein Moen blows for a foul after Dani Alves (Barcelona) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 24:56",
            "label": "",
            "description": "Neymar (Barcelona) tries to nod in the rebound, but his effort is saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 23:48",
            "label": "",
            "description": "A dangerous attempt from Dani Alves (Barcelona) was aimed towards the roof of the net, but Salvatore Sirigu pulls off a superb save and stops this one."
        },
        {
            "gameTime": "1 - 22:25",
            "label": "",
            "description": "Close! Lionel Messi (Barcelona) unleashes a rocket of a shot from the edge of the box and his shot flies just a few inches over the crossbar."
        },
        {
            "gameTime": "1 - 21:21",
            "label": "",
            "description": "Andres Iniesta (Barcelona) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort."
        },
        {
            "gameTime": "1 - 20:43",
            "label": "",
            "description": "Gerard Pique (Barcelona) plays an extraordinary diagonal pass and Jordi Alba darts into free space to control the ball."
        },
        {
            "gameTime": "1 - 20:11",
            "label": "",
            "description": "Javier Pastore (Paris SG) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 18:55",
            "label": "",
            "description": "Yohan Cabaye (Paris SG) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 18:06",
            "label": "",
            "description": "A raking crossfield pass from Lionel Messi (Barcelona) lacks accuracy and the opposition gain possession."
        },
        {
            "gameTime": "1 - 17:19",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Zlatan Ibrahimovic (Paris SG) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "1 - 15:43",
            "label": "",
            "description": "Maxwell (Paris SG) sends a cross into the box, but Marc Andre ter Stegen comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 15:23",
            "label": "",
            "description": "Andres Iniesta (Barcelona) makes an overly aggressive challenge and Svein Moen blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 14:37",
            "label": "",
            "description": "Barcelona are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 13:29",
            "label": "soccer-ball",
            "description": "Goal! Andres Iniesta displays great vision and sends a pass to Neymar (Barcelona), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 1:0."
        },
        {
            "gameTime": "1 - 12:22",
            "label": "",
            "description": "Lionel Messi (Barcelona) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 11:57",
            "label": "",
            "description": "Dani Alves (Barcelona) makes a reckless foul in order to win the ball from his opponent. Svein Moen has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 11:46",
            "label": "",
            "description": "Lionel Messi (Barcelona) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 09:49",
            "label": "",
            "description": "Javier Pastore (Paris SG) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "",
            "description": "A crossfield pass from Marquinhos (Paris SG) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 06:25",
            "label": "",
            "description": "Edinson Cavani (Paris SG) makes a rough challenge and Svein Moen blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 05:11",
            "label": "",
            "description": "Javier Pastore (Paris SG) crosses the ball forward but it is intercepted."
        },
        {
            "gameTime": "1 - 04:49",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 03:34",
            "label": "",
            "description": "Luis Suarez (Barcelona) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety. Barcelona force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 02:52",
            "label": "y-card",
            "description": "Today's referee Svein Moen rightly decides to book David Luiz (Paris SG) for his harsh tackle."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "",
            "description": "Sergio Busquets (Barcelona) makes a strong challenge and Svein Moen blows for a foul."
        },
        {
            "gameTime": "1 - 00:19",
            "label": "",
            "description": "Lionel Messi (Barcelona) sends an accurate pass to Gerard Pique, who controls the ball with a fine first touch."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Svein Moen."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side were dominant and dictated the tempo of the game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "21/04/2015 - 21:45",
    "gameHomeTeam": "Barcelona",
    "gameScore": "2 - 0"
}