{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-04-30 - 21-45 Inter 0 - 1 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:54",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 47:21",
            "label": "",
            "description": "Yuto Nagatomo (Inter) rises above the defenders and places a towering header low towards the middle of the goal, but Pepe Reina is prepared and thwarts him."
        },
        {
            "gameTime": "2 - 46:24",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 40:16",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) smashes the ball towards goal from the edge of the penalty box, but it fails to bother the goalkeeper as it hits the defensive wall."
        },
        {
            "gameTime": "2 - 39:29",
            "label": "",
            "description": "Gianluca Rocchi blows his whistle after Marco Andreolli (Inter) kicks an opponent's legs instead of the ball. Napoli are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 35:33",
            "label": "corner",
            "description": "The corner from Ever Banega (Inter) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 35:26",
            "label": "substitution",
            "description": "Maurizio Sarri decides to make a substitution. Dries Mertens will be replaced by Arkadiusz Milik (Napoli)."
        },
        {
            "gameTime": "2 - 34:54",
            "label": "",
            "description": "Ever Banega (Inter) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Inter have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 31:14",
            "label": "substitution",
            "description": "A substitution has been made. Jeison Murillo goes off and Marco Andreolli (Inter) comes on."
        },
        {
            "gameTime": "2 - 30:06",
            "label": "",
            "description": "Dries Mertens (Napoli) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "y-card",
            "description": "Marko Rog (Napoli) shouldn't be surprised it's a yellow from the ref, who cooled the situation down well."
        },
        {
            "gameTime": "2 - 27:41",
            "label": "substitution",
            "description": "Stefano Pioli has decided to introduce fresh legs, with Ever Banega (Inter) replacing Eder."
        },
        {
            "gameTime": "2 - 26:55",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Marek Hamsik walks off the pitch to be replaced by Allan (Napoli)."
        },
        {
            "gameTime": "2 - 25:29",
            "label": "",
            "description": "Ivan Perisic (Inter) unleasheaIvan Perisic (Inter) unleashes a beautiful mid range volley low to the middle of the goal, but his effort is thwarted by the keeper, and the score remains the same.s a beautiful mid range volley low to the middle of the goal, but his effort is thwarted by the keeper, and the score doesn't change."
        },
        {
            "gameTime": "2 - 23:19",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) tries to find the back of the net with a volley from inside the penalty area, but the goalkeeper denies him with a crucial save."
        },
        {
            "gameTime": "2 - 19:52",
            "label": "corner",
            "description": "The resulting corner from Faouzi Ghoulam (Napoli) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 19:16",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Kalidou Koulibaly (Napoli) was quite harsh and Gianluca Rocchi didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 19:03",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) produces a ferocious strike from the edge of the box. His dangerous effort towards the bottom left corner is blocked by Samir Handanovic, who pulls off a superb save to keep the ball out of the net. The ball is out of play. Napoli will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 18:30",
            "label": "corner",
            "description": "Jose Callejon (Napoli) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 17:43",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to make a change. Marko Rog (Napoli) replaces Piotr Zielinski."
        },
        {
            "gameTime": "2 - 16:10",
            "label": "",
            "description": "Ivan Perisic (Inter) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "2 - 14:30",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) serves up a nice cross, but Pepe Reina punches the ball away."
        },
        {
            "gameTime": "2 - 14:16",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Ivan Perisic (Inter) for Joao Mario."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 10:28",
            "label": "y-card",
            "description": "Marcelo Brozovic (Inter) gets a yellow card. The referee Gianluca Rocchi made the right call."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "corner",
            "description": "Pepe Reina leaps to collect the ball from the corner which was sent over by Antonio Candreva (Inter)."
        },
        {
            "gameTime": "2 - 09:52",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear. The linesman makes the right call and Inter will have a corner."
        },
        {
            "gameTime": "2 - 07:32",
            "label": "",
            "description": "That was close. Lorenzo Insigne (Napoli) fires a shot from the edge of the box which goes a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 07:00",
            "label": "y-card",
            "description": "Jeison Murillo (Inter) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 06:17",
            "label": "",
            "description": "Eder (Inter) unleashes a shot towards the goal, but his effort isn't precise at all and it flies high over the bar."
        },
        {
            "gameTime": "2 - 03:13",
            "label": "",
            "description": "Dries Mertens (Napoli) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:09",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:28",
            "label": "corner",
            "description": "Antonio Candreva (Inter) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:28",
            "label": "",
            "description": "Jeison Murillo (Inter) is able to continue to play."
        },
        {
            "gameTime": "1 - 42:15",
            "label": "soccer-ball",
            "description": "Goal! A mistake from the defence gifted a chance to a lurking Jose Callejon (Napoli), who keeps his cool and rolls the ball into the net from close range. 0:1."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "injury",
            "description": "Jeison Murillo (Inter) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "1 - 38:59",
            "label": "corner",
            "description": "Antonio Candreva (Inter) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 38:39",
            "label": "",
            "description": "A cross from Joao Mario (Inter) fails to reach the box as the defence clears the ball away to safety. The linesman points to the corner flag, Inter are going to take it."
        },
        {
            "gameTime": "1 - 36:25",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "1 - 34:17",
            "label": "",
            "description": "Dries Mertens (Napoli) expertly controls a neat clever pass inside the box, but his effort crashes against the left post! What an opportunity that was!"
        },
        {
            "gameTime": "1 - 30:05",
            "label": "",
            "description": "Antonio Candreva (Inter) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 29:01",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 24:16",
            "label": "",
            "description": "Marek Hamsik (Napoli) misses a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball floats high over the crossbar!"
        },
        {
            "gameTime": "1 - 22:46",
            "label": "",
            "description": "Pepe Reina gets a well deserved ovation! He pulls off a remarkable save to block a long range effort from Antonio Candreva (Inter) low towards the middle of the target. Nice goalkeeping skills!"
        },
        {
            "gameTime": "1 - 22:19",
            "label": "corner",
            "description": "The resulting corner from Antonio Candreva (Inter) is cleared."
        },
        {
            "gameTime": "1 - 20:54",
            "label": "",
            "description": "Dries Mertens (Napoli) dribbles into the box, but Samir Handanovic is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "1 - 18:27",
            "label": "",
            "description": "Jose Callejon (Napoli) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "1 - 15:02",
            "label": "",
            "description": "Joao Mario (Inter) attempts to surprise the keeper with a nice shot, but it lacks more accuracy and goes way wide of the left post."
        },
        {
            "gameTime": "1 - 13:37",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Lorenzo Insigne (Napoli), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "1 - 12:14",
            "label": "",
            "description": "Mauro Icardi (Inter) connects with the corner kick around the penalty spot, but steers his header just wide of the left post."
        },
        {
            "gameTime": "1 - 12:11",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 11:22",
            "label": "",
            "description": "Yuto Nagatomo (Inter) has an effort from distance but it's blocked. The ball goes out of play. Inter are awarded a corner kick."
        },
        {
            "gameTime": "1 - 09:36",
            "label": "",
            "description": "Marek Hamsik (Napoli) finds himself with a great opportunity! He unleashes a shot from the edge of the box, which whizzes just wide of the right post!"
        },
        {
            "gameTime": "1 - 07:08",
            "label": "",
            "description": "Gianluca Rocchi blows his whistle as Dries Mertens (Napoli) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "1 - 06:23",
            "label": "",
            "description": "Antonio Candreva (Inter) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 03:13",
            "label": "",
            "description": "Half chance! Jose Callejon (Napoli) plays a pass into the box, but Samir Handanovic reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 01:34",
            "label": "corner",
            "description": "Jose Callejon (Napoli) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 01:01",
            "label": "",
            "description": "Dries Mertens (Napoli) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. The referee points to the corner flag and Napoli will take a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Inter will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gianluca Rocchi will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most frequent result for Napoli this season has been 3:0, 5 of their matches ended like this."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Inter have not tasted victory over their past 7 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "30/04/2017 - 21:45",
    "gameHomeTeam": "Inter",
    "gameScore": "0 - 1"
}