{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-08-27 - 14-30 Tottenham 1 - 1 Liverpool/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. There wasn't any evident superiority by either side today. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 49:03",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 48:59",
            "label": "y-card",
            "description": "Joel Matip (Liverpool) infringed the rules and goes into the book. Robert Madley pulls out a yellow card."
        },
        {
            "gameTime": "2 - 48:27",
            "label": "substitution",
            "description": "Jurgen Klopp prepares a substitution. Adam Lallana is replaced by Kevin Stewart (Liverpool)."
        },
        {
            "gameTime": "2 - 47:59",
            "label": "substitution",
            "description": "We are about to witness a substitution. Harry Winks (Tottenham) is replacing Christian Eriksen."
        },
        {
            "gameTime": "2 - 47:30",
            "label": "",
            "description": "Flag goes up against Joshua Onomah (Tottenham) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "corner",
            "description": "The resulting corner, taken by Christian Eriksen (Tottenham), comes to nothing."
        },
        {
            "gameTime": "2 - 46:34",
            "label": "",
            "description": "Adam Lallana (Liverpool) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. The referee blows his whistle, Liverpool are awarded a corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the middle of the goal. Michel Vorm has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 42:59",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Daniel Sturridge (Liverpool) comes onto the pitch for Sadio Mane."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "y-card",
            "description": "What was Jordan Henderson (Liverpool) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "2 - 39:35",
            "label": "",
            "description": "Toby Alderweireld (Tottenham) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "2 - 39:09",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 38:52",
            "label": "",
            "description": "Joshua Onomah (Tottenham) sends a pass into the box, but his attempt is thwarted and cleared. The referee points to the corner flag and Tottenham will take a corner."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "substitution",
            "description": "Substitution. Joshua Onomah (Tottenham) in, Harry Kane out."
        },
        {
            "gameTime": "2 - 34:52",
            "label": "",
            "description": "Excellent touch by Nathaniel Clyne (Liverpool)! He latches on to a precise pass on the edge of the box and produces a shot goalwards which goes way wide of the left post. The ball goes out of play and Tottenham will have a goal kick."
        },
        {
            "gameTime": "2 - 34:12",
            "label": "",
            "description": "Roberto Firmino (Liverpool) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "2 - 32:45",
            "label": "",
            "description": "Joel Matip (Liverpool) will take the free kick."
        },
        {
            "gameTime": "2 - 31:59",
            "label": "y-card",
            "description": "A yellow coloured card is received by Dele Alli (Tottenham)."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "",
            "description": "The referee and the linesman both signal a throw in for Liverpool."
        },
        {
            "gameTime": "2 - 27:35",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 27:30",
            "label": "",
            "description": "Adam Lallana (Liverpool) tries to send a low pass into the box, but it's blocked and cleared. The referee points to the corner flag. It's a corner to Liverpool."
        },
        {
            "gameTime": "2 - 26:53",
            "label": "soccer-ball",
            "description": "Gooal! Danny Rose (Tottenham) scores with a shot from inside the box after latching onto a headed pass from Erik Lamela. He makes it 1:1."
        },
        {
            "gameTime": "2 - 24:54",
            "label": "",
            "description": "Divock Origi (Liverpool) is caught offside!"
        },
        {
            "gameTime": "2 - 23:48",
            "label": "substitution",
            "description": "Substitution. Philippe Coutinho will be replaced by Divock Origi (Liverpool)."
        },
        {
            "gameTime": "2 - 22:14",
            "label": "",
            "description": "The ball is behind the sideline. James Milner (Liverpool) takes a throw in."
        },
        {
            "gameTime": "2 - 19:56",
            "label": "corner",
            "description": "The corner kick from Christian Eriksen (Tottenham) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 19:35",
            "label": "",
            "description": "What a great chance for Toby Alderweireld (Tottenham). He times his jump superbly when he leaps high to meet a precise cross from the corner, directing his towering header inside the left post, but the goalkeeper denies him with a miraculous save. Tottenham have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 19:17",
            "label": "corner",
            "description": "Christian Eriksen (Tottenham) will take a corner kick."
        },
        {
            "gameTime": "2 - 18:36",
            "label": "",
            "description": "Erik Lamela (Tottenham) stands over the free kick and opts to take it himself, sending it towards the top of net only for Simon Mignolet to dive and make a save. The ball is out of play. Tottenham win a corner kick."
        },
        {
            "gameTime": "2 - 17:45",
            "label": "y-card",
            "description": "Dejan Lovren (Liverpool) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "2 - 16:40",
            "label": "",
            "description": "Christian Eriksen (Tottenham) takes a shot after receiving a good pass, but his effort from the edge of the box goes just over the crossbar."
        },
        {
            "gameTime": "2 - 14:50",
            "label": "",
            "description": "Sadio Mane (Liverpool) sends a teasing cross into the area, but Michel Vorm intercepts the ball."
        },
        {
            "gameTime": "2 - 13:34",
            "label": "",
            "description": "James Milner (Liverpool) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "2 - 10:35",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Sadio Mane (Liverpool) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "",
            "description": "Toby Alderweireld (Tottenham) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "",
            "description": "A player from Liverpool brings down an opponent and commits a foul."
        },
        {
            "gameTime": "2 - 08:55",
            "label": "corner",
            "description": "Philippe Coutinho (Liverpool) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 08:32",
            "label": "",
            "description": "Sadio Mane (Liverpool) meets a pass on the edge of the penalty area and shoots towards the bottom right corner. He didn't put enough power into the effort, though, and Michel Vorm pulls off an easy save. The referee signals a corner kick to Liverpool."
        },
        {
            "gameTime": "2 - 07:41",
            "label": "",
            "description": "Joel Matip (Liverpool) sees his header crash off the crossbar after meeting a corner kick inside the six yard box. The goalkeeper would have been helpless."
        },
        {
            "gameTime": "2 - 07:35",
            "label": "corner",
            "description": "Corner kick. James Milner (Liverpool) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 07:11",
            "label": "",
            "description": "Jordan Henderson (Liverpool) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort. The ball goes out for a corner. Liverpool can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 05:55",
            "label": "y-card",
            "description": "Jan Vertonghen (Tottenham) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 05:15",
            "label": "",
            "description": "What a poor attempt! Christian Eriksen (Tottenham) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes yards wide of the left post."
        },
        {
            "gameTime": "2 - 03:54",
            "label": "",
            "description": "Danny Rose (Tottenham) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 03:20",
            "label": "",
            "description": "Adam Lallana (Liverpool) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 02:41",
            "label": "injury",
            "description": "Danny Rose (Tottenham) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 01:25",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) wastes a big chance! He unleashes a shot from the edge of the box and it goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "The fans in the stadium won't regret buying tickets for today's game as they have witnessed a great game so far, and nothing suggests it's going to change in the second half. The visitors were more active and dominated the home side in the first half, who weren't able to keep up. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 48:12",
            "label": "whistle",
            "description": "Robert Madley has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 48:10",
            "label": "corner",
            "description": "Erik Lamela (Tottenham) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 48:05",
            "label": "",
            "description": "Dele Alli (Tottenham) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety."
        },
        {
            "gameTime": "1 - 47:16",
            "label": "",
            "description": "The ball has crossed the sideline. Tottenham are taking a throw in."
        },
        {
            "gameTime": "1 - 45:52",
            "label": "y-card",
            "description": "Philippe Coutinho (Liverpool) is literally asking for a yellow card with his behaviour. The referee agrees and books him."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "1 - 42:59",
            "label": "soccer-ball",
            "description": "Goal! James Milner (Liverpool) slams home the penalty with a precise low shot into the bottom left corner."
        },
        {
            "gameTime": "1 - 42:57",
            "label": "",
            "description": "James Milner (Liverpool) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 42:26",
            "label": "penalty",
            "description": "Erik Lamela (Tottenham) brings his opponent down. Robert Madley has a clear sight of it and blows his whistle for a foul. Liverpool are awarded a penalty kick!"
        },
        {
            "gameTime": "1 - 41:29",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 40:07",
            "label": "",
            "description": "Sadio Mane (Liverpool) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "1 - 38:07",
            "label": "",
            "description": "The ball is out of play. Liverpool will have a throw in."
        },
        {
            "gameTime": "1 - 35:10",
            "label": "",
            "description": "Michel Vorm (Tottenham) takes a direct free kick."
        },
        {
            "gameTime": "1 - 34:09",
            "label": "",
            "description": "Sadio Mane (Liverpool) makes a strong challenge and Robert Madley blows for a foul."
        },
        {
            "gameTime": "1 - 32:54",
            "label": "",
            "description": "Jan Vertonghen (Tottenham) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 31:55",
            "label": "y-card",
            "description": "Sadio Mane (Liverpool) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "1 - 29:55",
            "label": "",
            "description": "Dele Alli (Tottenham) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "1 - 28:55",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) will take the free kick."
        },
        {
            "gameTime": "1 - 28:41",
            "label": "y-card",
            "description": "Danny Rose (Tottenham) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 27:21",
            "label": "substitution",
            "description": "Mauricio Pochettino is forced to make a change. Kyle Walker is unable to continue due to injury, Vincent Janssen (Tottenham) comes on."
        },
        {
            "gameTime": "1 - 26:10",
            "label": "injury",
            "description": "Kyle Walker (Tottenham) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 25:55",
            "label": "",
            "description": "The linesman signals that Sadio Mane (Liverpool) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 25:19",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) wastes a huge opportunity! He receives a precise cross inside the penalty area and releases a quick shot that sails towards the bottom left corner. His effort, however, lacks power and the goalkeeper dives to make a stunning save."
        },
        {
            "gameTime": "1 - 23:26",
            "label": "corner",
            "description": "A dangerous looking corner kick from Jordan Henderson (Liverpool) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 22:39",
            "label": "",
            "description": "Michel Vorm makes a brilliant save! Philippe Coutinho (Liverpool) easily weaves through the defence and unleashes a shot from just outside of the box. His effort goes straight under the crossbar but is saved by the keeper! The ball goes behind for a corner. Liverpool will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 21:52",
            "label": "",
            "description": "Christian Eriksen (Tottenham) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "1 - 21:29",
            "label": "",
            "description": "The game is interrupted. Dejan Lovren (Liverpool) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did. There is a free kick near the sideline to Tottenham."
        },
        {
            "gameTime": "1 - 18:55",
            "label": "",
            "description": "Victor Wanyama (Tottenham) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 18:30",
            "label": "",
            "description": "Jordan Henderson (Liverpool) commits a rough foul. Robert Madley stops the game and makes a call."
        },
        {
            "gameTime": "1 - 17:12",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the right post."
        },
        {
            "gameTime": "1 - 16:15",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "1 - 13:46",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) is caught offside after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 12:16",
            "label": "",
            "description": "Dele Alli (Tottenham) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box well wide of the left post."
        },
        {
            "gameTime": "1 - 12:05",
            "label": "",
            "description": "Danny Rose (Tottenham) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 09:45",
            "label": "",
            "description": "Jordan Henderson (Liverpool) takes a direct free kick."
        },
        {
            "gameTime": "1 - 09:30",
            "label": "",
            "description": "Christian Eriksen (Tottenham) pulls the jersey of one of the opposition players and Robert Madley blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 06:45",
            "label": "corner",
            "description": "The resulting corner from Christian Eriksen (Tottenham) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 06:20",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Harry Kane (Tottenham)."
        },
        {
            "gameTime": "1 - 05:40",
            "label": "",
            "description": "Christian Eriksen (Tottenham) stands over the free kick and opts to take it himself, sending it towards the right post only for Simon Mignolet to dive and make a save."
        },
        {
            "gameTime": "1 - 05:30",
            "label": "",
            "description": "A player from Liverpool takes his opponent down, the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 04:12",
            "label": "",
            "description": "Excellent touch by Philippe Coutinho (Liverpool)! He latches on to a precise pass deep into the box and unleashes a low drive towards the left post, but the goalkeeper pulls off a terrific save."
        },
        {
            "gameTime": "1 - 02:47",
            "label": "",
            "description": "Dele Alli (Tottenham) fails to pick a body out in the box with an over hit cross to the back post. The ball is off of the pitch and it's a goal kick for Liverpool."
        },
        {
            "gameTime": "1 - 02:06",
            "label": "",
            "description": "A cross from Danny Rose (Tottenham) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Tottenham will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Robert Madley will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last game that Liverpool played was against West Ham and it ended 4:0."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 5:0 in the last game between Tottenham and Swansea."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Tottenham will miss a few players for this clash: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. There wasn't any evident superiority by either side today. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Liverpool",
    "gameDate": "27/08/2016 - 14:30",
    "gameHomeTeam": "Tottenham",
    "gameScore": "1 - 1"
}