{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-02-17 - 22-45 Shakhtar Donetsk 0 - 0 Bayern Munich/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Let's hope the managers of both teams will be able to spark the players into life in the next matches. Up to this point the game today has lacked any interesting or exciting moments. The away team was superior on the pitch today. It's obvious that defence had the highest priority for the home side. The away team made a lot of passes and attempted to maintain possession."
        },
        {
            "gameTime": "2 - 48:05",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "",
            "description": "Oleksandr Gladky (Shakhtar) is adjudged offside."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "",
            "description": "The linesman signals that Oleksandr Gladky (Shakhtar) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "",
            "description": "Bastian Schweinsteiger (Bayern Munich) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 43:21",
            "label": "substitution",
            "description": "Luiz Adriano goes off the pitch and Oleksandr Gladky (Shakhtar) comes on."
        },
        {
            "gameTime": "2 - 39:42",
            "label": "attendance",
            "description": "The attendance for today's match is 34915."
        },
        {
            "gameTime": "2 - 39:02",
            "label": "y-card",
            "description": "Today's referee Alberto Undiano Mallenco rightly decides to book Bastian Schweinsteiger (Bayern Munich) for his harsh tackle."
        },
        {
            "gameTime": "2 - 38:41",
            "label": "substitution",
            "description": "Here is a change. Taison is going off and Mircea Lucescu gives the last tactical orders to Wellington Silva Sanches Agular (Shakhtar)."
        },
        {
            "gameTime": "2 - 38:38",
            "label": "corner",
            "description": "Arjen Robben (Bayern Munich) whips in a cross from the corner, but Andrij Pyatov is well positioned and punches the ball away."
        },
        {
            "gameTime": "2 - 38:05",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) looks to break free, but an opposing player clears the ball away. The referee blows his whistle, Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) breaks into the penalty area but his shot is blocked."
        },
        {
            "gameTime": "2 - 34:44",
            "label": "y-card",
            "description": "Jerome Boateng (Bayern Munich) is booked after bringing down an opponent. Alberto Undiano Mallenco had an easy decision to make."
        },
        {
            "gameTime": "2 - 34:24",
            "label": "funfact",
            "description": "Total attempts – 1:8."
        },
        {
            "gameTime": "2 - 32:29",
            "label": "substitution",
            "description": "Here comes a substitution. Douglas Costa is given a rest as he is replaced by Marlos (Shakhtar)."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "y-card",
            "description": "The foul by Fred (Shakhtar) is worthy of a card and a yellow is duly shown by Alberto Undiano Mallenco."
        },
        {
            "gameTime": "2 - 29:06",
            "label": "substitution",
            "description": "Pep Guardiola prepares a substitution. Mario Gotze is replaced by Robert Lewandowski (Bayern Munich)."
        },
        {
            "gameTime": "2 - 25:23",
            "label": "corner",
            "description": "The corner by Arjen Robben (Bayern Munich) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "2 - 24:17",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Holger Badstuber (Bayern Munich) comes onto the pitch so that Thomas Muller can be given a rest."
        },
        {
            "gameTime": "2 - 23:50",
            "label": "",
            "description": "Bastian Schweinsteiger (Bayern Munich) attempted to pick out a free teammate inside the box, but Andrij Pyatov comes off the line to clear the ball away. Bayern Munich have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 19:58",
            "label": "yr-card",
            "description": "Xabi Alonso (Bayern Munich) makes a bad challenge and is given a second yellow card which means he's off."
        },
        {
            "gameTime": "2 - 17:34",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 16:19",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) is moving okay again after that injury scare. Luiz Adriano (Shakhtar) is able to continue to play."
        },
        {
            "gameTime": "2 - 15:46",
            "label": "injury",
            "description": "Looks like Xabi Alonso (Bayern Munich) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 15:23",
            "label": "injury",
            "description": "Luiz Adriano (Shakhtar) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "y-card",
            "description": "Douglas Costa (Shakhtar) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Alberto Undiano Mallenco didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 11:07",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) sends in a cross from a long range free kick. However, his effort lacks accuracy and the ball sails off the pitch. The ball goes out of play and Shakhtar Donetsk will have a goal kick."
        },
        {
            "gameTime": "2 - 09:58",
            "label": "",
            "description": "Darijo Srna (Shakhtar) commits a rough foul. Alberto Undiano Mallenco stops the game and makes a call. Bayern Munich have been awarded a free kick."
        },
        {
            "gameTime": "2 - 06:46",
            "label": "",
            "description": "Douglas Costa (Shakhtar) fails to beat the offside trap. The flag goes up and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 06:22",
            "label": "",
            "description": "Vyacheslav Shevchuk (Shakhtar) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "2 - 04:08",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "2 - 03:44",
            "label": "corner",
            "description": "Arjen Robben (Bayern Munich) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 02:59",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) delivers a low pass into the box which is intercepted. The ball goes out of play and Bayern Munich have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Alberto Undiano Mallenco starts the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game. It hasn't been very exciting show so far. The visitors enjoy superiority over the opposition. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 46:01",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 42:05",
            "label": "",
            "description": "It wasn't the best example of how to strike the ball. Franck Ribery (Bayern Munich) unleashed a first time shot from the edge of the box that went high over the crossbar."
        },
        {
            "gameTime": "1 - 41:37",
            "label": "",
            "description": "The linesman raises his flag for offside before Taison (Shakhtar) heads on."
        },
        {
            "gameTime": "1 - 38:28",
            "label": "",
            "description": "The resulting free kick from Xabi Alonso (Bayern Munich) ends up in the gloves of the keeper."
        },
        {
            "gameTime": "1 - 38:11",
            "label": "",
            "description": "Bayern Munich earn a free kick."
        },
        {
            "gameTime": "1 - 37:46",
            "label": "y-card",
            "description": "Darijo Srna (Shakhtar) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Alberto Undiano Mallenco ignores the protests."
        },
        {
            "gameTime": "1 - 37:01",
            "label": "",
            "description": "Vyacheslav Shevchuk (Shakhtar) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 35:19",
            "label": "",
            "description": "Bayern Munich seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 32:37",
            "label": "injury",
            "description": "Vyacheslav Shevchuk (Shakhtar) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "1 - 31:05",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) picks up the ball inside the penalty box and immediately fires a first time effort that sails well over the crossbar and ends in the stands."
        },
        {
            "gameTime": "1 - 27:51",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "1 - 27:40",
            "label": "",
            "description": "Franck Ribery (Bayern Munich) passes the ball into the box but an opposing player clears. Bayern Munich will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 24:39",
            "label": "",
            "description": "Manuel Neuer (Bayern Munich) reacts well to deny a long range free kick from towards the bottom right corner."
        },
        {
            "gameTime": "1 - 23:56",
            "label": "",
            "description": "Shakhtar Donetsk have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 23:39",
            "label": "y-card",
            "description": "Yellow card. Xabi Alonso (Bayern Munich) goes into the referee's book after a bad challenge."
        },
        {
            "gameTime": "1 - 22:16",
            "label": "y-card",
            "description": "Rafinha (Bayern Munich) kept talking out of turn to the referee until Alberto Undiano Mallenco lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "1 - 21:57",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation."
        },
        {
            "gameTime": "1 - 17:50",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "1 - 17:01",
            "label": "",
            "description": "Douglas Costa (Shakhtar) brings an opponent down and Alberto Undiano Mallenco interrupts the game. Bayern Munich win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 16:22",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 14:51",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 12:54",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle after Jerome Boateng (Bayern Munich) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 10:46",
            "label": "",
            "description": "What a goal scoring opportunity! Thomas Muller (Bayern Munich) finds some space inside the box and fires a volley at goal, but the shot is amazingly blocked by a defender."
        },
        {
            "gameTime": "1 - 07:11",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) receives the ball inside the box from the resulting free kick, but fails to score as his shot is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 06:39",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) takes a direct free kick."
        },
        {
            "gameTime": "1 - 06:19",
            "label": "",
            "description": "Fred (Shakhtar) was trying to get to the ball but clattered into the legs of the opponent as well. Alberto Undiano Mallenco blows his whistle for an infringement. It's a free kick to Bayern Munich, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 04:49",
            "label": "",
            "description": "Alex Teixeira (Shakhtar) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 04:37",
            "label": "",
            "description": "Alberto Undiano Mallenco couldn't ignore the rough tackle by Franck Ribery (Bayern Munich) and blew his whistle. Shakhtar Donetsk have a free kick."
        },
        {
            "gameTime": "1 - 01:59",
            "label": "",
            "description": "What a chance! The ball is inside the box and Bastian Schweinsteiger (Bayern Munich) takes a first time shot on goal, but his volley goes narrowly wide of the left post. The ball is off of the pitch and it's a goal kick for Shakhtar Donetsk."
        },
        {
            "gameTime": "1 - 00:46",
            "label": "",
            "description": "Rafinha (Bayern Munich) gets into a good shooting position. He wins some space for himself and drills a long range daisy cutter towards the middle of the goal. His good effort is, however, superbly saved by Andrij Pyatov!"
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Shakhtar Donetsk will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alberto Undiano Mallenco will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let's hope the managers of both teams will be able to spark the players into life in the next matches. Up to this point the game today has lacked any interesting or exciting moments. The away team was superior on the pitch today. It's obvious that defence had the highest priority for the home side. The away team made a lot of passes and attempted to maintain possession."
        }
    ],
    "gameAwayTeam": "Bayern Munich",
    "gameDate": "17/02/2015 - 22:45",
    "gameHomeTeam": "Shakhtar Donetsk",
    "gameScore": "0 - 0"
}