{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2014-2015/2015-05-16 - 19-00 Inter 1 - 2 Juventus/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. Great display from the home side, you have to say that they were the better side today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        },
        {
            "gameTime": "2 - 50:05",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 49:37",
            "label": "",
            "description": "Mateo Kovacic (Inter) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "2 - 49:08",
            "label": "",
            "description": "A clumsy foul by Fernando Llorente (Juventus) and Daniele Doveri blows his whistle. A free kick to Inter."
        },
        {
            "gameTime": "2 - 47:38",
            "label": "",
            "description": "Yuto Nagatomo (Inter) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "2 - 47:19",
            "label": "corner",
            "description": "Mateo Kovacic (Inter) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "Mauro Icardi (Inter) fails to find any of his teammates inside the box as his pass is blocked. The ball goes out of play and Inter have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 46:25",
            "label": "",
            "description": "Romulo (Juventus) swings a cross into the box, but it's far too close to Samir Handanovic, who smothers the ball."
        },
        {
            "gameTime": "2 - 45:38",
            "label": "",
            "description": "Assane Gnoukouri (Inter) was too fierce in his attempt to get the ball from his opponent and Daniele Doveri blows for a foul."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 5 min. of added time."
        },
        {
            "gameTime": "2 - 44:10",
            "label": "",
            "description": "Dangerous play by Paul Pogba (Juventus). Daniele Doveri blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 43:14",
            "label": "substitution",
            "description": "Substitution. Assane Gnoukouri (Inter) replaces Andrea Ranocchia."
        },
        {
            "gameTime": "2 - 43:10",
            "label": "",
            "description": "Lukas Podolski (Inter) is flagged for offside."
        },
        {
            "gameTime": "2 - 42:49",
            "label": "",
            "description": "Yuto Nagatomo (Inter) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 41:43",
            "label": "",
            "description": "Alvaro Morata (Juventus) leaps high deep inside the box to meet a beautiful cross from the resultant free kick. He glances a header goalwards, but it's not accurate and goes narrowly wide of the left post. The ball goes out of play and Inter will have a goal kick."
        },
        {
            "gameTime": "2 - 41:38",
            "label": "",
            "description": "Claudio Marchisio (Juventus) will take the free kick."
        },
        {
            "gameTime": "2 - 41:10",
            "label": "",
            "description": "Handball by Yuto Nagatomo (Inter). Juventus are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 40:22",
            "label": "",
            "description": "Nemanja Vidic (Inter) makes a strong challenge and Daniele Doveri blows for a foul. Juventus quickly take the free kick with a short pass."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "corner",
            "description": "Lukas Podolski (Inter) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 39:37",
            "label": "",
            "description": "Mauro Icardi (Inter) is quickest to the rebound inside the box and produces a sweet strike towards the right side of the goal. Nevertheless, the goalkeeper pulls off a spectacular save to keep the ball out of the net. Great goalkeeping! Inter will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 38:25",
            "label": "",
            "description": "Nice individual effort by Rodrigo Palacio (Inter). He gets all the way through to the keeper and hits a low drive to the bottom right corner, but Marco Storari does a good job to anticipate the direction of the ball and keeps it out."
        },
        {
            "gameTime": "2 - 37:44",
            "label": "soccer-ball",
            "description": "The ball rebounds and arrives at the feet of Alvaro Morata (Juventus) just outside the box. He doesn't think twice and fires a brilliant shot into the bottom left corner. His attempt was beyond the reach of Samir Handanovic. 1:1."
        },
        {
            "gameTime": "2 - 36:52",
            "label": "substitution",
            "description": "The game has come to an end for Marcelo Brozovic. He has contributed as much as he could today. He will be replaced by the fresh legs of Lukas Podolski (Inter)."
        },
        {
            "gameTime": "2 - 36:06",
            "label": "",
            "description": "Mauro Icardi (Inter) connects with a cross from the side, but produces a header which goes miles wide of the right post. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "2 - 35:17",
            "label": "",
            "description": "Claudio Marchisio (Juventus) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "2 - 34:55",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) is penalised for holding. Daniele Doveri signals a set piece. There is a free kick near the sideline to Juventus."
        },
        {
            "gameTime": "2 - 34:36",
            "label": "",
            "description": "Marcelo Brozovic (Inter) collects a pass and strikes from about 20 metres out. It's a poor attempt which flies well wide of the left post. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "2 - 32:26",
            "label": "substitution",
            "description": "Substitution. Roberto Pereyra is replaced by Paul Pogba (Juventus)."
        },
        {
            "gameTime": "2 - 31:05",
            "label": "",
            "description": "Marcelo Brozovic (Inter) gives away a foul for a clumsy challenge. Referee Daniele Doveri saw the whole situation. Juventus take a quick free kick and immediately restart play."
        },
        {
            "gameTime": "2 - 30:34",
            "label": "",
            "description": "Yuto Nagatomo (Inter) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 29:45",
            "label": "",
            "description": "Roberto Pereyra (Juventus) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 29:40",
            "label": "corner",
            "description": "Mateo Kovacic (Inter) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 28:54",
            "label": "injury",
            "description": "Roberto Pereyra (Juventus) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "2 - 28:18",
            "label": "",
            "description": "Yuto Nagatomo (Inter) sends a pass into the box, but his attempt is thwarted and cleared. The referee and his assistant both point at the corner flag. Inter will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 25:57",
            "label": "substitution",
            "description": "Yuto Nagatomo (Inter) joins the action as a substitute, replacing Xherdan Shaqiri."
        },
        {
            "gameTime": "2 - 25:43",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) unleashes a superb first time shot from the edge of the box, but it flies narrowly wide of the left post. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "",
            "description": "Mauro Icardi (Inter) has an effort from distance and sends the ball towards the bottom right corner, but the goalkeeper is equal to it."
        },
        {
            "gameTime": "2 - 23:42",
            "label": "",
            "description": "Marcelo Brozovic (Inter) meets a cross inside the box, but his header is blocked by an opposing player."
        },
        {
            "gameTime": "2 - 23:16",
            "label": "",
            "description": "The free kick is taken by Claudio Marchisio (Juventus), but ball is cleared."
        },
        {
            "gameTime": "2 - 21:55",
            "label": "y-card",
            "description": "Juan Jesus (Inter) is given a yellow card."
        },
        {
            "gameTime": "2 - 21:49",
            "label": "",
            "description": "Juan Jesus (Inter) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement. Juventus have a free kick."
        },
        {
            "gameTime": "2 - 21:25",
            "label": "",
            "description": "It looks like Danilo D'Ambrosio (Inter) saw red with that tackle. Daniele Doveri won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "2 - 20:56",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Mauro Icardi (Inter), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 20:29",
            "label": "substitution",
            "description": "Massimiliano Allegri has decided to make a change. Fernando Llorente (Juventus) replaces Alessandro Matri."
        },
        {
            "gameTime": "2 - 19:56",
            "label": "",
            "description": "Alessandro Matri (Juventus) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 18:36",
            "label": "",
            "description": "Gary Medel (Inter) gives away a foul for a fierce tackle on an opponent. Juventus produce a short pass from the free kick."
        },
        {
            "gameTime": "2 - 17:29",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Juventus."
        },
        {
            "gameTime": "2 - 16:16",
            "label": "",
            "description": "Juan Jesus (Inter) makes an overly aggressive challenge and Daniele Doveri blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 15:42",
            "label": "",
            "description": "Alvaro Morata (Juventus) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball into the stands. Nice run, but poor finish! The ball is off of the pitch and it's a goal kick for Inter."
        },
        {
            "gameTime": "2 - 13:08",
            "label": "corner",
            "description": "Xherdan Shaqiri (Inter) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 12:54",
            "label": "",
            "description": "Mauro Icardi (Inter) races towards goal but the defender gets back well to make a challenge. The referee points to the corner flag and Inter will take a corner."
        },
        {
            "gameTime": "2 - 12:44",
            "label": "y-card",
            "description": "Mateo Kovacic (Inter) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Daniele Doveri ignores the protests."
        },
        {
            "gameTime": "2 - 11:16",
            "label": "",
            "description": "Marcelo Brozovic (Inter) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 10:50",
            "label": "",
            "description": "Stefano Sturaro (Juventus) probably spotted the goalkeeper off his line, but he misdirected his long range shot as it went a few yards wide of the left post."
        },
        {
            "gameTime": "2 - 09:58",
            "label": "substitution",
            "description": "Substitution. Stephan Lichtsteiner did his best and is replaced by Angelo Ogbonna (Juventus)."
        },
        {
            "gameTime": "2 - 09:44",
            "label": "",
            "description": "A cross is clipped into the penalty area by Xherdan Shaqiri (Inter) but poses no threat. The ball has crossed the sideline. Juventus are taking a throw in."
        },
        {
            "gameTime": "2 - 08:31",
            "label": "y-card",
            "description": "Stephan Lichtsteiner (Juventus) infringed the rules and goes into the book. Daniele Doveri pulls out a yellow card."
        },
        {
            "gameTime": "2 - 07:12",
            "label": "",
            "description": "Marcelo Brozovic (Inter) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 06:46",
            "label": "y-card",
            "description": "Daniele Doveri shows a yellow card to Alvaro Morata (Juventus) for a tough tackle. A mid range free kick is awarded to Inter out wide and from this angle a cross into the box is likely."
        },
        {
            "gameTime": "2 - 05:16",
            "label": "",
            "description": "Mauro Icardi (Inter) skips perfectly past challenges but misdirects his shot from the edge of the box. The ball flies a few yards wide of the right post. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "",
            "description": "Gary Medel (Inter) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies into the stands. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "2 - 03:12",
            "label": "",
            "description": "Mateo Kovacic (Inter) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "2 - 02:28",
            "label": "",
            "description": "Mauro Icardi (Inter) commits a foul and Daniele Doveri immediately signals a free kick."
        },
        {
            "gameTime": "2 - 00:55",
            "label": "",
            "description": "Great ball in from Stephan Lichtsteiner. Alvaro Morata (Juventus) should really have done better with a close range header, but he heads it a whisker wide of the left post. The ball is off of the pitch and it's a goal kick for Inter."
        },
        {
            "gameTime": "2 - 00:30",
            "label": "",
            "description": "Alvaro Morata (Juventus) decides to keep the ball to himself and weaves through the defence into the box. From there he takes a shot which goes narrowly wide of the target. The ball is off of the pitch and it's a goal kick for Inter."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "This is how football should be full of action, thrilling moments and spectacular opportunities. And we have only had the first 45 minutes, so the expectations for the second half are high. The first half was definitely edged by the home side. The home side are keeping possession of the ball with some short passes, while the visitors are waiting to open up their defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 45:10",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) tries his luck with a shot from long range, but his effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 43:30",
            "label": "",
            "description": "Mateo Kovacic (Inter) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Daniele Doveri with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 41:25",
            "label": "soccer-ball",
            "description": "Claudio Marchisio (Juventus) scores from the penalty spot after firing the ball into the bottom left corner to give the goalkeeper no chance!"
        },
        {
            "gameTime": "1 - 41:10",
            "label": "",
            "description": "Claudio Marchisio (Juventus) is going to take the penalty!"
        },
        {
            "gameTime": "1 - 40:40",
            "label": "y-card",
            "description": "The whistle is blown for an infringement and Nemanja Vidic (Inter) receives a yellow card!"
        },
        {
            "gameTime": "1 - 40:10",
            "label": "penalty",
            "description": "Daniele Doveri blows his whistle after Nemanja Vidic (Inter) brings one of his opponents down with a strong tackle. It's a penalty to Juventus! Let's see who's going to take it."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Lovely cross from Stephan Lichtsteiner to find Roberto Pereyra (Juventus) deep in the box, but he steers his header well wide of the left post. The ball is off of the pitch and it's a goal kick for Inter."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Marcelo Brozovic (Inter) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "1 - 38:15",
            "label": "",
            "description": "OFF THE CROSSBAR! Xherdan Shaqiri (Inter) runs towards the goal to give his teammate support. He receives a fantastic pass and shoots from the edge of the box, but it crashes against the crossbar. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "1 - 35:32",
            "label": "",
            "description": "The referee blows his whistle as Danilo D'Ambrosio (Inter) was too aggressive in his challenge. Simone Padoin (Juventus) takes a short free kick."
        },
        {
            "gameTime": "1 - 35:06",
            "label": "",
            "description": "Claudio Marchisio (Juventus) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "1 - 34:45",
            "label": "y-card",
            "description": "Marcelo Brozovic (Inter) has tested the patience of referee Daniele Doveri and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 32:58",
            "label": "",
            "description": "Marcelo Brozovic (Inter) makes a rough challenge and Daniele Doveri blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 32:55",
            "label": "",
            "description": "Claudio Marchisio (Juventus) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "1 - 32:28",
            "label": "y-card",
            "description": "Today's referee Daniele Doveri rightly decides to book Andrea Ranocchia (Inter) for his harsh tackle."
        },
        {
            "gameTime": "1 - 32:02",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 30:26",
            "label": "",
            "description": "Good defending. Xherdan Shaqiri (Inter) tries to find Mauro Icardi inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 29:52",
            "label": "",
            "description": "Xherdan Shaqiri (Inter) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 29:37",
            "label": "",
            "description": "Marcelo Brozovic (Inter) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 26:52",
            "label": "",
            "description": "Stefano Sturaro (Juventus) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "1 - 26:48",
            "label": "",
            "description": "Stefano Sturaro (Juventus) fashions a shot from the edge of the box after receiving an accurate pass. Samir Handanovic makes a stunning save to stop the effort from flying into the right side of the goal."
        },
        {
            "gameTime": "1 - 26:20",
            "label": "",
            "description": "Rodrigo Palacio (Inter) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 25:27",
            "label": "",
            "description": "Daniele Doveri blows his whistle and it's Juan Jesus (Inter) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 25:06",
            "label": "corner",
            "description": "Xherdan Shaqiri (Inter) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "1 - 24:49",
            "label": "",
            "description": "Marcelo Brozovic (Inter) sends a lofted cross into the box which is headed clear. The referee signals a corner kick to Inter."
        },
        {
            "gameTime": "1 - 23:50",
            "label": "",
            "description": "Daniele Doveri has a clear sight and sees a foul from Romulo (Juventus)."
        },
        {
            "gameTime": "1 - 23:35",
            "label": "",
            "description": "Rodrigo Palacio (Inter) gets to the rebound inside the box and shoots to the bottom left corner, but his sidefooter is blocked by an alert Marco Storari. What a save!"
        },
        {
            "gameTime": "1 - 22:35",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Claudio Marchisio (Juventus). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 21:48",
            "label": "",
            "description": "Alvaro Morata (Juventus) wasted a huge opportunity! The fans already began to celebrate as he unleashed a powerful shot from the edge of the box after a brilliant solo effort. The ball went towards the left side of the goal, but Samir Handanovic made a crucial save! Juventus will take a corner kick."
        },
        {
            "gameTime": "1 - 21:17",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 20:55",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 19:52",
            "label": "corner",
            "description": "Claudio Marchisio (Juventus) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 19:37",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play. A goal scoring opportunity from a corner for Juventus."
        },
        {
            "gameTime": "1 - 18:29",
            "label": "",
            "description": "A pass from Marcelo Brozovic (Inter) is intercepted by Marco Storari and the move breaks down."
        },
        {
            "gameTime": "1 - 16:30",
            "label": "",
            "description": "Great teamplay by Inter as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 15:51",
            "label": "",
            "description": "Marcelo Brozovic (Inter) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 14:21",
            "label": "",
            "description": "Marco Storari gets a well deserved ovation! Mauro Icardi (Inter) produces a decent first time strike towards the top right corner, but the goalkeeper is positioned well to block it. Nice goalkeeping skills."
        },
        {
            "gameTime": "1 - 13:31",
            "label": "",
            "description": "Alvaro Morata (Juventus) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball goes out of play and Inter will have a goal kick."
        },
        {
            "gameTime": "1 - 12:30",
            "label": "",
            "description": "Marcelo Brozovic (Inter) commits a rough challenge and Daniele Doveri blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 11:58",
            "label": "",
            "description": "Rodrigo Palacio (Inter) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 10:47",
            "label": "corner",
            "description": "The resulting corner from Xherdan Shaqiri (Inter) is cleared by the defence."
        },
        {
            "gameTime": "1 - 10:38",
            "label": "",
            "description": "Xherdan Shaqiri (Inter) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. Inter win a corner."
        },
        {
            "gameTime": "1 - 10:16",
            "label": "",
            "description": "Rodrigo Palacio (Inter) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 09:50",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Alessandro Matri (Juventus) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "1 - 08:57",
            "label": "soccer-ball",
            "description": "Mauro Icardi (Inter) scores as the ball bounces off his body. He was standing in front of goal and helped his team with a lucky deflection."
        },
        {
            "gameTime": "1 - 08:30",
            "label": "corner",
            "description": "Xherdan Shaqiri (Inter) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 08:18",
            "label": "",
            "description": "Xherdan Shaqiri (Inter) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Inter force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 07:39",
            "label": "",
            "description": "Flag up against Alessandro Matri (Juventus). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 07:20",
            "label": "",
            "description": "Marcelo Brozovic (Inter) commits a rough challenge and Daniele Doveri blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 06:38",
            "label": "",
            "description": "Xherdan Shaqiri (Inter) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "",
            "description": "Marcelo Brozovic (Inter) has an effort from distance but it's blocked."
        },
        {
            "gameTime": "1 - 04:53",
            "label": "",
            "description": "Xherdan Shaqiri (Inter) creates a good chance for himself and goes for goal from mid range, but the effort is well over the bar. The ball goes out of play and Juventus will have a goal kick."
        },
        {
            "gameTime": "1 - 03:58",
            "label": "corner",
            "description": "Claudio Marchisio (Juventus) takes a short corner kick."
        },
        {
            "gameTime": "1 - 03:38",
            "label": "",
            "description": "Alvaro Morata (Juventus) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked. The ball is out of play and Juventus manage to earn a corner."
        },
        {
            "gameTime": "1 - 02:36",
            "label": "",
            "description": "A brilliant individual effort! Alvaro Morata (Juventus) tricks his way past challenges into the box and drags his shot narrowly wide of the left post. The ball is off of the pitch and it's a goal kick for Inter."
        },
        {
            "gameTime": "1 - 02:18",
            "label": "",
            "description": "An attempted cross from Xherdan Shaqiri (Inter) is cleared."
        },
        {
            "gameTime": "1 - 02:06",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Xherdan Shaqiri (Inter)."
        },
        {
            "gameTime": "1 - 01:53",
            "label": "corner",
            "description": "Xherdan Shaqiri (Inter) takes the corner but it's cleared. The ball is out of play. Inter will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 01:18",
            "label": "",
            "description": "Mauro Icardi (Inter) picks up a pass, lines up a shot and strikes from 20 metres out, but Marco Storari thwarts the effort which is headed for the top right corner. The linesman points to the corner flag, Inter are going to take it."
        },
        {
            "gameTime": "1 - 00:47",
            "label": "",
            "description": "Alvaro Morata (Juventus) commits a foul after unfairly pressing his opponent during an attacking move. Danilo D'Ambrosio (Inter) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 00:31",
            "label": "",
            "description": "The ball is cleared after Simone Padoin (Juventus) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Juventus will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Daniele Doveri."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. Great display from the home side, you have to say that they were the better side today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        }
    ],
    "gameAwayTeam": "Juventus",
    "gameDate": "16/05/2015 - 19:00",
    "gameHomeTeam": "Inter",
    "gameScore": "1 - 2"
}