{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-03 - 22-45 Benfica 2 - 1 Galatasaray/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The home side were superior in this game. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 49:36",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:54",
            "label": "y-card",
            "description": "Olcan Adin (Galatasaray) is booked by the referee."
        },
        {
            "gameTime": "2 - 47:53",
            "label": "substitution",
            "description": "It will be a substitution. Bryan Cristante (Benfica) is ready to enter the pitch as Anderson Talisca walks off."
        },
        {
            "gameTime": "2 - 47:16",
            "label": "",
            "description": "Close! Yasin Oztekin (Galatasaray) is a whisker away from finishing off the move he started. His close range effort flies just over the bar."
        },
        {
            "gameTime": "2 - 46:51",
            "label": "",
            "description": "Umut Bulut (Galatasaray) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Julio Cesar to get hold of the ball."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 42:34",
            "label": "",
            "description": "Selcuk Inan (Galatasaray) tries his luck and hits a thunderbolt of a shot towards goal from long range, but his powerful strike goes narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 39:49",
            "label": "yr-card",
            "description": "It's the second caution for Nicolas Gaitan (Benfica) and that's the last we'll see of him in this game. There was no other option for Milorad Mazic."
        },
        {
            "gameTime": "2 - 39:02",
            "label": "corner",
            "description": "Pizzi (Benfica) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 38:54",
            "label": "",
            "description": "Raul Jimenez (Benfica) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the right post. Fernando Muslera is alert and denies him with a nice save. Corner kick. Benfica will have an opportunity."
        },
        {
            "gameTime": "2 - 38:27",
            "label": "corner",
            "description": "Olcan Adin (Galatasaray) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 38:05",
            "label": "",
            "description": "Sabri Sarioglu (Galatasaray) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "2 - 37:35",
            "label": "",
            "description": "Mehdi Carcela Gonzalez (Benfica) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 35:20",
            "label": "substitution",
            "description": "Rui Vitoria has decided to introduce fresh legs, with Pizzi (Benfica) replacing Jonas."
        },
        {
            "gameTime": "2 - 33:30",
            "label": "",
            "description": "Umut Bulut (Galatasaray) rises high to meet a perfect cross, but luckily for the goalkeeper he steers his header just over the crossbar."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Jonas (Benfica)."
        },
        {
            "gameTime": "2 - 28:15",
            "label": "substitution",
            "description": "Substitution. Umut Bulut (Galatasaray) has come on for Burak Yilmaz."
        },
        {
            "gameTime": "2 - 28:08",
            "label": "substitution",
            "description": "Hamza Hamzaoglu has decided to make a change. Emre Colak (Galatasaray) replaces Jason Denayer."
        },
        {
            "gameTime": "2 - 27:50",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Mehdi Carcela Gonzalez (Benfica) replaces Goncalo Guedes."
        },
        {
            "gameTime": "2 - 26:48",
            "label": "corner",
            "description": "Nicolas Gaitan (Benfica) will take the corner."
        },
        {
            "gameTime": "2 - 26:07",
            "label": "",
            "description": "Raul Jimenez (Benfica) picks up a rebound inside the penalty area and drills a shot to the bottom right corner, but is denied by a reflex save from Fernando Muslera. Benfica have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 25:29",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Nicolas Gaitan (Benfica), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 25:04",
            "label": "",
            "description": "Nicolas Gaitan (Benfica) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender. The referee blows his whistle, Benfica are awarded a corner kick."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Yasin Oztekin (Galatasaray) will replace Bilal Kisa."
        },
        {
            "gameTime": "2 - 21:48",
            "label": "soccer-ball",
            "description": "Raul Jimenez sends a precise lofted cross into the box. Luisao (Benfica) latches on to it and finishes with a quick shot into the top right corner. The goalkeeper had no chance. The score changes to 0:0."
        },
        {
            "gameTime": "2 - 21:01",
            "label": "corner",
            "description": "Nicolas Gaitan (Benfica) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 20:22",
            "label": "",
            "description": "A cross into the box from Nicolas Gaitan (Benfica) is cleared. The ball goes out of play and Benfica have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 20:21",
            "label": "",
            "description": "What a great effort! Anderson Talisca (Benfica) decides to unleash a long range shot. Despite hitting it very well, it scorches inches wide of the right post. We could have witnessed a magnificent goal."
        },
        {
            "gameTime": "2 - 17:19",
            "label": "",
            "description": "Raul Jimenez (Benfica) finds himself unmarked on the edge of the box, but he drags his shot just wide of the right post."
        },
        {
            "gameTime": "2 - 16:18",
            "label": "",
            "description": "Silvio (Benfica) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 14:24",
            "label": "corner",
            "description": "Corner kick. Nicolas Gaitan (Benfica) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 14:14",
            "label": "",
            "description": "Goncalo Guedes (Benfica) sends a cross into the box, but the opposition's defence quickly intercepts the ball. Benfica force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 12:42",
            "label": "soccer-ball",
            "description": "Lukas Podolski (Galatasaray) latches on to a killer pass deep inside the box and coolly puts the ball inside the right post!"
        },
        {
            "gameTime": "2 - 11:57",
            "label": "",
            "description": "Sabri Sarioglu (Galatasaray) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 10:53",
            "label": "y-card",
            "description": "Silvio (Benfica) is yellow carded for breaking the rules of the game."
        },
        {
            "gameTime": "2 - 10:27",
            "label": "",
            "description": "Nicolas Gaitan (Benfica) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 09:31",
            "label": "y-card",
            "description": "Selcuk Inan (Galatasaray) is penalised."
        },
        {
            "gameTime": "2 - 06:18",
            "label": "soccer-ball",
            "description": "One of the defending players blocks a shot inside the box, but Jonas (Benfica) pounces on the rebound and gives the goalkeeper no chance with a shot inside the net."
        },
        {
            "gameTime": "2 - 05:31",
            "label": "",
            "description": "The cross into the penalty area from Raul Jimenez (Benfica) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "2 - 03:51",
            "label": "",
            "description": "Flag goes up against Burak Yilmaz (Galatasaray) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 02:18",
            "label": "",
            "description": "Jonas (Benfica) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have seen an attractive offensive game so far and the fans have nothing to complain about. The hosts are mostly controlling the match and making it pretty tough for the opposition to keep up. The home team makes a lot of passes and attempts to maintain possession. The same goes for the away side."
        },
        {
            "gameTime": "1 - 45:07",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:42",
            "label": "corner",
            "description": "Anderson Talisca (Benfica) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "1 - 44:41",
            "label": "",
            "description": "Goncalo Guedes (Benfica) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The ball is out of play. A goal scoring opportunity from a corner for Benfica."
        },
        {
            "gameTime": "1 - 43:13",
            "label": "y-card",
            "description": "The game is interrupted because of a yellow card that is shown to Nicolas Gaitan (Benfica)."
        },
        {
            "gameTime": "1 - 43:12",
            "label": "",
            "description": "The game is interrupted as Goncalo Guedes (Benfica) is flagged offside."
        },
        {
            "gameTime": "1 - 42:26",
            "label": "y-card",
            "description": "The whistle is blown for an infringement and Goncalo Guedes (Benfica) receives a yellow card!"
        },
        {
            "gameTime": "1 - 41:55",
            "label": "",
            "description": "Sabri Sarioglu (Galatasaray) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 40:48",
            "label": "y-card",
            "description": "The yellow card goes to Burak Yilmaz (Galatasaray)."
        },
        {
            "gameTime": "1 - 39:43",
            "label": "corner",
            "description": "Nicolas Gaitan (Benfica) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 39:24",
            "label": "",
            "description": "Jonas (Benfica) races towards goal but the defender gets back well to make a challenge. Benfica will take a corner kick."
        },
        {
            "gameTime": "1 - 38:19",
            "label": "",
            "description": "Anderson Talisca (Benfica) swings a cross into the box, but it's far too close to Fernando Muslera, who smothers the ball."
        },
        {
            "gameTime": "1 - 35:40",
            "label": "",
            "description": "Some great controlled play and passing from Benfica. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 32:42",
            "label": "corner",
            "description": "Nicolas Gaitan (Benfica) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 32:23",
            "label": "",
            "description": "Jonas (Benfica) sends a pass into the box, but his attempt is thwarted and cleared. Benfica have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 30:13",
            "label": "y-card",
            "description": "Caution goes to Andre Almeida (Benfica)."
        },
        {
            "gameTime": "1 - 29:53",
            "label": "corner",
            "description": "Wesley Sneijder (Galatasaray) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 29:20",
            "label": "",
            "description": "Lukas Podolski (Galatasaray) fires a powerful shot which is blocked. The ball goes out of play. Galatasaray are awarded a corner kick."
        },
        {
            "gameTime": "1 - 28:30",
            "label": "",
            "description": "Selcuk Inan (Galatasaray) tries his luck with and strikes the ball towards goal from long range, but it is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 28:08",
            "label": "corner",
            "description": "Wesley Sneijder (Galatasaray) takes the corner."
        },
        {
            "gameTime": "1 - 27:37",
            "label": "",
            "description": "Bilal Kisa (Galatasaray) blasts the ball from just outside the box, but his attempt is blocked by the defender. Galatasaray earn a corner."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "",
            "description": "Nicolas Gaitan (Benfica) was close to scoring after he unleashed a powerful shot which went a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 26:05",
            "label": "",
            "description": "Burak Yilmaz (Galatasaray) is flagged for offside."
        },
        {
            "gameTime": "1 - 25:04",
            "label": "corner",
            "description": "Bilal Kisa (Galatasaray) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 24:32",
            "label": "",
            "description": "Bilal Kisa (Galatasaray) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort. The ball is out of play. Galatasaray will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 23:48",
            "label": "",
            "description": "Andre Almeida (Benfica) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 21:48",
            "label": "",
            "description": "Jonas (Benfica) shoots from the edge of the penalty area. The ball travels towards the middle of the target, but Fernando Muslera easily deals with the threat."
        },
        {
            "gameTime": "1 - 20:40",
            "label": "",
            "description": "Lukas Podolski (Galatasaray) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "1 - 18:56",
            "label": "",
            "description": "Jonas (Benfica) has a great chance inside the six yard box, shoots low to the middle of the goal, but Fernando Muslera pulls off an exquisite save to deny him."
        },
        {
            "gameTime": "1 - 18:04",
            "label": "",
            "description": "The linesman signals that Goncalo Guedes (Benfica) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 15:23",
            "label": "",
            "description": "Wesley Sneijder (Galatasaray) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 13:54",
            "label": "",
            "description": "Goncalo Guedes (Benfica) sends a cross into the box, but Fernando Muslera comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 10:44",
            "label": "",
            "description": "Goncalo Guedes (Benfica) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "1 - 07:50",
            "label": "",
            "description": "Andre Almeida (Benfica) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Milorad Mazic blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 05:53",
            "label": "",
            "description": "Nicolas Gaitan (Benfica) misses a big chance! He fires the ball high over the crossbar from inside the 6 yard box after the ball rebounded to him."
        },
        {
            "gameTime": "1 - 04:43",
            "label": "",
            "description": "Raul Jimenez (Benfica) runs with the ball towards the keeper and pulls the trigger from close range, but Fernando Muslera anticipates his intention and makes an amazing save to stop the shot going low into the middle of the target."
        },
        {
            "gameTime": "1 - 03:40",
            "label": "",
            "description": "Silvio (Benfica) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 02:53",
            "label": "",
            "description": "Nicolas Gaitan (Benfica) goes close to scoring with a shot from inside the box, but he drags his effort wide of the left post."
        },
        {
            "gameTime": "1 - 01:43",
            "label": "",
            "description": "Sabri Sarioglu (Galatasaray) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 00:53",
            "label": "",
            "description": "Nicolas Gaitan (Benfica) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Benfica will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Milorad Mazic will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The home side were superior in this game. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Galatasaray",
    "gameDate": "03/11/2015 - 22:45",
    "gameHomeTeam": "Benfica",
    "gameScore": "2 - 1"
}