{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-04-22 - 21-45 Monaco 0 - 0 Juventus/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. The host team were superior on the pitch today. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        },
        {
            "gameTime": "2 - 49:12",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 48:58",
            "label": "",
            "description": "Carlos Tevez (Juventus) unleashed a powerful long range strike, but the ball was blocked by a defender on its way."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "",
            "description": "Andrea Pirlo (Juventus) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 46:44",
            "label": "",
            "description": "A player from Monaco commits a rough challenge. William Collum blows for a foul and keeps the game under control. Juventus are awarded the free kick."
        },
        {
            "gameTime": "2 - 46:35",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Andrea Pirlo (Juventus) takes it short."
        },
        {
            "gameTime": "2 - 46:06",
            "label": "",
            "description": "Carlos Tevez (Juventus) races towards goal but the defender gets back well to make a challenge. Good work from Juventus as they win a corner."
        },
        {
            "gameTime": "2 - 45:36",
            "label": "",
            "description": "Joao Moutinho (Monaco) sends a long ball in, but Gianluigi Buffon comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:51",
            "label": "",
            "description": "Andrea Pirlo (Juventus) fires a promising strike from distance, but his attempt rattles the right post! What a bad luck, he was really close to get on the scoresheet."
        },
        {
            "gameTime": "2 - 44:04",
            "label": "",
            "description": "Andrea Raggi (Monaco) commits a rough challenge and William Collum blows his whistle for a foul. Juventus earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 43:59",
            "label": "substitution",
            "description": "Here is a change. Patrice Evra is going off and Massimiliano Allegri gives the last tactical orders to Simone Padoin (Juventus)."
        },
        {
            "gameTime": "2 - 43:05",
            "label": "",
            "description": "William Collum blows his whistle and it's Dimitar Berbatov (Monaco) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 41:57",
            "label": "substitution",
            "description": "Substitution. Yannick Carrasco did his best and is replaced by Matheus Carvalho (Monaco)."
        },
        {
            "gameTime": "2 - 40:17",
            "label": "y-card",
            "description": "The referee gives a yellow card to Carlos Tevez (Juventus)."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "",
            "description": "Roberto Pereyra (Juventus) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 37:07",
            "label": "",
            "description": "William Collum has a clear sight and sees a foul from Stephan Lichtsteiner (Juventus)."
        },
        {
            "gameTime": "2 - 35:11",
            "label": "corner",
            "description": "Andrea Pirlo (Juventus) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 34:52",
            "label": "corner",
            "description": "Andrea Pirlo (Juventus) takes the corner but it's cleared. The ball is out of play. Juventus will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 34:21",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. The referee points to the corner flag and Juventus will take a corner."
        },
        {
            "gameTime": "2 - 31:45",
            "label": "substitution",
            "description": "It will be a substitution. Roberto Pereyra (Juventus) is ready to enter the pitch as Arturo Vidal walks off."
        },
        {
            "gameTime": "2 - 30:58",
            "label": "y-card",
            "description": "Geoffrey Kondogbia (Monaco) is punished with the yellow card."
        },
        {
            "gameTime": "2 - 30:22",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Valere Germain (Monaco) will replace Anthony Martial."
        },
        {
            "gameTime": "2 - 29:54",
            "label": "",
            "description": "Yannick Carrasco (Monaco) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 29:20",
            "label": "",
            "description": "Carlos Tevez (Juventus) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 27:32",
            "label": "",
            "description": "quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "2 - 27:12",
            "label": "",
            "description": "Handball by Fernando Llorente (Juventus)."
        },
        {
            "gameTime": "2 - 25:14",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 24:27",
            "label": "",
            "description": "The linesman raises his flag for offside before Dimitar Berbatov (Monaco) heads on."
        },
        {
            "gameTime": "2 - 23:20",
            "label": "substitution",
            "description": "It's time for a substitution. Fernando Llorente (Juventus) comes on in place of Alvaro Morata."
        },
        {
            "gameTime": "2 - 22:03",
            "label": "",
            "description": "Andrea Pirlo (Juventus) sends a long ball in, but Danijel Subasic comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 20:41",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the left post."
        },
        {
            "gameTime": "2 - 20:24",
            "label": "corner",
            "description": "Yannick Carrasco (Monaco) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 20:17",
            "label": "",
            "description": "Yannick Carrasco (Monaco) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "2 - 19:42",
            "label": "",
            "description": "Claudio Marchisio (Juventus) receives a pass and tries his luck with a long range powerful effort. His poorly placed shot lacks accuracy and flies miles wide of the left post."
        },
        {
            "gameTime": "2 - 19:12",
            "label": "funfact",
            "description": "1:1 the latest stats for both teams in respect of shots on target."
        },
        {
            "gameTime": "2 - 19:02",
            "label": "",
            "description": "Stephan Lichtsteiner (Juventus) clips an inviting cross into the box, but there's no one in a position to get on the end of it. It's a throw in for Monaco."
        },
        {
            "gameTime": "2 - 18:03",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 12:5."
        },
        {
            "gameTime": "2 - 17:39",
            "label": "",
            "description": "Alvaro Morata (Juventus) didn't hesitate to knock his opponent down with a harsh sliding tackle. William Collum could probably show him a yellow, but he only goes with blowing the whistle for a foul."
        },
        {
            "gameTime": "2 - 16:26",
            "label": "",
            "description": "Bernardo Silva (Monaco) takes a rebound on the edge of the box and slams the ball well wide of the right post."
        },
        {
            "gameTime": "2 - 16:20",
            "label": "",
            "description": "Yannick Carrasco (Monaco) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "2 - 16:02",
            "label": "",
            "description": "Geoffrey Kondogbia (Monaco) tries his luck with a shot from long distance after receiving a good pass. He hits the ball poorly and sends it into orbit."
        },
        {
            "gameTime": "2 - 15:47",
            "label": "",
            "description": "Geoffrey Kondogbia finds some space and receives a very precise long pass from Dimitar Berbatov (Monaco)."
        },
        {
            "gameTime": "2 - 13:55",
            "label": "corner",
            "description": "Joao Moutinho (Monaco) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 13:28",
            "label": "",
            "description": "A through ball from Yannick Carrasco (Monaco) fails to reach Dimitar Berbatov as one of the defending players reacts brilliantly to intercept the effort. If the pass had been produced a little bit earlier, Dimitar Berbatov could have got into a promising position. The ball goes out for a corner. Monaco can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 13:03",
            "label": "",
            "description": "Dimitar Berbatov (Monaco) sends a low pass from outside the box to Anthony Martial. He lines up a shot, but the defence intercepts at the last moment."
        },
        {
            "gameTime": "2 - 12:06",
            "label": "",
            "description": "Joao Moutinho (Monaco) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "2 - 11:50",
            "label": "corner",
            "description": "Yannick Carrasco (Monaco) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 11:26",
            "label": "",
            "description": "Yannick Carrasco (Monaco) tries to send a low pass into the box, but it's blocked and cleared. The referee blows his whistle, Monaco are awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:10",
            "label": "corner",
            "description": "Yannick Carrasco (Monaco) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 10:46",
            "label": "",
            "description": "Anthony Martial (Monaco) and Yannick Carrasco perform a quick tiki taka to get past two defenders and then continue the move along the side line. Yannick Carrasco (Monaco) tries to send a pass but it's blocked. Monaco have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 09:02",
            "label": "",
            "description": "The game is pretty dull as Monaco are just passing the ball from player to player. Nothing lasts forever, though, and they finally make a mistake, allowing the opposition to pick up the ball."
        },
        {
            "gameTime": "2 - 07:29",
            "label": "corner",
            "description": "Joao Moutinho (Monaco) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 07:08",
            "label": "",
            "description": "Anthony Martial (Monaco) races towards goal but the defender gets back well to make a challenge. The ball goes out of play. Monaco are awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:24",
            "label": "",
            "description": "Flag up against Alvaro Morata (Juventus). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 04:32",
            "label": "y-card",
            "description": "William Collum shows the yellow card to Bernardo Silva (Monaco) for a heavy challenge."
        },
        {
            "gameTime": "2 - 04:10",
            "label": "",
            "description": "Anthony Martial (Monaco) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 04:05",
            "label": "",
            "description": "Yannick Carrasco (Monaco) fails to deliver a cross from the free kick as his attempt is thwarted by the opposition's defence."
        },
        {
            "gameTime": "2 - 03:14",
            "label": "",
            "description": "Arturo Vidal (Juventus) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision! Monaco win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 02:06",
            "label": "",
            "description": "Yannick Carrasco (Monaco) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 01:50",
            "label": "",
            "description": "Bernardo Silva (Monaco) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 01:19",
            "label": "",
            "description": "Anthony Martial (Monaco) trips an opponent with a slide tackle. William Collum stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "2 - 00:54",
            "label": "",
            "description": "Anthony Martial (Monaco) swings a cross into the box, but it's far too close to Gianluigi Buffon, who smothers the ball."
        },
        {
            "gameTime": "2 - 00:07",
            "label": "substitution",
            "description": "Leonardo Jardim has decided to make a substitution during the half time break. Dimitar Berbatov (Monaco) comes on the pitch for Jeremy Toulalan."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "William Collum blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We have seen a few chances and nice movements, but the overall impression of the game is rather average and not hugely entertaining. The home side is dominant and dictating the tempo of the game, mainly because of their work rate and accurate passing. The home team makes a lot of passes and attempts to maintain possession, while the visitors look to counter attack."
        },
        {
            "gameTime": "1 - 46:03",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:12",
            "label": "",
            "description": "shows too much aggression while trying to break free from his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 45:04",
            "label": "",
            "description": "attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:07",
            "label": "",
            "description": "Alvaro Morata sprays a wonderful pass out to Carlos Tevez (Juventus), who cannot get enough power or direction to cause Danijel Subasic problems and the goalkeeper is able to watch the ball go just wide of the right post."
        },
        {
            "gameTime": "1 - 43:10",
            "label": "",
            "description": "Andrea Pirlo (Juventus) sends a chip pass into the box, but Danijel Subasic is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 42:23",
            "label": "",
            "description": "Yannick Carrasco (Monaco) climbs high to connect with a cross on the edge of the box, but his header is off target."
        },
        {
            "gameTime": "1 - 41:26",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) fizzes over a cross which doesn't cause any problems. The ball is off of the pitch and it's a goal kick for Juventus."
        },
        {
            "gameTime": "1 - 41:19",
            "label": "",
            "description": "Some neat passing and movement from Monaco as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 38:47",
            "label": "",
            "description": "Yannick Carrasco (Monaco) attempts to find one of his teammates with a cross from the resultant free kick, but he fails to hit the ball properly and sends it off the pitch."
        },
        {
            "gameTime": "1 - 38:21",
            "label": "",
            "description": "A clumsy foul by Arturo Vidal (Juventus) and William Collum blows his whistle. Monaco will take a free kick."
        },
        {
            "gameTime": "1 - 37:26",
            "label": "",
            "description": "Andrea Pirlo (Juventus) fails to pick a body out in the box with an over hit chip pass. The ball goes out of play and Monaco will have a goal kick."
        },
        {
            "gameTime": "1 - 36:51",
            "label": "funfact",
            "description": "The total number of attempts is 12:5."
        },
        {
            "gameTime": "1 - 34:16",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 32:47",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) leaps high to meet a lofted pass inside the six yard box, but his header flies yards wide of the left post."
        },
        {
            "gameTime": "1 - 32:15",
            "label": "",
            "description": "Joao Moutinho (Monaco) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 32:09",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Bernardo Silva (Monaco) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 30:05",
            "label": "injury",
            "description": "Looks like Joao Moutinho (Monaco) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 28:48",
            "label": "",
            "description": "Anthony Martial (Monaco) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 27:54",
            "label": "",
            "description": "Joao Moutinho (Monaco) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "1 - 26:01",
            "label": "",
            "description": "Andrea Pirlo (Juventus) sends a cross into the box, but Danijel Subasic comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 25:48",
            "label": "",
            "description": "The ball is cleared after Alvaro Morata (Juventus) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 25:22",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "Claudio Marchisio (Juventus) gives away a foul for a clumsy challenge. Referee William Collum saw the whole situation."
        },
        {
            "gameTime": "1 - 23:13",
            "label": "",
            "description": "Anthony Martial (Monaco) was trying to get to the ball but clattered into the legs of the opponent as well. William Collum blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 22:42",
            "label": "",
            "description": "An attempted cross from Layvin Kurzawa (Monaco) is cleared."
        },
        {
            "gameTime": "1 - 22:17",
            "label": "",
            "description": "Andrea Pirlo (Juventus) probably handled the ball."
        },
        {
            "gameTime": "1 - 22:00",
            "label": "",
            "description": "fires the ball from distance, but it's blocked by a defender."
        },
        {
            "gameTime": "1 - 20:19",
            "label": "",
            "description": "decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "1 - 20:06",
            "label": "",
            "description": "Arturo Vidal (Juventus) makes an overly aggressive challenge and William Collum blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 19:42",
            "label": "",
            "description": "Geoffrey Kondogbia (Monaco) gets into a good scoring position. He creates some space for himself and tries his luck from distance. His decent effort towards the middle of the goal is, however, saved by Gianluigi Buffon!"
        },
        {
            "gameTime": "1 - 18:24",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 17:20",
            "label": "",
            "description": "Juventus spell of possession comes to an end after a mistake. The ball is out of play. Monaco will have a throw in."
        },
        {
            "gameTime": "1 - 14:51",
            "label": "corner",
            "description": "Joao Moutinho (Monaco) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 14:19",
            "label": "",
            "description": "Bernardo Silva (Monaco) produces a dangerous low pass into the penalty area, but the defence manage to cut it out. Monaco get a corner."
        },
        {
            "gameTime": "1 - 14:15",
            "label": "",
            "description": "Bernardo Silva (Monaco) and Joao Moutinho combine well with a quick one two and their attacking move continues."
        },
        {
            "gameTime": "1 - 13:49",
            "label": "",
            "description": "pulls the trigger and strikes the ball towards goal from long range, but his effort is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 12:51",
            "label": "",
            "description": "Juventus try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "1 - 12:43",
            "label": "",
            "description": "makes a slide tackle, but referee William Collum blows for a foul."
        },
        {
            "gameTime": "1 - 12:14",
            "label": "",
            "description": "William Collum blows his whistle. Alvaro Morata (Juventus) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 11:05",
            "label": "",
            "description": "Geoffrey Kondogbia (Monaco) clearly handles the ball, but he is surprised when the referee blows his whistle."
        },
        {
            "gameTime": "1 - 10:43",
            "label": "",
            "description": "A pass from Jeremy Toulalan (Monaco) is intercepted by Gianluigi Buffon and the move breaks down."
        },
        {
            "gameTime": "1 - 10:14",
            "label": "",
            "description": "attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball is behind the touchline and Monaco will take a throw in."
        },
        {
            "gameTime": "1 - 09:30",
            "label": "",
            "description": "Layvin Kurzawa (Monaco) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "1 - 09:09",
            "label": "",
            "description": "Andrea Pirlo (Juventus) extricates himself from the difficult situation with a good pass, comfortably eluding the pressing opponent."
        },
        {
            "gameTime": "1 - 07:29",
            "label": "",
            "description": "Danijel Subasic pulls off a run of the mill save from a header by Carlos Tevez (Juventus) after a cross from the side."
        },
        {
            "gameTime": "1 - 06:53",
            "label": "",
            "description": "William Collum blows the whistle, Joao Moutinho (Monaco) is penalised for a foul."
        },
        {
            "gameTime": "1 - 05:03",
            "label": "",
            "description": "Geoffrey Kondogbia (Monaco) has an effort on goal, but he misses to the right of the goal."
        },
        {
            "gameTime": "1 - 04:48",
            "label": "",
            "description": "and Bernardo Silva (Monaco) attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 03:59",
            "label": "",
            "description": "William Collum blows his whistle after Claudio Marchisio (Juventus) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 02:14",
            "label": "",
            "description": "Joao Moutinho (Monaco) was too forceful with his tackle and William Collum interrupted the game to signal a free kick. Juventus take a quick free kick and immediately restart play."
        },
        {
            "gameTime": "1 - 01:54",
            "label": "",
            "description": "Yannick Carrasco (Monaco) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 01:40",
            "label": "",
            "description": "Yannick Carrasco (Monaco) will take a free kick. Is he going to strike the ball directly at the goal? Let's find out!"
        },
        {
            "gameTime": "1 - 00:56",
            "label": "y-card",
            "description": "Giorgio Chiellini (Juventus) is literally asking for a yellow card with his behaviour. The referee agrees and books him."
        },
        {
            "gameTime": "1 - 00:15",
            "label": "",
            "description": "picks out Bernardo Silva (Monaco) with a fine lofted pass, but the latter wasn't able to create some space to get into shooting range."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Monaco will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "William Collum will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. The host team were superior on the pitch today. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        }
    ],
    "gameAwayTeam": "Juventus",
    "gameDate": "22/04/2015 - 21:45",
    "gameHomeTeam": "Monaco",
    "gameScore": "0 - 0"
}