{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-10-03 - 19-30 Chelsea 1 - 3 Southampton/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The visitors certainly had the better of things. Both sides adopted slow build up play tactics today."
        },
        {
            "gameTime": "2 - 50:05",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:44",
            "label": "",
            "description": "Oscar (Chelsea) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 45:55",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Sadio Mane as he is replaced by Maya Yoshida (Southampton)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 5 min. of added time."
        },
        {
            "gameTime": "2 - 41:49",
            "label": "corner",
            "description": "The resulting corner from Cesc Fabregas (Chelsea) is cleared by the defence."
        },
        {
            "gameTime": "2 - 41:04",
            "label": "",
            "description": "Falcao (Chelsea) takes the free kick from the edge of the box, but the goalkeeper perfectly sets up the defensive wall and his effort is thwarted. Chelsea have a corner."
        },
        {
            "gameTime": "2 - 40:36",
            "label": "y-card",
            "description": "Robert Madley shows a yellow card to Graziano Pelle (Southampton) for a tough tackle. Chelsea are awarded the free kick."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "corner",
            "description": "The resulting corner from Pedro (Chelsea) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 38:42",
            "label": "",
            "description": "Pedro (Chelsea) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 38:08",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Pedro (Chelsea), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 36:26",
            "label": "",
            "description": "Half chance! Loic Remy (Chelsea) plays a pass into the box, but Maarten Stekelenburg reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 35:49",
            "label": "",
            "description": "Graziano Pelle (Southampton) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 34:08",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 33:31",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 32:21",
            "label": "substitution",
            "description": "Ronald Koeman has decided to introduce fresh legs, with Jay Rodriguez (Southampton) replacing Dusan Tadic."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "y-card",
            "description": "Robert Madley shows the yellow card to James Ward Prowse (Southampton) for a heavy challenge."
        },
        {
            "gameTime": "2 - 31:46",
            "label": "",
            "description": "Oscar (Chelsea) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the left post."
        },
        {
            "gameTime": "2 - 31:08",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from James Ward Prowse (Southampton). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 30:56",
            "label": "",
            "description": "Dusan Tadic (Southampton) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. It will be a corner kick for Southampton."
        },
        {
            "gameTime": "2 - 27:55",
            "label": "substitution",
            "description": "Here comes a substitution. Loic Remy (Chelsea) is brought on as a substitute for Nemanja Matic."
        },
        {
            "gameTime": "2 - 26:55",
            "label": "soccer-ball",
            "description": "Goal! Sadio Mane displays great vision and sends a pass to Graziano Pelle (Southampton), who shows brilliant composure inside the box to bury the ball into the bottom left corner. The score is 1:3."
        },
        {
            "gameTime": "2 - 26:41",
            "label": "",
            "description": "The free kick from Cesc Fabregas (Chelsea) is cleared away from danger by one of the defenders."
        },
        {
            "gameTime": "2 - 26:33",
            "label": "",
            "description": "A player from Southampton takes his opponent down, the referee blows his whistle for a foul. It's a free kick to Chelsea, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 25:31",
            "label": "",
            "description": "A lofted cross from Steven Davis (Southampton) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 24:54",
            "label": "attendance",
            "description": "The attendance for today's match is 41642."
        },
        {
            "gameTime": "2 - 23:26",
            "label": "",
            "description": "James Ward Prowse (Southampton) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "2 - 22:41",
            "label": "",
            "description": "James Ward Prowse (Southampton) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "2 - 21:56",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) makes a rough challenge and the referee blows for a foul. A free kick is awarded to Southampton."
        },
        {
            "gameTime": "2 - 21:25",
            "label": "",
            "description": "What a chance to score from the free kick by Dusan Tadic (Southampton). He unleashed a sharp shot that sailed just wide of the right post."
        },
        {
            "gameTime": "2 - 19:57",
            "label": "",
            "description": "Falcao (Chelsea) brings down his opponent with a very late tackle. Southampton get a free kick."
        },
        {
            "gameTime": "2 - 18:55",
            "label": "substitution",
            "description": "It will be a substitution. Pedro (Chelsea) is ready to enter the pitch as Willian walks off."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 16:21",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) fails to find any of his teammates inside the box as his pass is blocked. Chelsea force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 14:55",
            "label": "soccer-ball",
            "description": "Goal! Graziano Pelle displays great vision and sends a pass to Sadio Mane (Southampton), who shows brilliant composure inside the box to bury the ball into the back of the net. The score is 1:2."
        },
        {
            "gameTime": "2 - 11:48",
            "label": "y-card",
            "description": "That will be a yellow card for one of the players. The one who gets booked is Falcao (Chelsea)."
        },
        {
            "gameTime": "2 - 09:05",
            "label": "",
            "description": "Oscar (Chelsea) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "2 - 08:36",
            "label": "corner",
            "description": "The resulting corner from Cesc Fabregas (Chelsea) is cleared."
        },
        {
            "gameTime": "2 - 08:25",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) fails to send a pass into the box as his effort is cut out. The ball is out of play and Chelsea manage to earn a corner."
        },
        {
            "gameTime": "2 - 06:51",
            "label": "",
            "description": "pulls the shirt of his opponent and only escapes without punishment due to the benevolence of the referee."
        },
        {
            "gameTime": "2 - 05:35",
            "label": "",
            "description": "James Ward Prowse (Southampton) attempts to find one of his teammates with a free kick, but the defence is well positioned and clears the ball away from danger."
        },
        {
            "gameTime": "2 - 05:25",
            "label": "",
            "description": "Chelsea concede a free kick following a bad challenge. A free kick to Southampton."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "",
            "description": "James Ward Prowse (Southampton) gets the ball from a rebound before trying his luck with a good long range shot which threatens the goalkeeper! The ball sails painfully wide of the right post!"
        },
        {
            "gameTime": "2 - 03:52",
            "label": "",
            "description": "Sadio Mane (Southampton) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 03:21",
            "label": "",
            "description": "Sadio Mane (Southampton) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Asmir Begovic."
        },
        {
            "gameTime": "2 - 03:06",
            "label": "",
            "description": "Eden Hazard (Chelsea) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here is a change after the half time break. Ramires is replaced by Nemanja Matic (Chelsea)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The need to improve in the second half has brought about a change. Oriol Romeu comes off for James Ward Prowse (Southampton)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Not a lot happening in the first half, it hasn't been the best game so far in terms of quality. Neither side has gained the upper hand as yet. The home side are attempting to hold onto the ball for as long as possible. The away team, on the other hand, are playing long ball football."
        },
        {
            "gameTime": "1 - 47:42",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:54",
            "label": "",
            "description": "Willian (Chelsea) unleashes a powerful shot from the free kick but it only hits the defensive wall."
        },
        {
            "gameTime": "1 - 46:29",
            "label": "",
            "description": "Victor Wanyama (Southampton) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play. Chelsea are awarded a free kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 43:01",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Steven Davis (Southampton) produces a brilliant first time effort from the edge of the penalty area after receiving the ball from Graziano Pelle. The goalkeeper would need to possess super powers to stop this shot from reaching the left side of the goal."
        },
        {
            "gameTime": "1 - 42:50",
            "label": "y-card",
            "description": "Ramires (Chelsea) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "1 - 41:27",
            "label": "corner",
            "description": "Asmir Begovic comes off his line to intercept the corner from Steven Davis (Southampton)."
        },
        {
            "gameTime": "1 - 41:11",
            "label": "",
            "description": "Ryan Bertrand (Southampton) collects a great pass inside the box and misses a sitter. His shot was directed towards the left post, but the goalkeeper pulls off a marvellous diving save and denies him. Southampton win a corner."
        },
        {
            "gameTime": "1 - 39:35",
            "label": "corner",
            "description": "Steven Davis (Southampton) sends the corner into the box, but Asmir Begovic intercepts it and averts the threat."
        },
        {
            "gameTime": "1 - 39:24",
            "label": "",
            "description": "Victor Wanyama (Southampton) sends a teasing cross into the area, but Asmir Begovic intercepts the ball. The referee blows his whistle, Southampton are awarded a corner kick."
        },
        {
            "gameTime": "1 - 38:51",
            "label": "corner",
            "description": "Steven Davis (Southampton) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 37:57",
            "label": "",
            "description": "Steven Davis (Southampton) whips in the free kick, but one of the defenders comfortably clears the ball away. Corner kick. Southampton will have an opportunity."
        },
        {
            "gameTime": "1 - 37:43",
            "label": "",
            "description": "Foul! Gary Cahill (Chelsea) is penalised for pulling back his opponent. A free kick has been awarded to Southampton."
        },
        {
            "gameTime": "1 - 35:06",
            "label": "",
            "description": "Cedric Soares (Southampton) was holding his opponent and can be glad he didn't receive a yellow card."
        },
        {
            "gameTime": "1 - 33:23",
            "label": "y-card",
            "description": "Sadio Mane (Southampton) is given a yellow card."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "",
            "description": "A player from Southampton pulled an opponent down, forcing the referee to blow his whistle."
        },
        {
            "gameTime": "1 - 27:36",
            "label": "",
            "description": "Dusan Tadic (Southampton) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 25:59",
            "label": "y-card",
            "description": "Ryan Bertrand (Southampton) has received a yellow card for his foul."
        },
        {
            "gameTime": "1 - 25:06",
            "label": "",
            "description": "Oscar (Chelsea) collects a great pass inside the box and misses a sitter. His shot was directed under the crossbar, but the goalkeeper pulls off a marvellous diving save and denies him."
        },
        {
            "gameTime": "1 - 24:15",
            "label": "",
            "description": "Flag goes up against Sadio Mane (Southampton) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 23:40",
            "label": "",
            "description": "Maarten Stekelenburg makes a save to deny the long range effort from Eden Hazard (Chelsea) towards the middle of the goal."
        },
        {
            "gameTime": "1 - 22:06",
            "label": "",
            "description": "Oscar (Chelsea) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 19:40",
            "label": "",
            "description": "Oscar (Chelsea) receives a pass and tries his luck with a long range powerful effort. His poorly placed shot lacks accuracy and flies way over the crossbar."
        },
        {
            "gameTime": "1 - 18:40",
            "label": "",
            "description": "Sadio Mane (Southampton) finds some space for a shot after collecting the ball and unleashes a rocket of a shot from long distance towards the net. The goalkeeper thwarts the effort."
        },
        {
            "gameTime": "1 - 15:39",
            "label": "",
            "description": "Steven Davis (Southampton) receives a precise pass inside the box and takes a shot that flies just wide of the right post."
        },
        {
            "gameTime": "1 - 15:08",
            "label": "",
            "description": "Oscar (Chelsea) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "1 - 12:07",
            "label": "",
            "description": "Dusan Tadic (Southampton) sends a lofted cross into the box from the free kick, but Asmir Begovic guesses his intention and plucks the ball out of the air."
        },
        {
            "gameTime": "1 - 11:35",
            "label": "",
            "description": "Ramires (Chelsea) gives away a foul for a fierce tackle on an opponent. That's a free kick to Southampton."
        },
        {
            "gameTime": "1 - 11:05",
            "label": "corner",
            "description": "Dusan Tadic (Southampton) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "1 - 10:53",
            "label": "",
            "description": "Sadio Mane (Southampton) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee points to the corner flag. It's a corner to Southampton."
        },
        {
            "gameTime": "1 - 09:59",
            "label": "soccer-ball",
            "description": "Willian (Chelsea) successfully takes the free kick. He curls the ball over the wall of defenders from about 25 metres from goal and it bounces in off the inside of the right post."
        },
        {
            "gameTime": "1 - 08:54",
            "label": "y-card",
            "description": "Oriol Romeu (Southampton) picks up a yellow card for a foul. Chelsea earn a free kick."
        },
        {
            "gameTime": "1 - 08:20",
            "label": "",
            "description": "Dusan Tadic (Southampton) crosses the ball in from a free kick, but Asmir Begovic reads it well and gathers the ball."
        },
        {
            "gameTime": "1 - 07:49",
            "label": "",
            "description": "Ramires (Chelsea) gives away a foul for a clumsy challenge. Referee Robert Madley saw the whole situation. Southampton have a free kick."
        },
        {
            "gameTime": "1 - 07:00",
            "label": "corner",
            "description": "The corner from Dusan Tadic (Southampton) is intercepted by Asmir Begovic."
        },
        {
            "gameTime": "1 - 06:38",
            "label": "",
            "description": "Steven Davis (Southampton) takes the free kick and sends the ball into the penalty area, but the opposition's defence is ready. The ball is out of play and the linesman points at the corner flag. Corner to Southampton."
        },
        {
            "gameTime": "1 - 06:30",
            "label": "",
            "description": "Robert Madley blows his whistle. Cesc Fabregas (Chelsea) commits a foul after dangerous play. Southampton win a free kick."
        },
        {
            "gameTime": "1 - 05:33",
            "label": "",
            "description": "Graziano Pelle (Southampton) is caught offside!"
        },
        {
            "gameTime": "1 - 03:22",
            "label": "",
            "description": "Dangerous play by Ramires (Chelsea). Robert Madley blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 01:21",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Chelsea will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Robert Madley is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Head to head clashes between these two clubs: 27.2.2016 1:2, 15.3.2015 1:1, 28.12.2014 1:1, 1.1.2014 0:3, 1.12.2013 1:3."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "2:2 That's the most common Chelsea's result of the season. Already 5 times their match ended with that score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "5x that's the number of matches that Chelsea have lost at home so far this season, while they have lost 7x away."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The visitors certainly had the better of things. Both sides adopted slow build up play tactics today."
        }
    ],
    "gameAwayTeam": "Southampton",
    "gameDate": "03/10/2015 - 19:30",
    "gameHomeTeam": "Chelsea",
    "gameScore": "1 - 3"
}