{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-08-20 - 17-00 Burnley 2 - 0 Liverpool/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. The visitors certainly had the better of things. The home team attempted to leave the opposition defence outnumbered and hit them on the break. The visitors tried to keep the ball on the ground and play a passing game."
        },
        {
            "gameTime": "2 - 48:33",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Aiden O'Neill (Burnley) will replace Andre Gray."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "corner",
            "description": "The corner from Scott Arfield (Burnley) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 46:02",
            "label": "",
            "description": "Stephen Ward (Burnley) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention. The linesman points to the corner flag, Burnley are going to take it."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:42",
            "label": "corner",
            "description": "Alberto Moreno (Liverpool) works the corner short."
        },
        {
            "gameTime": "2 - 44:39",
            "label": "",
            "description": "Liverpool will take a corner kick. Georginio Wijnaldum (Liverpool) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 44:15",
            "label": "corner",
            "description": "Philippe Coutinho (Liverpool) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 44:06",
            "label": "",
            "description": "Marko Grujic (Liverpool) fails to send a pass into the box as his effort is cut out. Now Liverpool have a corner."
        },
        {
            "gameTime": "2 - 41:12",
            "label": "",
            "description": "Alberto Moreno (Liverpool) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 40:02",
            "label": "",
            "description": "Roberto Firmino (Liverpool) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "2 - 39:34",
            "label": "",
            "description": "Stephen Ward receives a sweet cross inside the box from Michael Keane (Burnley), but one of the defenders rushes in bravely to intercept the move."
        },
        {
            "gameTime": "2 - 36:38",
            "label": "substitution",
            "description": "Substitution. Sam Vokes will be replaced by Lukas Jutkiewicz (Burnley)."
        },
        {
            "gameTime": "2 - 35:37",
            "label": "",
            "description": "Roberto Firmino (Liverpool) takes a mid range shot, but the ball sails high over the bar."
        },
        {
            "gameTime": "2 - 35:15",
            "label": "corner",
            "description": "Liverpool work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "2 - 35:05",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) sends a teasing cross into the area, but Tom Heaton intercepts the ball. The linesman makes the right call and Liverpool will have a corner."
        },
        {
            "gameTime": "2 - 32:26",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to substitute Adam Lallana and he is replaced by Marko Grujic (Liverpool)."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and James Milner leaves the pitch and Alberto Moreno (Liverpool) comes on."
        },
        {
            "gameTime": "2 - 31:44",
            "label": "",
            "description": "Burnley are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "2 - 28:49",
            "label": "",
            "description": "Divock Origi (Liverpool) commits a foul on his opponent and it looks like it should be the other way around at first glance, but the referee makes the right decision in awarding a free kick to the other team."
        },
        {
            "gameTime": "2 - 26:55",
            "label": "",
            "description": "Andre Gray (Burnley) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 26:03",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 3:26."
        },
        {
            "gameTime": "2 - 24:42",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "2 - 23:02",
            "label": "funfact",
            "description": "The percentage of ball possession is – 20:80."
        },
        {
            "gameTime": "2 - 21:06",
            "label": "",
            "description": "Andre Gray (Burnley) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the left post."
        },
        {
            "gameTime": "2 - 20:00",
            "label": "y-card",
            "description": "Jordan Henderson (Liverpool) gets booked for the first time in this match."
        },
        {
            "gameTime": "2 - 19:11",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Divock Origi (Liverpool) is coming onto the pitch as Daniel Sturridge cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 17:46",
            "label": "corner",
            "description": "Liverpool didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 17:23",
            "label": "corner",
            "description": "James Milner (Liverpool) swings in a cross from the corner, but Tom Heaton reads it well and gathers the ball. Liverpool have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 17:06",
            "label": "",
            "description": "A pass into the penalty area from Nathaniel Clyne (Liverpool) is intercepted by the defence. Liverpool have a corner."
        },
        {
            "gameTime": "2 - 16:09",
            "label": "",
            "description": "Scott Arfield (Burnley) commits a rough challenge and Lee Mason blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "",
            "description": "James Milner (Liverpool) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it. The ball goes out of play and Burnley will have a goal kick."
        },
        {
            "gameTime": "2 - 13:41",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) latches on to an accurate pass on the edge of the box and immediately unleashes a shot which is wide of the mark."
        },
        {
            "gameTime": "2 - 12:12",
            "label": "corner",
            "description": "James Milner (Liverpool) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 11:58",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) tries to slide the ball through to a teammate but it's well blocked by a defender. The referee and one of his assistants signal for a corner kick to Liverpool."
        },
        {
            "gameTime": "2 - 10:55",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Johann Gudmundsson (Burnley) for Steven Defour."
        },
        {
            "gameTime": "2 - 10:12",
            "label": "",
            "description": "Liverpool are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "2 - 08:08",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "2 - 07:52",
            "label": "corner",
            "description": "Liverpool quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 06:31",
            "label": "",
            "description": "Roberto Firmino (Liverpool) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. The referee blows his whistle, Liverpool are awarded a corner kick."
        },
        {
            "gameTime": "2 - 05:59",
            "label": "",
            "description": "Andre Gray (Burnley) dribbles into the box, but Simon Mignolet is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 05:05",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the middle of the goal. Tom Heaton has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 03:05",
            "label": "",
            "description": "Jordan Henderson (Liverpool) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "2 - 01:01",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Daniel Sturridge (Liverpool), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Lee Mason blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game. It hasn't been very exciting show so far. The first half was definitely edged by the visiting team. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 46:19",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) gets on the ball and beats an opponent, but his run is stopped by the referee Lee Mason who sees an offensive foul."
        },
        {
            "gameTime": "1 - 42:15",
            "label": "funfact",
            "description": "The ball possession is 20:80."
        },
        {
            "gameTime": "1 - 41:52",
            "label": "",
            "description": "The linesman raises his flag. Andre Gray (Burnley) is adjudged offside."
        },
        {
            "gameTime": "1 - 41:08",
            "label": "",
            "description": "The Liverpool players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 39:02",
            "label": "",
            "description": "Great touch by Nathaniel Clyne (Liverpool) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "1 - 37:00",
            "label": "soccer-ball",
            "description": "Goal! Steven Defour tees up Andre Gray (Burnley) on the edge of the box and he fires the ball into the bottom left corner. 2:0."
        },
        {
            "gameTime": "1 - 36:15",
            "label": "",
            "description": "This shall not pass! Adam Lallana (Liverpool) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 35:20",
            "label": "",
            "description": "Andre Gray (Burnley) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 34:10",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) tries to find James Milner, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 32:54",
            "label": "corner",
            "description": "James Milner (Liverpool) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 32:43",
            "label": "",
            "description": "James Milner (Liverpool) looks to break free, but an opposing player clears the ball away. Liverpool force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 32:28",
            "label": "",
            "description": "A lofted cross from James Milner (Liverpool) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "1 - 31:54",
            "label": "",
            "description": "Good defending. Philippe Coutinho (Liverpool) tries to find Georginio Wijnaldum inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 29:21",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the left post."
        },
        {
            "gameTime": "1 - 28:22",
            "label": "",
            "description": "The Liverpool players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 26:25",
            "label": "",
            "description": "Dean Marney (Burnley) trips an opponent with a slide tackle. Lee Mason stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 25:35",
            "label": "corner",
            "description": "James Milner (Liverpool) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 25:19",
            "label": "",
            "description": "Adam Lallana (Liverpool) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The ball is out of play and the linesman points at the corner flag. Corner to Liverpool."
        },
        {
            "gameTime": "1 - 23:57",
            "label": "",
            "description": "The ball is off of the pitch and it's a goal kick for Liverpool. Steven Defour (Burnley) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 21:45",
            "label": "",
            "description": "Adam Lallana (Liverpool) decided to shoot after receiving a sweet pass. The ball went low to the middle of the goal, but Tom Heaton made a easy save."
        },
        {
            "gameTime": "1 - 20:35",
            "label": "",
            "description": "A long pass, executed by Nathaniel Clyne (Liverpool), missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 18:33",
            "label": "",
            "description": "Neat link up play between Daniel Sturridge (Liverpool) and Philippe Coutinho, but Tom Heaton reads the game well and the move breaks down."
        },
        {
            "gameTime": "1 - 16:55",
            "label": "",
            "description": "Scott Arfield (Burnley) sends a long ball in, but Simon Mignolet comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 15:33",
            "label": "corner",
            "description": "James Milner (Liverpool) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 15:20",
            "label": "",
            "description": "A raking crossfield pass from Jordan Henderson (Liverpool) lacks accuracy and the opposition gain possession. Corner kick. Liverpool will have an opportunity."
        },
        {
            "gameTime": "1 - 14:03",
            "label": "corner",
            "description": "James Milner (Liverpool) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 13:47",
            "label": "",
            "description": "Roberto Firmino (Liverpool) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. Liverpool get a corner."
        },
        {
            "gameTime": "1 - 12:46",
            "label": "",
            "description": "Dejan Lovren (Liverpool) passes the ball onto James Milner, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 11:21",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) collects a pass and has an effort from 20 metres out, but it flies just over the crossbar."
        },
        {
            "gameTime": "1 - 09:41",
            "label": "",
            "description": "Dean Marney (Burnley) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Lee Mason blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 08:51",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) unleashes a shot from 25 metres out but is unable to find the target and it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 07:45",
            "label": "corner",
            "description": "Liverpool take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) connects with a pass but sees his shot from the edge of the box blocked. It will be a corner kick for Liverpool."
        },
        {
            "gameTime": "1 - 05:00",
            "label": "",
            "description": "One of the players from Burnley times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 03:35",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "1 - 02:00",
            "label": "soccer-ball",
            "description": "Goal! Andre Gray tees up Sam Vokes (Burnley) on the edge of the box and he fires the ball into the left side of the goal. 1:0."
        },
        {
            "gameTime": "1 - 01:15",
            "label": "",
            "description": "Neat passing move from Liverpool in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Lee Mason."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "1.2 Average number of goals scored in the last 5 matches between these two teams."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 0:2 in the last game between Burnley and Stoke City."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. The visitors certainly had the better of things. The home team attempted to leave the opposition defence outnumbered and hit them on the break. The visitors tried to keep the ball on the ground and play a passing game."
        }
    ],
    "gameAwayTeam": "Liverpool",
    "gameDate": "20/08/2016 - 17:00",
    "gameHomeTeam": "Burnley",
    "gameScore": "2 - 0"
}