{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2015-10-24 - 16-30 Bayern Munich 4 - 0 FC Koln/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Bayern Munich were better today and displayed masterful control and movement. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 45:14",
            "label": "whistle",
            "description": "That's it for today, Florian Meyer has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 44:40",
            "label": "funfact",
            "description": "The statistic for corner kicks – 10:0."
        },
        {
            "gameTime": "2 - 44:01",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) sprays a pass out to Robert Lewandowski, but he can't beat his man to get to the ball."
        },
        {
            "gameTime": "2 - 41:21",
            "label": "",
            "description": "Dominique Heintz (Koln) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 40:57",
            "label": "",
            "description": "The game is interrupted. Arturo Vidal (Bayern Munich) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "2 - 39:32",
            "label": "",
            "description": "Dangerous play by Kingsley Coman (Bayern Munich). Florian Meyer blows his whistle for a foul. FC Koln earn a free kick."
        },
        {
            "gameTime": "2 - 39:03",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) connects with a cross from the side, but produces a header which goes way over the bar. The ball is off of the pitch and it's a goal kick for FC Koln."
        },
        {
            "gameTime": "2 - 37:03",
            "label": "attendance",
            "description": "The attendance is 75000."
        },
        {
            "gameTime": "2 - 35:29",
            "label": "",
            "description": "Yuya Osako (Koln) delivers a promising cross into the box, but it's cleared. The ball is behind the touchline and FC Koln will take a throw in."
        },
        {
            "gameTime": "2 - 32:22",
            "label": "substitution",
            "description": "Pep Guardiola has decided to substitute Thomas Muller and he is replaced by Thiago Alcantara (Bayern Munich)."
        },
        {
            "gameTime": "2 - 31:54",
            "label": "soccer-ball",
            "description": "Thomas Muller (Bayern Munich) steps up to take the penalty and leaves the keeper helpless with a shot into the bottom right corner."
        },
        {
            "gameTime": "2 - 31:34",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 30:57",
            "label": "penalty",
            "description": "Dominique Heintz (Koln) was too forceful with his tackle and Florian Meyer interrupted the game to signal a free kick. The referee points to the penalty spot. Bayern Munich are awarded a penalty kick!"
        },
        {
            "gameTime": "2 - 29:59",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Dusan Svento (Koln) will replace Yannick Gerhardt."
        },
        {
            "gameTime": "2 - 29:36",
            "label": "",
            "description": "Philipp Hosiner (Koln) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "2 - 29:03",
            "label": "",
            "description": "Great teamplay by FC Koln as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 27:06",
            "label": "",
            "description": "What a great touch by Douglas Costa (Bayern Munich) as he controls a fine pass into the box and takes a shot to the right side of the goal, but an opposing player makes a clearance. Great defending."
        },
        {
            "gameTime": "2 - 26:01",
            "label": "",
            "description": "A neat pass is well received by David Alaba (Bayern Munich), who is lurking on the edge of the box and strikes the ball towards the middle of the target. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "2 - 25:39",
            "label": "substitution",
            "description": "We are about to witness a substitution. Philipp Hosiner (Koln) is replacing Simon Zoller."
        },
        {
            "gameTime": "2 - 24:40",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) produces a long range cannon of a shot after a nice pass. The ball heads towards the middle of the goal, but is easily stopped by a save from Timo Horn and the score remains the same."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) darts into the penalty area to latch on to a pass, and he unleashes a shot in the direction of the left post. Timo Horn is alert and denies him with a nice save."
        },
        {
            "gameTime": "2 - 23:55",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 20:13",
            "label": "",
            "description": "Jonas Hector (Koln) fashions a shot from the edge of the box after receiving an accurate pass. Manuel Neuer makes a comfortable save to stop the effort from flying into the middle of the goal."
        },
        {
            "gameTime": "2 - 20:00",
            "label": "",
            "description": "Simon Zoller (Koln) receives a pass and tries his luck with a long range powerful effort. His poorly placed shot lacks accuracy and flies miles wide of the right post."
        },
        {
            "gameTime": "2 - 19:42",
            "label": "substitution",
            "description": "Pep Guardiola prepares a substitution. Arjen Robben is replaced by Joshua Kimmich (Bayern Munich)."
        },
        {
            "gameTime": "2 - 16:43",
            "label": "soccer-ball",
            "description": "The ball is whipped in from the free kick and finds the head of Robert Lewandowski (Bayern Munich), who rises and produces an amazing header inside the right post."
        },
        {
            "gameTime": "2 - 16:31",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) takes a direct free kick."
        },
        {
            "gameTime": "2 - 16:30",
            "label": "substitution",
            "description": "Jerome Boateng comes off the pitch to be replaced by Javi Martinez (Bayern Munich)."
        },
        {
            "gameTime": "2 - 15:52",
            "label": "y-card",
            "description": "Matthias Lehmann (Koln) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 15:23",
            "label": "",
            "description": "Marcel Risse (Koln) sends in a lofted cross from a long range free kick, but his poor effort goes out of play."
        },
        {
            "gameTime": "2 - 14:49",
            "label": "",
            "description": "The ball spins up and hits the hand of Jerome Boateng (Bayern Munich) after he fails to control it and the referee blows his whistle for a foul. FC Koln are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 14:19",
            "label": "",
            "description": "David Alaba (Bayern Munich) wins the ball after the corner kick and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 14:07",
            "label": "corner",
            "description": "Arjen Robben (Bayern Munich) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 13:46",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) tries to send a pass but it's blocked. The linesman points to the corner flag, Bayern Munich are going to take it."
        },
        {
            "gameTime": "2 - 12:51",
            "label": "",
            "description": "Timo Horn makes a brilliant save! Arjen Robben (Bayern Munich) easily weaves through the defence and unleashes a shot from just outside of the box. His effort goes towards the left side of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "2 - 12:26",
            "label": "substitution",
            "description": "The referee signals a substitution. Yuya Osako (Koln) is brought on as a substitute for Anthony Modeste."
        },
        {
            "gameTime": "2 - 10:15",
            "label": "",
            "description": "Frederik Sorensen (Koln) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "2 - 09:12",
            "label": "y-card",
            "description": "Rafinha (Bayern Munich) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "2 - 08:36",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) picks up a pass and unleashes a low shot towards goal, but he can't generate enough power to trouble Timo Horn."
        },
        {
            "gameTime": "2 - 07:16",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) collects a great pass inside the box and misses a golden opportunity. His low shot was directed into the middle of the goal, but the goalkeeper does well to stop his effort."
        },
        {
            "gameTime": "2 - 06:06",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) produces an awful long range shot that goes high and wide."
        },
        {
            "gameTime": "2 - 04:50",
            "label": "",
            "description": "Half chance! Arjen Robben (Bayern Munich) plays a pass into the box, but Timo Horn reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 04:14",
            "label": "",
            "description": "Matthias Lehmann (Koln) tries his luck with a long range effort after receiving a precise pass, but Manuel Neuer has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 03:47",
            "label": "",
            "description": "David Alaba (Bayern Munich) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "2 - 03:40",
            "label": "corner",
            "description": "Arjen Robben (Bayern Munich) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "2 - 03:13",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Bayern Munich have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 02:47",
            "label": "",
            "description": "Timo Horn makes a save to deny the long range effort from Arturo Vidal (Bayern Munich) towards the middle of the goal."
        },
        {
            "gameTime": "2 - 01:56",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 01:44",
            "label": "corner",
            "description": "Thomas Muller (Bayern Munich) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 01:18",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Thomas Muller (Bayern Munich). Bayern Munich force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. Bayern Munich dominated the opening period and easily created the most chances. The home team makes a lot of passes and attempts to maintain possession. As for the away side, it's obvious that defence has the highest priority for them."
        },
        {
            "gameTime": "1 - 45:33",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:11",
            "label": "",
            "description": "Anthony Modeste (Koln) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 42:42",
            "label": "",
            "description": "Anthony Modeste (Koln) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 42:02",
            "label": "",
            "description": "Simon Zoller (Koln) produces a dangerous lofted cross into the box which is intercepted. The ball is out of play. FC Koln will take a throw in."
        },
        {
            "gameTime": "1 - 39:20",
            "label": "soccer-ball",
            "description": "Goal! Arturo Vidal (Bayern Munich) gets a shot away from inside the box and the effort is deflected past the goalkeeper. 2:0."
        },
        {
            "gameTime": "1 - 38:15",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) is forced to stop his forward run after being caught in an offside position by the linesman."
        },
        {
            "gameTime": "1 - 38:05",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) has an effort from distance but it's blocked."
        },
        {
            "gameTime": "1 - 37:06",
            "label": "corner",
            "description": "Arjen Robben (Bayern Munich) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 36:54",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) delivers a low pass into the box which is intercepted. The referee and his assistant both point at the corner flag. Bayern Munich will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 34:20",
            "label": "soccer-ball",
            "description": "Goal! Arjen Robben (Bayern Munich) fires the rebound inside the left post after the ball breaks to him in the box. The score is 1:0."
        },
        {
            "gameTime": "1 - 34:19",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "1 - 32:16",
            "label": "",
            "description": "A player from Bayern Munich commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "1 - 32:07",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 31:37",
            "label": "corner",
            "description": "Arjen Robben (Bayern Munich) steps up to take the corner, but the ball just sails in among the defenders. The referee points to the corner flag and Bayern Munich will take a corner."
        },
        {
            "gameTime": "1 - 31:19",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) collects a pass and has an effort from distance which is blocked. The ball goes behind for a corner. Bayern Munich will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 31:05",
            "label": "corner",
            "description": "Philipp Lahm (Bayern Munich) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 30:50",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net. It will be a corner kick for Bayern Munich."
        },
        {
            "gameTime": "1 - 28:18",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) rises above the defenders and places a towering header towards the middle of the goal, but Timo Horn is prepared to thwart his effort."
        },
        {
            "gameTime": "1 - 26:37",
            "label": "",
            "description": "Anthony Modeste (Koln) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "1 - 24:09",
            "label": "",
            "description": "A spell of possession for Bayern Munich in an attempt to control the game."
        },
        {
            "gameTime": "1 - 22:30",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) creates a yard of space for himself and tries an effort from distance, but it's blocked."
        },
        {
            "gameTime": "1 - 21:49",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) creates himself some space around the penalty spot and connects with the free kick. His header is badly mistimed and sails high over the bar."
        },
        {
            "gameTime": "1 - 21:07",
            "label": "",
            "description": "Marcel Risse (Koln) trips an opponent with a slide tackle. Florian Meyer stops the game and he could give him a card, but eventually decides on just a warning. A free kick has been awarded to Bayern Munich."
        },
        {
            "gameTime": "1 - 20:50",
            "label": "",
            "description": "Bayern Munich seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "1 - 18:43",
            "label": "",
            "description": "Dominique Heintz (Koln) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "1 - 17:52",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) is penalised for a foul. Florian Meyer had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 16:31",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Douglas Costa (Bayern Munich)."
        },
        {
            "gameTime": "1 - 16:00",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) is the first to arrive to a rebound inside the penalty area and unleashes a quick strike towards the left side of the target that beats the keeper. One of the defenders, however, makes a goal line clearance. The referee blows his whistle, Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "1 - 14:00",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 13:53",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 13:32",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) collects an inch perfect pass and strikes the ball from far out, but his shot is blocked. The referee signals a corner kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 12:41",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. The referee and the linesman both signal a throw in for Bayern Munich."
        },
        {
            "gameTime": "1 - 10:13",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Timo Horn is alert and denies him."
        },
        {
            "gameTime": "1 - 09:23",
            "label": "",
            "description": "Timo Horn steps in and intercepts a long pass from Kingsley Coman (Bayern Munich)."
        },
        {
            "gameTime": "1 - 08:54",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 06:59",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 06:38",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) had a golden opportunity. He volleyed from point blank range towards the left side of the goal, but Timo Horn was alert and made an amazing save! Now Bayern Munich have a corner."
        },
        {
            "gameTime": "1 - 05:27",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 05:11",
            "label": "",
            "description": "A player from FC Koln commits a rough challenge. Florian Meyer blows for a foul and keeps the game under control. Bayern Munich win a free kick."
        },
        {
            "gameTime": "1 - 04:45",
            "label": "",
            "description": "Jonas Hector (Koln) sends over a free kick from long range but the defence is alert."
        },
        {
            "gameTime": "1 - 04:03",
            "label": "",
            "description": "Rafinha (Bayern Munich) makes a strong challenge and Florian Meyer blows for a foul. FC Koln have a free kick."
        },
        {
            "gameTime": "1 - 02:38",
            "label": "",
            "description": "Simon Zoller (Koln) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Manuel Neuer was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 02:12",
            "label": "",
            "description": "Frederik Sorensen (Koln) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "1 - 01:00",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Bayern Munich will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Florian Meyer will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Bayern Munich were better today and displayed masterful control and movement. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "FC Koln",
    "gameDate": "24/10/2015 - 16:30",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "4 - 0"
}