{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-01-22 - 22-45 AS Roma 1 - 0 Cagliari/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "We can only hope that the managers will be able to motivate the players and spark them into life in the next games. The football on offer today has been disappointing. The hosts looked more lively and played better football. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        },
        {
            "gameTime": "2 - 49:42",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 49:19",
            "label": "",
            "description": "A precise low pass is received by Leandro Paredes (AS Roma), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the left post."
        },
        {
            "gameTime": "2 - 48:38",
            "label": "",
            "description": "Bruno Peres (AS Roma) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 47:58",
            "label": "r-card",
            "description": "Marco Guida shows a red card with no hesitation. Joao Pedro (Cagliari) can have an early bath and think about his challenge."
        },
        {
            "gameTime": "2 - 45:41",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Konstantinos Manolas as he is replaced by Thomas Vermaelen (AS Roma)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "The linesman raises his flag for offside before Marco Borriello (Cagliari) heads on."
        },
        {
            "gameTime": "2 - 43:58",
            "label": "",
            "description": "Edin Dzeko (AS Roma) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 43:25",
            "label": "y-card",
            "description": "It's like he was asking for a caution. Nicolo Barella (Cagliari) receives a yellow card."
        },
        {
            "gameTime": "2 - 42:18",
            "label": "substitution",
            "description": "Substitution. Radja Nainggolan makes way for Leandro Paredes (AS Roma)."
        },
        {
            "gameTime": "2 - 41:48",
            "label": "y-card",
            "description": "Marco Guida shows a yellow card to Konstantinos Manolas (AS Roma), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 39:25",
            "label": "",
            "description": "Marco Sau (Cagliari) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. AS Roma are awarded a free kick."
        },
        {
            "gameTime": "2 - 38:27",
            "label": "",
            "description": "Edin Dzeko (AS Roma) connects with a cross near the penalty spot and produces a header which hits the crossbar!"
        },
        {
            "gameTime": "2 - 37:33",
            "label": "",
            "description": "Chance! Radja Nainggolan (AS Roma) gets to the rebound on the edge of the box and smashes the ball towards the bottom right corner, but Rafael is alert and makes a great save to deny him."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "y-card",
            "description": "Luca Ceppitelli (Cagliari) sees a yellow card from Marco Guida after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 36:10",
            "label": "substitution",
            "description": "Substitution. Paolo Farago (Cagliari) receives a signal from the referee and is now allowed to enter the pitch as Fabio Pisacane walks off."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "substitution",
            "description": "Here is a change. Diego Perotti is going off and Luciano Spalletti gives the last tactical orders to Stephan El Shaarawy (AS Roma)."
        },
        {
            "gameTime": "2 - 34:14",
            "label": "",
            "description": "The Cagliari players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "2 - 32:38",
            "label": "",
            "description": "Panagiotis Tachtsidis (Cagliari) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 30:46",
            "label": "",
            "description": "Bruno Peres (AS Roma) has a huge chance to score from close range, but his effort goes just a few inches wide of the right hand post."
        },
        {
            "gameTime": "2 - 30:22",
            "label": "",
            "description": "Rafael pulls off a brilliant save! Edin Dzeko (AS Roma) launched himself and met a cross into the box, but his header to the right post is saved."
        },
        {
            "gameTime": "2 - 28:36",
            "label": "",
            "description": "A goal, which was scored by Edin Dzeko (AS Roma), was disallowed due to offside."
        },
        {
            "gameTime": "2 - 26:56",
            "label": "substitution",
            "description": "The manager makes a subsitution with Marco Sau (Cagliari) coming on for Diego Farias."
        },
        {
            "gameTime": "2 - 26:27",
            "label": "corner",
            "description": "Daniele De Rossi (AS Roma) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 25:43",
            "label": "",
            "description": "The ball is cleared after Edin Dzeko (AS Roma) attempted to dribble past an opposing player. Now AS Roma have a corner."
        },
        {
            "gameTime": "2 - 24:58",
            "label": "corner",
            "description": "The corner from Diego Perotti (AS Roma) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 24:35",
            "label": "",
            "description": "Diego Perotti (AS Roma) produced a promising shot towards the right side of the goal after his wonderful solo run, but Rafael thwarted him with a fabulous save and the score remains the same. The ball is out of play. AS Roma will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 23:41",
            "label": "",
            "description": "Luca Ceppitelli (Cagliari) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but it goes well wide of the left post."
        },
        {
            "gameTime": "2 - 23:29",
            "label": "corner",
            "description": "Panagiotis Tachtsidis (Cagliari) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 23:13",
            "label": "",
            "description": "Marco Borriello (Cagliari) connects with a pass but sees his shot from the edge of the box blocked. The ball goes out of play. Cagliari are awarded a corner kick."
        },
        {
            "gameTime": "2 - 22:16",
            "label": "corner",
            "description": "Nicolo Barella (Cagliari) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 21:58",
            "label": "",
            "description": "Mauricio Isla (Cagliari) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. Cagliari force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 20:26",
            "label": "substitution",
            "description": "Substitution. Daniele Dessena walks off the pitch and Joao Pedro (Cagliari) comes on as a substitute."
        },
        {
            "gameTime": "2 - 18:34",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "2 - 17:25",
            "label": "",
            "description": "Edin Dzeko (AS Roma) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "",
            "description": "Bruno Peres (AS Roma) is disappointed with himself because he got into a good area but produced a poor cross. The ball has crossed the sideline. Cagliari are taking a throw in."
        },
        {
            "gameTime": "2 - 16:08",
            "label": "",
            "description": "Diego Perotti (AS Roma) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "2 - 14:52",
            "label": "",
            "description": "Diego Perotti (AS Roma) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "2 - 14:10",
            "label": "",
            "description": "The Cagliari players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball."
        },
        {
            "gameTime": "2 - 12:56",
            "label": "corner",
            "description": "Panagiotis Tachtsidis (Cagliari) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "soccer-ball",
            "description": "It's a goal! Edin Dzeko (AS Roma) shows off his superb ability as he volleys the ball from inside the box into the roof of the net. The assist goes to Antonio Rudiger and the score changes to 1:0."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "",
            "description": "Mauricio Isla (Cagliari) unleashes a shot, but his effort is poor and floats well wide of the right post."
        },
        {
            "gameTime": "2 - 07:48",
            "label": "corner",
            "description": "Panagiotis Tachtsidis (Cagliari) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 06:22",
            "label": "",
            "description": "What a chance that is! Edin Dzeko (AS Roma) displays good awareness near the penalty spot to get on the end of a cross from the free kick, but he steers his header narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 06:12",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Marco Borriello (Cagliari). Marco Guida saw the sliding tackle and blows for a foul. That's a free kick to AS Roma."
        },
        {
            "gameTime": "2 - 04:02",
            "label": "",
            "description": "That was close by Marco Borriello (Cagliari)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the right post."
        },
        {
            "gameTime": "2 - 00:39",
            "label": "",
            "description": "Poor challenge! Antonio Rudiger (AS Roma) is penalised for tripping and Marco Guida blows his whistle."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Marco Guida blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Let's hope the players will show us more in the second half as the first one has been rather ordinary, devoid of goalscoring opportunities. The home fans will be really pleased with what they've seen from their players so far. The home side have dominated the possession and midfield so far. The visitors have spent most of their time defending and waiting for the right moment to launch counter attacks."
        },
        {
            "gameTime": "1 - 45:05",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Marco Guida has ended it."
        },
        {
            "gameTime": "1 - 44:07",
            "label": "",
            "description": "Diego Perotti (AS Roma) sends a pass into the penalty area, but the opponent manages to cut it out."
        },
        {
            "gameTime": "1 - 43:06",
            "label": "",
            "description": "Bruno Peres (AS Roma) climbs high to connect with a cross near the penalty spot but plants a header high over the bar."
        },
        {
            "gameTime": "1 - 41:26",
            "label": "",
            "description": "Diego Farias (Cagliari) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "1 - 38:18",
            "label": "",
            "description": "Kevin Strootman (AS Roma) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 37:00",
            "label": "",
            "description": "Kevin Strootman (AS Roma) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort."
        },
        {
            "gameTime": "1 - 34:15",
            "label": "",
            "description": "AS Roma are enjoying a spell of pressure at the moment, but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 32:26",
            "label": "",
            "description": "Federico Fazio (AS Roma) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul. A free kick has been awarded to Cagliari."
        },
        {
            "gameTime": "1 - 30:08",
            "label": "",
            "description": "Edin Dzeko (AS Roma) had a golden opportunity. He volleyed from point blank range low towards the middle of the net, but Rafael was alert and made an amazing save!"
        },
        {
            "gameTime": "1 - 27:45",
            "label": "corner",
            "description": "Daniele De Rossi (AS Roma) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 27:33",
            "label": "",
            "description": "Edin Dzeko (AS Roma) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. The ball goes behind for a corner. AS Roma will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 27:27",
            "label": "corner",
            "description": "Daniele De Rossi (AS Roma) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 24:59",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) gets on the ball and beats an opponent, but his run is stopped by the referee Marco Guida who sees an offensive foul. Cagliari are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 24:46",
            "label": "corner",
            "description": "Daniele De Rossi (AS Roma) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 24:03",
            "label": "",
            "description": "Diego Perotti (AS Roma) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The linesman points to the corner flag, AS Roma are going to take it."
        },
        {
            "gameTime": "1 - 21:54",
            "label": "",
            "description": "Diego Perotti (AS Roma) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "1 - 20:56",
            "label": "",
            "description": "Edin Dzeko (AS Roma) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 18:11",
            "label": "",
            "description": "Bruno Peres (AS Roma) failed to convert a mid range free kick and sends the ball narrowly over the bar."
        },
        {
            "gameTime": "1 - 17:30",
            "label": "y-card",
            "description": "Booking. Fabio Pisacane (Cagliari) receives a caution from the referee."
        },
        {
            "gameTime": "1 - 15:42",
            "label": "",
            "description": "Diego Perotti (AS Roma) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 13:22",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) tries to create a chance, but puts too much weight on his pass. The ball goes out of play and Cagliari will have a goal kick."
        },
        {
            "gameTime": "1 - 11:53",
            "label": "",
            "description": "Mauricio Isla (Cagliari) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 10:07",
            "label": "",
            "description": "Diego Perotti (AS Roma) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 08:57",
            "label": "",
            "description": "Diego Perotti (AS Roma) latches on to an accurate cross on the edge of the penalty box and sends the ball towards goal, but it's too easy for the keeper."
        },
        {
            "gameTime": "1 - 07:42",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) sends in a cross from a long range free kick. However, his effort lacks accuracy and the ball sails off the pitch."
        },
        {
            "gameTime": "1 - 06:54",
            "label": "",
            "description": "Nicola Murru (Cagliari) tackles a bit over zealously and Marco Guida blows for a foul. AS Roma will take a free kick."
        },
        {
            "gameTime": "1 - 06:03",
            "label": "",
            "description": "Edin Dzeko (AS Roma) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Rafael is alert and denies him."
        },
        {
            "gameTime": "1 - 05:17",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 03:21",
            "label": "",
            "description": "Edin Dzeko (AS Roma) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "",
            "description": "Daniele Dessena (Cagliari) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 00:53",
            "label": "",
            "description": "Diego Farias (Cagliari) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Cagliari will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Marco Guida."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last game that Cagliari played was against Empoli and it ended 3:2."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "3 The amount of games AS Roma have won in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We can only hope that the managers will be able to motivate the players and spark them into life in the next games. The football on offer today has been disappointing. The hosts looked more lively and played better football. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        }
    ],
    "gameAwayTeam": "Cagliari",
    "gameDate": "22/01/2017 - 22:45",
    "gameHomeTeam": "AS Roma",
    "gameScore": "1 - 0"
}