{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-24 - 22-45 Bayern Munich 4 - 0 Olympiakos Piraeus/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Bayern Munich were better today and displayed masterful control and movement. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        },
        {
            "gameTime": "2 - 47:01",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:45",
            "label": "corner",
            "description": "Thomas Muller (Bayern Munich) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 46:33",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) dribbles deep into the box and releases a strike towards the left side of the goal, but Roberto Jimenez makes a sensational reflex save and punches the ball onto the post. Superb goalkeeping! Bayern Munich win a corner."
        },
        {
            "gameTime": "2 - 45:51",
            "label": "",
            "description": "Olympiakos Piraeus are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:25",
            "label": "",
            "description": "Leandro Salino (Olympiakos Piraeus) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "2 - 42:55",
            "label": "",
            "description": "The linesman signals that Thomas Muller (Bayern Munich) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 42:47",
            "label": "",
            "description": "Chance! Philipp Lahm (Bayern Munich) was in a good position inside the box, but he couldn't connect with the pass as it was overhit."
        },
        {
            "gameTime": "2 - 40:54",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Roberto Jimenez is alert and denies him."
        },
        {
            "gameTime": "2 - 38:33",
            "label": "corner",
            "description": "Hernani (Olympiakos Piraeus) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 38:10",
            "label": "",
            "description": "Hernani (Olympiakos Piraeus) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The referee blows his whistle, Olympiakos Piraeus are awarded a corner kick."
        },
        {
            "gameTime": "2 - 38:03",
            "label": "attendance",
            "description": "The attendance for today's match is 70000."
        },
        {
            "gameTime": "2 - 37:25",
            "label": "",
            "description": "Arthur Masuaku (Olympiakos Piraeus) is disappointed with himself because he got into a good area but produced a poor cross. The ball goes out of play and Bayern Munich will have a goal kick."
        },
        {
            "gameTime": "2 - 37:12",
            "label": "",
            "description": "Konstantinos Fortounis (Olympiakos Piraeus) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 36:07",
            "label": "funfact",
            "description": "The up to date shots on target statistics – 9:0."
        },
        {
            "gameTime": "2 - 35:45",
            "label": "",
            "description": "Luka Milivojevic (Olympiakos Piraeus) attempts to find one of his teammates with a cross from the resultant free kick, but he fails to hit the ball properly and sends it off the pitch."
        },
        {
            "gameTime": "2 - 34:46",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) jumps into a tackle and Jonas Eriksson blows his whistle for a foul. It's a free kick to Olympiakos Piraeus, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "2 - 34:30",
            "label": "",
            "description": "Neat passing move from Olympiakos Piraeus in order to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 32:50",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Leandro Salino (Olympiakos Piraeus) for Omar Elabdellaoui."
        },
        {
            "gameTime": "2 - 30:41",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "2 - 29:59",
            "label": "",
            "description": "Jonas Eriksson blows the whistle, Manuel da Costa (Olympiakos Piraeus) is penalised for a foul. Bayern Munich are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 27:44",
            "label": "corner",
            "description": "Thomas Muller (Bayern Munich) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 27:31",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Bayern Munich have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 26:13",
            "label": "substitution",
            "description": "Pep Guardiola has decided to make a change. Javi Martinez (Bayern Munich) replaces Douglas Costa."
        },
        {
            "gameTime": "2 - 23:59",
            "label": "soccer-ball",
            "description": "Goal! Thomas Muller finds Kingsley Coman (Bayern Munich) with a headed pass and the latter glances a header past the goalkeeper to make it 4:0."
        },
        {
            "gameTime": "2 - 23:14",
            "label": "",
            "description": "Good defending. Konstantinos Fortounis (Olympiakos Piraeus) tries to find Brown Ideye inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 21:51",
            "label": "substitution",
            "description": "Marco da Silva has decided to introduce fresh legs, with Hernani (Olympiakos Piraeus) replacing Felipe Pardo."
        },
        {
            "gameTime": "2 - 21:42",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Pajtim Kasami as he is replaced by Konstantinos Fortounis (Olympiakos Piraeus)."
        },
        {
            "gameTime": "2 - 19:55",
            "label": "",
            "description": "Bayern Munich are enjoying a spell of pressure at the moment, but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "y-card",
            "description": "A yellow card for a tackle by Luka Milivojevic (Olympiakos Piraeus). Jonas Eriksson doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 15:30",
            "label": "funfact",
            "description": "Here's the current ball possession statistics for both teams – 65:35."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "",
            "description": "CHANCE! Brown Ideye (Olympiakos Piraeus) picks up a pass inside the box and has a sight of goal, but he blazes his shot well over the top."
        },
        {
            "gameTime": "2 - 13:30",
            "label": "",
            "description": "Great solo effort by Douglas Costa (Bayern Munich) as he tricks his way through two defenders before firing a drive from just outside of the box towards the roof of the net. The goalkeeper is ready and produces a stunning save."
        },
        {
            "gameTime": "2 - 12:24",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) shoots at goal from the free kick from some 24 metres out. His attempt was quite precise and another few inches and it would have ended up inside the left post."
        },
        {
            "gameTime": "2 - 11:25",
            "label": "",
            "description": "Dimitrios Siovas (Olympiakos Piraeus) is penalised for holding. Jonas Eriksson signals a set piece. That's a free kick to Bayern Munich."
        },
        {
            "gameTime": "2 - 11:18",
            "label": "corner",
            "description": "Thomas Muller (Bayern Munich) takes a short corner kick."
        },
        {
            "gameTime": "2 - 10:49",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) tries to send a pass but it's blocked. The ball goes behind for a corner. Bayern Munich will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 10:25",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Robert Lewandowski trots off the pitch and is replaced by Mehdi Benatia (Bayern Munich)."
        },
        {
            "gameTime": "2 - 09:20",
            "label": "corner",
            "description": "The resulting corner, taken by Felipe Pardo (Olympiakos Piraeus), comes to nothing."
        },
        {
            "gameTime": "2 - 08:58",
            "label": "",
            "description": "A poorly taken free kick by Arthur Masuaku (Olympiakos Piraeus)! He sends a shot from the edge of the box into the defensive wall. Olympiakos Piraeus force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 08:19",
            "label": "",
            "description": "Olympiakos Piraeus earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 07:25",
            "label": "r-card",
            "description": "It's a foul from Holger Badstuber (Bayern Munich). Surprisingly, the referee comes and pulls out a red card. It was a very harsh one and Holger Badstuber (Bayern Munich) complains, but it's no use of course. The decision has been made."
        },
        {
            "gameTime": "2 - 05:38",
            "label": "",
            "description": "Flag up against Douglas Costa (Bayern Munich). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 04:53",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 03:41",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) is caught offside!"
        },
        {
            "gameTime": "2 - 02:50",
            "label": "",
            "description": "Flag goes up against Robert Lewandowski (Bayern Munich) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 02:37",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) receives the ball from the set piece on the edge of the box, but fails to score because his shot is blocked."
        },
        {
            "gameTime": "2 - 02:18",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) takes a direct free kick."
        },
        {
            "gameTime": "2 - 01:17",
            "label": "",
            "description": "Arthur Masuaku (Olympiakos Piraeus) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation. Bayern Munich have a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "There was plenty of entertainment during the first 45 minutes. Hopefully more of the same in the second half. Bayern Munich dominated the opening period and easily created the most chances. The visitors have been very flat and lacked creativity in their attack. Let's see if they change something in the second period."
        },
        {
            "gameTime": "1 - 45:51",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:31",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) releases Kingsley Coman, who latched on to his perfect through pass and can continue with his team's attack."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:54",
            "label": "",
            "description": "Luka Milivojevic (Olympiakos Piraeus) takes a shot from the free kick on the edge of the box and the ball sails inches wide of the right post. What a chance!"
        },
        {
            "gameTime": "1 - 42:22",
            "label": "",
            "description": "Olympiakos Piraeus are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 41:59",
            "label": "y-card",
            "description": "Jerome Boateng (Bayern Munich) has tested the patience of referee Jonas Eriksson and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "1 - 40:58",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends a cross into the box, but Roberto Jimenez comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Bayern Munich are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "1 - 37:09",
            "label": "",
            "description": "It's a weak and poor shot by Joshua Kimmich (Bayern Munich) as he flashes a first time shot from the edge of the box. The ball flies well wide of the right post."
        },
        {
            "gameTime": "1 - 35:21",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 34:56",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition. Good work from Bayern Munich as they win a corner."
        },
        {
            "gameTime": "1 - 34:41",
            "label": "",
            "description": "Felipe Pardo (Olympiakos Piraeus) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 33:26",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 32:14",
            "label": "substitution",
            "description": "Pep Guardiola is forced to make a change. Arjen Robben is unable to continue due to injury, Joshua Kimmich (Bayern Munich) comes on."
        },
        {
            "gameTime": "1 - 31:35",
            "label": "",
            "description": "Felipe Pardo (Olympiakos Piraeus) wriggles into space and fires the ball from the edge of the area, but one of the defenders is there to block the effort."
        },
        {
            "gameTime": "1 - 30:55",
            "label": "",
            "description": "Bayern Munich try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "1 - 30:48",
            "label": "",
            "description": "Manuel da Costa (Olympiakos Piraeus) was too fierce in his attempt to get the ball from his opponent and Jonas Eriksson blows for a foul. A free kick has been awarded to Bayern Munich."
        },
        {
            "gameTime": "1 - 29:46",
            "label": "",
            "description": "Bayern Munich keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 27:25",
            "label": "",
            "description": "Excellent touch by Thomas Muller (Bayern Munich)! He latches on to a precise pass on the edge of the box and produces a shot goalwards which goes way wide of the left post."
        },
        {
            "gameTime": "1 - 26:23",
            "label": "",
            "description": "Jonas Eriksson couldn't ignore the rough tackle by Pajtim Kasami (Olympiakos Piraeus) and blew his whistle."
        },
        {
            "gameTime": "1 - 25:24",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) nearly creates a chance, but his attempt to pick out a teammate with a through ball does not come off."
        },
        {
            "gameTime": "1 - 23:35",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) receives a brilliant pass and wastes a big opportunity as his shot from inside the penalty area flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 22:50",
            "label": "",
            "description": "Bayern Munich are passing the ball across the pitch and keep possession. However, an opponent intercepts a pass and the situation changes."
        },
        {
            "gameTime": "1 - 19:42",
            "label": "soccer-ball",
            "description": "Goal! Arjen Robben gets to the ball and heads it over the defence to Thomas Muller (Bayern Munich), who meets it nicely and fires in into the back of the net. 3:0."
        },
        {
            "gameTime": "1 - 17:59",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Bayern Munich."
        },
        {
            "gameTime": "1 - 15:35",
            "label": "soccer-ball",
            "description": "Goal! That was a fantastic finish by Robert Lewandowski (Bayern Munich) from just outside the box. He wasted little time in getting away a bullet of a shot that flew past the goalkeeper into the left side of the net."
        },
        {
            "gameTime": "1 - 15:04",
            "label": "",
            "description": "Esteban Cambiasso (Olympiakos Piraeus) attempted to pick out a free teammate inside the box, but Manuel Neuer comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 13:36",
            "label": "",
            "description": "A cross is clipped into the penalty area by Kingsley Coman (Bayern Munich) but poses no threat."
        },
        {
            "gameTime": "1 - 13:12",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) shows his brilliant passing ability after picking out Kingsley Coman with a fine lofted pass."
        },
        {
            "gameTime": "1 - 11:44",
            "label": "corner",
            "description": "Arturo Vidal (Bayern Munich) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 11:15",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender. The ball goes out of play. Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "1 - 10:50",
            "label": "",
            "description": "The Bayern Munich players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 07:48",
            "label": "soccer-ball",
            "description": "The goalkeeper makes a save but the ball rebounds off him out to Douglas Costa (Bayern Munich). He finds himself some space inside the penalty area and unleashes an unstoppable shot which bounces off the right post into the net. A magnificent goal!"
        },
        {
            "gameTime": "1 - 07:35",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) hammers the ball goalwards from about 25 metres. The shot is directed to the left side of the target but is thwarted by a save from Roberto Jimenez."
        },
        {
            "gameTime": "1 - 07:17",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety. It's a throw in for Bayern Munich."
        },
        {
            "gameTime": "1 - 06:23",
            "label": "",
            "description": "Omar Elabdellaoui (Olympiakos Piraeus) sprays a pass out to Seba, but he can't beat his man inside the box."
        },
        {
            "gameTime": "1 - 05:28",
            "label": "",
            "description": "Bayern Munich enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 03:48",
            "label": "",
            "description": "The game is interrupted as Robert Lewandowski (Bayern Munich) is flagged offside."
        },
        {
            "gameTime": "1 - 03:33",
            "label": "",
            "description": "Manuel da Costa (Olympiakos Piraeus) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 01:58",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. The linesman signals a throw in for Bayern Munich."
        },
        {
            "gameTime": "1 - 00:53",
            "label": "",
            "description": "Luka Milivojevic (Olympiakos Piraeus) sends a long ball in, but Manuel Neuer comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Bayern Munich will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Jonas Eriksson."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Bayern Munich were better today and displayed masterful control and movement. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        }
    ],
    "gameAwayTeam": "Olympiakos Piraeus",
    "gameDate": "24/11/2015 - 22:45",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "4 - 0"
}