{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2015-08-22 - 16-30 Hoffenheim 1 - 2 Bayern Munich/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. The away side dominated this game. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        },
        {
            "gameTime": "2 - 50:18",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 49:10",
            "label": "corner",
            "description": "Thiago Alcantara (Bayern Munich) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) sends a pass into the penalty area, but the opponent manages to cut it out. The referee and one of his assistants signal for a corner kick to Bayern Munich."
        },
        {
            "gameTime": "2 - 48:53",
            "label": "corner",
            "description": "A quickly taken corner by Bayern Munich."
        },
        {
            "gameTime": "2 - 48:51",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) looks to break free, but an opposing player clears the ball away. The ball goes out for a corner. Bayern Munich can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 47:55",
            "label": "corner",
            "description": "The corner from Sebastian Rudy (Hoffenheim) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 47:49",
            "label": "",
            "description": "Pavel Kaderabek (Hoffenheim) fails to send a pass into the box as his effort is cut out. Hoffenheim have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 47:26",
            "label": "time",
            "description": "Fourth official shows 5 min. of added time."
        },
        {
            "gameTime": "2 - 45:30",
            "label": "substitution",
            "description": "Fabian Schar will be replaced by Philipp Ochs (Hoffenheim)."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "soccer-ball",
            "description": "Goal! Robert Lewandowski (Bayern Munich) finds himself some space inside the box to get on the end of a pass from Mario Gotze, then sends the ball low into the middle of the net. 1:2."
        },
        {
            "gameTime": "2 - 43:55",
            "label": "y-card",
            "description": "Tobias Stieler shows the yellow card to Eugen Polanski (Hoffenheim) for a heavy challenge."
        },
        {
            "gameTime": "2 - 42:59",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) leaps high to meet a lofted pass inside the six yard box, but his header only flies onto the right post and away off it!"
        },
        {
            "gameTime": "2 - 42:55",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) escapes his marker to meet a cross and heads to the middle of the goal, but the keeper pulls off an excellent reflex save to deny him."
        },
        {
            "gameTime": "2 - 42:51",
            "label": "corner",
            "description": "Arturo Vidal (Bayern Munich) goes over to take the corner kick and it looks like he will swing the ball into the penalty box. Arturo Vidal (Bayern Munich) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 42:32",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) decided to shoot after receiving a sweet pass. If it wasn't for Oliver Baumann's superb save the ball would have probably ended up in the bottom right corner. Bayern Munich earn a corner."
        },
        {
            "gameTime": "2 - 42:04",
            "label": "",
            "description": "Eugen Polanski (Hoffenheim) is able to continue to play."
        },
        {
            "gameTime": "2 - 41:35",
            "label": "",
            "description": "Pirmin Schwegler (Hoffenheim) fouls an opponent. At least that's what referee Tobias Stieler signals."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Hoffenheim."
        },
        {
            "gameTime": "2 - 38:10",
            "label": "injury",
            "description": "Looks like Eugen Polanski (Hoffenheim) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 37:45",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Rafinha (Bayern Munich) was quite harsh and Tobias Stieler didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 35:21",
            "label": "",
            "description": "CLOSE! Mark Uth (Hoffenheim) shows off his amazing skills with a solo run to the edge of the box before fashioning a shot that goes inches wide of the right post! The ball is off of the pitch and it's a goal kick for Bayern Munich."
        },
        {
            "gameTime": "2 - 33:30",
            "label": "attendance",
            "description": "The attendance is 30150."
        },
        {
            "gameTime": "2 - 31:27",
            "label": "y-card",
            "description": "Yellow card. Jin Su Kim (Hoffenheim) goes into the referee's book after a bad challenge."
        },
        {
            "gameTime": "2 - 29:52",
            "label": "y-card",
            "description": "Tobias Stieler shows a yellow card to Thomas Muller (Bayern Munich), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 28:50",
            "label": "corner",
            "description": "The resulting corner, taken by Sebastian Rudy (Hoffenheim), comes to nothing."
        },
        {
            "gameTime": "2 - 28:35",
            "label": "penalty-missed",
            "description": "Eugen Polanski (Hoffenheim) fails to score from the penalty as his shot only hits the right post. The ball is out of play. Hoffenheim win a corner kick."
        },
        {
            "gameTime": "2 - 28:16",
            "label": "",
            "description": "Eugen Polanski (Hoffenheim) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 27:11",
            "label": "yr-card",
            "description": "It's too late to protest, Jerome Boateng (Bayern Munich) has to leave the pitch after receiving a second yellow card."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "penalty",
            "description": "Handball by Jerome Boateng (Bayern Munich). PENALTY to Hoffenheim! Great chance to score."
        },
        {
            "gameTime": "2 - 26:30",
            "label": "",
            "description": "Sebastian Rudy (Hoffenheim) attempts to curl the ball over the wall from the free kick, but one of the defenders deflects it away from danger."
        },
        {
            "gameTime": "2 - 25:55",
            "label": "",
            "description": "Hoffenheim are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 25:45",
            "label": "y-card",
            "description": "Jerome Boateng (Bayern Munich) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Tobias Stieler didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "",
            "description": "Douglas Costa plays a lovely pass into Thomas Muller (Bayern Munich), but he can't find the target. His strike from inside the box goes narrowly wide of the right post. The ball goes out of play and Hoffenheim will have a goal kick."
        },
        {
            "gameTime": "2 - 23:52",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) collects a great pass inside the box and misses a golden opportunity. His low shot was directed into the middle of the goal, but the goalkeeper does well to stop his effort."
        },
        {
            "gameTime": "2 - 23:33",
            "label": "substitution",
            "description": "Markus Gisdol has decided to make a change. Mark Uth (Hoffenheim) replaces Kevin Kuranyi."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) picks up a pass and unleashes a low shot towards goal, but he can't generate enough power to trouble Oliver Baumann."
        },
        {
            "gameTime": "2 - 21:53",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Robert Lewandowski (Bayern Munich) comes onto the pitch so that Philipp Lahm can be given a rest."
        },
        {
            "gameTime": "2 - 20:14",
            "label": "",
            "description": "OFF THE CROSSBAR! Arturo Vidal (Bayern Munich) runs towards the goal to give his teammate support. He receives a fantastic pass and shoots from the edge of the box, but it crashes against the crossbar. It could have been a brilliant goal, unlucky. The ball is off of the pitch and it's a goal kick for Hoffenheim."
        },
        {
            "gameTime": "2 - 19:52",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends a teasing cross into the area, but Oliver Baumann intercepts the ball."
        },
        {
            "gameTime": "2 - 18:51",
            "label": "substitution",
            "description": "That's the end of the game for Jonathan Schmid, who is replaced by Sebastian Rudy (Hoffenheim)."
        },
        {
            "gameTime": "2 - 17:57",
            "label": "y-card",
            "description": "Today's referee Tobias Stieler rightly decides to book Pirmin Schwegler (Hoffenheim) for his harsh tackle."
        },
        {
            "gameTime": "2 - 17:23",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) fails to deliver a decent cross from the corner and the ball goes out of play. The ball is off of the pitch and it's a goal kick for Hoffenheim."
        },
        {
            "gameTime": "2 - 16:55",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) fails to find any of his teammates inside the box as his pass is blocked. The referee points to the corner flag and Bayern Munich will take a corner."
        },
        {
            "gameTime": "2 - 15:54",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "2 - 14:57",
            "label": "",
            "description": "That was a poorly executed free kick from long distance. Jonathan Schmid (Hoffenheim) was trying to produce a cross into the penalty area, but his effort sailed off the pitch. The ball is off of the pitch and it's a goal kick for Bayern Munich."
        },
        {
            "gameTime": "2 - 14:32",
            "label": "",
            "description": "Tobias Stieler has a clear sight and sees a foul from David Alaba (Bayern Munich). Hoffenheim are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 13:12",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Thiago Alcantara (Bayern Munich) comes onto the pitch for Arjen Robben."
        },
        {
            "gameTime": "2 - 12:22",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 10:19",
            "label": "corner",
            "description": "Jonathan Schmid (Hoffenheim) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 09:40",
            "label": "",
            "description": "Kevin Volland (Hoffenheim) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Hoffenheim have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 09:10",
            "label": "funfact",
            "description": "Here's the current ball possession statistics for both teams – 28:72."
        },
        {
            "gameTime": "2 - 07:49",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 06:51",
            "label": "",
            "description": "Close! Douglas Costa (Bayern Munich) picks up the ball in space and from inside the penalty area sends a shot inches wide of the left post. The ball goes out of play and Hoffenheim will have a goal kick."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "",
            "description": "The linesman signals that Kevin Kuranyi (Hoffenheim) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 05:57",
            "label": "",
            "description": "Rafinha (Bayern Munich) jumps into a tackle and Tobias Stieler blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 04:44",
            "label": "",
            "description": "David Alaba (Bayern Munich) unleashes a powerful shot from the free kick but it only hits the defensive wall."
        },
        {
            "gameTime": "2 - 03:26",
            "label": "",
            "description": "Fabian Schar (Hoffenheim) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again. A free kick has been awarded to Bayern Munich."
        },
        {
            "gameTime": "2 - 03:11",
            "label": "",
            "description": "Bayern Munich control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 01:53",
            "label": "corner",
            "description": "Jonathan Schmid (Hoffenheim) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 01:22",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Kevin Volland (Hoffenheim). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate. Hoffenheim win a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. The visitors are mostly controlling the match and making it tough for the home side to keep up. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 46:10",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 46:02",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "",
            "description": "Ambitious effort from Arjen Robben (Bayern Munich). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well wide of the right post. The ball is off of the pitch and it's a goal kick for Hoffenheim."
        },
        {
            "gameTime": "1 - 44:18",
            "label": "",
            "description": "The Hoffenheim players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession."
        },
        {
            "gameTime": "1 - 40:58",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Thomas Muller (Bayern Munich) and he fired home from close range. The score is 1:1."
        },
        {
            "gameTime": "1 - 40:50",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) zig zags his way into the box and drills a low shot towards the right post, but the goalkeeper pulls off a superb stop."
        },
        {
            "gameTime": "1 - 39:50",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 39:32",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 37:55",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 35:45",
            "label": "substitution",
            "description": "Mehdi Benatia is substituted due to injury. Pep Guardiola gives a chance to Rafinha (Bayern Munich)."
        },
        {
            "gameTime": "1 - 33:52",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) fires a brilliant shot from the edge of the box, but the effort rattles the right post! It could have been a superb goal. The ball is off of the pitch and it's a goal kick for Hoffenheim."
        },
        {
            "gameTime": "1 - 33:19",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 32:33",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) attempts to convert a lofted cross as he jumps high and heads the ball towards the roof of the net. Oliver Baumann shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net. Bayern Munich get a corner."
        },
        {
            "gameTime": "1 - 30:18",
            "label": "",
            "description": "Steven Zuber (Hoffenheim) makes an overly aggressive challenge and Tobias Stieler blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 29:45",
            "label": "",
            "description": "A pass by Arturo Vidal (Bayern Munich) ends up in no man's land, and the attacking effort comes to an end. The ball is out of play. Hoffenheim will have a throw in."
        },
        {
            "gameTime": "1 - 28:08",
            "label": "",
            "description": "A cross by Douglas Costa (Bayern Munich) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "1 - 27:26",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 26:36",
            "label": "",
            "description": "Jin Su Kim (Hoffenheim) is penalised for holding. Tobias Stieler signals a set piece."
        },
        {
            "gameTime": "1 - 26:20",
            "label": "",
            "description": "A spell of possession for Bayern Munich in an attempt to control the game."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "",
            "description": "Pavel Kaderabek (Hoffenheim) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. It's a throw in for Hoffenheim."
        },
        {
            "gameTime": "1 - 24:12",
            "label": "",
            "description": "Kevin Volland (Hoffenheim) whips the ball into the box and Kevin Kuranyi takes a perfect touch to control it, but one of the defenders does well to intercept."
        },
        {
            "gameTime": "1 - 21:46",
            "label": "",
            "description": "David Alaba (Bayern Munich) plays a through ball but overhits it. The ball is off of the pitch and it's a goal kick for Hoffenheim."
        },
        {
            "gameTime": "1 - 20:53",
            "label": "",
            "description": "Neat passing move from Bayern Munich in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 19:58",
            "label": "",
            "description": "Good movement by Douglas Costa (Bayern Munich), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "1 - 18:52",
            "label": "",
            "description": "A cross from the free kick is whipped in by Xabi Alonso (Bayern Munich), but one of the defenders steps in and averts the threat."
        },
        {
            "gameTime": "1 - 18:15",
            "label": "",
            "description": "Steven Zuber (Hoffenheim) brings his opponent down with a tackle and Tobias Stieler blows his whistle for a foul. Bayern Munich win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 16:33",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) shows his brilliant passing ability after picking out Thomas Muller with a fine lofted pass. Thomas Muller (Bayern Munich) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 14:59",
            "label": "",
            "description": "Fabian Schar (Hoffenheim) connects with the corner but his looping header goes well over. The ball is off of the pitch and it's a goal kick for Bayern Munich."
        },
        {
            "gameTime": "1 - 14:58",
            "label": "corner",
            "description": "There's an opportunity for Jonathan Schmid (Hoffenheim) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 14:37",
            "label": "",
            "description": "Jin Su Kim (Hoffenheim) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Hoffenheim will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 12:54",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the left post. The ball is off of the pitch and it's a goal kick for Hoffenheim."
        },
        {
            "gameTime": "1 - 11:47",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) is flagged for offside."
        },
        {
            "gameTime": "1 - 11:26",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "1 - 10:54",
            "label": "",
            "description": "A pass by Douglas Costa (Bayern Munich) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 10:01",
            "label": "",
            "description": "What an amazing save by Oliver Baumann! Douglas Costa (Bayern Munich) swirls around the defenders and attempts to beat the keeper with a close range shot low towards the middle of the target, but fails."
        },
        {
            "gameTime": "1 - 09:59",
            "label": "",
            "description": "Pirmin Schwegler (Hoffenheim) crosses the ball from the free kick, but it goes out of play. The ball goes out of play and Bayern Munich will have a goal kick."
        },
        {
            "gameTime": "1 - 09:29",
            "label": "",
            "description": "One of the Bayern Munich players tripped an opponent and conceded a foul. A free kick has been awarded to Hoffenheim."
        },
        {
            "gameTime": "1 - 08:11",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) gets on the ball and beats an opponent, but his run is stopped by the referee Tobias Stieler who sees an offensive foul."
        },
        {
            "gameTime": "1 - 06:57",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Xabi Alonso (Bayern Munich) takes it short."
        },
        {
            "gameTime": "1 - 06:46",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends the ball into the box from the side of the pitch, but his cross is blocked. It will be a corner kick for Bayern Munich."
        },
        {
            "gameTime": "1 - 06:24",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 05:21",
            "label": "",
            "description": "The linesman raises his flag for offside before Arjen Robben (Bayern Munich) heads on."
        },
        {
            "gameTime": "1 - 04:48",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) is adjudged offside."
        },
        {
            "gameTime": "1 - 03:56",
            "label": "",
            "description": "Referee Tobias Stieler sees the trip by Kevin Kuranyi (Hoffenheim) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 02:56",
            "label": "",
            "description": "The Bayern Munich players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 00:08",
            "label": "soccer-ball",
            "description": "Goal! Some very poor defending from the opponent allows Kevin Volland (Hoffenheim) the chance to get to the edge of the box and he makes no mistake with a lovely finish. It's 1:0."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Bayern Munich will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Tobias Stieler."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. The away side dominated this game. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        }
    ],
    "gameAwayTeam": "Bayern Munich",
    "gameDate": "22/08/2015 - 16:30",
    "gameHomeTeam": "Hoffenheim",
    "gameScore": "1 - 2"
}