{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-02-13 - 18-00 Real Madrid 4 - 2 Ath Bilbao/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The hosts were largely in control of the game today. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:30",
            "label": "",
            "description": "Aritz Aduriz (Ath Bilbao) commits a foul and Alfonso Alvarez immediately signals a free kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "soccer-ball",
            "description": "Goal – 4:2! Oscar de Marcos sends a precise lofted pass into the box, Gorka Elustondo (Ath Bilbao) rises above the defenders to meet the ball near the penalty spot and heads it straight into the bottom left corner."
        },
        {
            "gameTime": "2 - 44:02",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) sends the corner into the box, but Gorka Iraizoz intercepts it and averts the threat. The linesman points to the corner flag, Real Madrid are going to take it."
        },
        {
            "gameTime": "2 - 43:19",
            "label": "",
            "description": "Lucas (Real Madrid) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 43:02",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Luka Modric (Real Madrid)."
        },
        {
            "gameTime": "2 - 42:53",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) picks up a pass inside the box and finds some space for a shot before unleashing a low drive goalwards, but one of the defending players blocks his effort. The ball is out of play. Real Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 41:36",
            "label": "soccer-ball",
            "description": "Lucas sends a precise lofted cross into the box. Cristiano Ronaldo (Real Madrid) latches on to it and finishes with a quick shot into the middle of the goal. The goalkeeper had no chance. The score changes to 4:1."
        },
        {
            "gameTime": "2 - 40:12",
            "label": "corner",
            "description": "Benat (Ath Bilbao) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 39:33",
            "label": "",
            "description": "Iker Muniain (Ath Bilbao) sends a cross into the box, but the opposition's defence clears the ball to safety. The ball goes out of play. Ath Bilbao are awarded a corner kick."
        },
        {
            "gameTime": "2 - 38:06",
            "label": "",
            "description": "Mikel Balenziaga (Ath Bilbao) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 37:51",
            "label": "",
            "description": "Benat (Ath Bilbao) decides to speed play up by quickly sending the free kick into the box."
        },
        {
            "gameTime": "2 - 37:15",
            "label": "yr-card",
            "description": "Raphael Varane (Real Madrid) should have been more careful. He commits a bad foul, receives his second yellow card and is sent off! There is a free kick near the sideline to Ath Bilbao."
        },
        {
            "gameTime": "2 - 36:24",
            "label": "",
            "description": "It's a weak and poor shot by Karim Benzema (Real Madrid) as he flashes a first time shot from the edge of the box. The ball flies well wide of the right post."
        },
        {
            "gameTime": "2 - 35:53",
            "label": "",
            "description": "That didn't go as planned! Cristiano Ronaldo (Real Madrid) tried his luck from the edge of the box, but his effort towards the bottom right corner was too weak to get past Gorka Iraizoz, who easily kept it out."
        },
        {
            "gameTime": "2 - 34:52",
            "label": "substitution",
            "description": "Here's the change. James Rodriguez leaves the pitch and Lucas (Real Madrid) comes on as a substitute."
        },
        {
            "gameTime": "2 - 34:24",
            "label": "substitution",
            "description": "Here is a change. Sabin is going off and Ernesto Valverde Tejedor gives the last tactical orders to Borja Viguera (Ath Bilbao)."
        },
        {
            "gameTime": "2 - 34:07",
            "label": "",
            "description": "Karim Benzema (Real Madrid) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 33:56",
            "label": "",
            "description": "James Rodriguez (Real Madrid) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 32:49",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "2 - 30:23",
            "label": "corner",
            "description": "Javier Eraso (Ath Bilbao) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 30:15",
            "label": "",
            "description": "Mikel Balenziaga (Ath Bilbao) looks to break free, but an opposing player clears the ball away. The ball is out of play and the linesman points at the corner flag. Corner to Ath Bilbao."
        },
        {
            "gameTime": "2 - 29:02",
            "label": "",
            "description": "Karim Benzema (Real Madrid) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 26:22",
            "label": "",
            "description": "Benat (Ath Bilbao) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 26:02",
            "label": "substitution",
            "description": "Substitution. Isco (Real Madrid) replaces Mateo Kovacic."
        },
        {
            "gameTime": "2 - 25:57",
            "label": "y-card",
            "description": "Luka Modric (Real Madrid) has tested the patience of referee Alfonso Alvarez and goes into the book for a previous late challenge. Ath Bilbao are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 23:33",
            "label": "substitution",
            "description": "Ernesto Valverde Tejedor prepares a substitution. Lekue is replaced by Iker Muniain (Ath Bilbao)."
        },
        {
            "gameTime": "2 - 22:48",
            "label": "substitution",
            "description": "Danilo comes off the pitch to be replaced by Nacho (Real Madrid)."
        },
        {
            "gameTime": "2 - 22:04",
            "label": "",
            "description": "Keylor Navas pulls off a great save to deny Aritz Aduriz (Ath Bilbao) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "2 - 21:05",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "2 - 19:49",
            "label": "",
            "description": "Gorka Elustondo (Ath Bilbao) is penalised for a foul. Alfonso Alvarez had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 18:52",
            "label": "",
            "description": "A precise cross aimed towards the penalty spot was met by Sabin (Ath Bilbao). He outjumped the defence and produced a decent header which went a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 17:47",
            "label": "",
            "description": "The linesman raises his flag. Daniel Carvajal (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "2 - 17:02",
            "label": "",
            "description": "James Rodriguez (Real Madrid) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "2 - 16:02",
            "label": "substitution",
            "description": "Ernesto Valverde Tejedor has decided to introduce fresh legs, with Gorka Elustondo (Ath Bilbao) replacing Ander Iturraspe."
        },
        {
            "gameTime": "2 - 13:48",
            "label": "funfact",
            "description": "19:11 – the total goal attempt statistics."
        },
        {
            "gameTime": "2 - 13:28",
            "label": "",
            "description": "Karim Benzema (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 12:26",
            "label": "",
            "description": "Oscar de Marcos (Ath Bilbao) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 07:33",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) gets to a rebound on the edge of the box and strikes, but he only hits the crossbar and wastes a promising chance."
        },
        {
            "gameTime": "2 - 06:45",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes a mid range free kick and the effort crashes into the defensive wall."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "",
            "description": "Oscar de Marcos (Ath Bilbao) makes a reckless foul in order to win the ball from his opponent. Alfonso Alvarez has a clear sight of it and blows his whistle. Real Madrid have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 03:14",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) is flagged for offside."
        },
        {
            "gameTime": "2 - 02:24",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Aritz Aduriz (Ath Bilbao) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 00:47",
            "label": "",
            "description": "Aymeric Laporte (Ath Bilbao) sends a long ball in, but Keylor Navas comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Both sides have been very active in the first 45 minutes, providing the fans with an exciting show. During the first half the home team held the upper hand and were much more precise and effective. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 46:22",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:52",
            "label": "soccer-ball",
            "description": "Goal! Cristiano Ronaldo plays a pass to the feet of Toni Kroos (Real Madrid), and he shoots into the back of the net from inside the box. It's 3:1."
        },
        {
            "gameTime": "1 - 43:54",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) pounces on the rebound on the edge of the box but his wild shot goes high over the crossbar."
        },
        {
            "gameTime": "1 - 43:37",
            "label": "corner",
            "description": "The resulting corner from Toni Kroos (Real Madrid) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 43:13",
            "label": "",
            "description": "Toni Kroos (Real Madrid) floats the free kick into the box, but it's easily cleared by the first man. Real Madrid will take a corner kick."
        },
        {
            "gameTime": "1 - 42:41",
            "label": "y-card",
            "description": "Alfonso Alvarez shows a yellow card to Mikel Balenziaga (Ath Bilbao) for his blatant foul. It's a free kick to Real Madrid, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 41:37",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 38:49",
            "label": "",
            "description": "Sabin (Ath Bilbao) latches onto the ball in the penalty box and takes a first time effort that goes a couple of yards over the crossbar."
        },
        {
            "gameTime": "1 - 36:52",
            "label": "soccer-ball",
            "description": "What a beauty from just outside the box! James Rodriguez (Real Madrid) lashed the ball with incredible pace and power inside the left post."
        },
        {
            "gameTime": "1 - 33:11",
            "label": "",
            "description": "Oscar de Marcos (Ath Bilbao) cracks a first time shot from inside the box, but it flies way wide of the left post."
        },
        {
            "gameTime": "1 - 32:01",
            "label": "",
            "description": "James Rodriguez (Real Madrid) latches on to a pass inside the box and strikes the ball to the middle of the goal, but one of the defending players makes a goal line clearance."
        },
        {
            "gameTime": "1 - 29:14",
            "label": "",
            "description": "Great solo effort by Cristiano Ronaldo (Real Madrid) as he beats two defenders before unleashing a low drive from just outside of the box towards the middle of the goal. The goalkeeper is ready and makes a decent save."
        },
        {
            "gameTime": "1 - 28:09",
            "label": "",
            "description": "Aritz Aduriz (Ath Bilbao) wastes a huge chance as he sends a first time shot from inside the penalty area straight onto the crossbar!"
        },
        {
            "gameTime": "1 - 25:56",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) sends a cross into the box, but Gorka Iraizoz comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 24:16",
            "label": "",
            "description": "Danilo (Real Madrid) must be feeling really frustrated right now. He managed to meet the rebound and sent in a nice header from close range. However, Gorka Iraizoz pulled off an amazing save out of the blue to deny his promising effort towards the left side of the goal."
        },
        {
            "gameTime": "1 - 24:07",
            "label": "",
            "description": "James Rodriguez (Real Madrid) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 22:48",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 21:38",
            "label": "",
            "description": "The flag is raised and Cristiano Ronaldo (Real Madrid) is offside again, not for the first time today."
        },
        {
            "gameTime": "1 - 21:14",
            "label": "",
            "description": "Danilo (Real Madrid) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 18:11",
            "label": "",
            "description": "That was a brilliant piece of goalkeeping! Keylor Navas dived superbly to block a header by Aritz Aduriz (Ath Bilbao) from around the penalty spot. His effort was directed straight towards the left post, but Keylor Navas pulled off a remarkable save!"
        },
        {
            "gameTime": "1 - 17:34",
            "label": "",
            "description": "Real Madrid are ruled offside."
        },
        {
            "gameTime": "1 - 16:29",
            "label": "",
            "description": "Benat (Ath Bilbao) attempts to find one of his teammates with a cross from the resultant free kick, but he fails to hit the ball properly and sends it off the pitch."
        },
        {
            "gameTime": "1 - 15:33",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Raphael Varane (Real Madrid) was quite harsh and Alfonso Alvarez didn't hesitate to show him a yellow card. Ath Bilbao will take a free kick."
        },
        {
            "gameTime": "1 - 14:54",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes a mid range free kick and fires the ball into the stands. His effort flew well wide of the right post and it's going to be a goal kick."
        },
        {
            "gameTime": "1 - 13:44",
            "label": "y-card",
            "description": "Alfonso Alvarez shows the yellow card to Xabier Etxeita (Ath Bilbao) for a heavy challenge. Real Madrid have a free kick."
        },
        {
            "gameTime": "1 - 13:36",
            "label": "",
            "description": "Karim Benzema (Real Madrid) skips past his man but can't keep the ball in play."
        },
        {
            "gameTime": "1 - 12:38",
            "label": "",
            "description": "Lekue (Ath Bilbao) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 09:52",
            "label": "soccer-ball",
            "description": "GOAL! A terrible mistake leads to a goal. The defender ends up losing possession, allowing Javier Eraso (Ath Bilbao) to pick up the ball before slotting it into the back of the net to make it 1:1."
        },
        {
            "gameTime": "1 - 08:56",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 08:31",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) picks up a rebound inside the penalty area and sends a shot to the middle of the goal, but is denied by a reflex save from Gorka Iraizoz. Real Madrid get a corner."
        },
        {
            "gameTime": "1 - 08:23",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "1 - 07:47",
            "label": "",
            "description": "What a chance that is! Aritz Aduriz (Ath Bilbao) squanders a huge opportunity as he latches on to a perfect cross from the wing. He and produces a bullet header from around the penalty spot which goes well wide of the left post!"
        },
        {
            "gameTime": "1 - 06:54",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 05:47",
            "label": "",
            "description": "Ander Iturraspe (Ath Bilbao) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 04:38",
            "label": "",
            "description": "Flag goes up against Cristiano Ronaldo (Real Madrid) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 02:26",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Cristiano Ronaldo (Real Madrid) was set free in the area by Karim Benzema and made no mistake with a lovely finish into the top right corner. 1:0."
        },
        {
            "gameTime": "1 - 00:48",
            "label": "",
            "description": "Luka Modric (Real Madrid) is unable to feed a through ball into the path of his teammates."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alfonso Alvarez will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This game has surely entertained the crowd. We saw a lot of wonderful movement and opportunities on the pitch. The hosts were largely in control of the game today. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        }
    ],
    "gameAwayTeam": "Ath Bilbao",
    "gameDate": "13/02/2016 - 18:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "4 - 2"
}