{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2015-09-19 - 16-30 Darmstadt 0 - 3 Bayern Munich/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. Bayern Munich had more of the game and were superior. Their manager will certainly be the happier of the two managers. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        },
        {
            "gameTime": "2 - 45:21",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 44:41",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) attempts to find Kingsley Coman, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "2 - 42:48",
            "label": "",
            "description": "He should have done better. Joshua Kimmich (Bayern Munich) is afforded space to connect with a Kingsley Coman cross, but his header from the centre of the box flies well wide of the right post."
        },
        {
            "gameTime": "2 - 41:37",
            "label": "",
            "description": "The game is interrupted. Jerome Gondorf (Darmstadt) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "2 - 41:13",
            "label": "",
            "description": "Jerome Gondorf (Darmstadt) breaks past challenges inside the box, but puts too much pace on his pass to Fabian Holland."
        },
        {
            "gameTime": "2 - 38:15",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) pulls the jersey of one of the opposition players and Felix Zwayer blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 37:31",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "2 - 35:41",
            "label": "",
            "description": "Aytac Sulu (Darmstadt) fails to deliver a decent cross from a long range free kick. The opposition's defence intercepts the effort."
        },
        {
            "gameTime": "2 - 34:59",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Javi Martinez (Bayern Munich) was quite harsh and Felix Zwayer didn't hesitate to show him a yellow card. A free kick to Darmstadt."
        },
        {
            "gameTime": "2 - 33:04",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) fires in an effort from the free kick from some 22 metres. His strike is very inaccurate and ends in row Z."
        },
        {
            "gameTime": "2 - 32:18",
            "label": "y-card",
            "description": "Aytac Sulu (Darmstadt) is booked after bringing down an opponent. Felix Zwayer had an easy decision to make. Bayern Munich are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 31:37",
            "label": "substitution",
            "description": "Dirk Schuster has decided to make a change. Mario Vrancic (Darmstadt) replaces Konstantin Rausch."
        },
        {
            "gameTime": "2 - 30:50",
            "label": "",
            "description": "Rafinha (Bayern Munich) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "2 - 27:57",
            "label": "y-card",
            "description": "Sandro Wagner (Darmstadt) has tested the patience of referee Felix Zwayer and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 26:58",
            "label": "substitution",
            "description": "Here comes a substitution. Xabi Alonso (Bayern Munich) is brought on as a substitute for Jerome Boateng."
        },
        {
            "gameTime": "2 - 26:34",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "2 - 25:09",
            "label": "",
            "description": "Jan Rosenthal (Darmstadt) is flagged for offside."
        },
        {
            "gameTime": "2 - 24:42",
            "label": "",
            "description": "Javi Martinez (Bayern Munich) climbs high to connect with a cross near the penalty spot but plants a header well wide of the left post."
        },
        {
            "gameTime": "2 - 24:25",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Mario Gotze (Bayern Munich)."
        },
        {
            "gameTime": "2 - 24:06",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) produces a dangerous low pass into the penalty area, but the defence manage to cut it out. The ball goes behind for a corner. Bayern Munich will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 23:27",
            "label": "substitution",
            "description": "Substitution. Jan Rosenthal (Darmstadt) replaces Peter Niemeyer."
        },
        {
            "gameTime": "2 - 22:55",
            "label": "substitution",
            "description": "Here is a change. Douglas Costa is going off and Pep Guardiola gives the last tactical orders to Thomas Muller (Bayern Munich)."
        },
        {
            "gameTime": "2 - 22:35",
            "label": "",
            "description": "A lofted cross from Rafinha (Bayern Munich) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 20:18",
            "label": "substitution",
            "description": "Here comes a substitution. Arturo Vidal is given a rest as he is replaced by Javi Martinez (Bayern Munich)."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Sebastian Rode (Bayern Munich) and he fired home from close range. The score is 0:3."
        },
        {
            "gameTime": "2 - 17:50",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) squanders a great opportunity after striking the ball onto the post!"
        },
        {
            "gameTime": "2 - 16:56",
            "label": "soccer-ball",
            "description": "Goal! Sebastian Rode tees up Kingsley Coman (Bayern Munich) on the edge of the box and he fires the ball into the bottom left corner. 0:2."
        },
        {
            "gameTime": "2 - 14:55",
            "label": "",
            "description": "Sandro Wagner (Darmstadt) meets a cross from Marcel Heller, but he cannot keep his header on target. It goes well wide of the left post."
        },
        {
            "gameTime": "2 - 13:18",
            "label": "substitution",
            "description": "A substitution has been made. Dominik Stroh Engel goes off and Sandro Wagner (Darmstadt) comes on."
        },
        {
            "gameTime": "2 - 12:35",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) makes a reckless foul in order to win the ball from his opponent. Felix Zwayer has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "2 - 11:34",
            "label": "",
            "description": "Close! Mario Gotze (Bayern Munich) picks up the ball in space and from inside the penalty area sends a shot inches wide of the left post."
        },
        {
            "gameTime": "2 - 10:38",
            "label": "corner",
            "description": "Kingsley Coman (Bayern Munich) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 10:02",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Bayern Munich force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 09:26",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) jinks his way past multiple challenges and fires the ball from the edge of the box to the right side of the goal, but Christian Mathenia shows his agility and makes a save."
        },
        {
            "gameTime": "2 - 08:53",
            "label": "",
            "description": "Peter Niemeyer (Darmstadt) is able to continue to play."
        },
        {
            "gameTime": "2 - 07:58",
            "label": "injury",
            "description": "Peter Niemeyer (Darmstadt) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 06:02",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 05:11",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "2 - 03:57",
            "label": "",
            "description": "Flag up against Peter Niemeyer (Darmstadt). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 03:11",
            "label": "",
            "description": "Sebastian Rode (Bayern Munich) escapes without any punishment from the referee after using excessive force to foul his opponent. It's a free kick to Darmstadt in a dangerous position."
        },
        {
            "gameTime": "2 - 01:39",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "2 - 00:46",
            "label": "",
            "description": "Felix Zwayer blows his whistle after Jerome Gondorf (Darmstadt) brings one of his opponents down with a strong tackle. Bayern Munich win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 00:21",
            "label": "",
            "description": "Dominik Stroh Engel (Darmstadt) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, that wasn't the best of halves. Both sides struggled to produce anything of merit. Great display from Bayern Munich so far, looking at stats you have to say that they were the better side during that opening 45 minutes. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 45:22",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Felix Zwayer has ended it."
        },
        {
            "gameTime": "1 - 44:44",
            "label": "",
            "description": "Gyorgy Garics (Darmstadt) is penalised for holding. Felix Zwayer signals a set piece."
        },
        {
            "gameTime": "1 - 43:56",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) sends a long ball across the pitch, but it misses its target. The ball is out of play. Darmstadt will have a throw in."
        },
        {
            "gameTime": "1 - 42:14",
            "label": "",
            "description": "It looks like Arturo Vidal (Bayern Munich) saw red with that tackle. Felix Zwayer won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "1 - 40:25",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 39:39",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) missed a great opportunity! He jumped for a cross and headed towards goal from the penalty spot, but the ball sailed well wide of the left post!"
        },
        {
            "gameTime": "1 - 38:12",
            "label": "",
            "description": "Marcel Heller (Darmstadt) swings a cross into the box, but it's far too close to Manuel Neuer, who smothers the ball."
        },
        {
            "gameTime": "1 - 37:53",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) creates a good chance for himself and goes for goal from mid range, but he misses the left post by a whisker."
        },
        {
            "gameTime": "1 - 36:10",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "1 - 35:52",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 35:35",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) has an effort from distance but it's blocked."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends a cross into the box, but Christian Mathenia comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 33:35",
            "label": "",
            "description": "Manuel Neuer stretches to his right and makes a brilliant save! Konstantin Rausch (Darmstadt) met a rebound outside the box and attempted to beat the keeper into the bottom right corner."
        },
        {
            "gameTime": "1 - 33:28",
            "label": "",
            "description": "Peter Niemeyer (Darmstadt) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 31:29",
            "label": "",
            "description": "Marcel Heller (Darmstadt) latches on to a lofted pass and strikes the ball! His attempt flies narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 30:20",
            "label": "",
            "description": "Jerome Gondorf (Darmstadt) commits a rough challenge and Felix Zwayer blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 29:44",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 28:15",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 27:53",
            "label": "",
            "description": "Bayern Munich seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 25:13",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "1 - 24:27",
            "label": "",
            "description": "The linesman signals that Konstantin Rausch (Darmstadt) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 23:41",
            "label": "corner",
            "description": "Konstantin Rausch (Darmstadt) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 23:09",
            "label": "",
            "description": "A cross to the edge of the box finds Dominik Stroh Engel (Darmstadt) who takes a nice first touch and tries to beat the keeper with a quick shot towards the bottom right corner. Manuel Neuer pulls off a good save and the score remains the same. The referee points to the corner flag and Darmstadt will take a corner."
        },
        {
            "gameTime": "1 - 22:23",
            "label": "",
            "description": "Good movement by Kingsley Coman (Bayern Munich), but he can't find any of his teammates as the cross is poor. The ball is off of the pitch and it's a goal kick for Darmstadt."
        },
        {
            "gameTime": "1 - 19:40",
            "label": "soccer-ball",
            "description": "Arturo Vidal (Bayern Munich) receives a pass and doesn't hesitate to shoot from around 22 metres. And it was an excellent choice. His superb effort goes in off the right post."
        },
        {
            "gameTime": "1 - 18:03",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) stands over the resultant free kick from mid range, but his shot goes just wide of the left post."
        },
        {
            "gameTime": "1 - 17:30",
            "label": "",
            "description": "Peter Niemeyer (Darmstadt) jumps into a tackle and Felix Zwayer blows his whistle for a foul. A free kick has been awarded to Bayern Munich."
        },
        {
            "gameTime": "1 - 16:11",
            "label": "",
            "description": "Felix Zwayer interrupts the game for a tactical foul by Mario Gotze (Bayern Munich)."
        },
        {
            "gameTime": "1 - 14:51",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 14:39",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) looks to break free, but an opposing player clears the ball away. The ball goes out of play. Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "1 - 14:22",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 14:09",
            "label": "",
            "description": "Marcel Heller (Darmstadt) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. Bayern Munich are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 13:29",
            "label": "",
            "description": "Gyorgy Garics (Darmstadt) commits a rough foul. Felix Zwayer stops the game and makes a call."
        },
        {
            "gameTime": "1 - 13:10",
            "label": "",
            "description": "Jerome Gondorf (Darmstadt) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 12:50",
            "label": "",
            "description": "Marcel Heller (Darmstadt) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 10:08",
            "label": "",
            "description": "Chance! Arturo Vidal (Bayern Munich) comes within inches of scoring after picking up a pass from Kingsley Coman, but his shot from inside the box flashes inches wide of the right post."
        },
        {
            "gameTime": "1 - 09:12",
            "label": "",
            "description": "Aytac Sulu (Darmstadt) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "1 - 08:18",
            "label": "",
            "description": "The linesman raises his flag. Tobias Kempe (Darmstadt) is adjudged offside."
        },
        {
            "gameTime": "1 - 06:31",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 05:37",
            "label": "corner",
            "description": "The corner by Kingsley Coman (Bayern Munich) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 05:13",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Kingsley Coman (Bayern Munich). Good work from Bayern Munich as they win a corner."
        },
        {
            "gameTime": "1 - 03:05",
            "label": "",
            "description": "Tobias Kempe (Darmstadt) is caught offside!"
        },
        {
            "gameTime": "1 - 02:18",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) breaks past challenges inside the box, but puts too much pace on his pass to Mario Gotze. The ball goes out of play and Darmstadt will have a goal kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Bayern Munich will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Felix Zwayer got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Robert Lewandowski is Bayern Munich's leading goal scorer with 30 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Slobodan Rajkovic (Hamburger) is Darmstadt's latest signing."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "13 That's the number of clean sheets Darmstadt have already kept in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. Bayern Munich had more of the game and were superior. Their manager will certainly be the happier of the two managers. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        }
    ],
    "gameAwayTeam": "Bayern Munich",
    "gameDate": "19/09/2015 - 16:30",
    "gameHomeTeam": "Darmstadt",
    "gameScore": "0 - 3"
}