{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2014-2015/2015-05-03 - 21-45 Napoli 3 - 0 AC Milan/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. Great display from the home side, you have to say that they were the better side today. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "corner",
            "description": "Corner kick. Manolo Gabbiadini (Napoli) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 46:39",
            "label": "",
            "description": "Diego Lopez hears the fans clapping his superb goalkeeping. Dries Mertens (Napoli) shoots from the edge of the box towards the right side of the goal, but the goalkeeper makes a magnificent save. Napoli force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 42:06",
            "label": "funfact",
            "description": "Total attempts – 27:2."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "substitution",
            "description": "The referee signals a substitution. Gianfilippo Felicioli (AC Milan) is brought on as a substitute for Giacomo Bonaventura."
        },
        {
            "gameTime": "2 - 38:59",
            "label": "substitution",
            "description": "Rafael Benitez prepares a substitution. David Lopez is replaced by Sebastiano Luperto (Napoli)."
        },
        {
            "gameTime": "2 - 37:21",
            "label": "",
            "description": "Dries Mertens (Napoli) stands over the resultant free kick from mid range, but his shot goes just over the crossbar. It could have been a fantastic goal!"
        },
        {
            "gameTime": "2 - 36:49",
            "label": "",
            "description": "One of the AC Milan players unfairly tackled his opponent and conceded a foul. Another situation results in a direct free kick for Napoli."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Manolo Gabbiadini (Napoli) and he fired home from close range. The score is 3:0."
        },
        {
            "gameTime": "2 - 30:25",
            "label": "",
            "description": "Gonzalo Higuain (Napoli) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Diego Lopez."
        },
        {
            "gameTime": "2 - 28:55",
            "label": "soccer-ball",
            "description": "Gonzalo Higuain (Napoli) receives a precise pass inside the box from Dries Mertens and he beats the goalkeeper with a neat finish into the right side of the net. 2:0."
        },
        {
            "gameTime": "2 - 25:10",
            "label": "y-card",
            "description": "The referee Paolo Mazzoleni awards Marek Hamsik (Napoli) a yellow card."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "soccer-ball",
            "description": "One of the defending players blocked the first attempt, but the ball lands at the feet of Marek Hamsik (Napoli) and he unleashes an unstoppable shot which goes in off the right post. No chance for the goalkeeper."
        },
        {
            "gameTime": "2 - 23:42",
            "label": "",
            "description": "Gonzalo Higuain (Napoli) finds some space inside the box and produces a first time shot that goes high over the bar. High, wide and not at all pretty."
        },
        {
            "gameTime": "2 - 23:23",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 23:20",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Dries Mertens (Napoli) is coming onto the pitch as Lorenzo Insigne cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 22:51",
            "label": "",
            "description": "Diego Lopez (AC Milan) has an effort from distance but it's blocked. The ball goes behind for a corner. Napoli will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 21:56",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 20:19",
            "label": "",
            "description": "Keisuke Honda (AC Milan) takes a long range free kick and whips it into the box. The goalkeeper reads it well and leaps high to intercept the ball."
        },
        {
            "gameTime": "2 - 20:03",
            "label": "",
            "description": "Referee Paolo Mazzoleni sees the trip by Faouzi Ghoulam (Napoli) and doesn't hesitate to blow his whistle. AC Milan win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 19:27",
            "label": "y-card",
            "description": "Paolo Mazzoleni shows a yellow card to Raul Albiol (Napoli) for a tough tackle."
        },
        {
            "gameTime": "2 - 18:14",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Faouzi Ghoulam (Napoli)."
        },
        {
            "gameTime": "2 - 17:56",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) tries to send a pass but it's blocked. The ball goes out of play and Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 15:50",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 27:2."
        },
        {
            "gameTime": "2 - 15:33",
            "label": "substitution",
            "description": "Substitution. Salvatore Bocchetti leaves the pitch and is replaced by Daniele Bonera (AC Milan)."
        },
        {
            "gameTime": "2 - 15:17",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Jose Callejon (Napoli). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 14:30",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) pulls the trigger and strikes the ball towards goal from long range, but his effort is blocked by one of the defenders. The referee points to the corner flag. It's a corner to Napoli."
        },
        {
            "gameTime": "2 - 14:25",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Jose Callejon (Napoli) takes it short."
        },
        {
            "gameTime": "2 - 14:08",
            "label": "",
            "description": "Marek Hamsik (Napoli) wasted a clear opportunity. He fired a first time shot from point blank range, but it rattled the left post!"
        },
        {
            "gameTime": "2 - 12:10",
            "label": "corner",
            "description": "Lorenzo Insigne (Napoli) works the corner short."
        },
        {
            "gameTime": "2 - 12:01",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The ball goes out for a corner. Napoli can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 11:26",
            "label": "substitution",
            "description": "Here is a change. Mattia Destro is going off and Filippo Inzaghi gives the last tactical orders to Giampaolo Pazzini (AC Milan)."
        },
        {
            "gameTime": "2 - 11:07",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) wastes a big chance! He unleashes a shot from the edge of the box and it goes narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 09:59",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Jorginho trots off the pitch and is replaced by Manolo Gabbiadini (Napoli)."
        },
        {
            "gameTime": "2 - 07:53",
            "label": "",
            "description": "Gonzalo Higuain (Napoli) gets himself onto the end of the corner, but his header is blocked."
        },
        {
            "gameTime": "2 - 07:32",
            "label": "corner",
            "description": "Jose Callejon (Napoli) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 07:04",
            "label": "",
            "description": "Diego Lopez was forced into action to thwart Cristian Maggio (Napoli). He found himself some space after latching on to a pass and unleashed a shot to the bottom right corner but couldn't beat the keeper. The linesman points to the corner flag, Napoli are going to take it."
        },
        {
            "gameTime": "2 - 05:34",
            "label": "corner",
            "description": "A dangerous looking corner kick from Lorenzo Insigne (Napoli) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 05:26",
            "label": "",
            "description": "Gonzalo Higuain (Napoli) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Napoli force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 01:10",
            "label": "corner",
            "description": "Lorenzo Insigne (Napoli) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 00:37",
            "label": "",
            "description": "Jose Callejon (Napoli) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. The referee signals a corner kick to Napoli."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We have been witnesses to an ordinary game without many breathtaking situations, but there is still time for improvement in the second half. The host team has dominated the game in almost all aspects so far and their opponents have struggled to keep up. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:35",
            "label": "corner",
            "description": "Lorenzo Insigne (Napoli) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 45:12",
            "label": "",
            "description": "Marek Hamsik (Napoli) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. Napoli have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:34",
            "label": "corner",
            "description": "Lorenzo Insigne (Napoli) takes a short corner kick."
        },
        {
            "gameTime": "1 - 44:18",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) swings in a cross, but the ball is cleared to safety by one of the defending players. The referee points to the corner flag and Napoli will take a corner."
        },
        {
            "gameTime": "1 - 43:36",
            "label": "",
            "description": "Lorenzo Insigne sprays a wonderful pass out to Gonzalo Higuain (Napoli), who cannot get enough power or direction to cause Diego Lopez problems and the goalkeeper is able to watch the ball go just over the crossbar."
        },
        {
            "gameTime": "1 - 42:06",
            "label": "",
            "description": "Marek Hamsik (Napoli) finds himself unmarked on the edge of the box, but he drags his shot just wide of the right post."
        },
        {
            "gameTime": "1 - 39:28",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the left post."
        },
        {
            "gameTime": "1 - 38:07",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) latches on to a superb cross into the box and hits the left post with a fine header. What a chance!"
        },
        {
            "gameTime": "1 - 36:39",
            "label": "",
            "description": "Marek Hamsik (Napoli) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear."
        },
        {
            "gameTime": "1 - 33:29",
            "label": "corner",
            "description": "Lorenzo Insigne (Napoli) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 33:13",
            "label": "",
            "description": "Marek Hamsik (Napoli) produces a lovely chip pass into the box, but one of the opposition players cuts it out. Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 28:43",
            "label": "corner",
            "description": "Lorenzo Insigne (Napoli) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 28:23",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. Corner kick. Napoli will have an opportunity."
        },
        {
            "gameTime": "1 - 26:38",
            "label": "",
            "description": "The free kick is taken by Giacomo Bonaventura (AC Milan), but ball is cleared."
        },
        {
            "gameTime": "1 - 26:26",
            "label": "",
            "description": "Jorginho (Napoli) was trying to get to the ball but clattered into the legs of the opponent as well. Paolo Mazzoleni blows his whistle for an infringement. AC Milan have been awarded a free kick."
        },
        {
            "gameTime": "1 - 25:28",
            "label": "corner",
            "description": "Keisuke Honda (AC Milan) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 24:57",
            "label": "",
            "description": "A cross from the free kick is whipped in by Giacomo Bonaventura (AC Milan), but one of the defenders steps in and averts the threat. The linesman makes the right call and AC Milan will have a corner."
        },
        {
            "gameTime": "1 - 21:39",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) sends a cross into the box from the free kick, but his effort lacks accuracy and goes well out of play."
        },
        {
            "gameTime": "1 - 20:48",
            "label": "",
            "description": "Paolo Mazzoleni blows his whistle and signals a foul after Andrea Poli (AC Milan) brought his opponent down. Napoli earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 17:28",
            "label": "",
            "description": "Paolo Mazzoleni blows for a foul after Cristian Maggio (Napoli) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 15:02",
            "label": "injury",
            "description": "Giacomo Bonaventura (AC Milan) is being forced to leave the pitch in order to receive medical treatment and his team will play with a man short for a few minutes."
        },
        {
            "gameTime": "1 - 14:41",
            "label": "",
            "description": "Marek Hamsik (Napoli) receives a pass and tries his luck with a long range powerful effort. His poorly placed shot lacks accuracy and flies way over the crossbar. The ball is off of the pitch and it's a goal kick for AC Milan."
        },
        {
            "gameTime": "1 - 12:26",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) fashions a shot from the edge of the box after receiving an accurate pass. Mariano Andujar makes a comfortable save to stop the effort from flying into the middle of the goal."
        },
        {
            "gameTime": "1 - 11:37",
            "label": "",
            "description": "Paolo Mazzoleni has a clear sight and sees a foul from Faouzi Ghoulam (Napoli)."
        },
        {
            "gameTime": "1 - 08:52",
            "label": "",
            "description": "Raul Albiol (Napoli) should know this behaviour is beyond the rules. He was too careless with his challenge and left Paolo Mazzoleni no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 08:41",
            "label": "",
            "description": "The Napoli players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 04:23",
            "label": "corner",
            "description": "Jose Callejon (Napoli) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "1 - 04:04",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) blasts the ball from just outside the box, but his attempt is blocked by the defender. Napoli will take a corner kick."
        },
        {
            "gameTime": "1 - 03:45",
            "label": "corner",
            "description": "Lorenzo Insigne (Napoli) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 02:45",
            "label": "penalty-missed",
            "description": "Gonzalo Higuain (Napoli) has a great chance to score from the penalty. He shoots to the left post, but Diego Lopez leaps out to thwart his attempt. The referee and his assistant both point at the corner flag. Napoli will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 01:48",
            "label": "",
            "description": "Gonzalo Higuain (Napoli) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 00:35",
            "label": "r-card",
            "description": "Very strict call by the referee! He pulls out the red card and sends Mattia De Sciglio (AC Milan) off the pitch."
        },
        {
            "gameTime": "1 - 00:30",
            "label": "penalty",
            "description": "Mattia De Sciglio (AC Milan) trips an opposition player and Paolo Mazzoleni signals a foul. PENALTY to Napoli! Almost the entire opposition team is gathered around the referee and complaining. However, the decision has been made and it's final."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paolo Mazzoleni will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. Great display from the home side, you have to say that they were the better side today. The home side attempted to hold onto the ball for as long as possible, while the away side focused on defending and let the opposition keep possession."
        }
    ],
    "gameAwayTeam": "AC Milan",
    "gameDate": "03/05/2015 - 21:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "3 - 0"
}