{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2014-2015/2015-04-19 - 21-45 Inter 0 - 0 AC Milan/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. Great display from the home side, you have to say that they were the better side today. Long balls and crosses were the main weapons of the home team. The away team tried to find the weakness in the opposition's defence especially with rapid counter attacks."
        },
        {
            "gameTime": "2 - 49:06",
            "label": "whistle",
            "description": "That's it for today, Luca Banti has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:48",
            "label": "",
            "description": "Mauro Icardi (Inter) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 47:38",
            "label": "",
            "description": "Xherdan Shaqiri (Inter) sends a teasing cross into the area, but Diego Lopez intercepts the ball."
        },
        {
            "gameTime": "2 - 47:05",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 46:37",
            "label": "",
            "description": "Marco van Ginkel (AC Milan) races towards goal but the defender gets back well to make a challenge. The referee points to the corner flag. It's a corner to AC Milan."
        },
        {
            "gameTime": "2 - 46:04",
            "label": "",
            "description": "Nigel De Jong (AC Milan) wastes a great scoring opportunity! He receives a precise lofted cross inside the box and sends a quick shot to the top left corner, but he can't get the power to direct it past Samir Handanovic, who keeps it out."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:52",
            "label": "",
            "description": "Mauro Icardi (Inter) controls a cross inside the six yard box, but sends his shot slightly wide of the left post."
        },
        {
            "gameTime": "2 - 44:05",
            "label": "",
            "description": "Xherdan Shaqiri (Inter) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "2 - 43:23",
            "label": "",
            "description": "Jeremy Menez (AC Milan) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "2 - 39:45",
            "label": "",
            "description": "Mattia Destro (AC Milan) receives a low pass just outside the box and unleashes a fine strike to the bottom left corner. Samir Handanovic pulls off a reflexive save to block his effort. Nice goalkeeping skill."
        },
        {
            "gameTime": "2 - 38:51",
            "label": "y-card",
            "description": "Hernanes (Inter) is given a fully deserved yellow card."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "y-card",
            "description": "Luca Banti shows a yellow card to Danilo D'Ambrosio (Inter), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 36:28",
            "label": "y-card",
            "description": "The main referee, Luca Banti, is apparently not going to tolerate any discussions. Ignazio Abate (AC Milan) is given a yellow card for dissent."
        },
        {
            "gameTime": "2 - 35:59",
            "label": "substitution",
            "description": "Substitution. Alessio Cerci (AC Milan) in, Andrea Poli out."
        },
        {
            "gameTime": "2 - 35:17",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) receives a precise pass on the edge of the box and has an effort on goal. Unfortunately for him, his strike flies inches high over the bar."
        },
        {
            "gameTime": "2 - 34:30",
            "label": "",
            "description": "Mauro Icardi (Inter) is caught offside!"
        },
        {
            "gameTime": "2 - 33:35",
            "label": "corner",
            "description": "Xherdan Shaqiri (Inter) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 33:07",
            "label": "",
            "description": "is unlucky with a goal bound effort from the edge of the box. A brilliant save by Diego Lopez (AC Milan) stops the ball from going inside right post. The ball goes out of play. Inter are awarded a corner kick."
        },
        {
            "gameTime": "2 - 32:26",
            "label": "corner",
            "description": "Hernanes (Inter) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 32:10",
            "label": "",
            "description": "Mauro Icardi (Inter) fires the ball from distance, but it's blocked by a defender. The ball goes out of play. Inter are awarded a corner kick."
        },
        {
            "gameTime": "2 - 31:10",
            "label": "substitution",
            "description": "Roberto Mancini has decided to introduce fresh legs, with Xherdan Shaqiri (Inter) replacing Mateo Kovacic."
        },
        {
            "gameTime": "2 - 30:40",
            "label": "",
            "description": "The foul by Luca Antonelli (AC Milan) was seen by Luca Banti who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 27:20",
            "label": "substitution",
            "description": "Substitution. Suso walks off the pitch and Mattia Destro (AC Milan) comes on as a substitute."
        },
        {
            "gameTime": "2 - 26:30",
            "label": "",
            "description": "Rodrigo Palacio (Inter) launches into a thunderous tackle on his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 24:58",
            "label": "substitution",
            "description": "Alex is being substituted because of an injury. Filippo Inzaghi sends Gabriel Paletta (AC Milan) on the pitch."
        },
        {
            "gameTime": "2 - 24:17",
            "label": "injury",
            "description": "The game is interrupted now, Alex (AC Milan) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 22:43",
            "label": "",
            "description": "A pass from Rodrigo Palacio (Inter) is intercepted by Diego Lopez and the move breaks down."
        },
        {
            "gameTime": "2 - 22:25",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 17:7."
        },
        {
            "gameTime": "2 - 21:22",
            "label": "substitution",
            "description": "Assane Gnoukouri comes off the pitch to be replaced by Joel Obi (Inter)."
        },
        {
            "gameTime": "2 - 19:34",
            "label": "",
            "description": "Nemanja Vidic (Inter) finds enough space to climb high and plants a header well wide of the right post. What a poor effort."
        },
        {
            "gameTime": "2 - 18:53",
            "label": "corner",
            "description": "Hernanes (Inter) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "2 - 18:17",
            "label": "",
            "description": "Hernanes (Inter) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. The ball goes out of play and Inter have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 16:17",
            "label": "",
            "description": "That was close by Mateo Kovacic (Inter)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "2 - 13:49",
            "label": "corner",
            "description": "Hernanes (Inter) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 13:38",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) fails to send a pass into the box as his effort is cut out. Inter force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 11:52",
            "label": "",
            "description": "What a great touch by Rodrigo Palacio (Inter) as he controls a fine pass into the box and takes a shot to the centre of the goal, but an opposing player makes a clearance. Great defending."
        },
        {
            "gameTime": "2 - 11:14",
            "label": "corner",
            "description": "Hernanes (Inter) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 11:01",
            "label": "",
            "description": "Rodrigo Palacio (Inter) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play. Inter will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 09:16",
            "label": "",
            "description": "Mauro Icardi (Inter) clips a neat ball into the box in the direction of Rodrigo Palacio, but he can't get on the end of the pass."
        },
        {
            "gameTime": "2 - 09:02",
            "label": "",
            "description": "AC Milan are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 07:30",
            "label": "",
            "description": "Luca Antonelli (AC Milan) was too fierce in his attempt to get the ball from his opponent and Luca Banti blows for a foul."
        },
        {
            "gameTime": "2 - 04:20",
            "label": "",
            "description": "Flag up against Mauro Icardi (Inter). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "",
            "description": "Jeremy Menez (AC Milan) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 03:13",
            "label": "",
            "description": "Luca Banti blows his whistle for a foul after Nigel De Jong (AC Milan) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 01:17",
            "label": "",
            "description": "That was close by Giacomo Bonaventura (AC Milan)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the right post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "It wasn't the most inspiring 45 minutes that you'll see this week. Let's hope that the second period will be more exciting. The game is quite balanced. The home side display their usual fluent passing, while the visitors use their organization to stop the build up and launch counter attacks."
        },
        {
            "gameTime": "1 - 46:18",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "",
            "description": "Andrea Poli (AC Milan) is able to continue to play."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:03",
            "label": "injury",
            "description": "Andrea Poli (AC Milan) is down injured and the referee stops play so that he can receive medical treatment."
        },
        {
            "gameTime": "1 - 43:48",
            "label": "corner",
            "description": "The corner from Suso (AC Milan) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 43:18",
            "label": "",
            "description": "An attempted cross from Ignazio Abate (AC Milan) is cleared. AC Milan earn a corner."
        },
        {
            "gameTime": "1 - 42:52",
            "label": "",
            "description": "The linesman raises his flag for offside before Jeremy Menez (AC Milan) heads on."
        },
        {
            "gameTime": "1 - 42:38",
            "label": "",
            "description": "Luca Banti blows his whistle. Danilo D'Ambrosio (Inter) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 39:13",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Suso (AC Milan) sends it out of play. The ball is off of the pitch and it's a goal kick for Inter."
        },
        {
            "gameTime": "1 - 39:02",
            "label": "",
            "description": "Ignazio Abate (AC Milan) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 34:55",
            "label": "y-card",
            "description": "A yellow card for a tackle by Juan Jesus (Inter). Luca Banti doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 34:41",
            "label": "",
            "description": "A pass from Jeremy Menez (AC Milan) is intercepted by Samir Handanovic and the move breaks down."
        },
        {
            "gameTime": "1 - 32:42",
            "label": "y-card",
            "description": "Luca Banti shows a yellow card to Nigel De Jong (AC Milan) for a tough tackle."
        },
        {
            "gameTime": "1 - 28:46",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Nigel De Jong (AC Milan) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "1 - 28:02",
            "label": "",
            "description": "Suso (AC Milan) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 27:55",
            "label": "y-card",
            "description": "Gary Medel (Inter) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Luca Banti ignores the protests."
        },
        {
            "gameTime": "1 - 25:41",
            "label": "",
            "description": "Hernanes (Inter) fires the ball in from a mid range free kick, but it blazes over the bar."
        },
        {
            "gameTime": "1 - 25:06",
            "label": "",
            "description": "Luca Antonelli (AC Milan) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him. Inter are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 24:44",
            "label": "corner",
            "description": "Hernanes (Inter) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 24:24",
            "label": "",
            "description": "Rodrigo Palacio (Inter) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Inter win a corner."
        },
        {
            "gameTime": "1 - 21:56",
            "label": "",
            "description": "Referee Luca Banti sees the trip by Gary Medel (Inter) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 20:59",
            "label": "",
            "description": "Suso (AC Milan) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 19:34",
            "label": "",
            "description": "The goalkeeper pulls off a save to deny Suso (AC Milan), whose effort is only aimed at the middle of the goal."
        },
        {
            "gameTime": "1 - 18:40",
            "label": "",
            "description": "Rodrigo Palacio (Inter) commits a foul after unfairly pressing his opponent during an attacking move."
        },
        {
            "gameTime": "1 - 17:35",
            "label": "",
            "description": "Suso (AC Milan) fashions a shot from the edge of the box after receiving an accurate pass. Samir Handanovic makes a comfortable save to stop the effort from flying into the middle of the goal."
        },
        {
            "gameTime": "1 - 13:35",
            "label": "",
            "description": "Jeremy Menez (AC Milan) sees an unmarked teammate and attempts to send him a low pass. However, one of the defenders reads the game perfectly and averts the danger."
        },
        {
            "gameTime": "1 - 12:42",
            "label": "",
            "description": "Mateo Kovacic (Inter) strikes the ball towards goal from distance, but it goes over the bar. The ball goes out of play and AC Milan will have a goal kick."
        },
        {
            "gameTime": "1 - 10:58",
            "label": "corner",
            "description": "Hernanes (Inter) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 10:24",
            "label": "",
            "description": "Hernanes (Inter) tries his luck with a long range effort after receiving a precise pass. It goes to the top right corner, but Diego Lopez has a clear view of it and makes a comfortable save. The referee and his assistant both point at the corner flag. Inter will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 09:24",
            "label": "corner",
            "description": "Hernanes (Inter) takes a short corner kick."
        },
        {
            "gameTime": "1 - 09:10",
            "label": "",
            "description": "The ball is cleared after Rodrigo Palacio (Inter) attempted to dribble past an opposing player. The ball goes out for a corner. Inter can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 07:15",
            "label": "corner",
            "description": "Hernanes (Inter) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 07:03",
            "label": "",
            "description": "Rodrigo Palacio (Inter) tries to send a low pass into the box, but it's blocked and cleared. The linesman points to the corner flag, Inter are going to take it."
        },
        {
            "gameTime": "1 - 06:33",
            "label": "",
            "description": "Inter players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass."
        },
        {
            "gameTime": "1 - 01:26",
            "label": "",
            "description": "Ignazio Abate (AC Milan) was too forceful with his tackle and Luca Banti interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Inter will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Luca Banti is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. Great display from the home side, you have to say that they were the better side today. Long balls and crosses were the main weapons of the home team. The away team tried to find the weakness in the opposition's defence especially with rapid counter attacks."
        }
    ],
    "gameAwayTeam": "AC Milan",
    "gameDate": "19/04/2015 - 21:45",
    "gameHomeTeam": "Inter",
    "gameScore": "0 - 0"
}