{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-02-13 - 20-30 Chelsea 5 - 1 Newcastle Utd/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:20",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side dominated this game. The hosts tried to catch the opposition off guard and hit them on the break. The visiting side kept the ball at their feet and the main intention was to produce that final killer pass."
        },
        {
            "gameTime": "2 - 49:11",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 48:53",
            "label": "corner",
            "description": "Eden Hazard (Chelsea) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "injury",
            "description": "Daryl Janmaat (Newcastle Utd) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 47:47",
            "label": "",
            "description": "Nemanja Matic (Chelsea) tries to send the ball in front of the goal, but the opposition's defence averts the threat. The referee blows his whistle, Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 46:26",
            "label": "",
            "description": "Seydou Doumbia (Newcastle Utd) is unable to control an accurate defence splitting pass properly and one of the defending players reacts well to rob him of the ball."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:22",
            "label": "soccer-ball",
            "description": "Andros Townsend (Newcastle Utd) scores with a great individual effort! He makes a good run, skips past defenders and smashes the ball from the edge of the box past the diving goalkeeper. His low drive went into the bottom left corner. Absolutely phenomenal!"
        },
        {
            "gameTime": "2 - 43:19",
            "label": "",
            "description": "Daryl Janmaat (Newcastle Utd) fails to pick a body out in the box with an over hit chip pass. The ball is off of the pitch and it's a goal kick for Chelsea."
        },
        {
            "gameTime": "2 - 42:57",
            "label": "",
            "description": "Gary Cahill (Chelsea) pulls the jersey of one of the opposition players and Roger East blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 41:36",
            "label": "",
            "description": "Eden Hazard (Chelsea) had a good opportunity when he latched on to a cross from the wing, but his strike from the six yard box wasn't accurate enough and the ball went a few inches wide of the right post. The ball is off of the pitch and it's a goal kick for Newcastle Utd."
        },
        {
            "gameTime": "2 - 41:14",
            "label": "",
            "description": "Good clearance! Seydou Doumbia (Newcastle Utd) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him."
        },
        {
            "gameTime": "2 - 40:45",
            "label": "",
            "description": "Newcastle Utd showcase their great team work by exchanging one two passes, but one wayward pass sees them lose possession."
        },
        {
            "gameTime": "2 - 37:57",
            "label": "soccer-ball",
            "description": "Goal! Cesar Azpilicueta plays a pass to the feet of Bertrand Traore (Chelsea), and he shoots into the bottom right corner from inside the box. It's 5:0."
        },
        {
            "gameTime": "2 - 35:58",
            "label": "",
            "description": "Pedro (Chelsea) plays a one two with Nemanja Matic, but the move breaks down."
        },
        {
            "gameTime": "2 - 35:18",
            "label": "",
            "description": "Ruben Loftus Cheek (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 34:32",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Willian will be replaced by Ruben Loftus Cheek (Chelsea)."
        },
        {
            "gameTime": "2 - 34:06",
            "label": "",
            "description": "A rebound falls at the feet of Abdul Baba Rahman (Chelsea) who unleashes a shot from long range towards the goal. However, his effort is poor and it flies high over the crossbar."
        },
        {
            "gameTime": "2 - 33:51",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) collects an inch perfect pass and strikes the ball from far out, but his shot is blocked."
        },
        {
            "gameTime": "2 - 33:26",
            "label": "",
            "description": "Bertrand Traore (Chelsea) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 31:50",
            "label": "corner",
            "description": "Jonjo Shelvey (Newcastle Utd) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "2 - 31:32",
            "label": "",
            "description": "Jack Colback (Newcastle Utd) produces a lovely chip pass into the box, but one of the opposition players cuts it out. The ball goes behind for a corner. Newcastle Utd will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 30:50",
            "label": "funfact",
            "description": "55:45 – the latest ball possession ratio."
        },
        {
            "gameTime": "2 - 29:54",
            "label": "",
            "description": "Eden Hazard (Chelsea) has again attempted to split the defence with a through ball."
        },
        {
            "gameTime": "2 - 28:03",
            "label": "",
            "description": "Bertrand Traore loses the ball after receiving a sweet pass from Eden Hazard (Chelsea)."
        },
        {
            "gameTime": "2 - 26:43",
            "label": "attendance",
            "description": "The attendance is 41622."
        },
        {
            "gameTime": "2 - 24:46",
            "label": "substitution",
            "description": "Here's the change. Aleksandar Mitrovic leaves the pitch and Seydou Doumbia (Newcastle Utd) comes on as a substitute."
        },
        {
            "gameTime": "2 - 24:26",
            "label": "",
            "description": "Gary Cahill (Chelsea) is penalised for a foul. Roger East had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 24:08",
            "label": "",
            "description": "Roger East blows his whistle after Andros Townsend (Newcastle Utd) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "2 - 23:53",
            "label": "corner",
            "description": "Eden Hazard (Chelsea) takes a short corner kick."
        },
        {
            "gameTime": "2 - 23:36",
            "label": "",
            "description": "Pedro (Chelsea) sends a pass into the box, but his attempt is thwarted and cleared. It will be a corner kick for Chelsea."
        },
        {
            "gameTime": "2 - 23:28",
            "label": "",
            "description": "Chelsea slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "2 - 21:29",
            "label": "",
            "description": "Willian (Chelsea) is able to continue to play."
        },
        {
            "gameTime": "2 - 21:21",
            "label": "substitution",
            "description": "It is time for a substitution. Jamaal Lascelles (Newcastle Utd) is on for Cheik Tiote."
        },
        {
            "gameTime": "2 - 20:35",
            "label": "injury",
            "description": "The game is interrupted now, Willian (Chelsea) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 19:20",
            "label": "",
            "description": "Cheik Tiote (Newcastle Utd) and Jonjo Shelvey combine well with a quick one two to trick their opponent."
        },
        {
            "gameTime": "2 - 17:40",
            "label": "corner",
            "description": "Rob Elliot comes off his line to intercept the corner from Cesc Fabregas (Chelsea)."
        },
        {
            "gameTime": "2 - 17:28",
            "label": "",
            "description": "Bertrand Traore (Chelsea) races towards goal but the defender gets back well to make a challenge. Chelsea have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 16:42",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) receives a cross in the box and attempts to shoot, but mishits the ball and misses the goal."
        },
        {
            "gameTime": "2 - 15:54",
            "label": "y-card",
            "description": "Jonjo Shelvey (Newcastle Utd) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 15:28",
            "label": "",
            "description": "Chelsea are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "2 - 14:48",
            "label": "substitution",
            "description": "The substitution is prepared. Bertrand Traore (Chelsea) joins the action as a substitute, replacing Diego Costa."
        },
        {
            "gameTime": "2 - 13:31",
            "label": "soccer-ball",
            "description": "It's a goal! Pedro (Chelsea) scores with a brilliant shot into the bottom right corner after being released inside the box by a superb lofted pass from Cesc Fabregas. The score is now 3:0."
        },
        {
            "gameTime": "2 - 12:57",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) blows an opportunity as he sends a rebound from just outside of the box narrowly wide of the left post. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "2 - 12:14",
            "label": "",
            "description": "Daryl Janmaat (Newcastle Utd) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 11:33",
            "label": "",
            "description": "Jonjo Shelvey (Newcastle Utd) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "2 - 11:02",
            "label": "",
            "description": "Willian (Chelsea) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "2 - 10:15",
            "label": "",
            "description": "A pass from Diego Costa (Chelsea) is intercepted by Rob Elliot and the move breaks down."
        },
        {
            "gameTime": "2 - 09:41",
            "label": "",
            "description": "Pedro (Chelsea) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "",
            "description": "Diego Costa (Chelsea) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "2 - 08:12",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "",
            "description": "The ball is cleared after Diego Costa (Chelsea) attempted to dribble past an opposing player. The referee and his assistant both point at the corner flag. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 06:38",
            "label": "corner",
            "description": "Andros Townsend (Newcastle Utd) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 06:16",
            "label": "",
            "description": "Jonjo Shelvey (Newcastle Utd) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. The ball is out of play and Newcastle Utd manage to earn a corner."
        },
        {
            "gameTime": "2 - 05:34",
            "label": "",
            "description": "The Newcastle Utd players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 04:40",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 04:27",
            "label": "corner",
            "description": "Andros Townsend (Newcastle Utd) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 04:10",
            "label": "corner",
            "description": "Jonjo Shelvey (Newcastle Utd) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender. The linesman makes the right call and Newcastle Utd will have a corner."
        },
        {
            "gameTime": "2 - 01:55",
            "label": "injury",
            "description": "Aleksandar Mitrovic (Newcastle Utd) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 01:45",
            "label": "",
            "description": "Moussa Sissoko (Newcastle Utd) delivers a promising cross into the box, but it's cleared. Newcastle Utd have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 01:41",
            "label": "",
            "description": "Good defending. Eden Hazard (Chelsea) tries to find Diego Costa inside the box, but the pass is cut out."
        },
        {
            "gameTime": "2 - 01:03",
            "label": "",
            "description": "A long ball forward to Diego Costa (Chelsea) is intercepted."
        },
        {
            "gameTime": "2 - 00:06",
            "label": "substitution",
            "description": "Steve McClaren has decided to make a substitution during the half time break. Jack Colback (Newcastle Utd) comes on the pitch for Georginio Wijnaldum."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Well, a decent first half here. It's certainly not boring, but not the best match either. The home team were mostly in control in the first half. The home players attempt to beat the opposition's defence using mostly counter attacks. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 46:50",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 46:42",
            "label": "",
            "description": "Diego Costa (Chelsea) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 46:24",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Willian (Chelsea) fires the resulting free kick to the bottom left corner from the edge of the box, but Rob Elliot pulls off a superb save to deny him. Chelsea force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 45:21",
            "label": "",
            "description": "Willian (Chelsea) will take a free kick. Is he going to strike the ball directly at the goal? Let's find out!"
        },
        {
            "gameTime": "1 - 45:10",
            "label": "",
            "description": "Roger East blows his whistle after Moussa Sissoko (Newcastle Utd) brings one of his opponents down with a strong tackle. Chelsea are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:09",
            "label": "",
            "description": "Eden Hazard (Chelsea) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 43:51",
            "label": "",
            "description": "The ball is cleared after Andros Townsend (Newcastle Utd) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 42:20",
            "label": "injury",
            "description": "Eden Hazard (Chelsea) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 42:10",
            "label": "",
            "description": "Daryl Janmaat (Newcastle Utd) makes an overly aggressive challenge and Roger East blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 41:22",
            "label": "",
            "description": "Jonjo Shelvey (Newcastle Utd) tries to find Moussa Sissoko, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 40:49",
            "label": "",
            "description": "Andros Townsend (Newcastle Utd) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort."
        },
        {
            "gameTime": "1 - 39:51",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 39:29",
            "label": "",
            "description": "Eden Hazard (Chelsea) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort."
        },
        {
            "gameTime": "1 - 37:45",
            "label": "substitution",
            "description": "Guus Hiddink is forced to make a change. John Terry is not able to carry on due to injury. He is replaced by Abdul Baba Rahman (Chelsea)."
        },
        {
            "gameTime": "1 - 36:28",
            "label": "",
            "description": "Pedro (Chelsea) receives a great pass inside the box and misses a golden chance. The goalkeeper pulls off a stunning save."
        },
        {
            "gameTime": "1 - 34:46",
            "label": "",
            "description": "CHANCE! Georginio Wijnaldum (Newcastle Utd) goes very close! He gathers a cross inside the box and fires a shot towards Thibaut Courtois, who produces an excellent reflex save."
        },
        {
            "gameTime": "1 - 33:38",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 31:55",
            "label": "corner",
            "description": "Willian (Chelsea) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 30:55",
            "label": "",
            "description": "John Terry (Chelsea) gets his head on the corner, but he sees his header blocked. The ball is out of play. A goal scoring opportunity from a corner for Chelsea."
        },
        {
            "gameTime": "1 - 30:45",
            "label": "corner",
            "description": "Willian (Chelsea) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "1 - 30:30",
            "label": "",
            "description": "Diego Costa (Chelsea) finds himself in a promising position after receiving a beautiful cross from the side, but the opposition defence is ready and one of the defenders averts the threat with a quick interception. Chelsea will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 30:23",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Aleksandar Mitrovic (Newcastle Utd), but the defence gets it clear."
        },
        {
            "gameTime": "1 - 29:54",
            "label": "",
            "description": "Roger East interrupts the game for a tactical foul by Willian (Chelsea)."
        },
        {
            "gameTime": "1 - 29:29",
            "label": "",
            "description": "Chelsea are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 28:40",
            "label": "",
            "description": "Newcastle Utd keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "1 - 27:05",
            "label": "",
            "description": "Eden Hazard (Chelsea) races towards goal but the defender gets back well to make a challenge. The ball goes out of play and Newcastle Utd will have a goal kick."
        },
        {
            "gameTime": "1 - 24:58",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) gets himself onto the end of the corner, but his header is blocked."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "corner",
            "description": "Willian (Chelsea) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 24:33",
            "label": "",
            "description": "Wow, what an escape. Branislav Ivanovic (Chelsea) has an effort from inside the box but it's brilliantly blocked. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "1 - 24:07",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) is picked out by one of his teammates with a brilliant long range cross, but he doesn't control the ball well and the defence eliminates the danger without any problem."
        },
        {
            "gameTime": "1 - 23:11",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) looks to break free, but an opposing player clears the ball away. It's a throw in for Newcastle Utd."
        },
        {
            "gameTime": "1 - 21:05",
            "label": "",
            "description": "Roger East blows the whistle, Diego Costa (Chelsea) is penalised for a foul."
        },
        {
            "gameTime": "1 - 20:10",
            "label": "",
            "description": "Willian (Chelsea) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play and Newcastle Utd will have a goal kick."
        },
        {
            "gameTime": "1 - 19:36",
            "label": "",
            "description": "Steven Taylor (Newcastle Utd) and Rob Elliot combine well with some one touch passing and are gradually building up to an attack."
        },
        {
            "gameTime": "1 - 18:18",
            "label": "y-card",
            "description": "Steven Taylor (Newcastle Utd) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "1 - 17:58",
            "label": "",
            "description": "Jonjo Shelvey (Newcastle Utd) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 17:34",
            "label": "",
            "description": "Eden Hazard (Chelsea) and Nemanja Matic combine brilliantly in a series of one twos."
        },
        {
            "gameTime": "1 - 16:21",
            "label": "soccer-ball",
            "description": "Willian (Chelsea) scores a goal! He latches onto a lovely pass that puts him one on one with the keeper before producing a fine strike that goes into the left side of the net!"
        },
        {
            "gameTime": "1 - 15:15",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Daryl Janmaat (Newcastle Utd), is intercepted by the opposition's defence. The referee and the linesman both signal a throw in for Newcastle Utd."
        },
        {
            "gameTime": "1 - 14:31",
            "label": "",
            "description": "Moussa Sissoko (Newcastle Utd) attempts to score as he rises near the penalty spot and heads the ball to the middle of the goal. Thibaut Courtois pulls off a comfortable save to stop the ball from hitting the net."
        },
        {
            "gameTime": "1 - 13:27",
            "label": "",
            "description": "Pedro (Chelsea) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 12:53",
            "label": "",
            "description": "The game is interrupted. Cheik Tiote (Newcastle Utd) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "1 - 12:18",
            "label": "",
            "description": "Jonjo Shelvey (Newcastle Utd) and Steven Taylor combine well with a quick one two and their attacking move continues."
        },
        {
            "gameTime": "1 - 11:30",
            "label": "",
            "description": "Andros Townsend (Newcastle Utd) had a good chance to change the score. He ran towards the goal and unleashed a low shot from long range which went towards the middle of the goal, but Thibaut Courtois was ready and made a save."
        },
        {
            "gameTime": "1 - 10:46",
            "label": "corner",
            "description": "Jonjo Shelvey (Newcastle Utd) takes the corner kick, but Thibaut Courtois reads it well and stops the effort."
        },
        {
            "gameTime": "1 - 10:24",
            "label": "",
            "description": "Jonjo Shelvey (Newcastle Utd) creates a yard of space for himself and tries an effort from distance, but it's blocked. The ball goes out for a corner. Newcastle Utd can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 09:26",
            "label": "",
            "description": "Aleksandar Mitrovic (Newcastle Utd) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 08:50",
            "label": "soccer-ball",
            "description": "GOAL! Pedro (Chelsea) gets to the ball on the edge of the box after a huge mistake by an opponent and slams it into the back of the net. He makes it 2:0."
        },
        {
            "gameTime": "1 - 08:04",
            "label": "",
            "description": "Jonjo Shelvey (Newcastle Utd) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) commits a foul after making a slide tackle on his opponent. A free kick to Newcastle Utd."
        },
        {
            "gameTime": "1 - 06:51",
            "label": "",
            "description": "Andros Townsend (Newcastle Utd) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 05:51",
            "label": "",
            "description": "Rolando Aarons (Newcastle Utd) commits a foul and Roger East immediately signals a free kick."
        },
        {
            "gameTime": "1 - 04:41",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Willian is the provider as he slips the ball to Diego Costa (Chelsea) who simply steers it home from close range. It's 1:0."
        },
        {
            "gameTime": "1 - 03:49",
            "label": "",
            "description": "Willian (Chelsea) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 03:41",
            "label": "",
            "description": "Jonjo Shelvey (Newcastle Utd) commits a rough challenge and Roger East blows his whistle for an infringement. Chelsea have a free kick."
        },
        {
            "gameTime": "1 - 02:35",
            "label": "",
            "description": "Diego Costa (Chelsea) commits a rough foul. Roger East stops the game and makes a call."
        },
        {
            "gameTime": "1 - 01:22",
            "label": "",
            "description": "What a chance for Nemanja Matic (Chelsea) as he produced a stunning snap shot from the edge of the box! The goalkeeper was a bit lucky as the ball went just wide of the right post. The ball is off of the pitch and it's a goal kick for Newcastle Utd."
        },
        {
            "gameTime": "1 - 00:35",
            "label": "",
            "description": "Long passes, short passes and one two passes. Chelsea are showcasing great team work by keeping possession and producing pin point passes from player to player. The opposition's players are finding it very difficult to intercept at the moment."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Newcastle Utd will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Roger East will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. The home side dominated this game. The hosts tried to catch the opposition off guard and hit them on the break. The visiting side kept the ball at their feet and the main intention was to produce that final killer pass."
        }
    ],
    "gameAwayTeam": "Newcastle Utd",
    "gameDate": "13/02/2016 - 20:30",
    "gameHomeTeam": "Chelsea",
    "gameScore": "5 - 1"
}