{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-04-30 - 17-00 Real Sociedad 0 - 1 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. An impressive display from the visitors, they had the better of it. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 46:27",
            "label": "",
            "description": "David Zurutuza (Real Sociedad) creates himself some space inside the goalmouth and connects with the free kick. His accurate header would have probably ended up in the bottom left corner, but Keylor Navas pulls off a superb reflex save to thwart him."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "Mikel Gonzalez (Real Sociedad) gets his head on the corner, but he can't find the target as his header flies high over the crossbar."
        },
        {
            "gameTime": "2 - 44:44",
            "label": "corner",
            "description": "Asier Illarramendi (Real Sociedad) will take the corner."
        },
        {
            "gameTime": "2 - 44:29",
            "label": "",
            "description": "Bautista Orgilles Jon (Real Sociedad) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "corner",
            "description": "Mikel Oyarzabal (Real Sociedad) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 41:44",
            "label": "",
            "description": "David Zurutuza (Real Sociedad) swings in a cross, but the ball is cleared to safety by one of the defending players. The linesman points to the corner flag, Real Sociedad are going to take it."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "substitution",
            "description": "Eusebio Sacristan has decided to make a change. replaces Yuri Berchiche (Real Sociedad)."
        },
        {
            "gameTime": "2 - 39:56",
            "label": "substitution",
            "description": "Substitution. Luka Modric walks off the pitch and Mateo Kovacic (Real Madrid) comes on as a substitute."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "",
            "description": "Joseba Zaldua (Real Sociedad) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "2 - 36:49",
            "label": "",
            "description": "Xabi Prieto (Real Sociedad) swings a cross into the box, but it's far too close to Keylor Navas, who smothers the ball."
        },
        {
            "gameTime": "2 - 34:31",
            "label": "soccer-ball",
            "description": "It's a goal! Gareth Bale (Real Madrid) makes it 0:0. He jumped highest to connect with a perfect cross from Lucas and planted his close range header into the right side of the goal. Geronimo Rulli was helpless."
        },
        {
            "gameTime": "2 - 32:36",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Luka Modric (Real Madrid), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 32:21",
            "label": "",
            "description": "Jese (Real Madrid) tested Geronimo Rulli with a strike from just outside the box, but the effort is saved. Real Madrid will take a corner kick."
        },
        {
            "gameTime": "2 - 31:51",
            "label": "attendance",
            "description": "The attendance is 26426."
        },
        {
            "gameTime": "2 - 31:26",
            "label": "",
            "description": "Danilo (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "substitution",
            "description": "The substitution is prepared. Bautista Orgilles Jon (Real Sociedad) joins the action as a substitute, replacing Bruma."
        },
        {
            "gameTime": "2 - 30:17",
            "label": "",
            "description": "Neat link up play between Gareth Bale (Real Madrid) and Jese, but Geronimo Rulli reads the game well and the move breaks down."
        },
        {
            "gameTime": "2 - 29:22",
            "label": "y-card",
            "description": "Luka Modric (Real Madrid) picks up a yellow card for an infringement."
        },
        {
            "gameTime": "2 - 28:16",
            "label": "",
            "description": "Jese (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Geronimo Rulli is alert and denies him."
        },
        {
            "gameTime": "2 - 27:12",
            "label": "substitution",
            "description": "Substitution. James Rodriguez makes his way off the pitch and Isco (Real Madrid) comes on as his replacement."
        },
        {
            "gameTime": "2 - 26:17",
            "label": "",
            "description": "Bruma (Real Sociedad) tries his luck with a low long range effort after receiving a precise pass, but Keylor Navas has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 25:23",
            "label": "",
            "description": "Bruma (Real Sociedad) takes the direct free kick from far out, but his shot flies into the stands."
        },
        {
            "gameTime": "2 - 23:51",
            "label": "",
            "description": "Casemiro (Real Madrid) commits an ugly tackle on his opponent, but there is no caution from the referee. Real Sociedad will take a free kick."
        },
        {
            "gameTime": "2 - 22:01",
            "label": "substitution",
            "description": "Eusebio Sacristan has decided to substitute Markel Bergara and he is replaced by Diego Reyes (Real Sociedad)."
        },
        {
            "gameTime": "2 - 20:00",
            "label": "substitution",
            "description": "Substitution. Jese (Real Madrid) has come on for Borja Mayoral Moya."
        },
        {
            "gameTime": "2 - 19:00",
            "label": "y-card",
            "description": "Joseba Zaldua (Real Sociedad) receives a yellow card for infringement."
        },
        {
            "gameTime": "2 - 18:03",
            "label": "",
            "description": "A fine lofted pass into the box, sent by David Zurutuza (Real Sociedad), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 17:00",
            "label": "y-card",
            "description": "Nacho (Real Madrid) fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "2 - 13:38",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Alberto Undiano Mallenco ignores the protests."
        },
        {
            "gameTime": "2 - 13:09",
            "label": "",
            "description": "Gareth Bale (Real Madrid) picks up the rebound inside the penalty area and drills a good shot to the middle of the goal. Geronimo Rulli shows how quick his reflexes are and dives superbly to stop the effort. What a save but what a wasted opportunity!"
        },
        {
            "gameTime": "2 - 12:49",
            "label": "",
            "description": "James Rodriguez (Real Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 12:37",
            "label": "",
            "description": "The linesman raises his flag for offside before Gareth Bale (Real Madrid) heads on."
        },
        {
            "gameTime": "2 - 11:42",
            "label": "",
            "description": "Danilo (Real Madrid) has an effort on goal, but he misses to the right of the goal."
        },
        {
            "gameTime": "2 - 10:01",
            "label": "corner",
            "description": "Keylor Navas leaps to collect the ball from the corner which was sent over by Bruma (Real Sociedad)."
        },
        {
            "gameTime": "2 - 09:39",
            "label": "corner",
            "description": "The resulting corner from Bruma (Real Sociedad) is cleared. The ball is out of play. Real Sociedad will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 09:22",
            "label": "",
            "description": "David Zurutuza (Real Sociedad) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. The ball goes out for a corner. Real Sociedad can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 08:29",
            "label": "",
            "description": "A cross from the free kick is whipped in by James Rodriguez (Real Madrid), but one of the defenders steps in and averts the threat."
        },
        {
            "gameTime": "2 - 06:46",
            "label": "",
            "description": "Mikel Oyarzabal (Real Sociedad) commits a foul during an attacking move."
        },
        {
            "gameTime": "2 - 05:39",
            "label": "corner",
            "description": "The corner from Bruma (Real Sociedad) is intercepted by Keylor Navas."
        },
        {
            "gameTime": "2 - 05:03",
            "label": "",
            "description": "David Zurutuza (Real Sociedad) tries to send a pass but it's blocked. Real Sociedad force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 04:43",
            "label": "",
            "description": "Mikel Oyarzabal (Real Sociedad) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 03:00",
            "label": "y-card",
            "description": "Today's referee Alberto Undiano Mallenco rightly decides to book Xabi Prieto (Real Sociedad) for his harsh tackle."
        },
        {
            "gameTime": "2 - 02:47",
            "label": "",
            "description": "Gareth Bale (Real Madrid) connects with the corner but his looping header goes well over."
        },
        {
            "gameTime": "2 - 02:13",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) will take a corner kick."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "",
            "description": "Danilo (Real Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The game produced by the players until now hasn't been particularly attractive, but there is still 45 minutes left so let's hope they will come out with renewed vigour and provide better entertainment this half. During the first 45 minutes, we have witnessed the ascendency of the visiting team who have been precise and effective. The home players attempt to beat the opposition's defence using mostly counter attacks. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 45:17",
            "label": "whistle",
            "description": "Alberto Undiano Mallenco has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:05",
            "label": "",
            "description": "Raphael Varane (Real Madrid) leaps highest to meet the resulting set piece and sends his header way off target."
        },
        {
            "gameTime": "1 - 45:02",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 44:39",
            "label": "",
            "description": "Gareth Bale (Real Madrid) serves up a nice cross, but the defence clears the danger. Good work from Real Madrid as they win a corner."
        },
        {
            "gameTime": "1 - 44:03",
            "label": "",
            "description": "Good team movement sets up Joseba Zaldua (Real Sociedad) on the edge of the box, but he slices the ball narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 41:48",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco shows a yellow card to Markel Bergara (Real Sociedad), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 41:20",
            "label": "",
            "description": "David Zurutuza (Real Sociedad) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 40:58",
            "label": "",
            "description": "Nacho (Real Madrid) produced a promising shot low towards the middle of the goal after his wonderful solo run, but Geronimo Rulli thwarted him with a fabulous save and the score remains the same."
        },
        {
            "gameTime": "1 - 40:23",
            "label": "y-card",
            "description": "Gareth Bale (Real Madrid) is yellow carded."
        },
        {
            "gameTime": "1 - 39:32",
            "label": "",
            "description": "The linesman signals that Bruma (Real Sociedad) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 38:46",
            "label": "",
            "description": "Danilo (Real Madrid) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender."
        },
        {
            "gameTime": "1 - 38:17",
            "label": "",
            "description": "The referee blows his whistle as Nacho (Real Madrid) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 36:00",
            "label": "y-card",
            "description": "The foul by Asier Illarramendi (Real Sociedad) is worthy of a card and a yellow is duly shown by Alberto Undiano Mallenco."
        },
        {
            "gameTime": "1 - 33:25",
            "label": "",
            "description": "Gareth Bale (Real Madrid) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 32:13",
            "label": "",
            "description": "Borja Mayoral Moya (Real Madrid) was too forceful with his tackle and Alberto Undiano Mallenco interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 30:48",
            "label": "",
            "description": "The free kick is delivered by James Rodriguez (Real Madrid) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "1 - 27:53",
            "label": "",
            "description": "Markel Bergara (Real Sociedad) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "1 - 26:11",
            "label": "",
            "description": "James Rodriguez (Real Madrid) shoots from the edge of the penalty area. The ball travels towards the target, but Geronimo Rulli easily deals with the threat."
        },
        {
            "gameTime": "1 - 24:59",
            "label": "",
            "description": "Neat link up play between Bruma (Real Sociedad) and Xabi Prieto, but Keylor Navas reads the game well and the move breaks down."
        },
        {
            "gameTime": "1 - 24:02",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Danilo (Real Madrid)."
        },
        {
            "gameTime": "1 - 23:00",
            "label": "corner",
            "description": "Bruma (Real Sociedad) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 22:37",
            "label": "",
            "description": "The ball is cleared after Xabi Prieto (Real Sociedad) attempted to dribble past an opposing player. Real Sociedad have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:57",
            "label": "",
            "description": "Great ball in from James Rodriguez. Gareth Bale (Real Madrid) should really have done better with a close range header, but he heads it a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 20:19",
            "label": "",
            "description": "Casemiro (Real Madrid) misses the target from a promising position, sending the ball well wide of the left post."
        },
        {
            "gameTime": "1 - 19:47",
            "label": "",
            "description": "Luka Modric (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 17:14",
            "label": "",
            "description": "Borja Mayoral Moya (Real Madrid) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 16:29",
            "label": "",
            "description": "David Zurutuza (Real Sociedad) gets into a good shooting position. He wins some space for himself and drills a long range daisy cutter towards the middle of the goal. His good effort is, however, superbly saved by Keylor Navas!"
        },
        {
            "gameTime": "1 - 15:52",
            "label": "",
            "description": "James Rodriguez (Real Madrid) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 15:03",
            "label": "",
            "description": "Gareth Bale (Real Madrid) was the quickest one to orientate himself inside the box and leaps to connect with a cross from the corner kick. He produces a fine header, but it flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 14:43",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 14:22",
            "label": "",
            "description": "A cross from James Rodriguez (Real Madrid) fails to reach the box as the defence clears the ball away to safety. Real Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 13:50",
            "label": "",
            "description": "Joseba Zaldua (Real Sociedad) trips an opponent with a slide tackle. Alberto Undiano Mallenco stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "1 - 11:50",
            "label": "",
            "description": "Mikel Oyarzabal (Real Sociedad) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 11:28",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) leaps highest to meet the resulting set piece and sends his header way off target."
        },
        {
            "gameTime": "1 - 11:00",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 10:42",
            "label": "",
            "description": "Danilo (Real Madrid) tries to slide the ball through to a teammate but it's well blocked by a defender. Real Madrid have a corner."
        },
        {
            "gameTime": "1 - 09:00",
            "label": "corner",
            "description": "The resulting corner from James Rodriguez (Real Madrid) comes to nothing."
        },
        {
            "gameTime": "1 - 08:28",
            "label": "",
            "description": "James Rodriguez (Real Madrid) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Geronimo Rulli to get hold of the ball. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 08:06",
            "label": "",
            "description": "Good defending. James Rodriguez (Real Madrid) tries to find Lucas inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 05:03",
            "label": "",
            "description": "Luka Modric (Real Madrid) is caught offside!"
        },
        {
            "gameTime": "1 - 03:54",
            "label": "",
            "description": "Geronimo Rulli doesn't have to worry about this one. James Rodriguez plays a pass into the feet of Gareth Bale (Real Madrid), who is unable to find the target as his effort from inside the box goes well wide of the left post."
        },
        {
            "gameTime": "1 - 01:52",
            "label": "",
            "description": "Casemiro (Real Madrid) should know this behaviour is beyond the rules. He was too careless with his challenge and left Alberto Undiano Mallenco no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Alberto Undiano Mallenco."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. An impressive display from the visitors, they had the better of it. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "30/04/2016 - 17:00",
    "gameHomeTeam": "Real Sociedad",
    "gameScore": "0 - 1"
}