{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-03 - 22-45 PSV 2 - 0 Wolfsburg/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. Neither of the teams could take the initiative and dominate today's game. The home team played long ball football unlike the away side who attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 49:02",
            "label": "whistle",
            "description": "That's it for today, Jonas Eriksson has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:17",
            "label": "",
            "description": "Maximilian Arnold (Wolfsburg) sends a poor cross in from the free kick that is cleared by the head of a defender."
        },
        {
            "gameTime": "2 - 48:01",
            "label": "",
            "description": "Davy Propper (PSV) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Jonas Eriksson blows for the foul but keeps his cards in his pocket on this occasion. Wolfsburg are awarded the free kick."
        },
        {
            "gameTime": "2 - 46:38",
            "label": "",
            "description": "Nicklas Bendtner (Wolfsburg) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the left post."
        },
        {
            "gameTime": "2 - 46:19",
            "label": "",
            "description": "Ricardo Rodriguez (Wolfsburg) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 44:46",
            "label": "y-card",
            "description": "Naldo (Wolfsburg) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Jonas Eriksson didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 43:09",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "2 - 41:52",
            "label": "",
            "description": "Luiz Gustavo (Wolfsburg) fashions a shot from the edge of the box after receiving an accurate pass. Jeroen Zoet makes a stunning save to stop the effort from flying into the left side of the goal."
        },
        {
            "gameTime": "2 - 40:49",
            "label": "soccer-ball",
            "description": "GOAL 2:0! Andres Guardado found Luuk de Jong (PSV) inside the box, he spotted goalkeeper Diego Benaglio off his line and chipped the ball into the net. What a cheeky lob!"
        },
        {
            "gameTime": "2 - 39:39",
            "label": "y-card",
            "description": "A yellow card for a tackle by Luuk de Jong (PSV). Jonas Eriksson doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 38:48",
            "label": "injury",
            "description": "Timm Klose (Wolfsburg) is down injured and the referee stops play so that he can receive medical treatment."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "substitution",
            "description": "Substitution. Luciano Narsingh makes his way off the pitch and Gaston Pereiro (PSV) comes on as his replacement."
        },
        {
            "gameTime": "2 - 37:11",
            "label": "",
            "description": "Great solo effort by Naldo (Wolfsburg) as he beats two defenders before firing in a drive from just outside of the box towards the left side of the goal. The goalkeeper is ready and makes an amazing save."
        },
        {
            "gameTime": "2 - 35:42",
            "label": "y-card",
            "description": "Santiago Arias (PSV) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Jonas Eriksson ignores the protests."
        },
        {
            "gameTime": "2 - 33:13",
            "label": "",
            "description": "Vieirinha (Wolfsburg) sends a teasing cross into the area, but Jeroen Zoet intercepts the ball."
        },
        {
            "gameTime": "2 - 30:02",
            "label": "",
            "description": "The effort by Daniel Caligiuri (Wolfsburg) failed to trouble the goalkeeper. He smashed the ball in from 22 metres but it went well wide of the right post."
        },
        {
            "gameTime": "2 - 29:33",
            "label": "substitution",
            "description": "Here comes a substitution. Jurgen Locadia is given a rest as he is replaced by Nicolas Isimat Mirin (PSV)."
        },
        {
            "gameTime": "2 - 28:55",
            "label": "substitution",
            "description": "Phillip Cocu has decided to make a change. Jorrit Hendrix (PSV) replaces Adam Maher."
        },
        {
            "gameTime": "2 - 25:33",
            "label": "",
            "description": "What a chance that is! Luciano Narsingh swings the ball into the box, and Adam Maher (PSV) gets in front of his man and powers his header just wide of the left post."
        },
        {
            "gameTime": "2 - 23:38",
            "label": "substitution",
            "description": "Dieter Hecking has decided to introduce fresh legs, with Julian Draxler (Wolfsburg) replacing Josuha Guilavogui."
        },
        {
            "gameTime": "2 - 23:16",
            "label": "substitution",
            "description": "Bas Dost will be replaced by Nicklas Bendtner (Wolfsburg)."
        },
        {
            "gameTime": "2 - 22:17",
            "label": "",
            "description": "Maximilian Arnold (Wolfsburg) takes a first time shot from the edge of the box, but his effort is well blocked by the defender."
        },
        {
            "gameTime": "2 - 21:13",
            "label": "",
            "description": "Luuk de Jong (PSV) wins some space for himself around the penalty spot and manages to produce a promising header. One of the defenders stops his effort before it gets to the goalkeeper, making him redundant."
        },
        {
            "gameTime": "2 - 19:42",
            "label": "",
            "description": "Daniel Caligiuri (Wolfsburg) cracks a volley from just outside the box, but his miskick goes skyward."
        },
        {
            "gameTime": "2 - 19:17",
            "label": "substitution",
            "description": "A substitution has been made. Andre Schurrle goes off and Vieirinha (Wolfsburg) comes on."
        },
        {
            "gameTime": "2 - 18:13",
            "label": "corner",
            "description": "Maximilian Arnold (Wolfsburg) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 17:54",
            "label": "",
            "description": "Andre Schurrle (Wolfsburg) sends a pass into the box, but his attempt is thwarted and cleared. The referee and his assistant both point at the corner flag. Wolfsburg will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "",
            "description": "The referee blows his whistle for a foul after Jurgen Locadia (PSV) overruns the ball during an attack and makes an aggressive challenge on his opponent."
        },
        {
            "gameTime": "2 - 12:20",
            "label": "",
            "description": "The game is interrupted as Luuk de Jong (PSV) is flagged offside."
        },
        {
            "gameTime": "2 - 11:11",
            "label": "",
            "description": "Luciano Narsingh (PSV) sends a chip pass into the box, but Diego Benaglio is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 09:23",
            "label": "soccer-ball",
            "description": "Goal! Luuk de Jong displays great vision and sends a pass to Jurgen Locadia (PSV), who shows brilliant composure inside the box to bury the ball inside the left post. The score is 1:0."
        },
        {
            "gameTime": "2 - 08:11",
            "label": "",
            "description": "Bas Dost (Wolfsburg) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 06:05",
            "label": "",
            "description": "Luuk de Jong (PSV) is adjudged offside."
        },
        {
            "gameTime": "2 - 04:59",
            "label": "",
            "description": "Naldo (Wolfsburg) collects an inch perfect pass and strikes the ball from far out, but his shot is blocked."
        },
        {
            "gameTime": "2 - 03:44",
            "label": "",
            "description": "Luciano Narsingh (PSV) swings a cross into the box, but it's far too close to Diego Benaglio, who smothers the ball."
        },
        {
            "gameTime": "2 - 02:44",
            "label": "",
            "description": "A beautiful low pass from the side is received by Adam Maher (PSV), who was waiting for his chance. However, the defence is alert and spanks the ball away."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Jonas Eriksson starts the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "The game can't be described as attractive. We are hoping against hope that the second half will bring more exciting moments and goal opportunities. We are witnessing quite a balanced game with both teams struggling to prevail. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 48:14",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 47:11",
            "label": "",
            "description": "Ricardo Rodriguez (Wolfsburg) sends in a poor free kick and the ball goes out of play. Back to the drawing board. The ball goes out of play and PSV will have a goal kick."
        },
        {
            "gameTime": "1 - 46:42",
            "label": "",
            "description": "It's a free kick to Wolfsburg in a dangerous position."
        },
        {
            "gameTime": "1 - 46:35",
            "label": "y-card",
            "description": "Jonas Eriksson shows a yellow card to Andres Guardado (PSV) for a tough tackle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:30",
            "label": "",
            "description": "Diego Benaglio was forced into action to thwart Jurgen Locadia (PSV). He found himself some space after latching on to a pass and unleashed a shot to the right post but couldn't beat the keeper."
        },
        {
            "gameTime": "1 - 41:31",
            "label": "",
            "description": "Hector Moreno (PSV) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 38:45",
            "label": "y-card",
            "description": "Jonas Eriksson shows the yellow card to Daniel Caligiuri (Wolfsburg) for a heavy challenge."
        },
        {
            "gameTime": "1 - 36:31",
            "label": "",
            "description": "Adam Maher (PSV) looks to break free, but an opposing player clears the ball away. It's a throw in for PSV."
        },
        {
            "gameTime": "1 - 33:48",
            "label": "",
            "description": "Diego Benaglio (Wolfsburg) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 32:19",
            "label": "injury",
            "description": "The game is interrupted now, Diego Benaglio (Wolfsburg) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 29:58",
            "label": "y-card",
            "description": "Today's referee Jonas Eriksson rightly decides to book Maximilian Arnold (Wolfsburg) for his harsh tackle."
        },
        {
            "gameTime": "1 - 28:45",
            "label": "",
            "description": "Diego Benaglio displays his ability to read the game and clears the danger after Luciano Narsingh (PSV) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "1 - 28:04",
            "label": "corner",
            "description": "Sebastian Jung (Wolfsburg) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 27:52",
            "label": "",
            "description": "The ball is cleared after Daniel Caligiuri (Wolfsburg) attempted to dribble past an opposing player. Now Wolfsburg have a corner."
        },
        {
            "gameTime": "1 - 26:27",
            "label": "",
            "description": "Good defending. Andre Schurrle (Wolfsburg) tries to find Bas Dost inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 25:36",
            "label": "",
            "description": "Hector Moreno (PSV) sends a long ball in, but Diego Benaglio comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 21:59",
            "label": "",
            "description": "Bas Dost (Wolfsburg) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 21:43",
            "label": "",
            "description": "Bas Dost (Wolfsburg) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Jeroen Zoet."
        },
        {
            "gameTime": "1 - 20:20",
            "label": "",
            "description": "The foul by Jurgen Locadia (PSV) was seen by Jonas Eriksson who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 17:42",
            "label": "",
            "description": "Jurgen Locadia (PSV) outjumps his marker on the edge of the 6 yard box and heads the resulting corner well wide of the right post."
        },
        {
            "gameTime": "1 - 17:29",
            "label": "corner",
            "description": "Andres Guardado (PSV) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 17:10",
            "label": "",
            "description": "Jeffrey Bruma (PSV) picks up a pass, lines up a shot and strikes from 35 metres out, but Diego Benaglio thwarts the effort which is headed to the left side of the goal. The referee points to the corner flag and PSV will take a corner."
        },
        {
            "gameTime": "1 - 14:39",
            "label": "",
            "description": "The PSV players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 11:11",
            "label": "",
            "description": "Ricardo Rodriguez (Wolfsburg) produces a shot from a direct free kick on the edge of the box. His effort sails narrowly over the crossbar. The goalkeeper was lucky there."
        },
        {
            "gameTime": "1 - 09:57",
            "label": "",
            "description": "Jonas Eriksson blows his whistle after Joshua Brenet (PSV) brings one of his opponents down with a strong tackle. Wolfsburg win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 06:37",
            "label": "",
            "description": "Luuk de Jong (PSV) jumps above the defenders in order to convert a lofted cross with a nice header. Diego Benaglio makes a reflexive save to block his effort from hitting the net."
        },
        {
            "gameTime": "1 - 04:20",
            "label": "",
            "description": "Adam Maher (PSV) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 03:30",
            "label": "",
            "description": "Luiz Gustavo (Wolfsburg) wastes a great chance as he climbs high around the penalty spot to connect with a cross from the resulting free kick. He produces a header which goes just over the crossbar."
        },
        {
            "gameTime": "1 - 02:42",
            "label": "",
            "description": "Maximilian Arnold (Wolfsburg) will take the free kick."
        },
        {
            "gameTime": "1 - 02:23",
            "label": "",
            "description": "Joshua Brenet (PSV) knocks his opponent down with an over the top tackle. Wolfsburg have been awarded a free kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "PSV will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Jonas Eriksson."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. Neither of the teams could take the initiative and dominate today's game. The home team played long ball football unlike the away side who attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Wolfsburg",
    "gameDate": "03/11/2015 - 22:45",
    "gameHomeTeam": "PSV",
    "gameScore": "2 - 0"
}