{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2015-2016/2015-11-07 - 22-45 AC Milan 0 - 0 Atalanta/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. The away team was superior on the pitch today. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        },
        {
            "gameTime": "2 - 49:44",
            "label": "whistle",
            "description": "That's it for today, Piero Giacomelli has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:22",
            "label": "",
            "description": "Flag up against Alessio Cerci (AC Milan). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 47:39",
            "label": "corner",
            "description": "The corner kick from Alejandro Gomez (Atalanta) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "",
            "description": "German Denis (Atalanta) tries to pass the ball into the penalty area but it's blocked. Atalanta get a corner."
        },
        {
            "gameTime": "2 - 46:12",
            "label": "",
            "description": "Luca Antonelli (AC Milan) wastes a great chance as he climbs high around the penalty spot to connect with a cross from the resulting free kick. He produces a header which goes well over the bar. The ball goes out of play and Atalanta will have a goal kick."
        },
        {
            "gameTime": "2 - 45:41",
            "label": "",
            "description": "Piero Giacomelli couldn't ignore the rough tackle by Cristian Raimondi (Atalanta) and blew his whistle. AC Milan earn a free kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:54",
            "label": "substitution",
            "description": "It will be a substitution. German Denis (Atalanta) is ready to enter the pitch as Mauricio Pinilla walks off."
        },
        {
            "gameTime": "2 - 44:35",
            "label": "",
            "description": "Davide Calabria (AC Milan) plays a through ball which would have led to a great opportunity, if it hadn't been stopped by the defence."
        },
        {
            "gameTime": "2 - 43:44",
            "label": "y-card",
            "description": "Carlos Carmona (Atalanta) sees a yellow card from Piero Giacomelli after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 43:25",
            "label": "",
            "description": "The linesman raises his flag for offside before Mauricio Pinilla (Atalanta) heads on."
        },
        {
            "gameTime": "2 - 41:11",
            "label": "",
            "description": "Cristian Raimondi (Atalanta) sends a teasing cross into the area, but Gianluigi Donnarumma intercepts the ball."
        },
        {
            "gameTime": "2 - 40:35",
            "label": "corner",
            "description": "Alejandro Gomez (Atalanta) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 40:32",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. The referee points to the corner flag. It's a corner to Atalanta."
        },
        {
            "gameTime": "2 - 40:19",
            "label": "",
            "description": "The free kick is delivered by Alejandro Gomez (Atalanta) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "2 - 39:11",
            "label": "",
            "description": "Luiz Adriano (AC Milan) knocks his opponent down with an over the top tackle. Atalanta have been awarded a free kick."
        },
        {
            "gameTime": "2 - 38:27",
            "label": "y-card",
            "description": "Carlos Bacca (AC Milan) is booked for saying more than Piero Giacomelli was willing to tolerate."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "",
            "description": "Alessio Cerci (AC Milan) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 36:24",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 8:15."
        },
        {
            "gameTime": "2 - 35:52",
            "label": "",
            "description": "Carlos Bacca (AC Milan) climbs high to meet a cross on the edge of the box, but it's a poor header and goes well wide of the left post."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "",
            "description": "A nice cross arrived in the box from the corner kick and found the head of Luiz Adriano (AC Milan). He steered the ball towards the bottom left corner, but one of the defenders is there to cover the goalkeeper and keep it out."
        },
        {
            "gameTime": "2 - 34:03",
            "label": "corner",
            "description": "Alessio Cerci (AC Milan) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 33:35",
            "label": "",
            "description": "Alessio Cerci (AC Milan) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. The ball is out of play. AC Milan will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 33:01",
            "label": "",
            "description": "That was close by Alejandro Gomez (Atalanta)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the left post."
        },
        {
            "gameTime": "2 - 32:23",
            "label": "",
            "description": "Mauricio Pinilla (Atalanta) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "2 - 31:45",
            "label": "y-card",
            "description": "Piero Giacomelli shows a yellow card to Davide Calabria (AC Milan), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 30:22",
            "label": "",
            "description": "Mauricio Pinilla (Atalanta) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play. Atalanta will have a throw in."
        },
        {
            "gameTime": "2 - 29:27",
            "label": "",
            "description": "Mauricio Pinilla (Atalanta) serves up a nice cross, but Gianluigi Donnarumma punches the ball away."
        },
        {
            "gameTime": "2 - 28:37",
            "label": "",
            "description": "A pass by Maximiliano Moralez (Atalanta) ends up in no man's land, and the attacking effort comes to an end. The ball is off of the pitch and it's a goal kick for AC Milan."
        },
        {
            "gameTime": "2 - 28:18",
            "label": "",
            "description": "Atalanta seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 26:59",
            "label": "substitution",
            "description": "Substitution. Keisuke Honda (AC Milan) replaces M'Baye Niang."
        },
        {
            "gameTime": "2 - 26:37",
            "label": "",
            "description": "Mauricio Pinilla (Atalanta) missed a great opportunity! He jumped for a cross and headed towards goal from the penalty spot, but the ball sailed well wide of the left post!"
        },
        {
            "gameTime": "2 - 25:59",
            "label": "substitution",
            "description": "Here is a change. Alberto Grassi is going off and Edoardo Reja gives the last tactical orders to Carlos Carmona (Atalanta)."
        },
        {
            "gameTime": "2 - 25:37",
            "label": "",
            "description": "Mauricio Pinilla (Atalanta) plays a one two with Maximiliano Moralez, but the move breaks down."
        },
        {
            "gameTime": "2 - 24:20",
            "label": "",
            "description": "Maximiliano Moralez (Atalanta) makes a driving run into the box but he cannot work any space for a shot. The ball goes out of play and AC Milan will have a goal kick."
        },
        {
            "gameTime": "2 - 23:19",
            "label": "",
            "description": "Alberto Grassi (Atalanta) was close to scoring a goal after unleashing a first time effort from inside the six yard box. The ball was aimed towards the middle of the net, but the goalkeeper read it well and pulled off a brilliant save to thwart the attempt."
        },
        {
            "gameTime": "2 - 23:01",
            "label": "",
            "description": "Carlos Bacca (AC Milan) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 22:43",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from AC Milan."
        },
        {
            "gameTime": "2 - 21:18",
            "label": "",
            "description": "A pass by Alessio Cerci (AC Milan) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 20:30",
            "label": "",
            "description": "The flag goes up and the referee blows his whistle another offside by Carlos Bacca (AC Milan), who has already been caught several times today."
        },
        {
            "gameTime": "2 - 20:22",
            "label": "funfact",
            "description": "The number of shots on goal at present is 3:4."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "",
            "description": "A big opportunity missed by Marten de Roon (Atalanta). He got on the ball inside the box and thumped a splendid first time shot on goal, but it went narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 19:37",
            "label": "corner",
            "description": "Maximiliano Moralez (Atalanta) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 18:46",
            "label": "",
            "description": "Maximiliano Moralez (Atalanta) volleys the ball towards the right side of the goal, but the goalkeeper makes a brilliant save to keep the ball out. The ball is out of play and Atalanta manage to earn a corner."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "substitution",
            "description": "Substitution. Juraj Kucka will be replaced by Luiz Adriano (AC Milan)."
        },
        {
            "gameTime": "2 - 17:39",
            "label": "",
            "description": "What a save from Gianluigi Donnarumma! Luca Cigarini (Atalanta) jumps high to meet a cross and glances a promising low header from close range, but the goalkeeper pulls off a brilliant stop to keep it out."
        },
        {
            "gameTime": "2 - 16:11",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) skips past his man but can't keep the ball in play. The ball is off of the pitch and it's a goal kick for Atalanta."
        },
        {
            "gameTime": "2 - 15:22",
            "label": "",
            "description": "Marten de Roon (Atalanta) collects a pass and strikes from about 30 metres out. It's a poor attempt which flies well over the bar. The ball goes out of play and AC Milan will have a goal kick."
        },
        {
            "gameTime": "2 - 14:40",
            "label": "corner",
            "description": "Maximiliano Moralez (Atalanta) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 13:55",
            "label": "corner",
            "description": "Alejandro Gomez (Atalanta) whips in the corner, but one of the defending players gets a head on it and intercepts. The linesman makes the right call and Atalanta will have a corner."
        },
        {
            "gameTime": "2 - 13:50",
            "label": "y-card",
            "description": "Philippe Mexes (AC Milan) attempts to discuss the decision with Piero Giacomelli, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "2 - 13:40",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) tries his luck from the edge of the box after a brilliant solo effort, but it is well blocked by the defender. The ball goes out of play and Atalanta have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 13:01",
            "label": "",
            "description": "M'Baye Niang (AC Milan) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "2 - 12:29",
            "label": "",
            "description": "A pass by Rafael Toloi (Atalanta) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 10:51",
            "label": "y-card",
            "description": "Yellow card! It's like Alejandro Gomez (Atalanta) was asking for a caution with his behaviour. Piero Giacomelli agrees and books him."
        },
        {
            "gameTime": "2 - 09:57",
            "label": "",
            "description": "The ball is cleared after M'Baye Niang (AC Milan) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 09:26",
            "label": "",
            "description": "What a chance that is! Maximiliano Moralez (Atalanta) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post. The ball is off of the pitch and it's a goal kick for AC Milan."
        },
        {
            "gameTime": "2 - 09:07",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "2 - 08:38",
            "label": "",
            "description": "Mauricio Pinilla (Atalanta) receives a well played pass inside the penalty area and shoots. His effort sails well wide of the right post. The ball goes out of play and AC Milan will have a goal kick."
        },
        {
            "gameTime": "2 - 08:24",
            "label": "",
            "description": "Gabriel Paletta (Atalanta) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 07:58",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "2 - 07:12",
            "label": "",
            "description": "Juraj Kucka (AC Milan) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement. A free kick has been awarded to Atalanta."
        },
        {
            "gameTime": "2 - 06:55",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 06:13",
            "label": "",
            "description": "Piero Giacomelli blows his whistle after Andrea Poli (AC Milan) brings one of his opponents down with a strong tackle. Atalanta will take a free kick."
        },
        {
            "gameTime": "2 - 05:28",
            "label": "",
            "description": "M'Baye Niang (AC Milan) gets on the end of a pass on the edge of the penalty area and shoots towards the middle of the goal. He didn't put enough power into the effort, though, and Marco Sportiello pulls off an easy save."
        },
        {
            "gameTime": "2 - 04:13",
            "label": "",
            "description": "Carlos Bacca (AC Milan) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "2 - 03:56",
            "label": "",
            "description": "Alessio Cerci (AC Milan) will take the free kick."
        },
        {
            "gameTime": "2 - 03:49",
            "label": "",
            "description": "M'Baye Niang (AC Milan) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "2 - 03:35",
            "label": "injury",
            "description": "Looks like M'Baye Niang (AC Milan) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 02:56",
            "label": "y-card",
            "description": "Mauricio Pinilla (Atalanta) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Piero Giacomelli ignores the protests."
        },
        {
            "gameTime": "2 - 02:30",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) passes the ball and slows down the tempo so his team can continue with their combination play."
        },
        {
            "gameTime": "2 - 01:56",
            "label": "",
            "description": "Atalanta concede a free kick following a bad challenge. AC Milan are awarded the free kick."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "",
            "description": "Davide Calabria (AC Milan) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 00:47",
            "label": "",
            "description": "Carlos Bacca (AC Milan) is caught offside!"
        },
        {
            "gameTime": "2 - 00:29",
            "label": "substitution",
            "description": "A substitution has been made. Mattia De Sciglio goes off and Davide Calabria (AC Milan) comes on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Let's hope the managers of both teams will be able to stir up the players as up till now the game has lacked any interesting or exciting moments. No side has really dominated in this first half. The home side is trying long passes and crosses into the box. The away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 45:57",
            "label": "whistle",
            "description": "Piero Giacomelli has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:15",
            "label": "",
            "description": "Mauricio Pinilla (Atalanta) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 43:06",
            "label": "",
            "description": "Alessio Romagnoli (AC Milan) escapes without any punishment from the referee after using excessive force to foul his opponent. Atalanta are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 42:10",
            "label": "",
            "description": "Alberto Grassi (Atalanta) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 41:28",
            "label": "y-card",
            "description": "Piero Giacomelli shows a yellow card to Luca Cigarini (Atalanta) for a tough tackle."
        },
        {
            "gameTime": "1 - 39:01",
            "label": "",
            "description": "Maximiliano Moralez (Atalanta) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 38:13",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 37:15",
            "label": "",
            "description": "M'Baye Niang (AC Milan) produced a promising shot towards the bottom right corner after his wonderful solo run, but Marco Sportiello thwarted him with a fabulous save."
        },
        {
            "gameTime": "1 - 36:05",
            "label": "",
            "description": "Piero Giacomelli interrupts the game for a tactical foul by Riccardo Montolivo (AC Milan)."
        },
        {
            "gameTime": "1 - 35:40",
            "label": "funfact",
            "description": "3:4 the latest stats for both teams in respect of shots on target."
        },
        {
            "gameTime": "1 - 34:42",
            "label": "",
            "description": "Half chance! Maximiliano Moralez (Atalanta) plays a pass into the box, but Gianluigi Donnarumma reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 34:01",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) sends the ball into the penalty area from a free kick a few yards outside the box. The cross is good, but the goalkeeper shows himself in a good light as he leaps high to intercept the ball."
        },
        {
            "gameTime": "1 - 33:05",
            "label": "",
            "description": "Piero Giacomelli blows the whistle, Mattia De Sciglio (AC Milan) is penalised for a foul. Atalanta are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 32:47",
            "label": "",
            "description": "Gianpaolo Bellini (Atalanta) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the left post."
        },
        {
            "gameTime": "1 - 32:17",
            "label": "corner",
            "description": "Alejandro Gomez (Atalanta) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 31:11",
            "label": "",
            "description": "Luca Cigarini (Atalanta) sends a cross into the box, but the opposition's defence quickly intercepts the ball. Atalanta have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 30:12",
            "label": "",
            "description": "Piero Giacomelli blows his whistle and it's Philippe Mexes (AC Milan) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 29:48",
            "label": "corner",
            "description": "Alessio Cerci (AC Milan) takes the corner."
        },
        {
            "gameTime": "1 - 29:20",
            "label": "",
            "description": "Good clearance! Carlos Bacca (AC Milan) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him. The ball goes out of play. AC Milan are awarded a corner kick."
        },
        {
            "gameTime": "1 - 28:42",
            "label": "",
            "description": "Luca Antonelli (AC Milan) looks to break free, but his touch lets him down and he loses the ball. The ball goes out of play and Atalanta will have a goal kick."
        },
        {
            "gameTime": "1 - 28:01",
            "label": "",
            "description": "The ball is cleared after M'Baye Niang (AC Milan) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 27:26",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates. The ball is out of play. Atalanta will take a throw in."
        },
        {
            "gameTime": "1 - 26:41",
            "label": "",
            "description": "Great teamplay by Atalanta as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 25:39",
            "label": "",
            "description": "The foul by Maximiliano Moralez (Atalanta) was seen by Piero Giacomelli who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 25:01",
            "label": "",
            "description": "A pass by M'Baye Niang (AC Milan) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 24:38",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) attempts to create a scoring opportunity with a wonderful long ball, but his pass is blocked."
        },
        {
            "gameTime": "1 - 23:55",
            "label": "y-card",
            "description": "Yellow card. Mattia De Sciglio (AC Milan) goes into the referee's book after a bad challenge."
        },
        {
            "gameTime": "1 - 23:20",
            "label": "",
            "description": "Marten de Roon (Atalanta) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "1 - 22:48",
            "label": "",
            "description": "Poor challenge! M'Baye Niang (AC Milan) is penalised for tripping and Piero Giacomelli blows his whistle. It's a free kick to Atalanta in a dangerous position."
        },
        {
            "gameTime": "1 - 22:15",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "1 - 21:13",
            "label": "",
            "description": "M'Baye Niang (AC Milan) cracks a first time shot from inside the box, but it flies way wide of the left post."
        },
        {
            "gameTime": "1 - 20:45",
            "label": "",
            "description": "Carlos Bacca (AC Milan) breaks into the penalty area but his shot is blocked."
        },
        {
            "gameTime": "1 - 20:31",
            "label": "",
            "description": "Cristian Raimondi (Atalanta) brings his opponent down with a tackle and Piero Giacomelli blows his whistle for a foul. AC Milan win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 20:13",
            "label": "",
            "description": "Maximiliano Moralez (Atalanta) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "1 - 18:54",
            "label": "substitution",
            "description": "Problems for Edoardo Reja as Boukary Drame is not able to play anymore. His injury is too serious and Gianpaolo Bellini (Atalanta) replaces him."
        },
        {
            "gameTime": "1 - 18:14",
            "label": "injury",
            "description": "Boukary Drame (Atalanta) is asking for medical treatment after picking up an injury."
        },
        {
            "gameTime": "1 - 17:46",
            "label": "",
            "description": "Maximiliano Moralez (Atalanta) tries to find Mauricio Pinilla, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 17:23",
            "label": "corner",
            "description": "Alessio Cerci (AC Milan) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 17:05",
            "label": "corner",
            "description": "Alessio Cerci (AC Milan) floats the ball in from the corner but it's intercepted. AC Milan have a corner."
        },
        {
            "gameTime": "1 - 16:35",
            "label": "",
            "description": "Andrea Poli (AC Milan) slaloms his way past challenges, but an opposing player does well to get the ball away. AC Milan force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 16:05",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Luca Antonelli (AC Milan) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 14:41",
            "label": "",
            "description": "Alessio Cerci (AC Milan) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 14:12",
            "label": "",
            "description": "Alessio Cerci (AC Milan) tries to send the ball in front of the goal, but the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 13:53",
            "label": "",
            "description": "Andrea Poli (AC Milan) and M'Baye Niang attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 12:41",
            "label": "",
            "description": "Andrea Poli (AC Milan) fails to pick a body out in the box with an over hit cross to the back post. The ball is off of the pitch and it's a goal kick for Atalanta."
        },
        {
            "gameTime": "1 - 12:01",
            "label": "",
            "description": "Luca Cigarini (Atalanta) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul. Free kick. AC Milan will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "1 - 11:31",
            "label": "",
            "description": "Boukary Drame (Atalanta) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 11:10",
            "label": "",
            "description": "Alessio Cerci (AC Milan) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 09:55",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 07:56",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) unleashes a shot from 25 metres out but is unable to find the target and it goes well wide of the right post. The ball goes out of play and AC Milan will have a goal kick."
        },
        {
            "gameTime": "1 - 06:55",
            "label": "",
            "description": "Juraj Kucka (AC Milan) sends over a cross, but he can't find any teammate inside the box. Poor delivery. The ball has crossed the sideline. Atalanta are taking a throw in."
        },
        {
            "gameTime": "1 - 06:01",
            "label": "",
            "description": "Maximiliano Moralez (Atalanta) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 05:21",
            "label": "",
            "description": "Luca Cigarini (Atalanta) sends a cross into the box, but Gianluigi Donnarumma comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 05:00",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "1 - 04:48",
            "label": "",
            "description": "Alessio Cerci (AC Milan) is penalised after knocking an opponent down. Atalanta will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 04:20",
            "label": "",
            "description": "Alejandro Gomez (Atalanta) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 03:22",
            "label": "",
            "description": "AC Milan enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 02:34",
            "label": "",
            "description": "M'Baye Niang (AC Milan) makes a reckless foul in order to win the ball from his opponent. Piero Giacomelli has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 02:23",
            "label": "",
            "description": "Alessio Cerci (AC Milan) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) takes a short free kick."
        },
        {
            "gameTime": "1 - 01:13",
            "label": "",
            "description": "Luca Cigarini (Atalanta) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. A free kick to AC Milan."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! AC Milan will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Piero Giacomelli will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. The away team was superior on the pitch today. The home team tried to find the weakness in the opposition's defence mostly using rapid counter attacks. On the other hand, long balls and crosses were the main weapons of the away team."
        }
    ],
    "gameAwayTeam": "Atalanta",
    "gameDate": "07/11/2015 - 22:45",
    "gameHomeTeam": "AC Milan",
    "gameScore": "0 - 0"
}