{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2017-03-07 - 22-45 Napoli 1 - 3 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:53",
            "label": "whistle",
            "description": "Cuneyt Cakir is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 45:48",
            "label": "soccer-ball",
            "description": "Goal! Alvaro Morata (Real Madrid) fires the rebound inside the right post after the ball breaks to him in the box. The score is 1:3."
        },
        {
            "gameTime": "2 - 45:40",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) picks up a precise pass deep inside the box, but his strike is saved by the keeper."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 43:25",
            "label": "y-card",
            "description": "Amadou Diawara (Napoli) has tested the patience of referee Cuneyt Cakir and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 37:37",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) controls the ball and sets off to face the goalkeeper, but deep inside the box the ball bounces up on the uneven surface and makes him miss the strike, sending the ball well over the goal."
        },
        {
            "gameTime": "2 - 36:08",
            "label": "",
            "description": "Marko Rog (Napoli) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "2 - 34:44",
            "label": "substitution",
            "description": "Isco (Real Madrid) joins the action as a substitute, replacing Luka Modric."
        },
        {
            "gameTime": "2 - 33:58",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) is flagged for offside."
        },
        {
            "gameTime": "2 - 33:34",
            "label": "",
            "description": "Marcelo (Real Madrid) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 33:23",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) works the corner short."
        },
        {
            "gameTime": "2 - 33:01",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety."
        },
        {
            "gameTime": "2 - 31:36",
            "label": "substitution",
            "description": "Zinedine Zidane decides to make a substitution. Karim Benzema will be replaced by Alvaro Morata (Real Madrid)."
        },
        {
            "gameTime": "2 - 29:44",
            "label": "substitution",
            "description": "Marek Hamsik goes off the pitch and Piotr Zielinski (Napoli) comes on."
        },
        {
            "gameTime": "2 - 28:01",
            "label": "corner",
            "description": "Jose Callejon (Napoli) whips in a cross from the corner, but Keylor Navas is well positioned and punches the ball away."
        },
        {
            "gameTime": "2 - 27:46",
            "label": "",
            "description": "The ball is cleared after Dries Mertens (Napoli) attempted to dribble past an opposing player. The referee signals a corner kick to Napoli."
        },
        {
            "gameTime": "2 - 24:36",
            "label": "substitution",
            "description": "Here is a change. Lorenzo Insigne is going off and Maurizio Sarri gives the last tactical orders to Arkadiusz Milik (Napoli)."
        },
        {
            "gameTime": "2 - 22:33",
            "label": "substitution",
            "description": "Substitution. Gareth Bale is replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 21:42",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 19:53",
            "label": "",
            "description": "Marko Rog (Napoli) takes a mid range shot, but the ball sails high over the bar."
        },
        {
            "gameTime": "2 - 18:48",
            "label": "",
            "description": "The linesman raises his flag for offside before Karim Benzema (Real Madrid) heads on."
        },
        {
            "gameTime": "2 - 17:44",
            "label": "",
            "description": "The game is interrupted as Dries Mertens (Napoli) is flagged offside."
        },
        {
            "gameTime": "2 - 13:56",
            "label": "",
            "description": "Poor challenge! Marko Rog (Napoli) is penalised for tripping and Cuneyt Cakir blows his whistle."
        },
        {
            "gameTime": "2 - 12:35",
            "label": "",
            "description": "Flag up against Dries Mertens (Napoli). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 11:34",
            "label": "soccer-ball-own",
            "description": "Dries Mertens (Napoli) is totally disorientated and accidentally puts the ball into his own goal!"
        },
        {
            "gameTime": "2 - 11:13",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) will take a corner kick."
        },
        {
            "gameTime": "2 - 10:44",
            "label": "substitution",
            "description": "Here comes a substitution. Marko Rog (Napoli) is brought on as a substitute for Allan."
        },
        {
            "gameTime": "2 - 09:43",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Allan (Napoli) was quite harsh and Cuneyt Cakir didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 08:31",
            "label": "corner",
            "description": "The corner from Faouzi Ghoulam (Napoli) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 06:00",
            "label": "soccer-ball",
            "description": "Toni Kroos takes over corner duties and expertly finds Sergio Ramos (Real Madrid), who jumps highest and coolly plants a bullet header into the back of the net. The score is now 1:1."
        },
        {
            "gameTime": "2 - 05:47",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner."
        },
        {
            "gameTime": "2 - 05:28",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Toni Kroos (Real Madrid). Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 02:51",
            "label": "corner",
            "description": "The resulting corner from Jose Callejon (Napoli) comes to nothing."
        },
        {
            "gameTime": "2 - 02:28",
            "label": "",
            "description": "Dries Mertens (Napoli) latches on to a pin point through ball, but one of the defending players dispossess him. Brilliant defending. Napoli force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 01:48",
            "label": "",
            "description": "Karim Benzema (Real Madrid) finds himself unmarked on the edge of the box, but he drags his shot just wide of the right post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Cuneyt Cakir blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:02",
            "label": "injury",
            "description": "Daniel Carvajal (Real Madrid) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:44",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "1 - 43:30",
            "label": "",
            "description": "Karim Benzema (Real Madrid) wastes a good opportunity as his pass into the box is blocked by the defence. Real Madrid earn a corner."
        },
        {
            "gameTime": "1 - 43:01",
            "label": "",
            "description": "Raul Albiol (Napoli) commits a rough foul. Cuneyt Cakir stops the game and makes a call."
        },
        {
            "gameTime": "1 - 41:16",
            "label": "",
            "description": "Dries Mertens (Napoli) gets on the ball and beats an opponent, but his run is stopped by the referee Cuneyt Cakir who sees an offensive foul."
        },
        {
            "gameTime": "1 - 40:25",
            "label": "",
            "description": "Keylor Navas can hear the fans clapping for his superb goalkeeping after he magnificently stops the close range effort from Marek Hamsik (Napoli). The ball would have probably ended up in the bottom left corner."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "",
            "description": "Marek Hamsik (Napoli) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the right post."
        },
        {
            "gameTime": "1 - 37:02",
            "label": "",
            "description": "What an excellent shot, but not the luckiest one. Dries Mertens (Napoli) fires the ball from inside the penalty box but it only hits the left post!"
        },
        {
            "gameTime": "1 - 36:12",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 34:30",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "1 - 34:12",
            "label": "corner",
            "description": "Jose Callejon (Napoli) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "1 - 34:01",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball is out of play. Napoli win a corner kick."
        },
        {
            "gameTime": "1 - 31:52",
            "label": "",
            "description": "Cuneyt Cakir has a clear sight and sees a foul from Allan (Napoli)."
        },
        {
            "gameTime": "1 - 29:56",
            "label": "",
            "description": "Casemiro (Real Madrid) gets a shot away from distance, but wasn't really set to take it and fires high and wide."
        },
        {
            "gameTime": "1 - 28:53",
            "label": "",
            "description": "Off the post! Cristiano Ronaldo (Real Madrid) amazingly found his way through the defence, but lacked a precise finish as his effort from close range bounced off the right post."
        },
        {
            "gameTime": "1 - 27:12",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) latches on to a pass on the edge of the box, but he can't get any power into the shot and fails to trouble Keylor Navas."
        },
        {
            "gameTime": "1 - 24:00",
            "label": "soccer-ball",
            "description": "GOAL! Superb work from Marek Hamsik, who plays a vital role in the build up. He squares it to Dries Mertens (Napoli), who beats Keylor Navas with a brilliant shot into the bottom right corner. 1:0."
        },
        {
            "gameTime": "1 - 20:21",
            "label": "",
            "description": "Toni Kroos (Real Madrid) gives away a foul for a clumsy challenge. Referee Cuneyt Cakir saw the whole situation."
        },
        {
            "gameTime": "1 - 19:40",
            "label": "",
            "description": "Flag goes up against Cristiano Ronaldo (Real Madrid) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 18:01",
            "label": "",
            "description": "Gareth Bale (Real Madrid) had an opportunity from long range. His low shot was directed towards the middle of the goal, but Pepe Reina was alert and made a comfortable save."
        },
        {
            "gameTime": "1 - 17:18",
            "label": "",
            "description": "Gareth Bale (Real Madrid) races towards goal but the defender gets back well to make a challenge. The ball is off of the pitch and it's a goal kick for Napoli."
        },
        {
            "gameTime": "1 - 16:04",
            "label": "",
            "description": "Marek Hamsik (Napoli) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the right post."
        },
        {
            "gameTime": "1 - 14:49",
            "label": "",
            "description": "Toni Kroos (Real Madrid) receives the ball and fires a first time shot from long range. His brilliant effort low towards the middle of the goal is blocked by Pepe Reina, who pulls off a stunning save!"
        },
        {
            "gameTime": "1 - 13:56",
            "label": "",
            "description": "Raul Albiol (Napoli) is penalised for a foul. Cuneyt Cakir had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 13:34",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 13:29",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) had a good opportunity from long range. His shot was directed towards the bottom left corner, but Keylor Navas was alert and made a comfortable save. The referee and his assistant both point at the corner flag. Napoli will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 10:41",
            "label": "",
            "description": "The linesman raises his flag. Karim Benzema (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "1 - 08:19",
            "label": "",
            "description": "Allan (Napoli) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Cuneyt Cakir with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "Marek Hamsik (Napoli) makes a yard for himself on the edge of the box and produces a poor effort that sails miles wide of the right post."
        },
        {
            "gameTime": "1 - 07:04",
            "label": "corner",
            "description": "The resulting corner, taken by Faouzi Ghoulam (Napoli), comes to nothing."
        },
        {
            "gameTime": "1 - 06:31",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) launches a cross from the corner, but Keylor Navas is alert to thwart the effort. The referee blows his whistle, Napoli are awarded a corner kick."
        },
        {
            "gameTime": "1 - 06:20",
            "label": "",
            "description": "Dries Mertens (Napoli) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play and Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 04:24",
            "label": "",
            "description": "The linesman signals that Dries Mertens (Napoli) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 01:14",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 00:53",
            "label": "",
            "description": "Dries Mertens (Napoli) blasts the ball from just outside the box, but his attempt is blocked by the defender. Napoli win a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Cuneyt Cakir."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Cuneyt Cakir is looking at his watch and immediately ends this match."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "07/03/2017 - 22:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "1 - 3"
}