{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-03-02 - 23-00 Liverpool 3 - 0 Manchester City/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The hosts were superior today. The hosts defended well and were deadly on the counter attack. The away side displayed some nice build up play using a lot of passes."
        },
        {
            "gameTime": "2 - 48:13",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 46:54",
            "label": "",
            "description": "Joe Allen (Liverpool) commits a foul and Martin Atkinson immediately signals a free kick."
        },
        {
            "gameTime": "2 - 45:11",
            "label": "",
            "description": "Joe Allen (Liverpool) takes a shot after receiving a good pass, but his effort from the edge of the box goes just over the crossbar. The ball goes out of play and Manchester City will have a goal kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:50",
            "label": "",
            "description": "A great solo effort from Wilfried Bony (Manchester City) and he attempts to surprise the goalkeeper with a long range shot low towards the middle of the goal. Simon Mignolet has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 44:31",
            "label": "corner",
            "description": "The resulting corner from Jesus Navas (Manchester City) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 44:06",
            "label": "",
            "description": "Sergio Aguero (Manchester City) races towards goal but the defender gets back well to make a challenge. Manchester City have a corner."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "",
            "description": "Jon Flanagan (Liverpool) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 42:39",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to introduce fresh legs, with Jordon Ibe (Liverpool) replacing James Milner."
        },
        {
            "gameTime": "2 - 41:13",
            "label": "injury",
            "description": "Jon Flanagan (Liverpool) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 39:15",
            "label": "",
            "description": "Jordan Henderson (Liverpool) shoots at goal from the free kick from some 20 metres out. His attempt was quite precise and another few inches and it would have ended up inside the left post."
        },
        {
            "gameTime": "2 - 38:02",
            "label": "",
            "description": "Vincent Kompany (Manchester City) pulls the jersey of one of the opposition players and Martin Atkinson blows his whistle for a foul. Liverpool are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 37:41",
            "label": "",
            "description": "Kelechi Iheanacho (Manchester City) makes an unfair challenge by holding his opponent to prevent him from getting the ball."
        },
        {
            "gameTime": "2 - 35:45",
            "label": "",
            "description": "Vincent Kompany (Manchester City) was too forceful with his tackle and Martin Atkinson interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 34:34",
            "label": "",
            "description": "The referee blows his whistle for a foul after Christian Benteke (Liverpool) overruns the ball during an attack and makes an aggressive challenge on his opponent."
        },
        {
            "gameTime": "2 - 33:00",
            "label": "",
            "description": "James Milner (Liverpool) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "2 - 31:30",
            "label": "",
            "description": "Manchester City are showing great team chemistry. They are passing the ball around seamlessly but finally one of the defending players makes an interception."
        },
        {
            "gameTime": "2 - 29:20",
            "label": "substitution",
            "description": "Jurgen Klopp prepares a substitution. Roberto Firmino (Liverpool) is replaced by Joe Allen."
        },
        {
            "gameTime": "2 - 29:00",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Gael Clichy leaves the pitch and Aleksandar Kolarov (Manchester City) comes on."
        },
        {
            "gameTime": "2 - 28:27",
            "label": "funfact",
            "description": "The shots on goal statistics – 7:1."
        },
        {
            "gameTime": "2 - 27:25",
            "label": "",
            "description": "The foul by James Milner (Liverpool) was seen by Martin Atkinson who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 25:25",
            "label": "",
            "description": "Sergio Aguero (Manchester City) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "substitution",
            "description": "Jurgen Klopp decides to make a substitution. Divock Origi will be replaced by Christian Benteke (Liverpool)."
        },
        {
            "gameTime": "2 - 23:25",
            "label": "",
            "description": "Fernando (Manchester City) makes a bad challenge and the referee blows his whistle for a foul. Liverpool have a free kick."
        },
        {
            "gameTime": "2 - 22:12",
            "label": "y-card",
            "description": "Yellow card! It's like Jesus Navas (Manchester City) was asking for a caution with his behaviour. Martin Atkinson agrees and books him."
        },
        {
            "gameTime": "2 - 20:15",
            "label": "",
            "description": "Jesus Navas (Manchester City) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "2 - 18:18",
            "label": "",
            "description": "James Milner (Liverpool) and his stunning dribble! He zig zags through the defence and gets in front of the keeper. He faints to shoot and then suddenly strikes goalwards, but his effort misses the target by a whisker. Very unlucky for James Milner (Liverpool). This could have been a legendary goal."
        },
        {
            "gameTime": "2 - 16:22",
            "label": "attendance",
            "description": "The attendance is 43597."
        },
        {
            "gameTime": "2 - 15:38",
            "label": "corner",
            "description": "James Milner (Liverpool) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 15:28",
            "label": "",
            "description": "James Milner (Liverpool) fails to find any of his teammates inside the box as his pass is blocked. The referee signals a corner kick to Liverpool."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "corner",
            "description": "Liverpool work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "2 - 14:36",
            "label": "",
            "description": "James Milner (Liverpool) fashions a shot from the edge of the box after receiving an accurate pass. Joe Hart makes a stunning save to stop the effort from flying into the roof of the net. The referee blows his whistle, Liverpool are awarded a corner kick."
        },
        {
            "gameTime": "2 - 14:00",
            "label": "",
            "description": "Liverpool keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "soccer-ball",
            "description": "Goal! Roberto Firmino (Liverpool) finds himself some space inside the box to get on the end of a pass from Adam Lallana, then sends the ball into the bottom right corner. 3:0."
        },
        {
            "gameTime": "2 - 09:40",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Fernandinho departs the field of play to be replaced by Kelechi Iheanacho (Manchester City)."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "",
            "description": "Fernandinho (Manchester City) breaks past challenges inside the box, but puts too much pace on his pass to David Silva."
        },
        {
            "gameTime": "2 - 06:39",
            "label": "",
            "description": "Some great controlled play and passing from Manchester City. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 04:58",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) produces a lovely chip pass into the box, but one of the opposition players cuts it out."
        },
        {
            "gameTime": "2 - 04:00",
            "label": "",
            "description": "Adam Lallana (Liverpool) brings his opponent down with a tackle and Martin Atkinson blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 02:17",
            "label": "",
            "description": "Divock Origi (Liverpool) receives a precise pass and is given time inside the box to send a promising strike towards the bottom left corner. Joe Hart guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "",
            "description": "The game is interrupted as Divock Origi (Liverpool) is flagged offside."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Manuel Pellegrini has decided to make a substitution during the half time break. Wilfried Bony (Manchester City) comes on the pitch for Raheem Sterling."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We have been witnesses to an ordinary game without many breathtaking situations, but there is still time for improvement in the second half. Neither team has really been able to control the flow of the game. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 46:30",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Martin Atkinson has ended it."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "",
            "description": "A free kick into the box, taken by David Silva (Manchester City), is comfortably cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 45:10",
            "label": "",
            "description": "Martin Atkinson couldn't ignore the rough tackle by Jon Flanagan (Liverpool) and blew his whistle. Manchester City have a free kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "",
            "description": "A pass into the penalty area from Sergio Aguero (Manchester City) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 44:13",
            "label": "",
            "description": "Roberto Firmino (Liverpool) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 43:08",
            "label": "",
            "description": "Manchester City are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error."
        },
        {
            "gameTime": "1 - 41:49",
            "label": "",
            "description": "Martin Atkinson blows his whistle after Emre Can (Liverpool) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 40:33",
            "label": "soccer-ball",
            "description": "Roberto Firmino plays a neat ball into the path of James Milner (Liverpool), who makes room for a shot and sends in a low drive which bounces in off the right post! 2:0."
        },
        {
            "gameTime": "1 - 39:52",
            "label": "",
            "description": "Flag up against Sergio Aguero (Manchester City). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 39:32",
            "label": "",
            "description": "Divock Origi (Liverpool) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 37:34",
            "label": "",
            "description": "An attempted cross from Jesus Navas (Manchester City) is cleared."
        },
        {
            "gameTime": "1 - 36:37",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Jesus Navas (Manchester City)."
        },
        {
            "gameTime": "1 - 36:17",
            "label": "",
            "description": "The ball is cleared after Sergio Aguero (Manchester City) attempted to dribble past an opposing player. The ball is out of play. Manchester City win a corner kick."
        },
        {
            "gameTime": "1 - 35:34",
            "label": "",
            "description": "The linesman raises his flag. Roberto Firmino (Liverpool) is adjudged offside."
        },
        {
            "gameTime": "1 - 33:42",
            "label": "soccer-ball",
            "description": "A wonderful pass found its target. Adam Lallana (Liverpool) received it well and shot from about 25 metres out. He did really well to send the ball past the goalkeeper and into the bottom right corner."
        },
        {
            "gameTime": "1 - 33:00",
            "label": "",
            "description": "Liverpool are seeing far more of the ball now."
        },
        {
            "gameTime": "1 - 31:00",
            "label": "",
            "description": "Manchester City are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "1 - 28:38",
            "label": "",
            "description": "Liverpool are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 27:15",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Raheem Sterling (Manchester City), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "1 - 25:17",
            "label": "",
            "description": "Emre Can (Liverpool) tries to find Jon Flanagan, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "",
            "description": "Sergio Aguero (Manchester City) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 23:57",
            "label": "",
            "description": "Roberto Firmino (Liverpool) commits a rough foul. Martin Atkinson stops the game and makes a call."
        },
        {
            "gameTime": "1 - 22:41",
            "label": "",
            "description": "Half chance! Pablo Zabaleta (Manchester City) plays a pass into the box, but Simon Mignolet reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 21:54",
            "label": "",
            "description": "Roberto Firmino (Liverpool) latches on to an accurate pass into the box and immediately unleashes a low shot goalwards. His effort is well saved by the keeper."
        },
        {
            "gameTime": "1 - 21:28",
            "label": "",
            "description": "Divock Origi (Liverpool) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "1 - 19:15",
            "label": "corner",
            "description": "James Milner (Liverpool) whips in a cross from the corner, but Joe Hart is well positioned and punches the ball away."
        },
        {
            "gameTime": "1 - 19:00",
            "label": "",
            "description": "Adam Lallana (Liverpool) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort. The ball is out of play and Liverpool manage to earn a corner."
        },
        {
            "gameTime": "1 - 17:58",
            "label": "",
            "description": "James Milner (Liverpool) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "1 - 15:59",
            "label": "",
            "description": "Adam Lallana (Liverpool) commits a rough challenge and Martin Atkinson blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 14:00",
            "label": "",
            "description": "James Milner (Liverpool) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it."
        },
        {
            "gameTime": "1 - 11:33",
            "label": "",
            "description": "Fernandinho (Manchester City) creates himself some space around the penalty spot and connects with the free kick. His header is so wild it sails way past the right post and behind for a goal kick."
        },
        {
            "gameTime": "1 - 10:47",
            "label": "",
            "description": "The game is interrupted. Jon Flanagan (Liverpool) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did. Manchester City earn a free kick."
        },
        {
            "gameTime": "1 - 09:17",
            "label": "",
            "description": "The Liverpool players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 08:00",
            "label": "",
            "description": "Adam Lallana (Liverpool) is penalised for holding. Martin Atkinson signals a set piece."
        },
        {
            "gameTime": "1 - 06:53",
            "label": "",
            "description": "Manchester City move the ball around well as they wait for an opportunity to shoot, but the attack is halted as they lose possession."
        },
        {
            "gameTime": "1 - 04:42",
            "label": "",
            "description": "James Milner (Liverpool) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "1 - 04:05",
            "label": "",
            "description": "It looks like Nicolas Otamendi (Manchester City) saw red with that tackle. Martin Atkinson won't tolerate such behaviour on the pitch and blows for a foul. That's a free kick to Liverpool."
        },
        {
            "gameTime": "1 - 03:32",
            "label": "",
            "description": "Roberto Firmino (Liverpool) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 01:26",
            "label": "",
            "description": "Jordan Henderson (Liverpool) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 01:00",
            "label": "",
            "description": "Raheem Sterling (Manchester City) robs an opponent of the ball and explodes in anger when Martin Atkinson blows for a foul. Liverpool win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Martin Atkinson."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The hosts were superior today. The hosts defended well and were deadly on the counter attack. The away side displayed some nice build up play using a lot of passes."
        }
    ],
    "gameAwayTeam": "Manchester City",
    "gameDate": "02/03/2016 - 23:00",
    "gameHomeTeam": "Liverpool",
    "gameScore": "3 - 0"
}