{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-02-24 - 22-45 Manchester City 1 - 2 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We have seen a great game today, let's hope the players will be able to maintain these high levels of play in order to keep fans entertained in future games. There wasn't any significant dominance by either side in this game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        },
        {
            "gameTime": "2 - 48:55",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 48:45",
            "label": "",
            "description": "Lionel Messi (Barcelona) covers his face with his hands after wasting a glorious chance. The ball rebounded to him but his close range header went a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 48:41",
            "label": "penalty-missed",
            "description": "Lionel Messi (Barcelona) blows a huge chance to score! He sends the penalty to the bottom right corner, but it's not enough to beat Joe Hart who easily stops the effort."
        },
        {
            "gameTime": "2 - 48:27",
            "label": "",
            "description": "Lionel Messi (Barcelona) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 47:48",
            "label": "penalty",
            "description": "Pablo Zabaleta (Manchester City) brings his opponent down. Felix Brych has a clear sight of it and blows his whistle for a foul. PENALTY to Barcelona! Great chance to score."
        },
        {
            "gameTime": "2 - 46:51",
            "label": "",
            "description": "Barcelona are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "2 - 45:02",
            "label": "",
            "description": "Lionel Messi (Barcelona) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:26",
            "label": "y-card",
            "description": "Fernando (Manchester City) picks up a yellow card for a foul."
        },
        {
            "gameTime": "2 - 42:49",
            "label": "y-card",
            "description": "Adriano (Barcelona) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Felix Brych didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 42:21",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 42:01",
            "label": "",
            "description": "Lionel Messi (Barcelona) sends a lofted cross into the box which is headed clear. The ball is out of play and Barcelona manage to earn a corner."
        },
        {
            "gameTime": "2 - 40:54",
            "label": "",
            "description": "Felix Brych blows his whistle and it's Lionel Messi (Barcelona) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 40:27",
            "label": "",
            "description": "Barcelona are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "",
            "description": "Adriano (Barcelona) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "2 - 37:58",
            "label": "",
            "description": "Luis Suarez (Barcelona) feels very aggrieved after the referee stops play for a foul that he commits while in possession of the ball."
        },
        {
            "gameTime": "2 - 37:23",
            "label": "",
            "description": "Good clearance! Luis Suarez (Barcelona) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him."
        },
        {
            "gameTime": "2 - 36:47",
            "label": "",
            "description": "Felix Brych blows his whistle as Sergio Busquets (Barcelona) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 34:40",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Neymar trots off the pitch and is replaced by Pedro (Barcelona)."
        },
        {
            "gameTime": "2 - 34:10",
            "label": "",
            "description": "Wilfried Bony (Manchester City) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 33:47",
            "label": "",
            "description": "Fernandinho (Manchester City) fails to deliver a decent free kick and the ball goes out of play."
        },
        {
            "gameTime": "2 - 33:18",
            "label": "",
            "description": "Sergio Busquets (Barcelona) makes a harsh challenge and Felix Brych calls for a foul. A free kick to Manchester City."
        },
        {
            "gameTime": "2 - 32:39",
            "label": "corner",
            "description": "Neymar (Barcelona) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 32:26",
            "label": "substitution",
            "description": "We are about to witness a substitution. Bacary Sagna (Manchester City) is replacing David Silva."
        },
        {
            "gameTime": "2 - 31:52",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. Barcelona will take a corner kick."
        },
        {
            "gameTime": "2 - 31:39",
            "label": "attendance",
            "description": "The attendance is 45550."
        },
        {
            "gameTime": "2 - 29:35",
            "label": "substitution",
            "description": "Dani Alves is not able to continue due to his injury and will be replaced by Adriano (Barcelona)."
        },
        {
            "gameTime": "2 - 28:12",
            "label": "yr-card",
            "description": "Gael Clichy (Manchester City) should have been more careful. He commits a bad foul, receives his second yellow card and is sent off!"
        },
        {
            "gameTime": "2 - 27:33",
            "label": "",
            "description": "The Barcelona players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 25:52",
            "label": "substitution",
            "description": "Substitution. Jeremy Mathieu (Barcelona) in, Ivan Rakitic out."
        },
        {
            "gameTime": "2 - 25:28",
            "label": "",
            "description": "Felix Brych blows his whistle. Vincent Kompany (Manchester City) commits a foul after dangerous play."
        },
        {
            "gameTime": "2 - 25:12",
            "label": "funfact",
            "description": "Here's the latest number of offsides – 0:7."
        },
        {
            "gameTime": "2 - 24:56",
            "label": "",
            "description": "Flag up against Luis Suarez (Barcelona). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 23:33",
            "label": "soccer-ball",
            "description": "Goal! David Silva puts the ball on a plate for Sergio Aguero (Manchester City), who scores with a simple close range finish. It's 1:2."
        },
        {
            "gameTime": "2 - 22:16",
            "label": "substitution",
            "description": "Here comes a substitution. Edin Dzeko is given a rest as he is replaced by Wilfried Bony (Manchester City)."
        },
        {
            "gameTime": "2 - 20:40",
            "label": "corner",
            "description": "A quickly taken corner by Manchester City."
        },
        {
            "gameTime": "2 - 20:10",
            "label": "",
            "description": "Sergio Aguero (Manchester City) fails to send a pass into the box as his effort is cut out. The referee signals a corner kick to Manchester City."
        },
        {
            "gameTime": "2 - 19:51",
            "label": "",
            "description": "Andres Iniesta (Barcelona) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 18:45",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) makes a good run with the ball, but his shot from the edge of the penalty area goes narrowly over the bar. Terrific solo effort, though."
        },
        {
            "gameTime": "2 - 18:25",
            "label": "",
            "description": "Barcelona hold possession of the ball and display neat passing from player to player. They are waiting for the right moment to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 17:11",
            "label": "corner",
            "description": "The resulting corner from James Milner (Manchester City) comes to nothing."
        },
        {
            "gameTime": "2 - 16:48",
            "label": "",
            "description": "Sergio Aguero (Manchester City) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The referee points to the corner flag. It's a corner to Manchester City."
        },
        {
            "gameTime": "2 - 16:06",
            "label": "substitution",
            "description": "A substitution has been made. Samir Nasri is replaced by Fernandinho (Manchester City)."
        },
        {
            "gameTime": "2 - 15:44",
            "label": "funfact",
            "description": "13:15 – this is the total number of shots produced by both teams."
        },
        {
            "gameTime": "2 - 15:18",
            "label": "",
            "description": "The game is interrupted as Luis Suarez (Barcelona) is flagged offside."
        },
        {
            "gameTime": "2 - 14:55",
            "label": "",
            "description": "Barcelona produce a short pass from the free kick."
        },
        {
            "gameTime": "2 - 14:25",
            "label": "",
            "description": "James Milner (Manchester City) makes an unfair challenge by holding his opponent to prevent him from getting the ball. Barcelona earn a free kick."
        },
        {
            "gameTime": "2 - 13:57",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) takes the free kick and sends the ball into the penalty area, but the opposition's defence is ready."
        },
        {
            "gameTime": "2 - 13:09",
            "label": "y-card",
            "description": "The foul by Gael Clichy (Manchester City) is worthy of a card and a yellow is duly shown by Felix Brych. A free kick has been awarded to Barcelona."
        },
        {
            "gameTime": "2 - 12:38",
            "label": "",
            "description": "Edin Dzeko (Manchester City) commits a foul during an attacking move."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "",
            "description": "Martin Demichelis (Manchester City) creates himself some space inside the goalmouth and connects with the resulting free kick. His header would have probably ended up in the middle of the goal, but Marc Andre ter Stegen pulls off a superb reflex save to thwart him."
        },
        {
            "gameTime": "2 - 11:35",
            "label": "",
            "description": "Andres Iniesta (Barcelona) commits a rough challenge and Felix Brych blows his whistle for an infringement. Manchester City are awarded a free kick."
        },
        {
            "gameTime": "2 - 11:17",
            "label": "corner",
            "description": "David Silva (Manchester City) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 10:46",
            "label": "",
            "description": "Edin Dzeko (Manchester City) passes the ball into the box but an opposing player clears. Manchester City have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 10:20",
            "label": "corner",
            "description": "Lionel Messi (Barcelona) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 09:45",
            "label": "",
            "description": "This shall not pass! Ivan Rakitic (Barcelona) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. Barcelona force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 08:28",
            "label": "",
            "description": "Lovely skill from Sergio Aguero (Manchester City) as he gets away from defenders and unleashes a shot from 20 metres out, but his effort goes just wide of the right post."
        },
        {
            "gameTime": "2 - 07:19",
            "label": "",
            "description": "Some patient build up play from Barcelona as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 05:14",
            "label": "",
            "description": "The resulting set piece from Lionel Messi (Barcelona) is successfully intercepted by the defender."
        },
        {
            "gameTime": "2 - 04:48",
            "label": "",
            "description": "Vincent Kompany (Manchester City) has now obviously shifted the ball with his hand. He could have been easily booked for that, however, the referee keeps the cards in his pocket and it only results in a free kick for the opponent's team. Barcelona have a free kick."
        },
        {
            "gameTime": "2 - 04:00",
            "label": "",
            "description": "Edin Dzeko (Manchester City) wastes a great chance from the resulting corner. He times his header superbly when he leaps high to meet a precise cross, but can't aim better than into the middle of the goal, straight into the arms of the goalkeeper."
        },
        {
            "gameTime": "2 - 03:44",
            "label": "corner",
            "description": "The ball goes behind for a corner. Manchester City will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 03:37",
            "label": "",
            "description": "A lofted cross from Edin Dzeko (Manchester City) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 03:09",
            "label": "",
            "description": "Samir Nasri (Manchester City) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 02:20",
            "label": "",
            "description": "Edin Dzeko (Manchester City) was the quickest one to orientate himself inside the box and leaps to connect with a cross from the corner kick. He produces a fine header, but it flies narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 02:00",
            "label": "corner",
            "description": "Manchester City force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 01:53",
            "label": "",
            "description": "Sergio Aguero (Manchester City) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "2 - 00:38",
            "label": "corner",
            "description": "Samir Nasri (Manchester City) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 00:20",
            "label": "",
            "description": "Samir Nasri (Manchester City) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. Now Manchester City have a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Up to now it has been an action packed game full of wonderful movements and opportunities. The visitors enjoy superiority over the opposition. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 46:17",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Samir Nasri (Manchester City). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 45:49",
            "label": "",
            "description": "Sergio Aguero (Manchester City) produces a poor pass. He attempts to get the ball into the box but it's hacked away. Corner kick. Manchester City will have an opportunity."
        },
        {
            "gameTime": "1 - 45:16",
            "label": "",
            "description": "Samir Nasri (Manchester City) had a great opportunity from mid range. His powerful volley was directed towards the right side of the goal, but Marc Andre ter Stegen was alert and made an astonishing save!"
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:19",
            "label": "y-card",
            "description": "Dani Alves (Barcelona) sees a yellow card from Felix Brych after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 43:27",
            "label": "",
            "description": "Crossbar! Dani Alves (Barcelona) amazingly found his way through the defence, but lacked a precise finish as his effort from close range crashed against the crossbar."
        },
        {
            "gameTime": "1 - 42:43",
            "label": "",
            "description": "The linesman raises his flag. Neymar (Barcelona) is adjudged offside."
        },
        {
            "gameTime": "1 - 41:52",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) is penalised for a foul. Felix Brych had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 40:31",
            "label": "y-card",
            "description": "Felix Brych shows a yellow card to Ivan Rakitic (Barcelona) for a tough tackle."
        },
        {
            "gameTime": "1 - 40:07",
            "label": "",
            "description": "Gael Clichy (Manchester City) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 39:22",
            "label": "",
            "description": "Edin Dzeko (Manchester City) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 37:58",
            "label": "",
            "description": "Dani Alves (Barcelona) sends a sweet pass into the box towards Luis Suarez. He looks to dribble past an opposing player, but fails and the ball is cleared."
        },
        {
            "gameTime": "1 - 35:42",
            "label": "",
            "description": "Lionel Messi (Barcelona) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 34:11",
            "label": "",
            "description": "The foul by Pablo Zabaleta (Manchester City) was seen by Felix Brych who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 33:53",
            "label": "",
            "description": "Edin Dzeko (Manchester City) swings a cross into the box, but it's far too close to Marc Andre ter Stegen, who smothers the ball."
        },
        {
            "gameTime": "1 - 33:10",
            "label": "",
            "description": "Luis Suarez (Barcelona) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 31:52",
            "label": "",
            "description": "Barcelona keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "1 - 29:55",
            "label": "soccer-ball",
            "description": "GOAL! Luis Suarez (Barcelona) got to the ball in front of the goal and he couldn't miss from there. His low drive went in off the right hand post. The score is 0:1."
        },
        {
            "gameTime": "1 - 27:16",
            "label": "corner",
            "description": "David Silva (Manchester City) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 26:49",
            "label": "",
            "description": "David Silva (Manchester City) sends a cross into the box, but the opposition's defence clears the ball to safety. Manchester City win a corner."
        },
        {
            "gameTime": "1 - 25:44",
            "label": "",
            "description": "Luis Suarez (Barcelona) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Joe Hart to get hold of the ball."
        },
        {
            "gameTime": "1 - 24:12",
            "label": "",
            "description": "The linesman signals that Ivan Rakitic (Barcelona) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 23:35",
            "label": "",
            "description": "Barcelona are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 21:57",
            "label": "",
            "description": "Gael Clichy (Manchester City) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "1 - 21:27",
            "label": "",
            "description": "Dani Alves (Barcelona) smashes the ball with a volley from the edge of the box, but his poor attempt goes miles wide of the left post. The ball is off of the pitch and it's a goal kick for Manchester City."
        },
        {
            "gameTime": "1 - 20:12",
            "label": "",
            "description": "Edin Dzeko (Manchester City) blows a huge opportunity! He latches on to a perfect cross from the wing into the penalty area, but sends a bullet header just wide of the left post!"
        },
        {
            "gameTime": "1 - 19:33",
            "label": "",
            "description": "Luis Suarez (Barcelona) strikes a volley towards goal, but one of the defenders blocks his effort."
        },
        {
            "gameTime": "1 - 18:07",
            "label": "",
            "description": "Luis Suarez (Barcelona) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 17:13",
            "label": "",
            "description": "Samir Nasri (Manchester City) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 15:43",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Luis Suarez (Barcelona) and he fired home from close range. The score is 0:1."
        },
        {
            "gameTime": "1 - 14:51",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "1 - 12:40",
            "label": "",
            "description": "Luis Suarez (Barcelona) takes the chance to have an effort at goal from inside the box but misses to the left of the target."
        },
        {
            "gameTime": "1 - 11:26",
            "label": "",
            "description": "Luis Suarez (Barcelona) is flagged for offside."
        },
        {
            "gameTime": "1 - 10:59",
            "label": "",
            "description": "Lionel Messi (Barcelona) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "1 - 10:18",
            "label": "",
            "description": "The Barcelona players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 08:20",
            "label": "",
            "description": "James Milner (Manchester City) smashes the ball towards goal from the edge of the penalty box, but it fails to bother the goalkeeper as it hits the defensive wall."
        },
        {
            "gameTime": "1 - 07:41",
            "label": "",
            "description": "Felix Brych blows his whistle after Javier Mascherano (Barcelona) kicks an opponent's legs instead of the ball. Another situation results in a direct free kick for Manchester City."
        },
        {
            "gameTime": "1 - 06:04",
            "label": "",
            "description": "Edin Dzeko (Manchester City) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 05:08",
            "label": "",
            "description": "The referee blows his whistle as Javier Mascherano (Barcelona) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 04:15",
            "label": "",
            "description": "Jordi Alba (Barcelona) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "1 - 03:51",
            "label": "",
            "description": "Barcelona are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "1 - 02:39",
            "label": "",
            "description": "Dani Alves (Barcelona) sends a teasing cross into the area, but Joe Hart intercepts the ball."
        },
        {
            "gameTime": "1 - 01:55",
            "label": "corner",
            "description": "Barcelona take a short corner kick."
        },
        {
            "gameTime": "1 - 01:20",
            "label": "",
            "description": "Lionel Messi (Barcelona) picks out Neymar with a fine lofted pass, but the latter wasn't able to create some space to get into shooting range. The ball goes out of play and Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Barcelona will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Felix Brych."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have seen a great game today, let's hope the players will be able to maintain these high levels of play in order to keep fans entertained in future games. There wasn't any significant dominance by either side in this game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "24/02/2015 - 22:45",
    "gameHomeTeam": "Manchester City",
    "gameScore": "1 - 2"
}