{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-09-21 - 21-00 Real Madrid 1 - 1 Villarreal/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:00",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. The home side dominated the game. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        },
        {
            "gameTime": "2 - 48:59",
            "label": "y-card",
            "description": "Daniel Carvajal (Real Madrid) goes into the book for bad language. His vulgar comments could have made it worse. Luckily for him, it's a yellow card."
        },
        {
            "gameTime": "2 - 48:06",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 47:35",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) hits a dangerous effort towards the middle of the goal from the promising free kick. His low shot is stopped by a well prepared Sergio Asenjo."
        },
        {
            "gameTime": "2 - 47:18",
            "label": "",
            "description": "The free kick will be taken by Cristiano Ronaldo (Real Madrid)."
        },
        {
            "gameTime": "2 - 47:05",
            "label": "",
            "description": "Mario Gaspar (Villarreal) makes a rough challenge and Gonzalez Gonzalez blows his whistle for a foul. Another situation results in a direct free kick for Real Madrid."
        },
        {
            "gameTime": "2 - 45:15",
            "label": "",
            "description": "Dangerous play by Raphael Varane (Real Madrid). Gonzalez Gonzalez blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:57",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) latches on to a lovely pass inside the box and fires towards the right side of the net, but the effort is smothered by the keeper."
        },
        {
            "gameTime": "2 - 43:07",
            "label": "",
            "description": "A pass by Daniel Carvajal (Real Madrid) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 42:38",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Jonathan dos Santos leaves the pitch and Alfred N'Diaye (Villarreal) comes on."
        },
        {
            "gameTime": "2 - 41:32",
            "label": "",
            "description": "Toni Kroos (Real Madrid) shoots from the edge of the penalty area. The ball travels low towards the middle of the target, but Sergio Asenjo easily deals with the threat."
        },
        {
            "gameTime": "2 - 40:30",
            "label": "corner",
            "description": "Daniel Carvajal (Real Madrid) works the corner short."
        },
        {
            "gameTime": "2 - 40:23",
            "label": "",
            "description": "James Rodriguez (Real Madrid) sends a lofted cross into the box which is headed clear. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "2 - 40:15",
            "label": "",
            "description": "Lucas (Real Madrid) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "2 - 40:01",
            "label": "attendance",
            "description": "The attendance for today's match is 67328."
        },
        {
            "gameTime": "2 - 37:59",
            "label": "corner",
            "description": "Lucas (Real Madrid) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "2 - 37:35",
            "label": "",
            "description": "Sergio Asenjo pulls off a glorious save! Alvaro Morata (Real Madrid) attempts to head home after a precise lofted cross. However, his effort only finds its way into the goalkeeper gloves. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 36:21",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is penalised for a foul. Gonzalez Gonzalez had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 34:47",
            "label": "",
            "description": "Toni Kroos (Real Madrid) had a good chance to change the score. He ran towards the goal and unleashed a low shot from long range which went towards the middle of the goal, but Sergio Asenjo was ready and made a save."
        },
        {
            "gameTime": "2 - 33:58",
            "label": "corner",
            "description": "The resulting corner from Manuel Trigueros (Villarreal) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 33:20",
            "label": "",
            "description": "Mario Gaspar (Villarreal) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort. The referee points to the corner flag. It's a corner to Villarreal."
        },
        {
            "gameTime": "2 - 31:34",
            "label": "substitution",
            "description": "Substitution. Alvaro Morata (Real Madrid) in, Karim Benzema out."
        },
        {
            "gameTime": "2 - 31:07",
            "label": "",
            "description": "The ball falls to Karim Benzema (Real Madrid) on the edge of the box, but his shot goes well wide of the goal. The ball goes out of play and Villarreal will have a goal kick."
        },
        {
            "gameTime": "2 - 30:39",
            "label": "corner",
            "description": "Lucas (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 30:37",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries his luck from the edge of the box after a brilliant solo effort, but it is well blocked by the defender. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 30:12",
            "label": "y-card",
            "description": "Toni Kroos (Real Madrid) has tested the patience of referee Gonzalez Gonzalez and goes into the book for a previous late challenge. Toni Kroos (Real Madrid) trips an opponent with a slide tackle. Gonzalez Gonzalez stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "2 - 30:05",
            "label": "",
            "description": "Karim Benzema (Real Madrid) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 28:20",
            "label": "",
            "description": "An attempted cross from Danilo (Real Madrid) is cleared."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "substitution",
            "description": "Francisco Escriba has decided to substitute Nicola Sansone and he is replaced by Pato (Villarreal)."
        },
        {
            "gameTime": "2 - 26:54",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Lucas (Real Madrid) is coming onto the pitch as Gareth Bale cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 24:24",
            "label": "y-card",
            "description": "Cristiano Ronaldo (Real Madrid) is shown a yellow card after a horrible tackle. Cristiano Ronaldo (Real Madrid) robs an opponent of the ball and explodes in anger when Gonzalez Gonzalez blows for a foul."
        },
        {
            "gameTime": "2 - 23:03",
            "label": "",
            "description": "Samu Castillejo (Villarreal) picks up the ball, dribbles to the edge of the penalty area and unleashes a brilliant shot to the bottom right corner, but is thwarted by a great save from Francisco Casilla."
        },
        {
            "gameTime": "2 - 20:16",
            "label": "",
            "description": "What a chance that is! Gareth Bale (Real Madrid) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post. The ball goes out of play and Villarreal will have a goal kick."
        },
        {
            "gameTime": "2 - 18:38",
            "label": "substitution",
            "description": "It will be a substitution. Roberto Soriano (Villarreal) is ready to enter the pitch as Denis Cheryshev walks off."
        },
        {
            "gameTime": "2 - 17:54",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 17:34",
            "label": "corner",
            "description": "The resulting corner from James Rodriguez (Real Madrid) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 17:20",
            "label": "",
            "description": "The ball is cleared after Cristiano Ronaldo (Real Madrid) attempted to dribble past an opposing player. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 15:28",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) tries to find Cristiano Ronaldo, but he puts too much power on the through ball. The ball is off of the pitch and it's a goal kick for Villarreal."
        },
        {
            "gameTime": "2 - 14:55",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) has a shot blocked, it rebounds back to him, but even on his second attempt he cannot hit the target. His effort goes well wide. The ball is off of the pitch and it's a goal kick for Villarreal."
        },
        {
            "gameTime": "2 - 14:13",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 13:54",
            "label": "",
            "description": "Danilo (Real Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The referee blows his whistle, Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 12:42",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by James Rodriguez (Real Madrid)."
        },
        {
            "gameTime": "2 - 12:36",
            "label": "",
            "description": "Danilo (Real Madrid) looks to break free, but an opposing player clears the ball away. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:55",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes a short corner kick."
        },
        {
            "gameTime": "2 - 11:50",
            "label": "",
            "description": "Gareth Bale (Real Madrid) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. Good work from Real Madrid as they win a corner."
        },
        {
            "gameTime": "2 - 11:34",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 11:11",
            "label": "",
            "description": "The ball is cleared after Gareth Bale (Real Madrid) attempted to dribble past an opposing player. Now Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "",
            "description": "It looks like Daniel Carvajal (Real Madrid) saw red with that tackle. Gonzalez Gonzalez won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "2 - 06:09",
            "label": "y-card",
            "description": "Jose Angel (Villarreal) is shown a yellow card for a late challenge. Jose Angel (Villarreal) commits a rough foul. Gonzalez Gonzalez stops the game and makes a call. A free kick has been awarded to Real Madrid."
        },
        {
            "gameTime": "2 - 04:49",
            "label": "",
            "description": "Good chance for Karim Benzema (Real Madrid) as he latched on to a cross on the edge of the box and blasted the ball towards the net! It flew wide of the left post. The ball goes out of play and Villarreal will have a goal kick."
        },
        {
            "gameTime": "2 - 02:44",
            "label": "soccer-ball",
            "description": "James Rodriguez takes over corner duties and expertly finds Sergio Ramos (Real Madrid), who scores with a header that bounces up off the ground and goes into the bottom left corner. The score is now 1:1."
        },
        {
            "gameTime": "2 - 02:43",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 01:20",
            "label": "",
            "description": "Referee Gonzalez Gonzalez sees the trip by Manuel Trigueros (Villarreal) and doesn't hesitate to blow his whistle. That's a free kick to Real Madrid."
        },
        {
            "gameTime": "2 - 01:04",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:30",
            "label": "",
            "description": "Let's hope the players will show us more in the second half as the first one has been rather ordinary, devoid of goalscoring opportunities. The hosts are mostly controlling the match and making it pretty tough for the opposition to keep up. The home players have grown in confidence and started to string some passes together. The visiting side have relied on their defence and counter attacks."
        },
        {
            "gameTime": "1 - 46:28",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "soccer-ball",
            "description": "Bruno (Villarreal) steps up to take the penalty and converts it with a shot into the middle of the goal."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "",
            "description": "Bruno (Villarreal) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 44:45",
            "label": "substitution",
            "description": "Problems for Zinedine Zidane as Marcelo is not able to play anymore. His injury is too serious and Daniel Carvajal (Real Madrid) replaces him."
        },
        {
            "gameTime": "1 - 44:39",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) is rightly booked by the referee because it could not have been anything other than a yellow card."
        },
        {
            "gameTime": "1 - 44:35",
            "label": "penalty",
            "description": "Sergio Ramos (Real Madrid) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him. Penalty awarded! Villarreal will take a penalty kick."
        },
        {
            "gameTime": "1 - 44:30",
            "label": "",
            "description": "Manuel Trigueros (Villarreal) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 43:38",
            "label": "",
            "description": "A neat pass is well received by Denis Cheryshev (Villarreal), who is lurking on the edge of the box and strikes the ball on goal. The goalkeeper makes a decent save to block his shot."
        },
        {
            "gameTime": "1 - 42:29",
            "label": "injury",
            "description": "Marcelo (Real Madrid) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 41:36",
            "label": "corner",
            "description": "Samu Castillejo (Villarreal) fails to produce a decent cross from the corner kick. The ball goes well out of play. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "1 - 41:14",
            "label": "",
            "description": "The ball is cleared after Samu Castillejo (Villarreal) attempted to dribble past an opposing player. Villarreal win a corner."
        },
        {
            "gameTime": "1 - 38:43",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Nicola Sansone (Villarreal)."
        },
        {
            "gameTime": "1 - 37:32",
            "label": "",
            "description": "Gareth Bale (Real Madrid) has a sight of goal and shoots from long range but his ambitious effort flies just wide of the right post. The ball is off of the pitch and it's a goal kick for Villarreal."
        },
        {
            "gameTime": "1 - 35:14",
            "label": "",
            "description": "Toni Kroos (Real Madrid) produces a long range volley, but the ball was blocked by a defender on its way."
        },
        {
            "gameTime": "1 - 32:53",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 32:33",
            "label": "",
            "description": "Marcelo (Real Madrid) looks to break free, but an opposing player clears the ball away. Real Madrid earn a corner."
        },
        {
            "gameTime": "1 - 31:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) gets the ball and drives a shot high over the bar from the edge of the area. The ball is off of the pitch and it's a goal kick for Villarreal."
        },
        {
            "gameTime": "1 - 29:42",
            "label": "",
            "description": "Gonzalez Gonzalez blows his whistle and it's Cristiano Ronaldo (Real Madrid) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 28:57",
            "label": "",
            "description": "Nicola Sansone (Villarreal) meets a fine cross on the edge of the box from the resulting corner kick and shoots. His shot flies just wide of the left post. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "1 - 28:33",
            "label": "corner",
            "description": "Samu Castillejo (Villarreal) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "1 - 27:54",
            "label": "",
            "description": "Denis Cheryshev (Villarreal) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the top right corner, but Francisco Casilla was alert and the score remains the same. The referee and one of his assistants signal for a corner kick to Villarreal."
        },
        {
            "gameTime": "1 - 24:38",
            "label": "",
            "description": "Nicola Sansone (Villarreal) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 23:15",
            "label": "",
            "description": "Raphael Varane (Real Madrid) jumps for a header from the corner kick, but fails to steer the ball into the goal as it flies high over the bar. The ball goes out of play and Villarreal will have a goal kick."
        },
        {
            "gameTime": "1 - 22:39",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "1 - 22:28",
            "label": "",
            "description": "Marcelo (Real Madrid) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. Real Madrid force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 19:12",
            "label": "",
            "description": "Manuel Trigueros (Villarreal) gets a shot away from distance, but wasn't really set to take it and fires well wide of the left post. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "1 - 17:53",
            "label": "",
            "description": "Karim Benzema (Real Madrid) plants a goal bound header towards the left post after a nice cross inside the box, but one of the defenders manages to deflect it away."
        },
        {
            "gameTime": "1 - 17:15",
            "label": "",
            "description": "Poor challenge! Samu Castillejo (Villarreal) is penalised for tripping and Gonzalez Gonzalez blows his whistle. Real Madrid are awarded the free kick."
        },
        {
            "gameTime": "1 - 16:35",
            "label": "",
            "description": "Real Madrid are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "1 - 13:14",
            "label": "",
            "description": "Good movement by Marcelo (Real Madrid), but he can't find any of his teammates as the cross is poor. The ball goes out of play and Villarreal will have a goal kick."
        },
        {
            "gameTime": "1 - 11:00",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 10:45",
            "label": "",
            "description": "Karim Benzema (Real Madrid) races towards goal but the defender gets back well to make a challenge. The ball is out of play. Real Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 10:40",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 10:23",
            "label": "",
            "description": "Karim Benzema (Real Madrid) reacts well to latch onto a rebound inside the box, but his shot is well blocked. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 09:55",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 09:35",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner but it's cleared. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "1 - 09:17",
            "label": "",
            "description": "Gareth Bale (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 08:45",
            "label": "",
            "description": "Karim Benzema receives a sweet cross inside the box from Danilo (Real Madrid), but one of the defenders rushes in bravely to intercept the move."
        },
        {
            "gameTime": "1 - 06:46",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "1 - 06:19",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "1 - 04:25",
            "label": "corner",
            "description": "The resulting corner from James Rodriguez (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 04:03",
            "label": "",
            "description": "Gareth Bale (Real Madrid) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. The referee and his assistant both point at the corner flag. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 02:43",
            "label": "",
            "description": "Real Madrid are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 00:54",
            "label": "",
            "description": "A pass by Toni Kroos (Real Madrid) ends up in no man's land, and the attacking effort comes to an end. The ball is off of the pitch and it's a goal kick for Villarreal."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Real Madrid will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gonzalez Gonzalez is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Villarreal have not lost for 3 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Nicola Sansone is the leading goal scorer for Villarreal with 5 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid scored at least one goal in each of their last 16 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Toni Kroos will look to add to his tally of 6 assists this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There wasn't a lot of action on the pitch. We could describe the game as average. The home side dominated the game. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        }
    ],
    "gameAwayTeam": "Villarreal",
    "gameDate": "21/09/2016 - 21:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "1 - 1"
}