{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2016-04-23 - 17-00 Bournemouth 1 - 4 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. We witnessed the away side dominate today's game. The home side played long passes and crosses into the box. The tactic of the away side, on the other hand, was slow build up play."
        },
        {
            "gameTime": "2 - 50:06",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 48:29",
            "label": "attendance",
            "description": "The attendance is 11365."
        },
        {
            "gameTime": "2 - 47:51",
            "label": "",
            "description": "Roger East couldn't ignore the rough tackle by Simon Francis (Bournemouth) and blew his whistle."
        },
        {
            "gameTime": "2 - 45:50",
            "label": "soccer-ball",
            "description": "Goal! Nemanja Matic displays great vision and sends a pass to Eden Hazard (Chelsea), who shows brilliant composure inside the box to bury the ball into the back of the net. The score is 1:4."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 5 min. of added time."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "y-card",
            "description": "Matt Ritchie (Bournemouth) receives a yellow card for a nasty tackle."
        },
        {
            "gameTime": "2 - 43:29",
            "label": "",
            "description": "Wonderful movement by Chelsea. The players are holding possession, mostly exchanging one touch passes. They control the pace of the game now."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "corner",
            "description": "Eden Hazard (Chelsea) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 40:48",
            "label": "",
            "description": "Eden Hazard (Chelsea) produces a dangerous lofted cross into the box which is intercepted. The ball is out of play. Chelsea win a corner kick."
        },
        {
            "gameTime": "2 - 40:15",
            "label": "corner",
            "description": "Marc Pugh (Bournemouth) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 40:01",
            "label": "",
            "description": "Simon Francis (Bournemouth) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. Bournemouth have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "substitution",
            "description": "Guus Hiddink is forced to make a change. Willian is not able to carry on due to injury. He is replaced by Ruben Loftus Cheek (Chelsea)."
        },
        {
            "gameTime": "2 - 36:10",
            "label": "corner",
            "description": "Matt Ritchie (Bournemouth) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 35:53",
            "label": "",
            "description": "Dan Gosling (Bournemouth) connects with a pass but sees his shot from the edge of the box blocked. Bournemouth force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 34:53",
            "label": "corner",
            "description": "Matt Ritchie (Bournemouth) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 34:25",
            "label": "",
            "description": "Tommy Elphick (Bournemouth) wins some space for himself around the penalty spot and manages to produce a promising header. One of the defenders stops his effort before it gets to the goalkeeper, making him redundant. Now Bournemouth have a corner."
        },
        {
            "gameTime": "2 - 33:33",
            "label": "corner",
            "description": "Matt Ritchie (Bournemouth) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 33:16",
            "label": "",
            "description": "A lofted cross from Tommy Elphick (Bournemouth) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Bournemouth force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 32:48",
            "label": "substitution",
            "description": "Here comes a substitution. Matt Ritchie (Bournemouth) is brought on as a substitute for Junior Stanislas."
        },
        {
            "gameTime": "2 - 31:15",
            "label": "",
            "description": "Ambitious effort from Pedro (Chelsea). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well wide of the right post."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "",
            "description": "Eden Hazard (Chelsea) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "2 - 27:41",
            "label": "",
            "description": "A pass by Eden Hazard (Chelsea) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 25:50",
            "label": "soccer-ball",
            "description": "GOAL 1:3! Cesc Fabregas found Willian (Chelsea) inside the box, he spotted goalkeeper Artur Boruc off his line and chipped the ball into the net. What a cheeky lob!"
        },
        {
            "gameTime": "2 - 23:59",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 23:32",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The referee and one of his assistants signal for a corner kick to Chelsea."
        },
        {
            "gameTime": "2 - 21:28",
            "label": "",
            "description": "Junior Stanislas (Bournemouth) makes a yard for himself and unleashes a stunning shot from 20 metres out. His great effort, however, goes painfully wide of the right post."
        },
        {
            "gameTime": "2 - 20:22",
            "label": "corner",
            "description": "Andrew Surman (Bournemouth) whips in a cross from the corner, but Asmir Begovic is well positioned and punches the ball away."
        },
        {
            "gameTime": "2 - 20:05",
            "label": "",
            "description": "Callum Wilson (Bournemouth) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention. The ball is out of play and Bournemouth manage to earn a corner."
        },
        {
            "gameTime": "2 - 17:50",
            "label": "substitution",
            "description": "Here is a change. Lewis Grabban is going off and Eddie Howe gives the last tactical orders to Benik Afobe (Bournemouth)."
        },
        {
            "gameTime": "2 - 17:40",
            "label": "substitution",
            "description": "Substitution. Joshua King leaves the pitch and is replaced by Callum Wilson (Bournemouth)."
        },
        {
            "gameTime": "2 - 17:17",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 17:06",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) serves up a nice cross, but the defence clears the danger. The ball is out of play. Chelsea will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 15:02",
            "label": "",
            "description": "Joshua King (Bournemouth) makes an overly aggressive challenge and Roger East blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 14:19",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 14:03",
            "label": "",
            "description": "Pedro (Chelsea) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players. Chelsea have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 13:54",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 13:44",
            "label": "",
            "description": "Eden Hazard (Chelsea) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 11:08",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) makes a slide tackle, but referee Roger East blows for a foul."
        },
        {
            "gameTime": "2 - 09:26",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Cesc Fabregas (Chelsea). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 08:52",
            "label": "",
            "description": "Diego Costa (Chelsea) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. It will be a corner kick for Chelsea."
        },
        {
            "gameTime": "2 - 06:05",
            "label": "",
            "description": "Abdul Baba Rahman (Chelsea) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "2 - 02:25",
            "label": "",
            "description": "Junior Stanislas (Bournemouth) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "There has been no time for the supporters to get bored during an eventful opening 45 minutes. Both teams provided some breathtaking moments. Neither side has gained the upper hand as yet. The home side are attempting to create scoring opportunities mainly with long balls, while the away team are trying to prevail using combination football."
        },
        {
            "gameTime": "1 - 47:11",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:45",
            "label": "corner",
            "description": "Andrew Surman (Bournemouth) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 46:39",
            "label": "",
            "description": "Lewis Grabban (Bournemouth) looks to break free, but an opposing player clears the ball away. The referee points to the corner flag and Bournemouth will take a corner."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:36",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Junior Stanislas (Bournemouth), whose instinctive shot towards goal flashes inches over the top."
        },
        {
            "gameTime": "1 - 40:28",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) creates some space for himself to pick up a pass on the edge of the box and unleashes a decent strike which goes a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 39:32",
            "label": "",
            "description": "Dan Gosling (Bournemouth) is penalised for holding. Roger East signals a set piece."
        },
        {
            "gameTime": "1 - 35:50",
            "label": "soccer-ball",
            "description": "Simon Francis showcases his great technique and produces a beautiful lofted cross into the box. Tommy Elphick (Bournemouth) gets onto the scoresheet by heading inside the left post. It's 1:2."
        },
        {
            "gameTime": "1 - 35:48",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Andrew Surman (Bournemouth)."
        },
        {
            "gameTime": "1 - 34:46",
            "label": "",
            "description": "Junior Stanislas (Bournemouth) serves up a nice cross, but Asmir Begovic punches the ball away. Bournemouth have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "soccer-ball",
            "description": "Eden Hazard (Chelsea) collected a pass and decided to shoot from about 20 metres out. He hit it perfectly! The ball zoomed around the goalkeeper and ended up inside the left post."
        },
        {
            "gameTime": "1 - 32:56",
            "label": "",
            "description": "Lewis Grabban (Bournemouth) jumps for a cross and produces a fine header from near the penalty spot, but it goes narrowly wide of the left post!"
        },
        {
            "gameTime": "1 - 30:45",
            "label": "",
            "description": "Joshua King (Bournemouth) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "1 - 30:29",
            "label": "corner",
            "description": "Simon Francis (Bournemouth) will take the corner."
        },
        {
            "gameTime": "1 - 29:56",
            "label": "",
            "description": "Lewis Grabban (Bournemouth) latches on to a precise pass and one on one with the keeper slams the ball towards the right hand post. Asmir Begovic is alert, though, and leaps like a salmon to deny him. Corner kick. Bournemouth will have an opportunity."
        },
        {
            "gameTime": "1 - 29:25",
            "label": "",
            "description": "Andrew Surman (Bournemouth) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 27:17",
            "label": "",
            "description": "That's a well taken pass by Marc Pugh (Bournemouth). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "1 - 26:10",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) decides to have a shot at goal from the free kick, but it hits the defensive wall."
        },
        {
            "gameTime": "1 - 25:37",
            "label": "",
            "description": "The free kick will be taken by Branislav Ivanovic (Chelsea)."
        },
        {
            "gameTime": "1 - 25:08",
            "label": "",
            "description": "Referee Roger East sees the trip by Steve Cook (Bournemouth) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 23:32",
            "label": "",
            "description": "Lewis Grabban (Bournemouth) rises high to head a nice lofted cross towards the roof of the net. Unfortunately for him, his close range effort lacks pace and Asmir Begovic makes a comfortable save."
        },
        {
            "gameTime": "1 - 22:59",
            "label": "",
            "description": "Willian (Chelsea) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 22:26",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "1 - 22:13",
            "label": "",
            "description": "Eden Hazard (Chelsea) flights in the cross, but the defender is alert and clears to safety. The linesman points to the corner flag, Chelsea are going to take it."
        },
        {
            "gameTime": "1 - 20:23",
            "label": "",
            "description": "Steve Cook (Bournemouth) misses a rebound from close range. His effort floats narrowly over the crossbar!"
        },
        {
            "gameTime": "1 - 19:46",
            "label": "corner",
            "description": "Andrew Surman (Bournemouth) launches a cross from the corner, but Asmir Begovic is alert to thwart the effort."
        },
        {
            "gameTime": "1 - 19:35",
            "label": "",
            "description": "Lewis Grabban (Bournemouth) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play. Bournemouth are awarded a corner kick."
        },
        {
            "gameTime": "1 - 17:40",
            "label": "",
            "description": "Joshua King (Bournemouth) wins the ball from the resulting corner but blazes it well over the bar."
        },
        {
            "gameTime": "1 - 17:18",
            "label": "corner",
            "description": "Joshua King (Bournemouth) goes over to take a corner kick after one of the defenders makes a good clearance."
        },
        {
            "gameTime": "1 - 16:59",
            "label": "",
            "description": "Lewis Grabban (Bournemouth) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The referee points to the corner flag. It's a corner to Bournemouth."
        },
        {
            "gameTime": "1 - 16:30",
            "label": "",
            "description": "The referee stops play as the linesman flags Diego Costa (Chelsea) offside."
        },
        {
            "gameTime": "1 - 13:16",
            "label": "",
            "description": "This shall not pass! Willian (Chelsea) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 10:35",
            "label": "",
            "description": "Eden Hazard (Chelsea) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 07:56",
            "label": "",
            "description": "Marc Pugh (Bournemouth) sends over a cross, but he can't find any teammate inside the box. Poor delivery."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "soccer-ball",
            "description": "Pedro (Chelsea) receives a delightful pass inside the box and smashes a precise shot inside the left post. What a lovely finish!"
        },
        {
            "gameTime": "1 - 03:37",
            "label": "",
            "description": "Marc Pugh (Bournemouth) sends a teasing cross into the area, but Asmir Begovic intercepts the ball."
        },
        {
            "gameTime": "1 - 00:12",
            "label": "",
            "description": "Chelsea will kick the game off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Roger East will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. We witnessed the away side dominate today's game. The home side played long passes and crosses into the box. The tactic of the away side, on the other hand, was slow build up play."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "23/04/2016 - 17:00",
    "gameHomeTeam": "Bournemouth",
    "gameScore": "1 - 4"
}