{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-09-21 - 21-45 AS Roma 4 - 0 Crotone/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The home team had more of the game. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        },
        {
            "gameTime": "2 - 47:08",
            "label": "whistle",
            "description": "That's it for today, Carmine Russo has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 46:10",
            "label": "",
            "description": "Juan Iturbe (AS Roma) is penalised for a foul. Carmine Russo had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:00",
            "label": "",
            "description": "Wojciech Szczesny (AS Roma) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "2 - 43:58",
            "label": "injury",
            "description": "Wojciech Szczesny (AS Roma) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 43:29",
            "label": "",
            "description": "Diego Falcinelli (Crotone) jumps for a cross in the goal area and produces a fine header which goes narrowly wide of the right post! What a huge opportunity! The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "corner",
            "description": "Adrian Stoian (Crotone) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 42:50",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Aniello Salzano (Crotone) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "corner",
            "description": "Aniello Salzano (Crotone) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "2 - 41:20",
            "label": "",
            "description": "Andrea Nalini (Crotone) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "2 - 40:20",
            "label": "",
            "description": "Juan Jesus (AS Roma) rises above the defence to meet a cross from the corner. His timing is good, but he directs his header just a few inches wide of the left post. The ball goes out of play and Crotone will have a goal kick."
        },
        {
            "gameTime": "2 - 40:10",
            "label": "corner",
            "description": "Francesco Totti (AS Roma) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "",
            "description": "Francesco Totti (AS Roma) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat. The referee blows his whistle, AS Roma are awarded a corner kick."
        },
        {
            "gameTime": "2 - 38:19",
            "label": "corner",
            "description": "The resulting corner from Emerson (AS Roma) is cleared."
        },
        {
            "gameTime": "2 - 38:08",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) looks to break free, but an opposing player clears the ball away. The ball is out of play and the linesman points at the corner flag. Corner to AS Roma."
        },
        {
            "gameTime": "2 - 37:36",
            "label": "",
            "description": "Leandro Paredes (AS Roma) displays his superb passing ability after picking out Stephan El Shaarawy with a fine lofted pass to continue their attacking move."
        },
        {
            "gameTime": "2 - 36:20",
            "label": "corner",
            "description": "The corner by Adrian Stoian (Crotone) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "2 - 36:01",
            "label": "",
            "description": "Aniello Salzano (Crotone) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The ball is out of play. Crotone will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 35:10",
            "label": "",
            "description": "Juan Iturbe (AS Roma) gets on the ball and beats an opponent, but his run is stopped by the referee Carmine Russo who sees an offensive foul."
        },
        {
            "gameTime": "2 - 34:49",
            "label": "substitution",
            "description": "Substitution. Alessandro Florenzi leaves the pitch and is replaced by Emerson (AS Roma)."
        },
        {
            "gameTime": "2 - 34:01",
            "label": "",
            "description": "What a chance that is! Aniello Salzano (Crotone) wastes a huge opportunity as he receives a beautiful pass inside the box but is somehow only able to prod the ball onto the left post! The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "2 - 33:31",
            "label": "",
            "description": "Juan Iturbe (AS Roma) takes a mid range shot, but it lacks accuracy and it goes way over the bar. The ball is off of the pitch and it's a goal kick for Crotone."
        },
        {
            "gameTime": "2 - 33:13",
            "label": "corner",
            "description": "Francesco Totti (AS Roma) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "",
            "description": "Juan Iturbe (AS Roma) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The referee and his assistant both point at the corner flag. AS Roma will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "",
            "description": "The AS Roma players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 28:58",
            "label": "",
            "description": "Adrian Stoian (Crotone) swings a cross into the box, but it's far too close to Wojciech Szczesny, who smothers the ball."
        },
        {
            "gameTime": "2 - 28:22",
            "label": "",
            "description": "AS Roma seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 27:37",
            "label": "",
            "description": "Bruno Peres (AS Roma) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "2 - 26:00",
            "label": "",
            "description": "Bruno Martella (Crotone) is clearly in an offside position after the ball is played through to him and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 25:51",
            "label": "",
            "description": "Diego Falcinelli (Crotone) almost finds himself in a very promising position, but he is flagged offside by the linesman."
        },
        {
            "gameTime": "2 - 25:22",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Juan Jesus (AS Roma) will replace Konstantinos Manolas."
        },
        {
            "gameTime": "2 - 23:58",
            "label": "",
            "description": "Francesco Totti (AS Roma) was too fierce in his attempt to get the ball from his opponent and Carmine Russo blows for a foul."
        },
        {
            "gameTime": "2 - 21:06",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to substitute Mohamed Salah and he is replaced by Juan Iturbe (AS Roma)."
        },
        {
            "gameTime": "2 - 20:35",
            "label": "",
            "description": "Adrian Stoian (Crotone) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "2 - 20:00",
            "label": "substitution",
            "description": "Today's match ends for Raffaele Palladino who will be replaced by Adrian Stoian (Crotone)."
        },
        {
            "gameTime": "2 - 17:17",
            "label": "corner",
            "description": "The resulting corner from Mohamed Salah (AS Roma) is cleared by the defence."
        },
        {
            "gameTime": "2 - 17:07",
            "label": "",
            "description": "Leandro Paredes (AS Roma) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball is out of play. AS Roma win a corner kick."
        },
        {
            "gameTime": "2 - 14:11",
            "label": "penalty-missed",
            "description": "Raffaele Palladino (Crotone) fails to beat the goalkeeper from the penalty spot with a shot low into the middle of the goal. Wojciech Szczesny anticipates his intention perfectly, though, and doesn't have to move to stop the effort."
        },
        {
            "gameTime": "2 - 14:07",
            "label": "",
            "description": "Raffaele Palladino (Crotone) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 14:01",
            "label": "substitution",
            "description": "Substitution. Bruno Martella (Crotone) replaces Mario Sampirisi."
        },
        {
            "gameTime": "2 - 14:01",
            "label": "penalty",
            "description": "Crotone are awarded a penalty! The opposing players are protesting, but the referee had an easy decision to make. Alessandro Florenzi (AS Roma) brings an opponent down and Carmine Russo interrupts the game."
        },
        {
            "gameTime": "2 - 13:04",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) sends a cross into the box, but Alex Cordaz comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 11:52",
            "label": "soccer-ball",
            "description": "Mohamed Salah plays a terrific cross over to Edin Dzeko (AS Roma), who finds some space inside the box and puts the ball into the back of the net."
        },
        {
            "gameTime": "2 - 09:37",
            "label": "corner",
            "description": "Diego Falcinelli (Crotone) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 09:19",
            "label": "",
            "description": "Diego Falcinelli (Crotone) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. The referee points to the corner flag and Crotone will take a corner."
        },
        {
            "gameTime": "2 - 06:47",
            "label": "",
            "description": "A cross from the free kick is whipped in by Aniello Salzano (Crotone), but one of the defenders steps in and averts the threat."
        },
        {
            "gameTime": "2 - 06:44",
            "label": "",
            "description": "A player from AS Roma pulled an opponent down, forcing the referee to blow his whistle."
        },
        {
            "gameTime": "2 - 04:49",
            "label": "y-card",
            "description": "Andrea Nalini (Crotone) is given a yellow card."
        },
        {
            "gameTime": "2 - 04:40",
            "label": "",
            "description": "Carmine Russo blows for a foul after Andrea Nalini (Crotone) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 03:00",
            "label": "soccer-ball",
            "description": "Goal! Edin Dzeko (AS Roma) picks up a pass and gets to the edge of the box before clipping a brilliant lob over the goalkeeper and into the empty net. He makes it 3:0."
        },
        {
            "gameTime": "2 - 02:40",
            "label": "",
            "description": "Leonardo Capezzi (Crotone) sends a long ball in, but Wojciech Szczesny comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Davide Nicola has made a change at the break. Andrea Nalini (Crotone) has come on in place of Marcus Rohden."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Carmine Russo blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Up to now it has been an action packed game full of wonderful movements and opportunities. AS Roma dominated the opening period and easily created the most chances. The home team is playing possession football and the away team is basing its game on a well organized defence."
        },
        {
            "gameTime": "1 - 45:10",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 44:20",
            "label": "",
            "description": "Edin Dzeko (AS Roma) brings his opponent down with a tackle and Carmine Russo blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 44:20",
            "label": "",
            "description": "One of the AS Roma players unfairly tackled his opponent and conceded a foul. Crotone will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 42:40",
            "label": "corner",
            "description": "Wojciech Szczesny (AS Roma) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance."
        },
        {
            "gameTime": "1 - 42:33",
            "label": "",
            "description": "This shall not pass! Edin Dzeko (AS Roma) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 42:15",
            "label": "",
            "description": "Some great controlled play and passing from AS Roma. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 41:31",
            "label": "",
            "description": "Leonardo Capezzi (Crotone) is in a clear offside position and the referee blows his whistle after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 36:39",
            "label": "soccer-ball",
            "description": "Goal! Mohamed Salah (AS Roma) collects a pass and without hesitation fires an unstoppable shot into the roof of the net."
        },
        {
            "gameTime": "1 - 35:45",
            "label": "",
            "description": "A player from Crotone commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "1 - 35:40",
            "label": "corner",
            "description": "Marcus Rohden (Crotone) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 35:16",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Raffaele Palladino (Crotone). Crotone have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "",
            "description": "Marcus Rohden (Crotone) is caught offside, but it was a really close call."
        },
        {
            "gameTime": "1 - 32:47",
            "label": "",
            "description": "Raffaele Palladino (Crotone) receives a lofted pass from the flank and shoots from close range, but the ball flies slightly wide, almost brushing the right hand post. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "1 - 30:53",
            "label": "",
            "description": "Leandro Paredes (AS Roma) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar. The ball is off of the pitch and it's a goal kick for Crotone."
        },
        {
            "gameTime": "1 - 28:39",
            "label": "",
            "description": "Edin Dzeko (AS Roma) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender."
        },
        {
            "gameTime": "1 - 25:31",
            "label": "soccer-ball",
            "description": "Stephan El Shaarawy (AS Roma) receives a killer pass, finds himself one on one with the goalkeeper and scores with aplomb into the top left corner. What a perfect shot."
        },
        {
            "gameTime": "1 - 24:35",
            "label": "",
            "description": "Mario Sampirisi (Crotone) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 23:00",
            "label": "",
            "description": "Mohamed Salah (AS Roma) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "1 - 20:14",
            "label": "corner",
            "description": "The resulting corner, taken by Francesco Totti (AS Roma), comes to nothing."
        },
        {
            "gameTime": "1 - 20:01",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Francesco Totti (AS Roma), is intercepted by the opposition's defence. AS Roma will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 17:52",
            "label": "",
            "description": "Carmine Russo blows the whistle, Raffaele Palladino (Crotone) is penalised for a foul."
        },
        {
            "gameTime": "1 - 17:00",
            "label": "corner",
            "description": "Francesco Totti (AS Roma) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 15:55",
            "label": "",
            "description": "Francesco Totti (AS Roma) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 15:47",
            "label": "",
            "description": "AS Roma control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 12:48",
            "label": "corner",
            "description": "Francesco Totti (AS Roma) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 12:11",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Francesco Totti (AS Roma). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate. The ball is out of play. A goal scoring opportunity from a corner for AS Roma."
        },
        {
            "gameTime": "1 - 09:46",
            "label": "",
            "description": "Raffaele Palladino (Crotone) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "1 - 06:42",
            "label": "corner",
            "description": "A dangerous looking corner kick from Mohamed Salah (AS Roma) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 05:02",
            "label": "",
            "description": "What a chance that is! Edin Dzeko (AS Roma) wastes a huge opportunity as he receives a beautiful pass on the edge of the box and fires towards the net. Unfortunately for him, he only hits the left post! The ball goes out of play and Crotone will have a goal kick."
        },
        {
            "gameTime": "1 - 03:49",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from AS Roma."
        },
        {
            "gameTime": "1 - 01:52",
            "label": "corner",
            "description": "Mohamed Salah (AS Roma) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 01:18",
            "label": "corner",
            "description": "The resulting corner from Francesco Totti (AS Roma) comes to nothing."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "",
            "description": "AS Roma are enjoying possession, but one of the opposition players steps in to end the sequence. The ball goes out of play and AS Roma have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Carmine Russo."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Crotone have lost 2x away this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma will miss a few players for this clash: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The home team had more of the game. The home side destroyed their opponents in every aspect of the game. The visitors offered very little going forward."
        }
    ],
    "gameAwayTeam": "Crotone",
    "gameDate": "21/09/2016 - 21:45",
    "gameHomeTeam": "AS Roma",
    "gameScore": "4 - 0"
}