{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-10-30 - 17-00 AC Milan 1 - 0 Pescara/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 52:59",
            "label": "",
            "description": "The game wasn't exhilarating, but it wasn't totally boring either. There were a few nice moments from both sides. The home side were dominant and dictated the tempo of the game. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        },
        {
            "gameTime": "2 - 52:05",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 51:09",
            "label": "",
            "description": "Cristiano Biraghi (Pescara) collects a wonderful lead pass and creates some space to smash the ball goalwards from long range. His shot goes painfully wide of the left post!"
        },
        {
            "gameTime": "2 - 49:55",
            "label": "",
            "description": "Gianluca Caprari (Pescara) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "2 - 49:38",
            "label": "",
            "description": "Suso (AC Milan) trips an opposition player and Daniele Doveri signals a foul."
        },
        {
            "gameTime": "2 - 49:17",
            "label": "",
            "description": "A cross from Rey Manaj (Pescara) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 47:51",
            "label": "corner",
            "description": "Gaston Brugman (Pescara) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "2 - 47:45",
            "label": "",
            "description": "Gianluca Caprari (Pescara) darts into the penalty area to latch on to a pass, and he unleashes a shot in the direction of the top left corner. Gianluigi Donnarumma is alert and denies him with a nice save. The referee signals a corner kick to Pescara."
        },
        {
            "gameTime": "2 - 45:55",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 45:07",
            "label": "",
            "description": "Alessandro Crescenzi (Pescara) brings an opponent down and Daniele Doveri interrupts the game. There is a free kick near the sideline to AC Milan."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 7 min. of added time."
        },
        {
            "gameTime": "2 - 40:30",
            "label": "",
            "description": "That's a well taken pass by Suso (AC Milan). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 38:26",
            "label": "substitution",
            "description": "Luiz Adriano (AC Milan) joins the action as a substitute, replacing Carlos Bacca."
        },
        {
            "gameTime": "2 - 37:08",
            "label": "",
            "description": "Rey Manaj (Pescara) picks up a pass and fires a powerful long range shot which goes painfully close to the left post."
        },
        {
            "gameTime": "2 - 35:58",
            "label": "",
            "description": "Great solo effort by Manuel Locatelli (AC Milan) as he beats two defenders before unleashing a low drive from just outside of the box towards the middle of the goal. The goalkeeper is ready and makes a decent save."
        },
        {
            "gameTime": "2 - 34:16",
            "label": "",
            "description": "The linesman raises his flag for offside before Rey Manaj (Pescara) heads on."
        },
        {
            "gameTime": "2 - 33:50",
            "label": "",
            "description": "Gianluigi Donnarumma makes a brilliant save! Francesco Zampano (Pescara) easily weaves through the defence and unleashes a shot from just outside of the box. His effort goes towards the middle of the goal but is saved by the keeper!"
        },
        {
            "gameTime": "2 - 32:12",
            "label": "",
            "description": "Mario Pasalic (AC Milan) had a good opportunity when he latched on to a cross from the wing, but his header wasn't accurate at all and the ball went well over the bar."
        },
        {
            "gameTime": "2 - 31:25",
            "label": "substitution",
            "description": "Massimo Oddo has decided to introduce fresh legs, with Rey Manaj (Pescara) replacing Alexandru Ionut Mitrita."
        },
        {
            "gameTime": "2 - 30:33",
            "label": "",
            "description": "Ahmad Benali (Pescara) sends a cross into the box, but Gianluigi Donnarumma comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 28:18",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Cristiano Biraghi (Pescara) comes onto the pitch for Andrea Coda."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "",
            "description": "A great solo effort from Suso (AC Milan) and he attempts to surprise the goalkeeper with a long range shot low towards the middle of the goal. Albano Bizzarri has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 24:34",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 24:14",
            "label": "",
            "description": "Mario Pasalic (AC Milan) tries to slide the ball through to a teammate but it's well blocked by a defender. AC Milan force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 22:39",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Juraj Kucka (AC Milan) comes onto the pitch so that Jose Sosa can be given a rest."
        },
        {
            "gameTime": "2 - 21:24",
            "label": "",
            "description": "Gaston Brugman (Pescara) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "",
            "description": "Jose Sosa (AC Milan) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 17:41",
            "label": "corner",
            "description": "The resulting corner from Alexandru Ionut Mitrita (Pescara) comes to nothing."
        },
        {
            "gameTime": "2 - 16:50",
            "label": "",
            "description": "Ledian Memushaj (Pescara) accepted an accurate pass on the edge of the box and unleashed a decent strike towards the top right corner of the goal. The goalkeeper, however, was alert and thwarted the effort. Good work from Pescara as they win a corner."
        },
        {
            "gameTime": "2 - 15:59",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from M'Baye Niang as he is replaced by Mario Pasalic (AC Milan)."
        },
        {
            "gameTime": "2 - 15:50",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) covers his face with his hands after wasting a promising chance. He takes the rebound on the edge of the box but blazes the ball high over the crossbar."
        },
        {
            "gameTime": "2 - 15:28",
            "label": "",
            "description": "Albano Bizzarri makes a brilliant save! Jose Sosa (AC Milan) easily weaves through the defence and unleashes a shot from just outside of the box. His effort goes straight under the crossbar but is saved by the keeper!"
        },
        {
            "gameTime": "2 - 13:29",
            "label": "",
            "description": "Daniele Doveri blows his whistle after Ledian Memushaj (Pescara) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "2 - 12:45",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) whips in the free kick, but one of the defenders comfortably clears the ball away."
        },
        {
            "gameTime": "2 - 12:33",
            "label": "",
            "description": "One of the Pescara players unfairly tackled his opponent and conceded a foul. AC Milan have a free kick."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "",
            "description": "Ledian Memushaj (Pescara) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 10:41",
            "label": "substitution",
            "description": "Alberto Aquilani is being substituted because of an injury. Massimo Oddo sends Bryan Cristante (Pescara) on the pitch."
        },
        {
            "gameTime": "2 - 08:40",
            "label": "injury",
            "description": "Looks like Alberto Aquilani (Pescara) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 08:30",
            "label": "injury",
            "description": "Ledian Memushaj (Pescara) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 08:19",
            "label": "",
            "description": "What a chance that is! Alberto Aquilani (Pescara) displays good awareness near the penalty spot to get on the end of a cross, but he sends his header narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 07:20",
            "label": "",
            "description": "Ahmad Benali (Pescara) jinks his way past two defenders and from the edge of the box has an effort which goes just over the bar."
        },
        {
            "gameTime": "2 - 05:32",
            "label": "",
            "description": "OFF THE POST! Carlos Bacca (AC Milan) drifts into the box to give his teammate support. He receives a fantastic pass and shoots from close range, but it crashes against the left post. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "2 - 04:54",
            "label": "",
            "description": "Ahmad Benali (Pescara) is adjudged offside."
        },
        {
            "gameTime": "2 - 03:39",
            "label": "soccer-ball",
            "description": "Giacomo Bonaventura (AC Milan) displays what a brilliant free kick master he is, especially from this distance. He hits the ball very well and scores with a low shot inside the left post, leaving the keeper helpless."
        },
        {
            "gameTime": "2 - 02:41",
            "label": "",
            "description": "A free kick has been awarded to AC Milan."
        },
        {
            "gameTime": "2 - 02:33",
            "label": "y-card",
            "description": "Daniele Doveri shows a yellow card to Alexandru Ionut Mitrita (Pescara) for a tough tackle."
        },
        {
            "gameTime": "2 - 00:58",
            "label": "",
            "description": "Jose Sosa (AC Milan) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Daniele Doveri starts the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "There has not been much to choose between the sides after an absorbing 45 minutes. Let's hope they can continue in the same vein in the second period. The hosts are enjoying a clear advantage over the opposition. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 46:09",
            "label": "whistle",
            "description": "Daniele Doveri has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:53",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the bottom right corner, but Albano Bizzarri was alert and the score remained the same."
        },
        {
            "gameTime": "1 - 43:40",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 43:30",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The referee and his assistant both point at the corner flag. AC Milan will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 43:03",
            "label": "",
            "description": "M'Baye Niang (AC Milan) had a good opportunity when he latched on to a cross from the wing, but his header from near the penalty spot wasn't accurate enough and the ball glanced away off the left post!"
        },
        {
            "gameTime": "1 - 42:34",
            "label": "",
            "description": "Carlos Bacca (AC Milan) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "y-card",
            "description": "Ignazio Abate (AC Milan) takes his opponent down and receives a yellow card from the referee."
        },
        {
            "gameTime": "1 - 40:42",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) sends in a poor cross from the corner and Albano Bizzarri has no trouble gathering it."
        },
        {
            "gameTime": "1 - 40:20",
            "label": "",
            "description": "M'Baye Niang (AC Milan) tries to send a pass but it's blocked. AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 38:59",
            "label": "",
            "description": "The linesman raises his flag. M'Baye Niang (AC Milan) is adjudged offside."
        },
        {
            "gameTime": "1 - 38:31",
            "label": "corner",
            "description": "Suso (AC Milan) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 38:20",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Suso (AC Milan). AC Milan have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 37:50",
            "label": "",
            "description": "Gustavo Gomez (AC Milan) leaps high deep inside the box to meet a beautiful cross from the free kick and attempts to score with a header. His effort is not accurate at all and goes well wide of the right post."
        },
        {
            "gameTime": "1 - 37:00",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) takes a direct free kick."
        },
        {
            "gameTime": "1 - 36:38",
            "label": "y-card",
            "description": "Gaston Brugman (Pescara) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Daniele Doveri didn't think twice about pulling it out of his pocket. A free kick is awarded to AC Milan."
        },
        {
            "gameTime": "1 - 35:15",
            "label": "",
            "description": "M'Baye Niang (AC Milan) fails to turn the rebound in from a promising position. The goalkeeper pulls off a superb save and denies his effort."
        },
        {
            "gameTime": "1 - 34:55",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) is obviously very disappointed with his shot from the rebound. He aims exactly at the goalkeeper's gloves. This should have been an easy goal!"
        },
        {
            "gameTime": "1 - 34:49",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "1 - 33:45",
            "label": "",
            "description": "Ledian Memushaj (Pescara) pulls the jersey of one of the opposition players and Daniele Doveri blows his whistle for a foul. A free kick has been awarded to AC Milan."
        },
        {
            "gameTime": "1 - 32:27",
            "label": "corner",
            "description": "Gianluigi Donnarumma comes off his line to intercept the corner from Alberto Aquilani (Pescara)."
        },
        {
            "gameTime": "1 - 32:15",
            "label": "corner",
            "description": "Alberto Aquilani (Pescara) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 32:13",
            "label": "",
            "description": "Gianluca Caprari (Pescara) delivers a low pass into the box which is intercepted. The referee blows his whistle, Pescara are awarded a corner kick."
        },
        {
            "gameTime": "1 - 31:38",
            "label": "",
            "description": "M'Baye Niang (AC Milan) is penalised for holding. Daniele Doveri signals a set piece."
        },
        {
            "gameTime": "1 - 30:38",
            "label": "",
            "description": "Ledian Memushaj (Pescara) is unable to feed an accurate cross into the box."
        },
        {
            "gameTime": "1 - 30:02",
            "label": "",
            "description": "M'Baye Niang (AC Milan) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball into the stands. Nice run, but poor finish!"
        },
        {
            "gameTime": "1 - 29:26",
            "label": "",
            "description": "Ledian Memushaj (Pescara) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 28:54",
            "label": "",
            "description": "Ledian Memushaj (Pescara) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 27:19",
            "label": "",
            "description": "Close! Carlos Bacca (AC Milan) picks up the ball in space and from inside the penalty area sends a shot inches wide of the right post."
        },
        {
            "gameTime": "1 - 25:43",
            "label": "",
            "description": "Gaston Brugman (Pescara) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 25:07",
            "label": "injury",
            "description": "Gaston Brugman (Pescara) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 23:38",
            "label": "",
            "description": "Jose Sosa (AC Milan) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 23:12",
            "label": "",
            "description": "Gianluca Caprari (Pescara) fouls an opponent. At least that's what referee Daniele Doveri signals."
        },
        {
            "gameTime": "1 - 22:27",
            "label": "",
            "description": "Ledian Memushaj (Pescara) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 19:45",
            "label": "",
            "description": "Gianluca Caprari (Pescara) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 18:15",
            "label": "",
            "description": "Carlos Bacca (AC Milan) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 16:55",
            "label": "",
            "description": "Carlos Bacca (AC Milan)'s poor effort is easily saved by Albano Bizzarri. He connects well with a cross, but mistimes it a little, and it heads towards the middle of the target and straight into the grateful hands of the goalkeeper."
        },
        {
            "gameTime": "1 - 15:54",
            "label": "",
            "description": "Handball by M'Baye Niang (AC Milan)."
        },
        {
            "gameTime": "1 - 15:40",
            "label": "",
            "description": "Daniele Doveri interrupts the game for a tactical foul by Alessandro Crescenzi (Pescara)."
        },
        {
            "gameTime": "1 - 14:43",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the left hand post, but Albano Bizzarri was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 14:33",
            "label": "",
            "description": "Mattia De Sciglio (AC Milan) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 13:08",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "1 - 12:57",
            "label": "",
            "description": "M'Baye Niang (AC Milan) fails to send a pass into the box as his effort is cut out. AC Milan have a corner."
        },
        {
            "gameTime": "1 - 12:10",
            "label": "",
            "description": "Alessandro Crescenzi (Pescara) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the roof of the net, but Gianluigi Donnarumma was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 11:25",
            "label": "",
            "description": "Ledian Memushaj (Pescara) wins himself enough space to meet the resulting corner and fires the ball at goal, but the keeper does well to stop his effort."
        },
        {
            "gameTime": "1 - 10:45",
            "label": "corner",
            "description": "Alberto Aquilani (Pescara) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "1 - 10:36",
            "label": "",
            "description": "Ahmad Benali (Pescara) serves up a nice cross, but Gianluigi Donnarumma punches the ball away. Pescara force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 07:53",
            "label": "",
            "description": "Alessandro Crescenzi (Pescara) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 06:50",
            "label": "",
            "description": "Gianluca Caprari (Pescara) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 04:16",
            "label": "",
            "description": "CLOSE! Gianluca Caprari (Pescara) shows off his amazing skills with a solo run to the edge of the box before fashioning a shot that goes inches wide of the left post!"
        },
        {
            "gameTime": "1 - 00:07",
            "label": "",
            "description": "The players are out and the match is about to start. AC Milan will have the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Daniele Doveri was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pescara managed to earn only 14 points from 36 matches this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 2:1 in the last game between AC Milan and Crotone."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Bacca looks sharp as he's the top goal scorer for AC Milan with 12 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The game wasn't exhilarating, but it wasn't totally boring either. There were a few nice moments from both sides. The home side were dominant and dictated the tempo of the game. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        }
    ],
    "gameAwayTeam": "Pescara",
    "gameDate": "30/10/2016 - 17:00",
    "gameHomeTeam": "AC Milan",
    "gameScore": "1 - 0"
}