{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-02-10 - 22-45 Napoli 2 - 0 Genoa/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:10",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 46:29",
            "label": "y-card",
            "description": "Today's referee Piero Giacomelli rightly decides to book Marko Rog (Napoli) for his harsh tackle."
        },
        {
            "gameTime": "2 - 46:00",
            "label": "",
            "description": "Leonardo Pavoletti (Napoli) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 42:33",
            "label": "",
            "description": "Napoli enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 38:47",
            "label": "",
            "description": "Leonardo Pavoletti (Napoli) misses a good chance to score. An inch perfect cross into the box finds Leonardo Pavoletti (Napoli) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 36:28",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 36:19",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) causes huge trouble for the goalkeeper with an astonishing free kick. The linesman points to the corner flag, Napoli are going to take it."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "y-card",
            "description": "Piero Giacomelli shows a yellow card to Nicolas Burdisso (Genoa), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 32:28",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Dries Mertens leaves the pitch and Leonardo Pavoletti (Napoli) comes on."
        },
        {
            "gameTime": "2 - 31:10",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 29:47",
            "label": "substitution",
            "description": "Maurizio Sarri decides to make a substitution. Marek Hamsik will be replaced by Allan (Napoli)."
        },
        {
            "gameTime": "2 - 27:01",
            "label": "substitution",
            "description": "A substitution has been made. Emanuele Giaccherini goes off and Marko Rog (Napoli) comes on."
        },
        {
            "gameTime": "2 - 26:30",
            "label": "",
            "description": "Darko Lazovic (Genoa) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 24:24",
            "label": "",
            "description": "Giovanni Simeone (Genoa) finds himself some space around the penalty spot and leaps high to meet the free kick. He tries to put his header into the right side of the goal, but Pepe Reina keeps it out."
        },
        {
            "gameTime": "2 - 22:31",
            "label": "soccer-ball",
            "description": "Goal 2:0! Dries Mertens laid the ball off to Emanuele Giaccherini (Napoli), who slots it into the back of the net from close range, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "y-card",
            "description": "Lucas Orban (Genoa) has received a yellow card for his foul."
        },
        {
            "gameTime": "2 - 21:30",
            "label": "",
            "description": "A cross from Diego Laxalt (Genoa) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 18:07",
            "label": "corner",
            "description": "Napoli fail to score from a corner as Eugenio Lamanna (Genoa) leaps to collect the ball."
        },
        {
            "gameTime": "2 - 17:51",
            "label": "",
            "description": "Cristian Maggio (Napoli) tries to send a pass but it's blocked. The referee and his assistant both point at the corner flag. Napoli will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 16:00",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) zig zags his way into the box and fails to direct a shot inside the right post as the goalkeeper pulls off a miraculous stop."
        },
        {
            "gameTime": "2 - 15:05",
            "label": "",
            "description": "Oscar Hiljemark (Genoa) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Pepe Reina was alert and the score remains the same."
        },
        {
            "gameTime": "2 - 14:08",
            "label": "",
            "description": "A long pass, executed by Diego Laxalt (Genoa), missed the precision to reach his teammates."
        },
        {
            "gameTime": "2 - 13:22",
            "label": "",
            "description": "Darko Lazovic (Genoa) serves up a nice cross, but Pepe Reina punches the ball away."
        },
        {
            "gameTime": "2 - 12:33",
            "label": "substitution",
            "description": "The manager makes a subsitution with Adel Taarabt (Genoa) coming on for Raffaele Palladino."
        },
        {
            "gameTime": "2 - 11:19",
            "label": "corner",
            "description": "Danilo Cataldi (Genoa) sends over a poor, overhit cross from the corner kick and the ball goes out of play."
        },
        {
            "gameTime": "2 - 10:47",
            "label": "",
            "description": "Darko Lazovic (Genoa) wastes a good opportunity as his pass into the box is blocked by the defence. The ball goes out of play. Genoa are awarded a corner kick."
        },
        {
            "gameTime": "2 - 10:27",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Emanuele Giaccherini (Napoli)."
        },
        {
            "gameTime": "2 - 09:48",
            "label": "corner",
            "description": "Emanuele Giaccherini (Napoli) takes a short corner kick."
        },
        {
            "gameTime": "2 - 09:30",
            "label": "",
            "description": "Napoli are passing the ball across the pitch and keep possession. However, an opponent intercepts a pass and the situation changes. Now Napoli have a corner."
        },
        {
            "gameTime": "2 - 09:01",
            "label": "corner",
            "description": "Napoli quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 08:50",
            "label": "",
            "description": "Napoli are just stroking the ball across the park now, but the defence is doing very well breaking up their possession. The referee and one of his assistants signal for a corner kick to Napoli."
        },
        {
            "gameTime": "2 - 07:11",
            "label": "",
            "description": "Amadou Diawara (Napoli) blows an opportunity as he sends a rebound from just outside of the box narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 06:38",
            "label": "",
            "description": "Dries Mertens (Napoli) unleashes a promising shot towards the middle of the goal after his wonderful solo run, but Eugenio Lamanna thwarts the effort with a fabulous save. The score remains the same."
        },
        {
            "gameTime": "2 - 04:52",
            "label": "soccer-ball",
            "description": "Goal! picks up the ball from a rebound and from the edge of the box he unleashes a low shot into the bottom right corner. Eugenio Lamanna (Genoa) is unable to keep the ball out of the net. It's 1:0."
        },
        {
            "gameTime": "2 - 04:50",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net."
        },
        {
            "gameTime": "2 - 03:36",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) takes the resultant free kick from the edge of the box and tries to find one of his teammates with a cross, but the keeper climbs high and gets to it first, collecting the ball with ease."
        },
        {
            "gameTime": "2 - 01:45",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Piero Giacomelli blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 47:13",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Emanuele Giaccherini (Napoli) is unlucky with a low drive from the edge of the box. A decent save by Eugenio Lamanna stops the ball from hitting the middle of the net."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:38",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post."
        },
        {
            "gameTime": "1 - 43:52",
            "label": "",
            "description": "Marek Hamsik (Napoli) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 42:58",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) swings in a cross from the corner, but Eugenio Lamanna reads it well and gathers the ball."
        },
        {
            "gameTime": "1 - 42:39",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) fails to send a pass into the box as his effort is cut out. The ball goes out of play. Napoli are awarded a corner kick."
        },
        {
            "gameTime": "1 - 38:42",
            "label": "corner",
            "description": "Napoli take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 38:38",
            "label": "substitution",
            "description": "Danilo Cataldi (Genoa) comes onto the pitch after Miguel Veloso signals to the bench that he cannot continue any longer after picking up an injury."
        },
        {
            "gameTime": "1 - 38:19",
            "label": "injury",
            "description": "Miguel Veloso (Genoa) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 37:05",
            "label": "",
            "description": "Cristian Maggio (Napoli) fails to find any of his teammates inside the box as his pass is blocked. Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 35:56",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "1 - 35:21",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) produces a ferocious strike from the edge of the box. His dangerous effort towards the roof of the net is blocked by Eugenio Lamanna, who pulls off a superb save to keep the ball out of the net. Napoli get a corner."
        },
        {
            "gameTime": "1 - 34:01",
            "label": "",
            "description": "Marek Hamsik (Napoli) is quickest inside the box and jumps to connect with the resulting set piece. He produces a fine header, but it flies just wide of the right post."
        },
        {
            "gameTime": "1 - 33:33",
            "label": "corner",
            "description": "There's an opportunity for Emanuele Giaccherini (Napoli) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 33:21",
            "label": "",
            "description": "Emanuele Giaccherini (Napoli) tries to slide the ball through to a teammate but it's well blocked by a defender. Napoli force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 32:54",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) had a good opportunity when he latched on to a cross from the wing, but his strike from the six yard box wasn't accurate enough and the ball went a few inches wide of the left post."
        },
        {
            "gameTime": "1 - 31:58",
            "label": "corner",
            "description": "A quickly taken corner by Napoli."
        },
        {
            "gameTime": "1 - 31:36",
            "label": "",
            "description": "The Napoli players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball. The ball goes out of play and Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 30:48",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Emanuele Giaccherini (Napoli). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 30:28",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) races towards goal but the defender gets back well to make a challenge. Napoli force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 29:34",
            "label": "",
            "description": "Emanuele Giaccherini (Napoli) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The referee and the linesman both signal a throw in for Napoli."
        },
        {
            "gameTime": "1 - 28:33",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) gets a shot away from distance, but wasn't really set to take it and fires high and wide."
        },
        {
            "gameTime": "1 - 24:26",
            "label": "",
            "description": "Emanuele Giaccherini (Napoli) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 22:52",
            "label": "",
            "description": "Piero Giacomelli blows his whistle after Luca Rigoni (Genoa) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 22:12",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 21:30",
            "label": "",
            "description": "Cristian Maggio (Napoli) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball is out of play and Napoli manage to earn a corner."
        },
        {
            "gameTime": "1 - 20:28",
            "label": "corner",
            "description": "Miguel Veloso (Genoa) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 19:47",
            "label": "",
            "description": "This shall not pass! Giovanni Simeone (Genoa) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender. The linesman makes the right call and Genoa will have a corner."
        },
        {
            "gameTime": "1 - 18:59",
            "label": "substitution",
            "description": "Problems for Ivan Juric as Santiago Gentiletti is not able to play anymore. His injury is too serious and Lucas Orban (Genoa) replaces him."
        },
        {
            "gameTime": "1 - 18:36",
            "label": "injury",
            "description": "Santiago Gentiletti (Genoa) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 17:11",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Lorenzo Insigne (Napoli) takes it short."
        },
        {
            "gameTime": "1 - 16:49",
            "label": "",
            "description": "Marek Hamsik (Napoli) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. Good work from Napoli as they win a corner."
        },
        {
            "gameTime": "1 - 16:28",
            "label": "corner",
            "description": "Diego Laxalt (Genoa) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 16:08",
            "label": "",
            "description": "Diego Laxalt (Genoa) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The referee signals a corner kick to Genoa."
        },
        {
            "gameTime": "1 - 15:33",
            "label": "corner",
            "description": "Genoa work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "1 - 15:14",
            "label": "",
            "description": "Raffaele Palladino (Genoa) sends a pass into the box, but his attempt is thwarted and cleared. Genoa have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 13:36",
            "label": "",
            "description": "Marek Hamsik (Napoli) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 12:26",
            "label": "",
            "description": "Dangerous play by Luca Rigoni (Genoa). Piero Giacomelli blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 10:44",
            "label": "",
            "description": "Cristian Maggio (Napoli) shows too much aggression during an attacking move and ends up fouling his opponent."
        },
        {
            "gameTime": "1 - 08:57",
            "label": "",
            "description": "The ball is behind the touchline and Napoli will take a throw in."
        },
        {
            "gameTime": "1 - 07:01",
            "label": "",
            "description": "The ball is cleared after Darko Lazovic (Genoa) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 05:54",
            "label": "",
            "description": "Darko Lazovic (Genoa) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 04:48",
            "label": "",
            "description": "Dries Mertens (Napoli) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 04:30",
            "label": "",
            "description": "The Napoli players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 03:46",
            "label": "injury",
            "description": "The game is interrupted now, Dries Mertens (Napoli) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 02:54",
            "label": "",
            "description": "The linesman signals a throw in for Genoa."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Genoa will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Piero Giacomelli will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most prolific goal scorer for Genoa is Giovanni Simeone with 10 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli have not lost for 7 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's the end of the match."
        }
    ],
    "gameAwayTeam": "Genoa",
    "gameDate": "10/02/2017 - 22:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "2 - 0"
}