{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-04-09 - 17-00 Real Madrid 4 - 0 Eibar/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The home side dominated today's game. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        },
        {
            "gameTime": "2 - 46:57",
            "label": "whistle",
            "description": "Jose Sanchez is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 45:45",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes a mid range shot, but the ball sails high over the bar."
        },
        {
            "gameTime": "2 - 45:30",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "attendance",
            "description": "The attendance for today's match is 70689."
        },
        {
            "gameTime": "2 - 38:43",
            "label": "",
            "description": "One of the players from Real Madrid times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 38:21",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Izet Hajrovic (Eibar), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 38:20",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Danilo (Real Madrid) sacrificed accuracy for power, and thus his attempt went well wide of the left post."
        },
        {
            "gameTime": "2 - 37:38",
            "label": "",
            "description": "A lofted cross from Izet Hajrovic (Eibar) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. Eibar have a corner."
        },
        {
            "gameTime": "2 - 36:01",
            "label": "",
            "description": "Isco (Real Madrid) fails to pick a body out in the box with an over hit chip pass. The ball is off of the pitch and it's a goal kick for Eibar."
        },
        {
            "gameTime": "2 - 34:36",
            "label": "",
            "description": "CHANCE! Borja Baston (Eibar) rises high to meet the resultant corner kick and attempts to steer his fine header past the goalkeeper, but only hits the crossbar!"
        },
        {
            "gameTime": "2 - 34:25",
            "label": "corner",
            "description": "The referee awards a corner and Izet Hajrovic (Eibar) goes over to take it."
        },
        {
            "gameTime": "2 - 33:00",
            "label": "y-card",
            "description": "Jose Sanchez shows a yellow card to Danilo (Real Madrid), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 32:55",
            "label": "",
            "description": "Izet Hajrovic (Eibar) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The ball is out of play. Eibar will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 32:50",
            "label": "",
            "description": "The ball is cleared after Izet Hajrovic (Eibar) attempted to dribble past an opposing player. It's a throw in for Eibar."
        },
        {
            "gameTime": "2 - 30:01",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to introduce fresh legs, with Borja Mayoral Moya (Real Madrid) replacing Jese."
        },
        {
            "gameTime": "2 - 28:46",
            "label": "",
            "description": "Golden chance! Cristiano Ronaldo (Real Madrid) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the left post."
        },
        {
            "gameTime": "2 - 28:05",
            "label": "",
            "description": "Some neat passing and movement from Real Madrid as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "2 - 26:33",
            "label": "substitution",
            "description": "Substitution. Izet Hajrovic (Eibar) in, Keko out."
        },
        {
            "gameTime": "2 - 24:17",
            "label": "",
            "description": "A pass by Mateo Kovacic (Real Madrid) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "2 - 22:58",
            "label": "y-card",
            "description": "Jose Sanchez shows a yellow card to Ivan Ramis (Eibar) for a tough tackle."
        },
        {
            "gameTime": "2 - 21:53",
            "label": "",
            "description": "Lucas (Real Madrid) sends a lofted cross into the box which is headed clear."
        },
        {
            "gameTime": "2 - 20:55",
            "label": "corner",
            "description": "Asier Riesgo leaps to intercept the corner kick from James Rodriguez (Real Madrid)."
        },
        {
            "gameTime": "2 - 20:40",
            "label": "",
            "description": "A cross from Jese (Real Madrid) fails to reach the box as the defence clears the ball away to safety. Real Madrid get a corner."
        },
        {
            "gameTime": "2 - 19:26",
            "label": "",
            "description": "Keko (Eibar) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 18:00",
            "label": "substitution",
            "description": "Daniel Carvajal comes off the pitch to be replaced by Danilo (Real Madrid)."
        },
        {
            "gameTime": "2 - 17:00",
            "label": "y-card",
            "description": "Gonzalo Escalante (Eibar) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Jose Sanchez ignores the protests."
        },
        {
            "gameTime": "2 - 14:46",
            "label": "corner",
            "description": "David Junca (Eibar) takes a short corner kick."
        },
        {
            "gameTime": "2 - 14:12",
            "label": "",
            "description": "Sergio Enrich (Eibar) attempts to whip a quick pass into the box, but Borja Baston was not able to dribble past the opponent's defence and loses the ball. Eibar force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 13:15",
            "label": "",
            "description": "Sergio Enrich (Eibar) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "2 - 10:55",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 08:55",
            "label": "",
            "description": "David Junca (Eibar) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the right post."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Mateo Kovacic (Real Madrid) comes onto the pitch so that Casemiro can be given a rest."
        },
        {
            "gameTime": "2 - 06:55",
            "label": "corner",
            "description": "The corner from James Rodriguez (Real Madrid) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 06:43",
            "label": "",
            "description": "Jese (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 06:18",
            "label": "",
            "description": "Jese (Real Madrid) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates."
        },
        {
            "gameTime": "2 - 05:25",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) was close to scoring after he unleashed a powerful shot which went a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 04:59",
            "label": "corner",
            "description": "The corner kick from David Junca (Eibar) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 04:58",
            "label": "",
            "description": "Keko (Eibar) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The linesman points to the corner flag, Eibar are going to take it."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner, but the goalkeeper jumps and gathers the ball."
        },
        {
            "gameTime": "2 - 03:26",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) came close to scoring but should have done much better. His poor attempt from close range ended up in the gloves of Asier Riesgo. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Jose Mendilibar decided to make a change. Jota is replaced by David Junca (Eibar)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The need to improve in the second half has brought about a change. Adrian comes off for Borja Baston (Eibar)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have seen an attractive offensive game so far and the fans have nothing to complain about. The hosts are enjoying a clear advantage over the opposition. The home team are playing possession football, while the away team look to find a weakness in the opposition's defence mainly with their rapid counter attacks."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:45",
            "label": "corner",
            "description": "Isco (Real Madrid) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 45:28",
            "label": "",
            "description": "Isco (Real Madrid) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. The ball is out of play. A goal scoring opportunity from a corner for Real Madrid."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 42:35",
            "label": "",
            "description": "Jota (Eibar) sends a cross into the box, but Francisco Casilla comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 42:05",
            "label": "",
            "description": "What a save from Asier Riesgo! Cristiano Ronaldo (Real Madrid) jumps high to meet a cross and glances a promising header from close range, but the goalkeeper pulls off a brilliant stop to keep it out."
        },
        {
            "gameTime": "1 - 40:50",
            "label": "",
            "description": "Aleksandar Pantic (Eibar) rises highest from the corner to head at goal, but his effort towards the middle of the goal is comfortably saved by the goalkeeper."
        },
        {
            "gameTime": "1 - 40:27",
            "label": "corner",
            "description": "Jota (Eibar) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "1 - 40:04",
            "label": "",
            "description": "Keko (Eibar) fails to find any of his teammates inside the box as his pass is blocked. Eibar will take a corner kick."
        },
        {
            "gameTime": "1 - 38:59",
            "label": "soccer-ball",
            "description": "Goal! Cristiano Ronaldo rounded the goalkeeper and sent a sweet pass to Jese (Real Madrid), who had an easy finish to put it into an empty net. 4:0."
        },
        {
            "gameTime": "1 - 37:54",
            "label": "",
            "description": "Ivan Ramis (Eibar) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 37:26",
            "label": "",
            "description": "James Rodriguez (Real Madrid) stands over the resultant free kick from mid range, but his shot goes just over the crossbar. It could have been a fantastic goal!"
        },
        {
            "gameTime": "1 - 36:32",
            "label": "",
            "description": "Lucas (Real Madrid) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 35:56",
            "label": "injury",
            "description": "Ivan Ramis (Eibar) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 35:34",
            "label": "injury",
            "description": "The game is interrupted now, Lucas (Real Madrid) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 34:29",
            "label": "",
            "description": "Casemiro (Real Madrid) brings an opponent down and Jose Sanchez interrupts the game."
        },
        {
            "gameTime": "1 - 33:14",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 32:39",
            "label": "",
            "description": "A cross into the box from Cristiano Ronaldo (Real Madrid) is cleared. The ball is out of play and Real Madrid manage to earn a corner."
        },
        {
            "gameTime": "1 - 32:21",
            "label": "corner",
            "description": "Jota (Eibar) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 31:52",
            "label": "",
            "description": "Keko (Eibar) sends a cross into the box, but the opposition's defence clears the ball to safety. Eibar will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 28:27",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Isco (Real Madrid) takes it short."
        },
        {
            "gameTime": "1 - 28:13",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) races towards goal but the defender gets back well to make a challenge. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "1 - 27:19",
            "label": "",
            "description": "Daniel Garcia (Eibar) tries to find Jota, but he puts too much power on the pass."
        },
        {
            "gameTime": "1 - 24:27",
            "label": "corner",
            "description": "Jota (Eibar) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "Nacho (Real Madrid) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 23:58",
            "label": "",
            "description": "Jota (Eibar) flights in the cross, but the defender is alert and clears to safety. Eibar have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 22:35",
            "label": "injury",
            "description": "Nacho (Real Madrid) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 21:58",
            "label": "",
            "description": "Jota (Eibar) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 19:00",
            "label": "soccer-ball",
            "description": "Goal 3:0! Jese laid the ball off to Cristiano Ronaldo (Real Madrid), who slots it into the back of the net from close range, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "1 - 17:27",
            "label": "soccer-ball",
            "description": "Wonderful movement! Cristiano Ronaldo is in a good position inside the box but decides to pass the ball to Lucas (Real Madrid), who keeps his cool and blasts the ball inside the left post. What a finish that is – 2:0."
        },
        {
            "gameTime": "1 - 15:55",
            "label": "",
            "description": "The game is interrupted as Cristiano Ronaldo (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "1 - 14:12",
            "label": "",
            "description": "Jese (Real Madrid) looks to break free, but his touch lets him down and he loses the ball. The ball goes out of play and Eibar will have a goal kick."
        },
        {
            "gameTime": "1 - 13:16",
            "label": "",
            "description": "Isco (Real Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 11:39",
            "label": "",
            "description": "What a poor attempt! Keko (Eibar) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "1 - 09:24",
            "label": "",
            "description": "Antonio Luna (Eibar) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 08:34",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) latches on to a superb cross into the box and plants a header well wide of the right post."
        },
        {
            "gameTime": "1 - 07:42",
            "label": "",
            "description": "Adrian (Eibar) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "1 - 07:25",
            "label": "",
            "description": "Lucas (Real Madrid) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 06:31",
            "label": "",
            "description": "Lucas (Real Madrid) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance."
        },
        {
            "gameTime": "1 - 04:37",
            "label": "soccer-ball",
            "description": "James Rodriguez (Real Madrid) struck with a perfectly taken free kick from the edge of the box. He curled the ball straight inside the left post. There are not enough superlatives that can be used to describe that goal."
        },
        {
            "gameTime": "1 - 03:00",
            "label": "y-card",
            "description": "fouls his opponent and receives a yellow card from the referee, but he is clearly not happy with the decision."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Eibar will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Jose Sanchez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The home side dominated today's game. The home team tried to prevail using combination football unlike the away players who attempted to beat the opposition's defence using mostly counter attacks."
        }
    ],
    "gameAwayTeam": "Eibar",
    "gameDate": "09/04/2016 - 17:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "4 - 0"
}