{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-25 - 22-45 Malmo FF 0 - 5 Paris SG/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The away side dominated the game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "y-card",
            "description": "Rasmus Bengtsson (Malmo FF) is shown a yellow card by the referee for dissent."
        },
        {
            "gameTime": "2 - 44:41",
            "label": "",
            "description": "The foul by Rasmus Bengtsson (Malmo FF) was seen by William Collum who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 44:15",
            "label": "corner",
            "description": "Magnus Wolff Eikrem (Malmo FF) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 44:07",
            "label": "",
            "description": "A pass from Magnus Wolff Eikrem (Malmo FF) is intercepted by Kevin Trapp and the move breaks down. The ball is out of play and Malmo FF manage to earn a corner."
        },
        {
            "gameTime": "2 - 42:53",
            "label": "",
            "description": "Adrien Rabiot (Paris SG) threads a pass through to Jean Kevin Augustin, but Johan Wiland breaks up the move."
        },
        {
            "gameTime": "2 - 41:23",
            "label": "funfact",
            "description": "38:62 – the latest ball possession ratio."
        },
        {
            "gameTime": "2 - 39:52",
            "label": "substitution",
            "description": "Laurent Blanc prepares a substitution. Zlatan Ibrahimovic is replaced by Jean Kevin Augustin (Paris SG)."
        },
        {
            "gameTime": "2 - 39:22",
            "label": "",
            "description": "Simon Kroon (Malmo FF) fails to beat a perfect example of the offside trap."
        },
        {
            "gameTime": "2 - 36:22",
            "label": "soccer-ball",
            "description": "GOAL! Lucas (Paris SG) stands over the free kick and from 21 metres out curls the ball into the right side of the net. Excellent free kick!"
        },
        {
            "gameTime": "2 - 35:43",
            "label": "substitution",
            "description": "That's the end of the game for Enoch Adu, who is replaced by Erdal Rakip (Malmo FF)."
        },
        {
            "gameTime": "2 - 35:15",
            "label": "",
            "description": "Rasmus Bengtsson (Malmo FF) was trying to get to the ball but clattered into the legs of the opponent as well. William Collum blows his whistle for an infringement. Paris SG have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "",
            "description": "The referee stops play as the linesman flags Maxwell (Paris SG) offside."
        },
        {
            "gameTime": "2 - 32:24",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) finds Benjamin Stambouli with a nice pass so he can go on towards the goal."
        },
        {
            "gameTime": "2 - 29:16",
            "label": "attendance",
            "description": "The attendance for today's match is 20500."
        },
        {
            "gameTime": "2 - 28:36",
            "label": "corner",
            "description": "Lucas (Paris SG) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 28:24",
            "label": "",
            "description": "Lucas (Paris SG) looks to break free, but an opposing player clears the ball away. The ball goes out of play. Paris SG are awarded a corner kick."
        },
        {
            "gameTime": "2 - 28:05",
            "label": "",
            "description": "William Collum blows his whistle as Zlatan Ibrahimovic (Paris SG) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 26:07",
            "label": "",
            "description": "Simon Kroon (Malmo FF) has a shot blocked from inside the box."
        },
        {
            "gameTime": "2 - 24:31",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Simon Kroon (Malmo FF) replaces Nikola Djurdjic."
        },
        {
            "gameTime": "2 - 23:58",
            "label": "substitution",
            "description": "Laurent Blanc has decided to introduce fresh legs, with Benjamin Stambouli (Paris SG) replacing Thiago Motta."
        },
        {
            "gameTime": "2 - 23:57",
            "label": "substitution",
            "description": "It will be a substitution. Lucas (Paris SG) is ready to enter the pitch as Angel Di Maria walks off."
        },
        {
            "gameTime": "2 - 22:23",
            "label": "soccer-ball",
            "description": "Angel Di Maria (Paris SG) jumps for a header from a cross and puts the ball past the helpless goalkeeper."
        },
        {
            "gameTime": "2 - 21:56",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 18:57",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) releases Edinson Cavani with a precise pass and he attempts to finish, but is immediately surrounded by the defenders and loses the ball."
        },
        {
            "gameTime": "2 - 15:39",
            "label": "penalty-missed",
            "description": "Markus Rosenberg (Malmo FF) fails to score from the penalty spot! His effort crashes against the left post."
        },
        {
            "gameTime": "2 - 15:28",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 14:51",
            "label": "penalty",
            "description": "Maxwell (Paris SG) trips an opponent with a slide tackle. William Collum stops the game and he could give him a card, but eventually decides on just a warning. PENALTY! Wonderful opportunity to score for Malmo FF."
        },
        {
            "gameTime": "2 - 14:32",
            "label": "substitution",
            "description": "That will be all from Vladimir Rodic who is being replaced by the fresh legs of Magnus Wolff Eikrem (Malmo FF)."
        },
        {
            "gameTime": "2 - 13:59",
            "label": "",
            "description": "What a poor attempt! Nikola Djurdjic (Malmo FF) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes miles wide to the right."
        },
        {
            "gameTime": "2 - 12:03",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Edinson Cavani (Paris SG)."
        },
        {
            "gameTime": "2 - 08:56",
            "label": "corner",
            "description": "Vladimir Rodic (Malmo FF) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 08:33",
            "label": "",
            "description": "Pa Konate (Malmo FF) gets to a rebound and attempts to score with a header. Kevin Trapp is in the right place at the right time and keeps out the effort which was heading under the crossbar. Malmo FF have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 08:10",
            "label": "corner",
            "description": "Vladimir Rodic (Malmo FF) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 07:59",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Malmo FF force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 07:04",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) passes the ball onto Edinson Cavani, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "2 - 04:17",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Zlatan Ibrahimovic (Paris SG) was set free in the area by Blaise Matuidi and made no mistake with a lovely finish into the right side of the net. 0:3."
        },
        {
            "gameTime": "2 - 02:08",
            "label": "",
            "description": "Enoch Adu (Malmo FF) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 01:05",
            "label": "corner",
            "description": "The corner from Angel Di Maria (Paris SG) is intercepted by Johan Wiland."
        },
        {
            "gameTime": "2 - 00:55",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) launches an inaccurate corner kick into the penalty area. The ball is out of play. A goal scoring opportunity from a corner for Paris SG."
        },
        {
            "gameTime": "2 - 00:42",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Paris SG will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "So far we have been witnesses to an entertaining encounter between these two teams. Let's hope there will not be a decline in the spectacle in the second half. During the first 45 minutes, we have witnessed the ascendency of the visiting team who have been precise and effective. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 42:52",
            "label": "corner",
            "description": "Angel Di Maria (Paris SG) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 42:36",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) tries to pass the ball into the penalty area but it's blocked. The referee and one of his assistants signal for a corner kick to Paris SG."
        },
        {
            "gameTime": "1 - 41:25",
            "label": "y-card",
            "description": "Markus Rosenberg (Malmo FF) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but William Collum ignores the protests."
        },
        {
            "gameTime": "1 - 38:30",
            "label": "corner",
            "description": "Vladimir Rodic (Malmo FF) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "1 - 38:18",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) races towards goal but the defender gets back well to make a challenge. The ball goes out of play. Malmo FF are awarded a corner kick."
        },
        {
            "gameTime": "1 - 36:46",
            "label": "",
            "description": "Zlatan Ibrahimovic (Paris SG) wasted a huge opportunity! The fans already began to celebrate as he unleashed a powerful shot from the edge of the box after a brilliant solo effort. The ball went towards the bottom left corner, but Johan Wiland made a crucial save!"
        },
        {
            "gameTime": "1 - 35:48",
            "label": "",
            "description": "Angel Di Maria (Paris SG) receives the ball inside the penalty box and immediately fires a first time effort, but it goes well over the top."
        },
        {
            "gameTime": "1 - 35:27",
            "label": "",
            "description": "The linesman raises his flag. Nikola Djurdjic (Malmo FF) is adjudged offside."
        },
        {
            "gameTime": "1 - 34:32",
            "label": "corner",
            "description": "The goalkeeper punched the ball away after Vladimir Rodic (Malmo FF) took the corner."
        },
        {
            "gameTime": "1 - 34:19",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) slaloms his way past challenges, but an opposing player does well to get the ball away. It will be a corner kick for Malmo FF."
        },
        {
            "gameTime": "1 - 33:40",
            "label": "",
            "description": "Jo Inge Berget (Malmo FF) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 32:59",
            "label": "",
            "description": "Vladimir Rodic (Malmo FF) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 32:22",
            "label": "",
            "description": "Adrien Rabiot (Paris SG) jumps into a tackle and William Collum blows his whistle for a foul. Malmo FF are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 30:01",
            "label": "",
            "description": "Paris SG are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "1 - 27:52",
            "label": "",
            "description": "What a chance that is! Edinson Cavani (Paris SG) wastes a huge opportunity as he receives a beautiful pass inside the box but is somehow only able to prod the ball onto the left post!"
        },
        {
            "gameTime": "1 - 27:17",
            "label": "",
            "description": "Vladimir Rodic (Malmo FF) delivers a fine ball into the box from a free kick. However, the opposition's defence make sure none of his teammates get a challenge in on the goalkeeper."
        },
        {
            "gameTime": "1 - 26:51",
            "label": "",
            "description": "Dangerous play by Maxwell (Paris SG). William Collum blows his whistle for a foul. It's a free kick to Malmo FF, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 26:26",
            "label": "",
            "description": "Gregory van der Wiel (Paris SG) fires a volley towards goal from the edge of the penalty box, but the ball goes well wide of the right post."
        },
        {
            "gameTime": "1 - 26:04",
            "label": "",
            "description": "Angel Di Maria (Paris SG) attempts to release Edinson Cavani with a through ball, but his effort is thwarted by one of the defending players."
        },
        {
            "gameTime": "1 - 23:01",
            "label": "",
            "description": "Oscar Lewicki (Malmo FF) is penalised for a foul. William Collum had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 22:34",
            "label": "corner",
            "description": "Vladimir Rodic (Malmo FF) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 22:03",
            "label": "",
            "description": "Kevin Trapp pulls off a great save to deny Jo Inge Berget (Malmo FF) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal. Malmo FF get a corner."
        },
        {
            "gameTime": "1 - 21:18",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) is caught offside!"
        },
        {
            "gameTime": "1 - 18:52",
            "label": "",
            "description": "What a miskick by Angel Di Maria (Paris SG). He smashes a volley from long distance that goes into the stands."
        },
        {
            "gameTime": "1 - 17:59",
            "label": "",
            "description": "Gregory van der Wiel races towards the box before laying off to Angel Di Maria (Paris SG), who picks it up but blazes a shot well over the bar from the edge of the box."
        },
        {
            "gameTime": "1 - 15:42",
            "label": "",
            "description": "Flag goes up against Nikola Djurdjic (Malmo FF) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 13:05",
            "label": "soccer-ball",
            "description": "Goal! Angel Di Maria (Paris SG) fires a first time effort from inside the penalty area into the left side of the goal, glancing in off the post. What a finish!"
        },
        {
            "gameTime": "1 - 12:24",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Edinson Cavani (Paris SG) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 11:26",
            "label": "",
            "description": "The linesman signals that Zlatan Ibrahimovic (Paris SG) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 09:53",
            "label": "",
            "description": "Blaise Matuidi (Paris SG) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 09:07",
            "label": "",
            "description": "Anton Tinnerholm (Malmo FF) has the ability to send the ball deep into the penalty area from throw ins and it can lead to very promising situations for his team."
        },
        {
            "gameTime": "1 - 05:52",
            "label": "",
            "description": "Anton Tinnerholm (Malmo FF) sends an accurate short pass. Enoch Adu controls the ball with a fine first touch and is able to come up with a new attacking effort."
        },
        {
            "gameTime": "1 - 04:46",
            "label": "",
            "description": "Edinson Cavani (Paris SG) finds himself behind the opposition's defence, but the game is stopped for offside."
        },
        {
            "gameTime": "1 - 02:17",
            "label": "soccer-ball",
            "description": "It's a goal! Adrien Rabiot (Paris SG) makes it 0:0. He jumped highest to connect with a perfect cross from Gregory van der Wiel and planted his close range header into the right side of the goal. Johan Wiland was helpless."
        },
        {
            "gameTime": "1 - 00:52",
            "label": "",
            "description": "Markus Rosenberg (Malmo FF) outjumps the defence to meet the resulting corner and heads the ball towards the middle of the goal. The long range header is not powerful enough, and the keeper comfortably makes a save."
        },
        {
            "gameTime": "1 - 00:42",
            "label": "corner",
            "description": "Vladimir Rodic (Malmo FF) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 00:16",
            "label": "",
            "description": "Nikola Djurdjic (Malmo FF) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Good work from Malmo FF as they win a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Malmo FF will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "William Collum will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The away side dominated the game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        }
    ],
    "gameAwayTeam": "Paris SG",
    "gameDate": "25/11/2015 - 22:45",
    "gameHomeTeam": "Malmo FF",
    "gameScore": "0 - 5"
}