{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-09-12 - 14-45 Everton 3 - 1 Chelsea/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The performance of both teams was pretty much even. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 49:08",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 47:51",
            "label": "",
            "description": "Gareth Barry (Everton) sends a lofted pass into the penalty area from a free kick, but the opposition's defence manages to control all the attacking players and thwart the threat."
        },
        {
            "gameTime": "2 - 47:13",
            "label": "y-card",
            "description": "Diego Costa (Chelsea) is booked after bringing down an opponent. Andre Marriner had an easy decision to make."
        },
        {
            "gameTime": "2 - 45:55",
            "label": "",
            "description": "races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "2 - 43:32",
            "label": "",
            "description": "John Stones (Everton) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 42:42",
            "label": "y-card",
            "description": "Cesar Azpilicueta (Chelsea) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 41:35",
            "label": "",
            "description": "Willian (Chelsea) attempts to find one of his teammates with a free kick, but the defence is well positioned and clears the ball away from danger."
        },
        {
            "gameTime": "2 - 41:30",
            "label": "y-card",
            "description": "John Stones (Everton) goes in the referee's notebook after being shown a yellow card."
        },
        {
            "gameTime": "2 - 40:46",
            "label": "",
            "description": "Asmir Begovic reacts well to deny a long range free kick from James McCarthy (Everton) towards the top left corner."
        },
        {
            "gameTime": "2 - 40:09",
            "label": "",
            "description": "Willian (Chelsea) commits a rough challenge and Andre Marriner blows his whistle for a foul. A free kick to Everton."
        },
        {
            "gameTime": "2 - 37:00",
            "label": "soccer-ball",
            "description": "Goal! Ross Barkley displays great vision and sends a pass to Steven Naismith (Everton), who shows brilliant composure inside the box to bury the ball into the back of the net. The score is 3:1."
        },
        {
            "gameTime": "2 - 35:11",
            "label": "corner",
            "description": "Willian (Chelsea) swings the ball into the box from the corner kick but it's a bit too strong and it goes out of play. The ball goes out of play and Everton will have a goal kick."
        },
        {
            "gameTime": "2 - 34:53",
            "label": "",
            "description": "Nemanja Matic (Chelsea) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. Chelsea force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 33:24",
            "label": "corner",
            "description": "Willian (Chelsea) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 33:10",
            "label": "",
            "description": "Willian (Chelsea) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The linesman points to the corner flag, Chelsea are going to take it."
        },
        {
            "gameTime": "2 - 32:46",
            "label": "",
            "description": "Willian (Chelsea) displays his superb passing ability after picking out Eden Hazard with a fine lofted pass to continue their attacking move."
        },
        {
            "gameTime": "2 - 32:16",
            "label": "",
            "description": "A cross from Willian (Chelsea) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 31:39",
            "label": "substitution",
            "description": "Seamus Coleman is substituted due to injury. Roberto Martinez gives a chance to Ramiro Mori (Everton)."
        },
        {
            "gameTime": "2 - 30:08",
            "label": "injury",
            "description": "Seamus Coleman (Everton) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 29:40",
            "label": "",
            "description": "Aaron Lennon (Everton) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "2 - 29:00",
            "label": "substitution",
            "description": "Here is a change. Cesc Fabregas is going off and Jose Mourinho gives the last tactical orders to Willian (Chelsea)."
        },
        {
            "gameTime": "2 - 28:36",
            "label": "",
            "description": "Seamus Coleman (Everton) is disappointed with himself because he got into a good area but produced a poor cross. The linesman signals a throw in for Chelsea."
        },
        {
            "gameTime": "2 - 26:34",
            "label": "substitution",
            "description": "A substitution has been made. Arouna Kone is replaced by Aaron Lennon (Everton)."
        },
        {
            "gameTime": "2 - 25:55",
            "label": "",
            "description": "A precise low pass is received by Romelu Lukaku (Everton), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the right post."
        },
        {
            "gameTime": "2 - 25:32",
            "label": "corner",
            "description": "Nemanja Matic (Chelsea) fails to deliver a decent cross from the corner and the ball goes out of play."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "",
            "description": "Diego Costa (Chelsea) races towards goal but the defender gets back well to make a challenge. The ball is out of play and Chelsea manage to earn a corner."
        },
        {
            "gameTime": "2 - 24:32",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Ross Barkley (Everton)."
        },
        {
            "gameTime": "2 - 24:21",
            "label": "substitution",
            "description": "That will be all from Pedro who is being replaced by the fresh legs of Falcao (Chelsea)."
        },
        {
            "gameTime": "2 - 23:47",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Steven Naismith (Everton) is thwarted and cleared to safety. The referee points to the corner flag. It's a corner to Everton."
        },
        {
            "gameTime": "2 - 23:14",
            "label": "corner",
            "description": "Ross Barkley (Everton) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 22:58",
            "label": "",
            "description": "Romelu Lukaku (Everton) looks to break free, but an opposing player clears the ball away. Everton force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 22:36",
            "label": "",
            "description": "Asmir Begovic can hear the fans clapping for his superb goalkeeping after he magnificently stops the close range effort from Romelu Lukaku (Everton). The ball would have probably ended up in the bottom left corner."
        },
        {
            "gameTime": "2 - 22:15",
            "label": "corner",
            "description": "Ross Barkley (Everton) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 21:51",
            "label": "",
            "description": "Steven Naismith (Everton) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The linesman makes the right call and Everton will have a corner."
        },
        {
            "gameTime": "2 - 20:10",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 19:55",
            "label": "y-card",
            "description": "Brendan Galloway (Everton) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 19:21",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) serves up a nice cross, but Tim Howard punches the ball away. Chelsea will take a corner kick."
        },
        {
            "gameTime": "2 - 18:13",
            "label": "",
            "description": "Arouna Kone (Everton) shoots from the edge of the penalty area. The ball travels towards the target, but Asmir Begovic easily deals with the threat."
        },
        {
            "gameTime": "2 - 16:19",
            "label": "",
            "description": "Close! Romelu Lukaku (Everton) picks up the ball in space and from inside the penalty area sends a shot inches wide of the right post."
        },
        {
            "gameTime": "2 - 14:26",
            "label": "",
            "description": "fires the ball on goal, but his attempt goes well wide of the left post."
        },
        {
            "gameTime": "2 - 13:51",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) shows his brilliant passing ability after picking out Branislav Ivanovic with a fine lofted pass."
        },
        {
            "gameTime": "2 - 12:44",
            "label": "",
            "description": "Great touch by Romelu Lukaku (Everton) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "2 - 11:32",
            "label": "",
            "description": "Ross Barkley (Everton) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Kenedy (Chelsea) will replace John Obi Mikel."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "",
            "description": "John Stones (Everton) finds enough space to climb high and plants a header way over the bar. What a poor effort."
        },
        {
            "gameTime": "2 - 09:36",
            "label": "corner",
            "description": "Ross Barkley (Everton) will take the corner."
        },
        {
            "gameTime": "2 - 09:10",
            "label": "",
            "description": "Seamus Coleman (Everton) races towards goal but the defender gets back well to make a challenge. The referee blows his whistle, Everton are awarded a corner kick."
        },
        {
            "gameTime": "2 - 07:54",
            "label": "",
            "description": "Kurt Zouma (Chelsea) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 06:12",
            "label": "injury",
            "description": "Kurt Zouma (Chelsea) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 05:49",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 05:36",
            "label": "",
            "description": "Diego Costa (Chelsea) tries to send a pass but it's blocked. The ball goes out of play. Chelsea are awarded a corner kick."
        },
        {
            "gameTime": "2 - 04:36",
            "label": "",
            "description": "Diego Costa (Chelsea) releases Eden Hazard, who latched on to his perfect through pass and can continue with his team's attack."
        },
        {
            "gameTime": "2 - 02:50",
            "label": "",
            "description": "Brendan Galloway (Everton) fouls an opponent. At least that's what referee Andre Marriner signals."
        },
        {
            "gameTime": "2 - 02:09",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "Up to now it has been an action packed game full of wonderful movements and opportunities. In terms of the overall play, the match has been fairly even so far. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 47:27",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:55",
            "label": "",
            "description": "Seamus Coleman (Everton) had a good opportunity when he latched on to a cross from the wing, but his header wasn't accurate at all and the ball went well wide of the right post."
        },
        {
            "gameTime": "1 - 46:26",
            "label": "",
            "description": "Steven Naismith latches onto a perfect defence splitting pass from Romelu Lukaku (Everton) and heads towards goal."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:46",
            "label": "",
            "description": "Eden Hazard passes to Pedro (Chelsea), but he produces a wild shot from the edge of the box which goes high over the bar."
        },
        {
            "gameTime": "1 - 43:25",
            "label": "",
            "description": "Cesc Fabregas (Chelsea) threads a pass through to Diego Costa, but Tim Howard breaks up the move."
        },
        {
            "gameTime": "1 - 42:23",
            "label": "",
            "description": "Eden Hazard (Chelsea) smashes the ball towards goal, but his effort fails to threaten the goalkeeper after going way off target."
        },
        {
            "gameTime": "1 - 42:10",
            "label": "corner",
            "description": "The resulting corner from Cesc Fabregas (Chelsea) is cleared by the defence."
        },
        {
            "gameTime": "1 - 41:40",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear. Corner kick. Chelsea will have an opportunity."
        },
        {
            "gameTime": "1 - 41:17",
            "label": "",
            "description": "Diego Costa (Chelsea) gets on the end of a pass on the edge of the box but his shot is blocked. The ball goes behind for a corner. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 40:17",
            "label": "corner",
            "description": "The resulting corner from Pedro (Chelsea) is cleared."
        },
        {
            "gameTime": "1 - 39:51",
            "label": "",
            "description": "Nemanja Matic (Chelsea) creates a yard of space for himself and tries an effort from distance, but it's blocked. Chelsea get a corner."
        },
        {
            "gameTime": "1 - 38:15",
            "label": "",
            "description": "What a chance that is! Eden Hazard swings the ball into the box, and John Terry (Chelsea) gets in front of his man and powers his header just over the bar."
        },
        {
            "gameTime": "1 - 38:08",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) works the corner short."
        },
        {
            "gameTime": "1 - 37:46",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner but it's cleared. The ball goes out for a corner. Chelsea can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 37:36",
            "label": "",
            "description": "Eden Hazard (Chelsea) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. The ball is out of play and the linesman points at the corner flag. Corner to Chelsea."
        },
        {
            "gameTime": "1 - 35:26",
            "label": "soccer-ball",
            "description": "Nice piece of skill by Nemanja Matic (Chelsea). He perfectly collected a pass from John Obi Mikel, then unleashed a fantastic long range strike which went inside the left post. The score is 2:1."
        },
        {
            "gameTime": "1 - 34:03",
            "label": "",
            "description": "Steven Naismith (Everton) commits a foul and Andre Marriner immediately signals a free kick."
        },
        {
            "gameTime": "1 - 33:23",
            "label": "",
            "description": "Ross Barkley (Everton) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 32:50",
            "label": "",
            "description": "Diego Costa (Chelsea) sends a cross into the box, but Tim Howard comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 32:09",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 31:57",
            "label": "",
            "description": "A lofted cross from Branislav Ivanovic (Chelsea) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The referee and one of his assistants signal for a corner kick to Chelsea."
        },
        {
            "gameTime": "1 - 30:59",
            "label": "",
            "description": "John Obi Mikel (Chelsea) smashes the ball upfield and Diego Costa controls it with a great first touch."
        },
        {
            "gameTime": "1 - 29:53",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) was trying to get to the ball but clattered into the legs of the opponent as well. Andre Marriner blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 28:19",
            "label": "",
            "description": "The ball is cleared after Branislav Ivanovic (Chelsea) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "",
            "description": "Nemanja Matic (Chelsea) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 26:50",
            "label": "corner",
            "description": "Nemanja Matic (Chelsea) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 26:40",
            "label": "",
            "description": "Chelsea are just stroking the ball across the park now, but the defence is doing very well breaking up their possession. The referee and his assistant both point at the corner flag. Chelsea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 26:37",
            "label": "corner",
            "description": "Cesc Fabregas (Chelsea) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "1 - 25:50",
            "label": "",
            "description": "What a goal scoring opportunity! Cesar Azpilicueta (Chelsea) finds some space inside the box and gets in a strike, but the shot is brilliantly blocked by one of the defending players sliding in. The referee points to the corner flag and Chelsea will take a corner."
        },
        {
            "gameTime": "1 - 21:28",
            "label": "soccer-ball",
            "description": "Goal 2:0! Steven Naismith (Everton) gets a shot away from the edge of the box and scores into the bottom right corner. Ross Barkley provided an assist for the goal."
        },
        {
            "gameTime": "1 - 20:48",
            "label": "corner",
            "description": "Ross Barkley (Everton) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 20:15",
            "label": "",
            "description": "James McCarthy (Everton) takes the ball on and fires in a shot from 20 metres out. Asmir Begovic stops the effort which is headed to the left post. Now Everton have a corner."
        },
        {
            "gameTime": "1 - 19:29",
            "label": "corner",
            "description": "Ross Barkley (Everton) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 18:52",
            "label": "",
            "description": "A brilliant cross into the box finds Arouna Kone (Everton), who directs his header towards the left post, but the goalkeeper shows all his agility and makes an astonishing save. Everton earn a corner."
        },
        {
            "gameTime": "1 - 18:01",
            "label": "",
            "description": "Brendan Galloway (Everton) plays a terrific long ball forward to Steven Naismith, but he can't beat his man and the move breaks down."
        },
        {
            "gameTime": "1 - 16:34",
            "label": "soccer-ball",
            "description": "It's a goal! Steven Naismith (Everton) makes it 1:0. He jumped highest to connect with a perfect cross from Brendan Galloway and planted his close range header into the top right corner. Asmir Begovic was helpless."
        },
        {
            "gameTime": "1 - 15:14",
            "label": "",
            "description": "Diego Costa makes a nice run and receives a pin point long through ball from Eden Hazard (Chelsea). It would probably have put him one on one with the keeper, but one of the defenders makes a great block."
        },
        {
            "gameTime": "1 - 14:18",
            "label": "",
            "description": "Arouna Kone (Everton) attempts to find Steven Naismith, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 13:19",
            "label": "",
            "description": "Eden Hazard (Chelsea) and Pedro try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 11:26",
            "label": "",
            "description": "Seamus Coleman (Everton) clips a neat ball into the box in the direction of Steven Naismith, but he can't get on the end of the pass. The ball goes out of play and Chelsea will have a goal kick."
        },
        {
            "gameTime": "1 - 09:46",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Pedro (Chelsea). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 09:25",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Branislav Ivanovic (Chelsea). Chelsea win a corner."
        },
        {
            "gameTime": "1 - 08:27",
            "label": "substitution",
            "description": "Steven Naismith (Everton) comes onto the pitch after Muhamed Besic signals to the bench that he cannot continue any longer after picking up an injury."
        },
        {
            "gameTime": "1 - 08:00",
            "label": "",
            "description": "Ross Barkley (Everton) takes a shot from the edge of the area, but it goes harmlessly wide of the right post."
        },
        {
            "gameTime": "1 - 07:31",
            "label": "",
            "description": "A through ball from Romelu Lukaku (Everton) fails to reach Muhamed Besic as one of the defending players reacts brilliantly to intercept the effort. If the pass had been produced a little bit earlier, Muhamed Besic could have got into a promising position."
        },
        {
            "gameTime": "1 - 06:14",
            "label": "",
            "description": "Cesar Azpilicueta (Chelsea) looks to break free, but his touch lets him down and he loses the ball. The ball is off of the pitch and it's a goal kick for Everton."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "Muhamed Besic (Everton) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 04:53",
            "label": "",
            "description": "Ross Barkley (Everton) swings a cross into the box, but it's far too close to Asmir Begovic, who smothers the ball."
        },
        {
            "gameTime": "1 - 04:26",
            "label": "corner",
            "description": "Ross Barkley (Everton) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 03:27",
            "label": "injury",
            "description": "The game is interrupted now, Muhamed Besic (Everton) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 03:14",
            "label": "",
            "description": "Muhamed Besic (Everton) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out. The ball goes out of play and Everton have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 01:45",
            "label": "",
            "description": "Branislav Ivanovic (Chelsea) sends a teasing cross into the area, but Tim Howard intercepts the ball."
        },
        {
            "gameTime": "1 - 01:23",
            "label": "",
            "description": "Eden Hazard (Chelsea) smashes the ball upfield and Branislav Ivanovic brings it down with a fine first touch."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Everton will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Andre Marriner was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Chelsea's latest transfer: Pato (Corinthians)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "59:53 Here is Chelsea's goals for and against. They need some improvement in the defence."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "11 That's the number of clean sheets Everton have already kept in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans in the stadium certainly won't regret buying tickets as they witnessed a great game today. The performance of both teams was pretty much even. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Chelsea",
    "gameDate": "12/09/2015 - 14:45",
    "gameHomeTeam": "Everton",
    "gameScore": "3 - 1"
}