{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-02-26 - 22-45 Inter 1 - 3 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:12",
            "label": "whistle",
            "description": "Paolo Tagliavento is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 48:35",
            "label": "",
            "description": "Eder (Inter) wastes a great scoring opportunity! He receives a precise lofted cross inside the box and sends a quick shot to the right side of the goal, but he can't get the power to direct it past Wojciech Szczesny, who keeps it out."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "corner",
            "description": "Inter take the corner, but their hopes of scoring a goal end with nice clearance by the defence."
        },
        {
            "gameTime": "2 - 47:38",
            "label": "",
            "description": "Danilo D'Ambrosio (Inter) serves up a nice cross, but the defence clears the danger. The linesman makes the right call and Inter will have a corner."
        },
        {
            "gameTime": "2 - 45:03",
            "label": "funfact",
            "description": "The current number of corner kicks is 10:2."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 43:36",
            "label": "substitution",
            "description": "We are about to witness a substitution. Thomas Vermaelen (AS Roma) is replacing Bruno Peres."
        },
        {
            "gameTime": "2 - 42:31",
            "label": "",
            "description": "Mauro Icardi (Inter) is quickest inside the box and leaps to connect with the resulting set piece. He produces a fine header, but it floats just over the crossbar."
        },
        {
            "gameTime": "2 - 42:25",
            "label": "corner",
            "description": "Gabriel (Inter) is about to take a corner kick."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "soccer-ball",
            "description": "Goal! Diego Perotti (AS Roma) slams home the penalty with a precise low shot into the bottom right corner."
        },
        {
            "gameTime": "2 - 39:49",
            "label": "",
            "description": "Diego Perotti (AS Roma) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 39:39",
            "label": "penalty",
            "description": "Poor challenge! Gary Medel (Inter) is penalised for tripping and Paolo Tagliavento blows his whistle. PENALTY AWARDED to AS Roma!"
        },
        {
            "gameTime": "2 - 38:41",
            "label": "substitution",
            "description": "Here comes a substitution. Leandro Paredes (AS Roma) is brought on as a substitute for Daniele De Rossi."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "y-card",
            "description": "The whistle blows and Federico Fazio (AS Roma) is booked for an infringement."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "y-card",
            "description": "The referee shows the yellow card to Jeison Murillo (Inter)."
        },
        {
            "gameTime": "2 - 35:59",
            "label": "soccer-ball",
            "description": "Goal! Ivan Perisic feeds Mauro Icardi (Inter), who taps the ball into an empty net. He makes it 1:2."
        },
        {
            "gameTime": "2 - 34:48",
            "label": "substitution",
            "description": "Stefano Pioli has decided to introduce fresh legs, with Ever Banega (Inter) replacing Joao Mario."
        },
        {
            "gameTime": "2 - 34:17",
            "label": "",
            "description": "Federico Fazio (AS Roma) wastes a great chance as he climbs high around the penalty spot to connect with a cross from the resulting free kick. He produces a header which goes just over the crossbar."
        },
        {
            "gameTime": "2 - 32:10",
            "label": "",
            "description": "Ivan Perisic (Inter) swings a cross into the box, but it's far too close to Wojciech Szczesny, who smothers the ball."
        },
        {
            "gameTime": "2 - 29:59",
            "label": "substitution",
            "description": "That will be all from Antonio Candreva who is being replaced by the fresh legs of Gabriel (Inter)."
        },
        {
            "gameTime": "2 - 28:33",
            "label": "corner",
            "description": "Antonio Candreva (Inter) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 28:19",
            "label": "",
            "description": "Antonio Candreva (Inter) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 27:48",
            "label": "",
            "description": "Diego Perotti swings the cross over. Edin Dzeko (AS Roma) gets his head to it but it goes just wide of the right post."
        },
        {
            "gameTime": "2 - 26:46",
            "label": "corner",
            "description": "Inter didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 26:30",
            "label": "",
            "description": "Antonio Candreva (Inter) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "2 - 25:55",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Diego Perotti (AS Roma) is coming onto the pitch as Mohamed Salah cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 25:30",
            "label": "",
            "description": "Roberto Gagliardini (Inter) was close to scoring after he unleashed a powerful shot which went a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 25:03",
            "label": "",
            "description": "Ivan Perisic (Inter) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 23:14",
            "label": "corner",
            "description": "Joao Mario (Inter) sends the corner into the box, but Wojciech Szczesny intercepts it and averts the threat."
        },
        {
            "gameTime": "2 - 20:43",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) sends a chip pass into the box, but Samir Handanovic is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 19:52",
            "label": "",
            "description": "A pass from Antonio Candreva (Inter) is intercepted by Wojciech Szczesny and the move breaks down."
        },
        {
            "gameTime": "2 - 19:12",
            "label": "",
            "description": "Mauro Icardi (Inter) gets himself into a promising goalscoring position, but he blazes the ball high over the crossbar."
        },
        {
            "gameTime": "2 - 18:24",
            "label": "",
            "description": "Kevin Strootman (AS Roma) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 17:45",
            "label": "",
            "description": "Edin Dzeko (AS Roma) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "2 - 17:04",
            "label": "",
            "description": "Antonio Candreva (Inter) takes the chance to have an effort at goal from inside the box but misses to the right of the target."
        },
        {
            "gameTime": "2 - 13:49",
            "label": "",
            "description": "Eder (Inter) was close to scoring after he unleashed a powerful shot which went a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 10:38",
            "label": "soccer-ball",
            "description": "Radja Nainggolan (AS Roma) struck from medium range, curling the ball into the top left corner. What a hit! Pure magic."
        },
        {
            "gameTime": "2 - 09:28",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Marcelo Brozovic will be replaced by Eder (Inter)."
        },
        {
            "gameTime": "2 - 05:04",
            "label": "corner",
            "description": "The resulting set piece from Inter is comfortably intercepted by one of the defending players."
        },
        {
            "gameTime": "2 - 04:47",
            "label": "",
            "description": "Ivan Perisic (Inter) gathers a nice lofted pass deep inside the box and attempts to put the ball into roof of the net, but his shot is deflected away by one of the defending players. The ball goes behind for a corner. Inter will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 03:40",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) plays a through ball but overhits it."
        },
        {
            "gameTime": "2 - 03:27",
            "label": "corner",
            "description": "A quickly taken corner by Inter."
        },
        {
            "gameTime": "2 - 02:49",
            "label": "",
            "description": "The goalkeeper pulls off a great save to deny Antonio Candreva (Inter), whose good effort would probably have ended inside the bottom right corner of the net. Corner kick. Inter will have an opportunity."
        },
        {
            "gameTime": "2 - 00:48",
            "label": "",
            "description": "Joao Mario (Inter) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:06",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:35",
            "label": "corner",
            "description": "Inter have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "1 - 45:06",
            "label": "",
            "description": "Marcelo Brozovic (Inter) is unlucky with a goal bound effort from the edge of the box. Some classy goalkeeping by Wojciech Szczesny stops the ball out of the bottom right corner. The ball is out of play. Inter win a corner kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 43:59",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the right post."
        },
        {
            "gameTime": "1 - 42:49",
            "label": "",
            "description": "Mohamed Salah (AS Roma) commits a foul and Paolo Tagliavento immediately signals a free kick."
        },
        {
            "gameTime": "1 - 41:47",
            "label": "",
            "description": "Mauro Icardi (Inter) shows good awareness inside the box to meet a delightful cross from the free kick. He fails to direct the ball into the net as it flies narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 41:40",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) will take a corner kick."
        },
        {
            "gameTime": "1 - 41:06",
            "label": "",
            "description": "Antonio Candreva (Inter) sends the ball into the box from the side of the pitch, but his cross is blocked. The referee points to the corner flag and Inter will take a corner."
        },
        {
            "gameTime": "1 - 40:43",
            "label": "",
            "description": "Joao Mario (Inter) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 39:58",
            "label": "y-card",
            "description": "Daniele De Rossi (AS Roma) is awarded a yellow card for his behaviour."
        },
        {
            "gameTime": "1 - 37:53",
            "label": "",
            "description": "Antonio Candreva (Inter) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 36:23",
            "label": "corner",
            "description": "The corner from Mohamed Salah (AS Roma) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 35:49",
            "label": "",
            "description": "That didn't go as planned! Edin Dzeko (AS Roma) tried his luck from the edge of the box, but his effort towards the bottom right corner was too weak to get past Samir Handanovic, who easily kept it out. It will be a corner kick for AS Roma."
        },
        {
            "gameTime": "1 - 35:09",
            "label": "",
            "description": "Paolo Tagliavento blows the whistle, Radja Nainggolan (AS Roma) is penalised for a foul."
        },
        {
            "gameTime": "1 - 31:11",
            "label": "",
            "description": "Wojciech Szczesny (AS Roma) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 29:46",
            "label": "",
            "description": "Mauro Icardi (Inter) tries to latch onto a through ball, but it's too long."
        },
        {
            "gameTime": "1 - 27:13",
            "label": "",
            "description": "Mohamed Salah (AS Roma) has an effort from the edge of the area, but he skies the ball over the top."
        },
        {
            "gameTime": "1 - 25:39",
            "label": "",
            "description": "Kevin Strootman (AS Roma) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "1 - 23:02",
            "label": "",
            "description": "A cross into the box from Juan Jesus (AS Roma) is cleared."
        },
        {
            "gameTime": "1 - 21:47",
            "label": "",
            "description": "Juan Jesus (AS Roma) is penalised for a foul. Paolo Tagliavento had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 20:52",
            "label": "",
            "description": "Edin Dzeko (AS Roma) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 17:59",
            "label": "corner",
            "description": "The resulting corner from Daniele De Rossi (AS Roma) comes to nothing."
        },
        {
            "gameTime": "1 - 17:23",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Daniele De Rossi (AS Roma), was easily dealt with by one of the defenders. AS Roma force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 16:46",
            "label": "",
            "description": "Rough tackle by Jeison Murillo (Inter). The referee blows his whistle for a foul. AS Roma have a free kick."
        },
        {
            "gameTime": "1 - 15:37",
            "label": "",
            "description": "Roberto Gagliardini (Inter) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 14:21",
            "label": "",
            "description": "Mauro Icardi (Inter) is picked out by one of his teammates with a brilliant long range cross, but he doesn't control the ball well and the defence eliminates the danger without any problem."
        },
        {
            "gameTime": "1 - 12:57",
            "label": "corner",
            "description": "Inter take the corner, but their hopes of scoring a goal end with nice clearance by the defence."
        },
        {
            "gameTime": "1 - 12:31",
            "label": "",
            "description": "Joao Mario (Inter) tested Wojciech Szczesny with a strike from just outside the box, but the effort is saved. Inter will take a corner kick."
        },
        {
            "gameTime": "1 - 11:50",
            "label": "soccer-ball",
            "description": "Radja Nainggolan (AS Roma) finds some space on the edge of the penalty box and smashes the ball into the top right corner! What a beauty!"
        },
        {
            "gameTime": "1 - 07:52",
            "label": "",
            "description": "Samir Handanovic can hear the fans clapping for his superb goalkeeping after he magnificently stops the close range effort from Mohamed Salah (AS Roma). The ball would have probably ended up in the bottom left corner."
        },
        {
            "gameTime": "1 - 07:06",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) connects with the ball from the resulting indirect free kick, but his effort is well blocked."
        },
        {
            "gameTime": "1 - 05:46",
            "label": "y-card",
            "description": "Ivan Perisic (Inter) is punished with a yellow card for violating the rules."
        },
        {
            "gameTime": "1 - 02:34",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) sends a teasing cross into the area, but Samir Handanovic intercepts the ball."
        },
        {
            "gameTime": "1 - 01:22",
            "label": "",
            "description": "The foul by Edin Dzeko (AS Roma) was seen by Paolo Tagliavento who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paolo Tagliavento is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko looks sharp as he's the top goal scorer for AS Roma with 20 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Inter have already 10 home victories this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Paolo Tagliavento is looking at his watch and immediately ends this match."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "26/02/2017 - 22:45",
    "gameHomeTeam": "Inter",
    "gameScore": "1 - 3"
}