{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-02-19 - 17-00 Chievo 1 - 3 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:00",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 46:04",
            "label": "",
            "description": "Emanuele Giaccherini (Napoli) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the right post."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:39",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Emanuele Giaccherini (Napoli) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "2 - 42:57",
            "label": "",
            "description": "Massimo Gobbi (Chievo) threw away a promising scoring opportunity. He received a fine cross inside the 6 yard box, but his shot missed the target close to the right post."
        },
        {
            "gameTime": "2 - 41:33",
            "label": "corner",
            "description": "Valter Birsa (Chievo) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 41:11",
            "label": "",
            "description": "Decent spell from Chievo here and they keep the pressure on until one of the defending players steps in. The linesman makes the right call and Chievo will have a corner."
        },
        {
            "gameTime": "2 - 39:48",
            "label": "corner",
            "description": "The corner from Valter Birsa (Chievo) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 39:35",
            "label": "",
            "description": "Perparim Hetemaj (Chievo) sends the ball into the box from the side of the pitch, but his cross is blocked. Corner kick. Chievo will have an opportunity."
        },
        {
            "gameTime": "2 - 38:04",
            "label": "",
            "description": "Jonathan de Guzman (Chievo) was too forceful with his tackle and Massimiliano Irrati interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 35:07",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Serge Gakpe (Chievo), whose instinctive shot towards goal flashes inches wide of the right post."
        },
        {
            "gameTime": "2 - 33:19",
            "label": "substitution",
            "description": "Substitution. Emanuele Giaccherini (Napoli) in, Lorenzo Insigne out."
        },
        {
            "gameTime": "2 - 32:19",
            "label": "",
            "description": "Mariano Izco (Chievo) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball is off of the pitch and it's a goal kick for Napoli."
        },
        {
            "gameTime": "2 - 31:40",
            "label": "",
            "description": "Mariano Izco (Chievo) is the first to arrive to a rebound inside the penalty area and unleashes a quick low strike towards the middle of the goal that beats the keeper. One of the defenders, however, makes a superb goal line clearance."
        },
        {
            "gameTime": "2 - 30:24",
            "label": "corner",
            "description": "Valter Birsa (Chievo) takes a short corner kick."
        },
        {
            "gameTime": "2 - 29:37",
            "label": "",
            "description": "Massimo Gobbi (Chievo) fails to send a pass into the box as his effort is cut out. Chievo force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 26:54",
            "label": "soccer-ball",
            "description": "Brilliant finish! Riccardo Meggiorini (Chievo) perfectly collected a pass on the edge of the penalty area from Jonathan de Guzman, then produced a nice strike into the bottom left corner. The score is 1:3."
        },
        {
            "gameTime": "2 - 25:49",
            "label": "substitution",
            "description": "Maurizio Sarri decides to make a substitution. Leonardo Pavoletti will be replaced by Arkadiusz Milik (Napoli)."
        },
        {
            "gameTime": "2 - 25:33",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Serge Gakpe (Chievo) is coming onto the pitch as Roberto Inglese cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 25:08",
            "label": "corner",
            "description": "The resulting corner from Valter Birsa (Chievo) is cleared by the defence."
        },
        {
            "gameTime": "2 - 24:35",
            "label": "",
            "description": "A lofted cross from Valter Birsa (Chievo) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The referee and one of his assistants signal for a corner kick to Chievo."
        },
        {
            "gameTime": "2 - 23:58",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) trips an opposition player and Massimiliano Irrati signals a foul."
        },
        {
            "gameTime": "2 - 23:17",
            "label": "",
            "description": "Marek Hamsik (Napoli) is penalised for holding. Massimiliano Irrati signals a set piece."
        },
        {
            "gameTime": "2 - 21:57",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 21:29",
            "label": "",
            "description": "Jose Callejon (Napoli) races towards goal but the defender gets back well to make a challenge. It will be a corner kick for Napoli."
        },
        {
            "gameTime": "2 - 19:10",
            "label": "",
            "description": "Marek Hamsik (Napoli) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 17:41",
            "label": "substitution",
            "description": "Substitution. Lucas Castro makes way for Jonathan de Guzman (Chievo)."
        },
        {
            "gameTime": "2 - 16:04",
            "label": "",
            "description": "The Napoli players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 12:42",
            "label": "soccer-ball",
            "description": "Lorenzo Insigne passes to Piotr Zielinski (Napoli), who collects the ball and unleashes a terrific shot from the edge of the box. His effort goes into the bottom right corner. Fabulous goal! The score is 0:3."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "",
            "description": "Piotr Zielinski (Napoli) received a pass and didn't think long what to do with it. He fired a powerful long range shot which went painfully close to the bar."
        },
        {
            "gameTime": "2 - 10:10",
            "label": "",
            "description": "A player from Napoli commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "2 - 08:50",
            "label": "y-card",
            "description": "Fabrizio Cacciatore (Chievo) picks up a yellow card for an infringement."
        },
        {
            "gameTime": "2 - 07:10",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) tries his luck with a long range effort after receiving a precise pass. It goes to the right side of the goal, but Stefano Sorrentino has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 06:26",
            "label": "",
            "description": "Jorginho (Napoli) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 06:02",
            "label": "",
            "description": "Massimo Gobbi (Chievo) fouls an opponent. At least that's what referee Massimiliano Irrati signals. Napoli earn a free kick."
        },
        {
            "gameTime": "2 - 04:11",
            "label": "",
            "description": "Roberto Inglese (Chievo) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 03:34",
            "label": "",
            "description": "The game is interrupted as Leonardo Pavoletti (Napoli) is flagged offside."
        },
        {
            "gameTime": "2 - 02:18",
            "label": "",
            "description": "Roberto Inglese (Chievo) reacts well to latch onto a rebound inside the box, but his shot is well blocked."
        },
        {
            "gameTime": "2 - 01:58",
            "label": "corner",
            "description": "The resulting corner from Valter Birsa (Chievo) is cleared."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "",
            "description": "Massimo Gobbi (Chievo) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The referee blows his whistle, Chievo are awarded a corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Here is a change after the half time break. Ivan Radovanovic (Chievo) is replaced by Riccardo Meggiorini."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:39",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:38",
            "label": "injury",
            "description": "Kalidou Koulibaly (Napoli) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 43:26",
            "label": "",
            "description": "Stefano Sorrentino blocks Lorenzo Insigne (Napoli)'s effort from the edge of the box."
        },
        {
            "gameTime": "1 - 42:35",
            "label": "corner",
            "description": "The corner from Valter Birsa (Chievo) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 42:10",
            "label": "",
            "description": "Valter Birsa (Chievo) crosses the ball forward but it is intercepted. The ball is out of play and the linesman points at the corner flag. Corner to Chievo."
        },
        {
            "gameTime": "1 - 41:30",
            "label": "substitution",
            "description": "Maurizio Sarri is forced to make a change. Allan is unable to continue due to injury, Piotr Zielinski (Napoli) comes on."
        },
        {
            "gameTime": "1 - 40:42",
            "label": "injury",
            "description": "Allan (Napoli) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 39:37",
            "label": "",
            "description": "Fabrizio Cacciatore (Chievo) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 37:48",
            "label": "soccer-ball",
            "description": "Goal! Marek Hamsik (Napoli) fires the rebound inside the left post after the ball breaks to him in the box. The score is 0:2."
        },
        {
            "gameTime": "1 - 35:54",
            "label": "",
            "description": "Jose Callejon races towards the box before laying off to Jorginho (Napoli), who picks it up but blazes a shot well over the bar from the edge of the box."
        },
        {
            "gameTime": "1 - 34:38",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Faouzi Ghoulam (Napoli) takes it short."
        },
        {
            "gameTime": "1 - 34:21",
            "label": "",
            "description": "Elseid Hysaj (Napoli) breaks into the penalty area but his shot is blocked. The referee signals a corner kick to Napoli."
        },
        {
            "gameTime": "1 - 30:57",
            "label": "soccer-ball",
            "description": "A good lofted pass from Elseid Hysaj finds Lorenzo Insigne (Napoli) on the edge of the area. He collects the ball and rips in a wonderful shot which ends up inside the right post. The score is now 0:1."
        },
        {
            "gameTime": "1 - 29:12",
            "label": "",
            "description": "Allan (Napoli) covers his face with his hands after wasting a promising chance. He takes the rebound on the edge of the box but blazes the ball high over the crossbar."
        },
        {
            "gameTime": "1 - 27:53",
            "label": "",
            "description": "Roberto Inglese (Chievo) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the left side of the net, but Pepe Reina leaps like a salmon to deny him."
        },
        {
            "gameTime": "1 - 26:16",
            "label": "corner",
            "description": "Jose Callejon (Napoli) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 25:51",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety. Napoli earn a corner."
        },
        {
            "gameTime": "1 - 21:58",
            "label": "",
            "description": "Jose Callejon (Napoli) holds his head in his hands after wasting a promising chance. He latches onto a rebound, creates some space for himself and fires the ball from the edge of the box into the stands."
        },
        {
            "gameTime": "1 - 20:20",
            "label": "",
            "description": "Jorginho (Napoli) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "1 - 17:50",
            "label": "",
            "description": "Napoli players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "1 - 14:49",
            "label": "",
            "description": "Roberto Inglese (Chievo) is adjudged offside."
        },
        {
            "gameTime": "1 - 14:32",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) sends a teasing cross into the area, but Stefano Sorrentino intercepts the ball."
        },
        {
            "gameTime": "1 - 12:07",
            "label": "",
            "description": "Leonardo Pavoletti (Napoli) latches on to an accurate cross on the edge of the penalty box and sends the ball towards goal, but it's too easy for the keeper."
        },
        {
            "gameTime": "1 - 11:14",
            "label": "",
            "description": "Jose Callejon (Napoli) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him."
        },
        {
            "gameTime": "1 - 09:46",
            "label": "",
            "description": "Some patient build up play from Napoli as they look to unlock the defence."
        },
        {
            "gameTime": "1 - 06:17",
            "label": "",
            "description": "What a chance to score from the free kick by Lorenzo Insigne (Napoli). He unleashed a sharp shot that sailed just wide of the right post."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "",
            "description": "Alessandro Gamberini (Chievo) trips an opponent with a slide tackle. Massimiliano Irrati stops the game and he could give him a card, but eventually decides on just a warning. Napoli will take a free kick."
        },
        {
            "gameTime": "1 - 04:07",
            "label": "",
            "description": "Massimiliano Irrati blows his whistle after Nikola Maksimovic (Napoli) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 03:25",
            "label": "corner",
            "description": "The corner from Jose Callejon (Napoli) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 02:52",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner kick but the ball only finds the head of an opponent. Good work from Napoli as they win a corner."
        },
        {
            "gameTime": "1 - 02:03",
            "label": "",
            "description": "Allan (Napoli) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. Now Napoli have a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Napoli will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Massimiliano Irrati."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli haven't lost in their last 13 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Valter Birsa from Chievo is in good form this season, he's assisted in a goal 7 times."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's the end of the match."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "19/02/2017 - 17:00",
    "gameHomeTeam": "Chievo",
    "gameScore": "1 - 3"
}