{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-04-02 - 21-45 Napoli 1 - 1 Juventus/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:06",
            "label": "whistle",
            "description": "That's it for today, Daniele Orsato has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 41:42",
            "label": "substitution",
            "description": "Massimiliano Allegri has decided to introduce fresh legs, with Tomas Rincon (Juventus) replacing Miralem Pjanic."
        },
        {
            "gameTime": "2 - 40:14",
            "label": "funfact",
            "description": "Total attempts – 17:4."
        },
        {
            "gameTime": "2 - 34:02",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Paulo Dybala (Juventus) is coming onto the pitch as Claudio Marchisio cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 33:41",
            "label": "substitution",
            "description": "Today's match ends for Ivan Strinic who will be replaced by Faouzi Ghoulam (Napoli)."
        },
        {
            "gameTime": "2 - 30:58",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Marek Hamsik as he is replaced by Marko Rog (Napoli)."
        },
        {
            "gameTime": "2 - 22:07",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to make a change. Piotr Zielinski (Napoli) replaces Allan."
        },
        {
            "gameTime": "2 - 16:00",
            "label": "substitution",
            "description": "It's time for a substitution. Juan Cuadrado (Juventus) comes on in place of Mario Lemina."
        },
        {
            "gameTime": "2 - 14:11",
            "label": "soccer-ball",
            "description": "Goal Marek Hamsik (Napoli)! Marek Hamsik (Napoli) was put through by Dries Mertens and he showed brilliant composure inside the box to fire into the right side of the net. 1:1."
        },
        {
            "gameTime": "2 - 11:06",
            "label": "",
            "description": "Jose Callejon (Napoli) has a goal ruled out for offside!"
        },
        {
            "gameTime": "2 - 08:16",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "",
            "description": "Dries Mertens (Napoli) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "Daniele Orsato has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "1 - 43:48",
            "label": "corner",
            "description": "The corner from Jose Callejon (Napoli) is intercepted by Gianluigi Buffon."
        },
        {
            "gameTime": "1 - 40:08",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the right post."
        },
        {
            "gameTime": "1 - 38:16",
            "label": "corner",
            "description": "Jorginho (Napoli) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 38:01",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The referee and one of his assistants signal for a corner kick to Napoli."
        },
        {
            "gameTime": "1 - 36:35",
            "label": "y-card",
            "description": "Lorenzo Insigne (Napoli) attempts to discuss the decision with Daniele Orsato, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "1 - 33:36",
            "label": "",
            "description": "Dries Mertens (Napoli) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Gianluigi Buffon was alert and the score remained the same."
        },
        {
            "gameTime": "1 - 31:01",
            "label": "",
            "description": "Dries Mertens (Napoli) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the right post."
        },
        {
            "gameTime": "1 - 29:49",
            "label": "",
            "description": "The Napoli players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "1 - 23:04",
            "label": "corner",
            "description": "Miralem Pjanic (Juventus) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 21:37",
            "label": "",
            "description": "Dries Mertens (Napoli) handles the ball inside the box."
        },
        {
            "gameTime": "1 - 21:12",
            "label": "corner",
            "description": "Jorginho (Napoli) will take the corner."
        },
        {
            "gameTime": "1 - 19:29",
            "label": "",
            "description": "Some patient build up play from Napoli as they look to unlock the defence."
        },
        {
            "gameTime": "1 - 15:23",
            "label": "corner",
            "description": "Miralem Pjanic (Juventus) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 15:07",
            "label": "",
            "description": "Gonzalo Higuain (Juventus) creates himself some space and attempts to put the ball into the box. However, the defender gets an important foot in to clear. Juventus have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 13:38",
            "label": "corner",
            "description": "Jose Callejon (Napoli) swings in the corner, but the goalkeeper does a brilliant job to intercept the effort."
        },
        {
            "gameTime": "1 - 10:04",
            "label": "corner",
            "description": "Jose Callejon (Napoli) swings in a cross from the corner, but Gianluigi Buffon reads it well and gathers the ball."
        },
        {
            "gameTime": "1 - 06:37",
            "label": "soccer-ball",
            "description": "Goal Sami Khedira (Juventus)! Sami Khedira (Juventus) was put through by Miralem Pjanic and he showed brilliant composure to tuck it home from inside the box. 0:1."
        },
        {
            "gameTime": "1 - 03:58",
            "label": "",
            "description": "The ball is cleared after Kwadwo Asamoah (Juventus) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 01:22",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Juventus will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Daniele Orsato."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Juventus have not lost for 15 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "From a total of 36 games that Napoli played there were 25 matches with over 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last 7 Napoli matches finished without a draw."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's it for today, Daniele Orsato has blown his whistle and the game is over."
        }
    ],
    "gameAwayTeam": "Juventus",
    "gameDate": "02/04/2017 - 21:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "1 - 1"
}