{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2015-2016/2015-09-12 - 17-00 Crystal Palace 0 - 1 Manchester City/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. It was a very tight match, with not much between the two teams. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 50:46",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 50:00",
            "label": "",
            "description": "Jesus Navas (Manchester City) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "2 - 49:39",
            "label": "",
            "description": "One of the players from Manchester City times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 49:08",
            "label": "",
            "description": "Brede Hangeland (Crystal Palace) is adjudged offside."
        },
        {
            "gameTime": "2 - 48:52",
            "label": "substitution",
            "description": "Substitution. Martin Demichelis (Manchester City) on for Samir Nasri."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) sends a promising through ball, but the defence is alert and cuts out the pass. The referee signals a corner kick to Manchester City."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 5 min. of added time."
        },
        {
            "gameTime": "2 - 44:59",
            "label": "soccer-ball",
            "description": "Goal 0:1! Kelechi Iheanacho (Manchester City) taps home from close range after the rebound fell kindly into his path."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "",
            "description": "Samir Nasri (Manchester City) drills a low shot from the edge of the box after a brilliant solo effort. The ball heads towards the left post, but the goalkeeper denies him with a fantastic save."
        },
        {
            "gameTime": "2 - 44:00",
            "label": "substitution",
            "description": "Substitution. Wilfried Bony makes way for Kelechi Iheanacho (Manchester City)."
        },
        {
            "gameTime": "2 - 43:09",
            "label": "",
            "description": "Dwight Gayle (Crystal Palace) gets on the end of a cross from Wilfried Zaha, but his shot goes a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 40:58",
            "label": "",
            "description": "The free kick into the penalty area from Yohan Cabaye (Crystal Palace) is cleared."
        },
        {
            "gameTime": "2 - 40:32",
            "label": "",
            "description": "Mike Jones blows his whistle for a foul after Vincent Kompany (Manchester City) hacks down one of his opponents. Crystal Palace are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 38:57",
            "label": "",
            "description": "Wilfried Zaha finds some space and receives a very precise long pass from Pape Souare (Crystal Palace)."
        },
        {
            "gameTime": "2 - 38:15",
            "label": "attendance",
            "description": "The attendance is 25167."
        },
        {
            "gameTime": "2 - 37:30",
            "label": "substitution",
            "description": "Jason Puncheon is substituted due to injury. Alan Pardew gives a chance to Chung Yong Lee (Crystal Palace)."
        },
        {
            "gameTime": "2 - 36:12",
            "label": "injury",
            "description": "The game is interrupted now, Jason Puncheon (Crystal Palace) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 35:39",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Eliaquim Mangala (Manchester City) was quite harsh and Mike Jones didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 35:02",
            "label": "",
            "description": "The free kick is delivered by Aleksandar Kolarov (Manchester City) but it's not one of his best and is easily cleared."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "substitution",
            "description": "Alan Pardew has decided to substitute Yannick Bolasie and he is replaced by Mile Jedinak (Crystal Palace)."
        },
        {
            "gameTime": "2 - 33:54",
            "label": "",
            "description": "It looks like Wilfried Zaha (Crystal Palace) saw red with that tackle. Mike Jones won't tolerate such behaviour on the pitch and blows for a foul. Manchester City will take a free kick."
        },
        {
            "gameTime": "2 - 32:30",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Kevin De Bruyne (Manchester City) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 31:30",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) found some space to play in a lofted pass, but he looks disappointed as none of his teammates managed to connect with it. The ball is off of the pitch and it's a goal kick for Crystal Palace."
        },
        {
            "gameTime": "2 - 30:47",
            "label": "",
            "description": "Yohan Cabaye (Crystal Palace) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 30:24",
            "label": "",
            "description": "Mike Jones blows his whistle after Kevin De Bruyne (Manchester City) brings one of his opponents down with a strong tackle. Crystal Palace win a free kick."
        },
        {
            "gameTime": "2 - 28:36",
            "label": "",
            "description": "Wilfried Bony passes to Yaya Toure (Manchester City), but he produces a wild shot from the edge of the box which goes well wide of the right post."
        },
        {
            "gameTime": "2 - 27:39",
            "label": "",
            "description": "Samir Nasri (Manchester City) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 26:21",
            "label": "injury",
            "description": "Samir Nasri (Manchester City) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 25:56",
            "label": "y-card",
            "description": "Brede Hangeland (Crystal Palace) is booked after bringing down an opponent. Mike Jones had an easy decision to make."
        },
        {
            "gameTime": "2 - 24:13",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) attempts to convert a lofted cross as he jumps high and heads the ball to the right side of the goal. Joe Hart shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net."
        },
        {
            "gameTime": "2 - 23:51",
            "label": "y-card",
            "description": "Samir Nasri (Manchester City) shouldn't be surprised it's a yellow from the ref, who cooled the situation down well."
        },
        {
            "gameTime": "2 - 22:42",
            "label": "",
            "description": "Dwight Gayle (Crystal Palace) robs an opponent of the ball and explodes in anger when Mike Jones blows for a foul."
        },
        {
            "gameTime": "2 - 22:17",
            "label": "substitution",
            "description": "It's time for a substitution. Dwight Gayle (Crystal Palace) comes on in place of Bakary Sako."
        },
        {
            "gameTime": "2 - 21:34",
            "label": "",
            "description": "Samir Nasri (Manchester City) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity!"
        },
        {
            "gameTime": "2 - 21:04",
            "label": "",
            "description": "Yaya Toure (Manchester City) races towards goal but the defender gets back well to make a challenge. The ball is out of play. Manchester City will take a throw in."
        },
        {
            "gameTime": "2 - 19:17",
            "label": "",
            "description": "Fernandinho (Manchester City) receives a precise pass from his teammate and sends a snap shot from the edge of the box. However, his aim was a bit off and the ball flies just narrowly over the crossbar."
        },
        {
            "gameTime": "2 - 18:58",
            "label": "",
            "description": "The referee blows his whistle as Alex McCarthy (Crystal Palace) was too aggressive in his challenge."
        },
        {
            "gameTime": "2 - 18:26",
            "label": "corner",
            "description": "Alex McCarthy leaps to intercept the corner kick from Samir Nasri (Manchester City)."
        },
        {
            "gameTime": "2 - 17:49",
            "label": "",
            "description": "Yaya Toure (Manchester City) sends a cross into the box, but the opposition's defence clears the ball to safety. Now Manchester City have a corner."
        },
        {
            "gameTime": "2 - 17:13",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Jesus Navas (Manchester City), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "",
            "description": "Bacary Sagna (Manchester City) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Manchester City force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 16:05",
            "label": "corner",
            "description": "Yohan Cabaye (Crystal Palace) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 15:48",
            "label": "",
            "description": "Martin Kelly (Crystal Palace) crosses the ball into the box, but one of the defending players averts the threat. The ball is out of play. A goal scoring opportunity from a corner for Crystal Palace."
        },
        {
            "gameTime": "2 - 11:50",
            "label": "",
            "description": "Mike Jones blows his whistle as Wilfried Zaha (Crystal Palace) used excessive force in the tackle during an attack."
        },
        {
            "gameTime": "2 - 10:51",
            "label": "",
            "description": "Vincent Kompany (Manchester City) connects with the corner but his looping header goes well over."
        },
        {
            "gameTime": "2 - 10:39",
            "label": "corner",
            "description": "The referee awards a corner and Kevin De Bruyne (Manchester City) goes over to take it."
        },
        {
            "gameTime": "2 - 10:25",
            "label": "",
            "description": "The ball is cleared after Kevin De Bruyne (Manchester City) attempted to dribble past an opposing player. The referee blows his whistle, Manchester City are awarded a corner kick."
        },
        {
            "gameTime": "2 - 09:45",
            "label": "",
            "description": "Samir Nasri (Manchester City) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 09:01",
            "label": "",
            "description": "Yaya Toure (Manchester City) produces a long range cannon of a shot after a nice pass. The ball heads towards the bottom right corner, but is stopped by a great save from Alex McCarthy and the score remains the same."
        },
        {
            "gameTime": "2 - 05:34",
            "label": "",
            "description": "Jesus Navas (Manchester City) and his stunning dribble! He zig zags through the defence and gets in front of the keeper. He faints to shoot and then suddenly strikes goalwards, but his effort misses the target by a whisker. Very unlucky for Jesus Navas (Manchester City). This could have been a legendary goal."
        },
        {
            "gameTime": "2 - 05:22",
            "label": "corner",
            "description": "The corner kick from Bakary Sako (Crystal Palace) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "",
            "description": "Yannick Bolasie (Crystal Palace) picks up a pass and hits the ball towards the bottom right corner, but he can't generate enough power to trouble Joe Hart. The ball is out of play. Crystal Palace will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 04:10",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) receives a reproachful look from Yaya Toure. He latches on to his pass, but the effort from the edge of the box sails high over the crossbar."
        },
        {
            "gameTime": "2 - 02:39",
            "label": "",
            "description": "Manchester City slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "2 - 01:26",
            "label": "",
            "description": "Pape Souare (Crystal Palace) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 49:59",
            "label": "",
            "description": "We have seen a few chances and nice movements, but the overall impression of the game is rather average and not hugely entertaining. Neither team has really been able to control the flow of the game. The home team makes a lot of passes and attempts to maintain possession. The same goes for the away side."
        },
        {
            "gameTime": "1 - 49:08",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 48:12",
            "label": "",
            "description": "Wilfried Zaha swings in an inviting cross that finds Yannick Bolasie (Crystal Palace). He doesn't take advantage as his effort goes harmlessly over the crossbar."
        },
        {
            "gameTime": "1 - 47:37",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) receives the ball and fires a first time shot from long range. His brilliant effort towards the middle of the goal is blocked by Alex McCarthy, who pulls off a stunning save!"
        },
        {
            "gameTime": "1 - 47:01",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 4 min. of added time."
        },
        {
            "gameTime": "1 - 44:35",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Jason Puncheon (Crystal Palace) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "1 - 42:55",
            "label": "",
            "description": "The linesman raises his flag. Wilfried Zaha (Crystal Palace) is adjudged offside."
        },
        {
            "gameTime": "1 - 41:57",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) fails to pick a body out in the box with an over hit cross to the back post."
        },
        {
            "gameTime": "1 - 41:17",
            "label": "",
            "description": "Samir Nasri (Manchester City) and Wilfried Bony try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "1 - 40:10",
            "label": "",
            "description": "Brede Hangeland (Crystal Palace) commits a rough challenge and Mike Jones blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 38:30",
            "label": "",
            "description": "Yohan Cabaye (Crystal Palace) attempts to slip the ball through the defence, but is unable to find any of his teammates. The ball goes out of play and Manchester City will have a goal kick."
        },
        {
            "gameTime": "1 - 38:09",
            "label": "",
            "description": "Jesus Navas (Manchester City) creates some space for himself to pick up a pass on the edge of the box and unleashes a decent strike which goes a whisker over the crossbar."
        },
        {
            "gameTime": "1 - 36:48",
            "label": "",
            "description": "The linesman raises his flag for offside before Wilfried Zaha (Crystal Palace) heads on."
        },
        {
            "gameTime": "1 - 36:09",
            "label": "",
            "description": "Yohan Cabaye (Crystal Palace) picks out Bakary Sako with a fine lofted pass, but the latter wasn't able to create some space to get into shooting range."
        },
        {
            "gameTime": "1 - 34:07",
            "label": "",
            "description": "Samir Nasri (Manchester City) sends over a free kick from long range but the defence is alert."
        },
        {
            "gameTime": "1 - 33:47",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) trips an opposition player and Mike Jones signals a foul. Manchester City get a free kick."
        },
        {
            "gameTime": "1 - 32:45",
            "label": "",
            "description": "Wilfried Bony (Manchester City) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 31:49",
            "label": "",
            "description": "Wilfried Bony (Manchester City) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Alex McCarthy guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 31:07",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) receives a pass and fires a shot in from long range, but it's blocked."
        },
        {
            "gameTime": "1 - 29:04",
            "label": "",
            "description": "A crossfield pass from Jason Puncheon (Crystal Palace) fails to find any of his teammates. The ball is off of the pitch and it's a goal kick for Manchester City."
        },
        {
            "gameTime": "1 - 26:49",
            "label": "",
            "description": "A cross from the free kick is whipped in by Jason Puncheon (Crystal Palace), but one of the defenders steps in and averts the threat."
        },
        {
            "gameTime": "1 - 25:43",
            "label": "y-card",
            "description": "Mike Jones shows a yellow card to Yaya Toure (Manchester City) for his blatant foul."
        },
        {
            "gameTime": "1 - 24:41",
            "label": "substitution",
            "description": "Manuel Pellegrini is forced to make a change. Sergio Aguero is unable to continue due to injury, Kevin De Bruyne (Manchester City) comes on."
        },
        {
            "gameTime": "1 - 22:34",
            "label": "",
            "description": "Yaya Toure (Manchester City) plays a long ball to Jesus Navas, but the defence is well organised and manages to get it clear."
        },
        {
            "gameTime": "1 - 21:32",
            "label": "",
            "description": "Jason Puncheon (Crystal Palace) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 21:20",
            "label": "",
            "description": "Sergio Aguero (Manchester City) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 21:07",
            "label": "",
            "description": "Yannick Bolasie (Crystal Palace) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 18:26",
            "label": "injury",
            "description": "The game is interrupted now, Sergio Aguero (Manchester City) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 17:38",
            "label": "y-card",
            "description": "Scott Dann (Crystal Palace) is shown a yellow card by the referee for a bad sliding tackle on an opponent."
        },
        {
            "gameTime": "1 - 17:10",
            "label": "",
            "description": "Yannick Bolasie (Crystal Palace) sends a sweet pass into the box towards Yohan Cabaye. He looks to dribble past an opposing player, but fails and the ball is cleared."
        },
        {
            "gameTime": "1 - 15:44",
            "label": "",
            "description": "Jesus Navas (Manchester City) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The ball is behind the touchline and Manchester City will take a throw in."
        },
        {
            "gameTime": "1 - 14:21",
            "label": "",
            "description": "Bacary Sagna (Manchester City) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 12:53",
            "label": "",
            "description": "Pape Souare (Crystal Palace) fouls an opponent. At least that's what referee Mike Jones signals."
        },
        {
            "gameTime": "1 - 10:56",
            "label": "",
            "description": "Pape Souare (Crystal Palace) has a sight of goal and shoots from long range but his ambitious effort flies just wide of the right post."
        },
        {
            "gameTime": "1 - 10:38",
            "label": "",
            "description": "A cross, provided by Jason Puncheon (Crystal Palace), caused no threat to the opposition's defence as the ball was cleared out of danger."
        },
        {
            "gameTime": "1 - 10:26",
            "label": "",
            "description": "Bacary Sagna (Manchester City) trips an opponent with a slide tackle. Mike Jones stops the game and he could give him a card, but eventually decides on just a warning. It's a free kick to Crystal Palace, but it's in no position for a direct shot on goal."
        },
        {
            "gameTime": "1 - 08:38",
            "label": "",
            "description": "Rough tackle by Yaya Toure (Manchester City). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 07:22",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) whips a promising cross into the box, but the opposition's defence intercepts the ball. The ball is out of play. Manchester City will have a throw in."
        },
        {
            "gameTime": "1 - 06:42",
            "label": "",
            "description": "Yannick Bolasie (Crystal Palace) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the left side of the net, but Joe Hart leaps like a salmon to deny him."
        },
        {
            "gameTime": "1 - 05:41",
            "label": "",
            "description": "James McArthur (Crystal Palace) makes a reckless foul in order to win the ball from his opponent. Mike Jones has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 04:44",
            "label": "",
            "description": "Wilfried Bony (Manchester City) rises above the opponent's defence and heads a precise cross towards the top right corner. The effort, however, is blocked by Alex McCarthy, who pulls off a stunning save!"
        },
        {
            "gameTime": "1 - 03:43",
            "label": "corner",
            "description": "Wilfried Zaha (Crystal Palace) fails to deliver a decent cross from the corner and the ball goes out of play."
        },
        {
            "gameTime": "1 - 03:11",
            "label": "",
            "description": "Yohan Cabaye (Crystal Palace) strikes a bullet of a shot towards goal from distance and forces the goalkeeper to make a good save. The ball goes behind for a corner. Crystal Palace will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 02:37",
            "label": "corner",
            "description": "Bakary Sako (Crystal Palace) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 02:22",
            "label": "",
            "description": "A cross from Yannick Bolasie (Crystal Palace) fails to reach the box as the defence clears the ball away to safety. Crystal Palace win a corner."
        },
        {
            "gameTime": "1 - 01:29",
            "label": "",
            "description": "Ambitious effort from Yannick Bolasie (Crystal Palace). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well over the bar."
        },
        {
            "gameTime": "1 - 00:51",
            "label": "",
            "description": "Martin Kelly (Crystal Palace) sends a long ball in, but Joe Hart comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Manchester City will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Mike Jones."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Manchester City have completed big transfer and they have signed Nicolas Hernan Otamendi (Valencia), Kevin De Bruyne (Wolfsburg)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "71 That's the number of goals Manchester City have scored so far in this competition. They are doing really well."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Crystal Palace have 42 points so far in the competition, of which 21 from away games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. It was a very tight match, with not much between the two teams. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Manchester City",
    "gameDate": "12/09/2015 - 17:00",
    "gameHomeTeam": "Crystal Palace",
    "gameScore": "0 - 1"
}