{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2014-2015/2015-02-14 - 20-00 Real Madrid 2 - 0 Dep. La Coruna/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. The home team had more of the game. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 49:55",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 49:47",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is caught offside!"
        },
        {
            "gameTime": "2 - 47:42",
            "label": "",
            "description": "The ball is out of play. Real Madrid will have a throw in."
        },
        {
            "gameTime": "2 - 46:33",
            "label": "",
            "description": "Isaac Cuenca (Dep. La Coruna) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 45:54",
            "label": "",
            "description": "The Real Madrid players are exchanging some short passes."
        },
        {
            "gameTime": "2 - 45:32",
            "label": "time",
            "description": "5 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:09",
            "label": "injury",
            "description": "Marcelo (Real Madrid) picks up an injury."
        },
        {
            "gameTime": "2 - 43:35",
            "label": "y-card",
            "description": "Javier Estrada Fernandez shows a yellow card to Laure (Dep. La Coruna) for his blatant foul."
        },
        {
            "gameTime": "2 - 42:53",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) strikes a shot towards goal from the edge of the penalty box, but it flies just wide of the left post."
        },
        {
            "gameTime": "2 - 41:09",
            "label": "",
            "description": "The linesman raises his flag. Cristiano Ronaldo (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "2 - 40:01",
            "label": "substitution",
            "description": "Carlo Ancelotti has decided to introduce fresh legs, with Jese (Real Madrid) replacing Karim Benzema."
        },
        {
            "gameTime": "2 - 39:58",
            "label": "substitution",
            "description": "The manager makes a subsitution with Juan Dominguez (Dep. La Coruna) coming on for Celso Borges."
        },
        {
            "gameTime": "2 - 37:59",
            "label": "y-card",
            "description": "Alberto Lopo (Dep. La Coruna) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent."
        },
        {
            "gameTime": "2 - 36:59",
            "label": "",
            "description": "A precise low pass is received by Gareth Bale (Real Madrid), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well over the bar."
        },
        {
            "gameTime": "2 - 36:31",
            "label": "",
            "description": "A player from Real Madrid pulled an opponent down, forcing the referee to blow his whistle. Dep. La Coruna will take a free kick."
        },
        {
            "gameTime": "2 - 34:46",
            "label": "substitution",
            "description": "Carlo Ancelotti decides to make a substitution. Isco will be replaced by Daniel Carvajal (Real Madrid)."
        },
        {
            "gameTime": "2 - 34:02",
            "label": "",
            "description": "Dep. La Coruna are awarded a free kick near the side line and the players make their way into the box for the inevitable cross."
        },
        {
            "gameTime": "2 - 33:53",
            "label": "substitution",
            "description": "Substitution. Haris Medunjanin (Dep. La Coruna) in, Lucas Perez out."
        },
        {
            "gameTime": "2 - 32:55",
            "label": "y-card",
            "description": "Alvaro Arbeloa (Real Madrid) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 32:29",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempted to send a defence splitting pass into space where Karim Benzema was lurking. It could have put him one on one with the goalkeeper, but one of the defending players somehow manages to avert the threat."
        },
        {
            "gameTime": "2 - 32:06",
            "label": "",
            "description": "The ball is behind the touchline and Dep. La Coruna will take a throw in."
        },
        {
            "gameTime": "2 - 31:11",
            "label": "",
            "description": "Real Madrid enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 29:32",
            "label": "injury",
            "description": "Ivan Cavaleiro (Dep. La Coruna) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "soccer-ball",
            "description": "Goal! Cristiano Ronaldo gets to the ball, slips Karim Benzema (Real Madrid) into the area and he scores with a delightful chipped finish to make it 2:0."
        },
        {
            "gameTime": "2 - 26:48",
            "label": "",
            "description": "A player from Dep. La Coruna brings down an opponent and commits a foul."
        },
        {
            "gameTime": "2 - 25:50",
            "label": "substitution",
            "description": "Substitution. Lucas Silva (Real Madrid) has come on for Asier Illarramendi."
        },
        {
            "gameTime": "2 - 25:01",
            "label": "",
            "description": "Alex Bergantinos (Dep. La Coruna) pulls the jersey of one of the opposition players and Javier Estrada Fernandez blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 24:03",
            "label": "corner",
            "description": "Celso Borges (Dep. La Coruna) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 23:49",
            "label": "",
            "description": "Laure (Dep. La Coruna) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. Good work from Dep. La Coruna as they win a corner."
        },
        {
            "gameTime": "2 - 21:58",
            "label": "",
            "description": "Asier Illarramendi (Real Madrid) brings an opponent down and Javier Estrada Fernandez interrupts the game. It's a free kick to Dep. La Coruna, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "2 - 21:14",
            "label": "",
            "description": "What a wasted opportunity by Karim Benzema (Real Madrid)! He creates some space for himself inside the penalty box and unleashes a decent strike towards the bottom right corner, but Fabricio makes an astonishing save to thwart him."
        },
        {
            "gameTime": "2 - 19:50",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Oriol Riera trots off the pitch and is replaced by Helder Costa (Dep. La Coruna)."
        },
        {
            "gameTime": "2 - 19:09",
            "label": "",
            "description": "Dep. La Coruna are ruled offside."
        },
        {
            "gameTime": "2 - 17:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes a direct free kick."
        },
        {
            "gameTime": "2 - 15:50",
            "label": "y-card",
            "description": "What was Manuel Pablo (Dep. La Coruna) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "2 - 14:27",
            "label": "",
            "description": "Good movement by Celso Borges (Dep. La Coruna), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "2 - 10:28",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Real Madrid."
        },
        {
            "gameTime": "2 - 08:57",
            "label": "",
            "description": "Gareth Bale (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 08:02",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) latches on to a fine cross from the resulting corner kick and slams the ball in from close range. He should have aimed better, however, as he hit his own teammate in front of him."
        },
        {
            "gameTime": "2 - 07:07",
            "label": "corner",
            "description": "Ivan Cavaleiro (Dep. La Coruna) prepares to take a corner kick."
        },
        {
            "gameTime": "2 - 06:26",
            "label": "",
            "description": "Isaac Cuenca (Dep. La Coruna) produces a dangerous lofted cross into the box which is intercepted. It will be a corner kick for Dep. La Coruna."
        },
        {
            "gameTime": "2 - 05:24",
            "label": "injury",
            "description": "The game is interrupted now, picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 04:51",
            "label": "corner",
            "description": "The resulting corner from Ivan Cavaleiro (Dep. La Coruna) comes to nothing."
        },
        {
            "gameTime": "2 - 04:11",
            "label": "",
            "description": "POST! Celso Borges (Dep. La Coruna) unleashes a thunderous effort from the edge of the box and the ball crashes against the right post. What a strike that was!"
        },
        {
            "gameTime": "2 - 02:55",
            "label": "y-card",
            "description": "Nacho (Real Madrid) is yellow carded for breaking the rules of the game."
        },
        {
            "gameTime": "2 - 02:05",
            "label": "",
            "description": "Isco (Real Madrid) sends a long ball in, but Fabri comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 00:40",
            "label": "",
            "description": "One of the Dep. La Coruna players tripped an opponent and conceded a foul."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Javier Estrada Fernandez blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Today's clash hasn't been that attractive up to now, but it hasn't been a total borefest. There have been a few nice movements for both sides. The hosts are enjoying a clear advantage over the opposition. Both teams are attempting to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 45:16",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "y-card",
            "description": "Celso Borges (Dep. La Coruna) is booked by the referee."
        },
        {
            "gameTime": "1 - 44:10",
            "label": "corner",
            "description": "The resulting corner, taken by Ivan Cavaleiro (Dep. La Coruna), comes to nothing."
        },
        {
            "gameTime": "1 - 44:00",
            "label": "",
            "description": "Oriol Riera (Dep. La Coruna) crosses the ball into the box, but one of the defending players averts the threat. Dep. La Coruna earn a corner."
        },
        {
            "gameTime": "1 - 42:47",
            "label": "corner",
            "description": "Fabricio comes off his line to intercept the corner from Toni Kroos (Real Madrid)."
        },
        {
            "gameTime": "1 - 42:18",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries to send a pass but it's blocked. Now Real Madrid have a corner."
        },
        {
            "gameTime": "1 - 41:35",
            "label": "",
            "description": "Gareth Bale (Real Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 39:43",
            "label": "",
            "description": "Celso Borges (Dep. La Coruna) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 38:29",
            "label": "",
            "description": "Gareth Bale (Real Madrid) whips the ball into the box and Cristiano Ronaldo takes a perfect touch to control it, but one of the defenders does well to intercept."
        },
        {
            "gameTime": "1 - 37:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) was trying to get to the ball but clattered into the legs of the opponent as well. Javier Estrada Fernandez blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 35:38",
            "label": "",
            "description": "Gareth Bale clips a neat ball into the box towards Cristiano Ronaldo (Real Madrid), whose header from the centre of the box goes narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 34:43",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) brings his opponent down with a tackle and Javier Estrada Fernandez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 33:42",
            "label": "",
            "description": "What a goal scoring opportunity! Cristiano Ronaldo (Real Madrid) makes a good run into the box to meet a cross and fires the ball in on goal, but the shot is amazingly blocked by a defender."
        },
        {
            "gameTime": "1 - 33:18",
            "label": "",
            "description": "A player from Dep. La Coruna pulled an opponent down, forcing the referee to blow his whistle. There is a free kick near the sideline to Real Madrid."
        },
        {
            "gameTime": "1 - 32:55",
            "label": "",
            "description": "Real Madrid seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 31:18",
            "label": "",
            "description": "One of the Real Madrid players unfairly tackled his opponent and conceded a foul."
        },
        {
            "gameTime": "1 - 31:01",
            "label": "",
            "description": "Isaac Cuenca (Dep. La Coruna) horribly skewed a first time shot from the edge of the box and sent the ball way wide of the right post."
        },
        {
            "gameTime": "1 - 29:41",
            "label": "",
            "description": "Karim Benzema (Real Madrid) reacts well and displays good awareness inside the box to get on the end of the resulting corner kick. He fails to direct the ball into the net as it flies narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 29:40",
            "label": "corner",
            "description": "The ball is out of play. A goal scoring opportunity from a corner for Real Madrid."
        },
        {
            "gameTime": "1 - 28:40",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The ball goes out for a corner. Real Madrid can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 28:05",
            "label": "",
            "description": "Isaac Cuenca (Dep. La Coruna) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 26:47",
            "label": "",
            "description": "A player from Real Madrid takes his opponent down, the referee blows his whistle for a foul. Dep. La Coruna earn a free kick."
        },
        {
            "gameTime": "1 - 26:40",
            "label": "",
            "description": "The Real Madrid players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 24:33",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes the resulting free kick from outside the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "1 - 21:58",
            "label": "soccer-ball",
            "description": "Goal 1:0! Isco (Real Madrid) tries his luck from the edge of the box and scores with an accurate shot inside the right post. Alvaro Arbeloa provided an assist for the goal."
        },
        {
            "gameTime": "1 - 21:31",
            "label": "",
            "description": "Oriol Riera (Dep. La Coruna) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 21:10",
            "label": "",
            "description": "Karim Benzema (Real Madrid) tackles a bit over zealously and Javier Estrada Fernandez blows for a foul."
        },
        {
            "gameTime": "1 - 20:31",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 20:09",
            "label": "",
            "description": "Karim Benzema (Real Madrid) meets a cross just outside the area and gets in a strike from a promising position, but the shot is blocked by the defender. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 19:36",
            "label": "",
            "description": "Karim Benzema (Real Madrid) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "1 - 18:02",
            "label": "",
            "description": "It should have been a goal! Gareth Bale (Real Madrid) fires a rocket of a shot but it only hits the crossbar!"
        },
        {
            "gameTime": "1 - 17:45",
            "label": "",
            "description": "The linesman signals a throw in for Real Madrid."
        },
        {
            "gameTime": "1 - 16:23",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) brings his opponent down. Javier Estrada Fernandez has a clear sight of it and blows his whistle for a foul. Real Madrid will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 15:09",
            "label": "corner",
            "description": "Celso Borges (Dep. La Coruna) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 15:01",
            "label": "",
            "description": "Isaac Cuenca (Dep. La Coruna) whips the ball into the penalty area, but one of the defenders is alert and spanks it away. Dep. La Coruna get a corner."
        },
        {
            "gameTime": "1 - 14:16",
            "label": "",
            "description": "Dep. La Coruna couldn't find the way to score from a long range free kick as Fabri (Dep. La Coruna) leaped high and intercepted a cross."
        },
        {
            "gameTime": "1 - 13:55",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Toni Kroos (Real Madrid), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 13:51",
            "label": "",
            "description": "Javier Estrada Fernandez blows his whistle after Manuel Pablo (Dep. La Coruna) kicks an opponent's legs instead of the ball. A free kick to Real Madrid."
        },
        {
            "gameTime": "1 - 13:17",
            "label": "",
            "description": "What a great touch by Cristiano Ronaldo (Real Madrid)! He picks up a precise pass inside the box and immediately produces a shot towards the net. Unfortunately for him, his bullet only crashes against the crossbar."
        },
        {
            "gameTime": "1 - 11:49",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 11:15",
            "label": "",
            "description": "Gareth Bale (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball. The referee and his assistant both point at the corner flag. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 10:36",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) shoots from the edge of the penalty area. The ball travels towards the middle of the target, but Iker Casillas easily deals with the threat."
        },
        {
            "gameTime": "1 - 10:07",
            "label": "",
            "description": "A pass by Isco (Real Madrid) ends up in no man's land, and the attacking effort comes to an end. The ball is off of the pitch and it's a goal kick for Dep. La Coruna."
        },
        {
            "gameTime": "1 - 08:17",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a lofted pass from the side and shoots from around the penalty spot, but the ball flies slightly over, almost brushing the crossbar."
        },
        {
            "gameTime": "1 - 06:31",
            "label": "",
            "description": "Isaac Cuenca (Dep. La Coruna) has an effort on goal, but he misses to the right of the goal."
        },
        {
            "gameTime": "1 - 06:08",
            "label": "corner",
            "description": "Ivan Cavaleiro (Dep. La Coruna) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 05:47",
            "label": "",
            "description": "Ivan Cavaleiro (Dep. La Coruna) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Iker Casillas to get hold of the ball. The referee signals a corner kick to Dep. La Coruna."
        },
        {
            "gameTime": "1 - 04:25",
            "label": "",
            "description": "Oriol Riera (Dep. La Coruna) goes for goal but he blazes his shot well over the top."
        },
        {
            "gameTime": "1 - 03:47",
            "label": "",
            "description": "The ball has crossed the sideline. Dep. La Coruna are taking a throw in."
        },
        {
            "gameTime": "1 - 02:38",
            "label": "",
            "description": "Gareth Bale (Real Madrid) switches the play to Marcelo and their attacking move continues."
        },
        {
            "gameTime": "1 - 01:53",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 01:25",
            "label": "",
            "description": "A cross into the box from Gareth Bale (Real Madrid) is cleared. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "1 - 00:34",
            "label": "",
            "description": "Real Madrid are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Javier Estrada Fernandez."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. The home team had more of the game. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Dep. La Coruna",
    "gameDate": "14/02/2015 - 20:00",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "2 - 0"
}