{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-11-27 - 22-45 Real Sociedad 1 - 1 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:05",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. Real Sociedad were the better team in today's clash. Both sides tried to combine well and to keep the ball at their feet."
        },
        {
            "gameTime": "2 - 49:04",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 48:00",
            "label": "y-card",
            "description": "Jordi Alba (Barcelona) is the one who receives a yellow card."
        },
        {
            "gameTime": "2 - 47:25",
            "label": "",
            "description": "Geronimo Rulli (Real Sociedad) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 45:56",
            "label": "injury",
            "description": "Geronimo Rulli (Real Sociedad) picks up an injury."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 44:16",
            "label": "",
            "description": "Esteban Granero (Real Sociedad) finds himself in a promising position to finish! He unleashes a poor shot which flies into the stands. What a poor effort that was!"
        },
        {
            "gameTime": "2 - 43:11",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by David Zurutuza (Real Sociedad) was quite harsh and Jesus Gil Manzano didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 42:42",
            "label": "",
            "description": "Esteban Granero (Real Sociedad) had a great opportunity from mid range. His powerful volley was directed towards the middle of the goal, but Marc Andre ter Stegen was alert and made an astonishing save!"
        },
        {
            "gameTime": "2 - 41:25",
            "label": "",
            "description": "Esteban Granero (Real Sociedad) takes a mid range shot, but it lacks accuracy and it goes way over the bar."
        },
        {
            "gameTime": "2 - 39:34",
            "label": "substitution",
            "description": "Substitution. Mikel Oyarzabal walks off the pitch and Esteban Granero (Real Sociedad) comes on as a substitute."
        },
        {
            "gameTime": "2 - 39:00",
            "label": "y-card",
            "description": "Denis Suarez (Barcelona) is booked after bringing down an opponent. Jesus Gil Manzano had an easy decision to make."
        },
        {
            "gameTime": "2 - 38:27",
            "label": "attendance",
            "description": "The attendance is 27756."
        },
        {
            "gameTime": "2 - 38:01",
            "label": "",
            "description": "Carlos Vela (Real Sociedad) wastes a promising chance! He tries his luck with a shot from mid range, but his effort hits the left post! A few inches to the right and it could have been a sweet goal!"
        },
        {
            "gameTime": "2 - 37:03",
            "label": "corner",
            "description": "Barcelona have a chance to score from a corner kick, but the ball is cleared by a defender."
        },
        {
            "gameTime": "2 - 36:12",
            "label": "",
            "description": "Denis Suarez (Barcelona) sends a sweet pass into the penalty area, but one of the defenders averts the danger. Barcelona force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 35:23",
            "label": "",
            "description": "Javier Mascherano (Barcelona) rises above the defence to meet a cross from the corner. His timing is good, but he directs his header just a few inches wide of the left post."
        },
        {
            "gameTime": "2 - 35:16",
            "label": "corner",
            "description": "The ball goes out of play and Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 30:55",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Juanmi (Real Sociedad) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "2 - 30:54",
            "label": "",
            "description": "Carlos Vela (Real Sociedad) gets a shot from the edge of the box, but it crashes against the crossbar!"
        },
        {
            "gameTime": "2 - 30:00",
            "label": "substitution",
            "description": "Here is a change. Da Silva Willian Jose is going off and Eusebio Sacristan gives the last tactical orders to Juanmi (Real Sociedad)."
        },
        {
            "gameTime": "2 - 29:42",
            "label": "",
            "description": "Barcelona are ruled offside."
        },
        {
            "gameTime": "2 - 26:48",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Xabi Prieto as he is replaced by Sergio Canales (Real Sociedad)."
        },
        {
            "gameTime": "2 - 19:27",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Luis Suarez (Barcelona) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "2 - 17:06",
            "label": "",
            "description": "One of the players from Real Sociedad times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 16:15",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows a yellow card to Carlos Martinez (Real Sociedad) for his blatant foul."
        },
        {
            "gameTime": "2 - 13:53",
            "label": "soccer-ball",
            "description": "Neymar produces a sweet pass and picks out Lionel Messi (Barcelona) inside the box. He quickly takes a shot which goes into the bottom right corner and leaves the goalkeeper helpless. He makes it 1:1!"
        },
        {
            "gameTime": "2 - 13:00",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "",
            "description": "Neymar (Barcelona) delivers a low pass into the box which is intercepted. The ball goes out of play. Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "2 - 09:40",
            "label": "y-card",
            "description": "Javier Mascherano (Barcelona) has tested the patience of referee Jesus Gil Manzano and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "soccer-ball",
            "description": "Da Silva Willian Jose (Real Sociedad) is first to latch onto the rebound near the penalty spot, and he produces a fantastic header which goes inside the left post."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "",
            "description": "Carlos Vela (Real Sociedad) runs with the ball towards the keeper and pulls the trigger from close range, but Marc Andre ter Stegen anticipates his intention and makes an amazing save to stop the shot going low into the middle of the target."
        },
        {
            "gameTime": "2 - 05:59",
            "label": "injury",
            "description": "Mikel Oyarzabal (Real Sociedad) picks up an injury."
        },
        {
            "gameTime": "2 - 05:37",
            "label": "",
            "description": "Gerard Pique (Barcelona) is flagged for offside."
        },
        {
            "gameTime": "2 - 05:00",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Neymar (Barcelona)."
        },
        {
            "gameTime": "2 - 04:59",
            "label": "",
            "description": "Neymar (Barcelona) stands over the free kick and opts to take it himself, sending it towards the left post only for Geronimo Rulli to dive and make a save. The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "",
            "description": "Raul Navas (Real Sociedad) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 01:00",
            "label": "substitution",
            "description": "Luis Enrique makes a switch. Denis Suarez (Barcelona) is coming on in place of Ivan Rakitic at the start of the second period."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We are watching a run of the mill game with only a few moments to ignite the crowd. The players surely can surely perform better, they just need to motivate themselves. It was a fairly one sided opening 45 minutes, with Real Sociedad much the better side better so far. Both sides are using the same slow build up play tactic."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:14",
            "label": "corner",
            "description": "Neymar (Barcelona) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:32",
            "label": "",
            "description": "Javier Mascherano (Barcelona) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort. The referee and one of his assistants signal for a corner kick to Barcelona."
        },
        {
            "gameTime": "1 - 44:26",
            "label": "corner",
            "description": "Corner kick. Barcelona will have an opportunity."
        },
        {
            "gameTime": "1 - 44:00",
            "label": "",
            "description": "Lionel Messi (Barcelona) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "1 - 41:18",
            "label": "",
            "description": "A player from Real Sociedad commits a rough challenge. Jesus Gil Manzano blows for a foul and keeps the game under control."
        },
        {
            "gameTime": "1 - 38:54",
            "label": "corner",
            "description": "Real Sociedad quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "1 - 38:50",
            "label": "",
            "description": "Mikel Oyarzabal (Real Sociedad) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play. Real Sociedad win a corner kick."
        },
        {
            "gameTime": "1 - 38:00",
            "label": "injury",
            "description": "Looks like Gerard Pique (Barcelona) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 37:12",
            "label": "",
            "description": "Flag up against Luis Suarez (Barcelona). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 36:12",
            "label": "",
            "description": "Xabi Prieto (Real Sociedad) hits a first time volley towards goal from the edge of the penalty box, but his effort is way off target and the ball goes well wide of the right post."
        },
        {
            "gameTime": "1 - 35:59",
            "label": "corner",
            "description": "The corner kick from Carlos Vela (Real Sociedad) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "",
            "description": "Carlos Martinez (Real Sociedad) fails to send a pass into the box as his effort is cut out. It will be a corner kick for Real Sociedad."
        },
        {
            "gameTime": "1 - 34:40",
            "label": "",
            "description": "Jordi Alba (Barcelona) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 34:22",
            "label": "corner",
            "description": "Carlos Vela (Real Sociedad) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 34:06",
            "label": "",
            "description": "A raking crossfield pass from David Zurutuza (Real Sociedad) lacks accuracy and the opposition gain possession. The ball is out of play and the linesman points at the corner flag. Corner to Real Sociedad."
        },
        {
            "gameTime": "1 - 33:01",
            "label": "injury",
            "description": "Jordi Alba (Barcelona) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 30:12",
            "label": "",
            "description": "Carlos Vela (Real Sociedad) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 25:21",
            "label": "",
            "description": "David Zurutuza (Real Sociedad) is adjudged offside."
        },
        {
            "gameTime": "1 - 23:14",
            "label": "corner",
            "description": "Real Sociedad take a short corner instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 22:41",
            "label": "",
            "description": "Carlos Martinez (Real Sociedad) looks to break free, but an opposing player clears the ball away. Real Sociedad force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 21:52",
            "label": "y-card",
            "description": "The whistle is blown for an infringement and Marc Andre ter Stegen (Barcelona) receives a yellow card!"
        },
        {
            "gameTime": "1 - 21:32",
            "label": "corner",
            "description": "Carlos Vela (Real Sociedad) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 21:18",
            "label": "",
            "description": "Raul Navas (Real Sociedad) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession. The linesman points to the corner flag, Real Sociedad are going to take it."
        },
        {
            "gameTime": "1 - 20:27",
            "label": "",
            "description": "Inigo Martinez (Real Sociedad) has a good chance to score with a mid range attempt after collecting a pass. He aims for the bottom left corner, but he can't generate enough power to trouble Marc Andre ter Stegen."
        },
        {
            "gameTime": "1 - 18:49",
            "label": "",
            "description": "Carlos Vela (Real Sociedad) threw away a promising scoring opportunity. He received a fine cross inside the 6 yard box, but his shot missed the target close to the right post."
        },
        {
            "gameTime": "1 - 17:30",
            "label": "",
            "description": "Xabi Prieto (Real Sociedad) leaps high to meet a lofted pass inside the six yard box, but his header flies yards wide of the left post."
        },
        {
            "gameTime": "1 - 16:25",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 14:20",
            "label": "",
            "description": "Xabi Prieto (Real Sociedad) attempts to convert a lofted cross as he jumps high and heads the ball down to the middle of the goal. Marc Andre ter Stegen shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net."
        },
        {
            "gameTime": "1 - 14:10",
            "label": "corner",
            "description": "Carlos Vela (Real Sociedad) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 13:43",
            "label": "",
            "description": "Asier Illarramendi (Real Sociedad) sends a pass into the box, but his attempt is thwarted and cleared. The ball goes behind for a corner. Real Sociedad will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 13:18",
            "label": "",
            "description": "Andre Gomes (Barcelona) should know this behaviour is beyond the rules. He was too careless with his challenge and left Jesus Gil Manzano no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 10:40",
            "label": "",
            "description": "The game is interrupted as Luis Suarez (Barcelona) is flagged offside."
        },
        {
            "gameTime": "1 - 10:01",
            "label": "",
            "description": "Carlos Vela (Real Sociedad) is caught offside!"
        },
        {
            "gameTime": "1 - 09:26",
            "label": "corner",
            "description": "The resulting corner from Carlos Vela (Real Sociedad) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 09:15",
            "label": "",
            "description": "Carlos Martinez (Real Sociedad) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Real Sociedad get a corner."
        },
        {
            "gameTime": "1 - 05:02",
            "label": "corner",
            "description": "Carlos Vela (Real Sociedad) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 04:33",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Yuri Berchiche (Real Sociedad). The referee blows his whistle, Real Sociedad are awarded a corner kick."
        },
        {
            "gameTime": "1 - 03:44",
            "label": "",
            "description": "A player from Real Sociedad brings down an opponent and commits a foul."
        },
        {
            "gameTime": "1 - 01:28",
            "label": "",
            "description": "David Zurutuza (Real Sociedad) rises high to head a nice lofted cross towards the roof of the net. Unfortunately for him, his close range effort lacks pace and Marc Andre ter Stegen makes a comfortable save."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Sociedad will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jesus Gil Manzano is introduced as the referee for today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Barcelona have won 13 away matches this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Da Silva Willian Jose has already scored 9 goals and he is the top goal scorer for Real Sociedad in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. Real Sociedad were the better team in today's clash. Both sides tried to combine well and to keep the ball at their feet."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "27/11/2016 - 22:45",
    "gameHomeTeam": "Real Sociedad",
    "gameScore": "1 - 1"
}