{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-02-07 - 22-45 AS Roma 4 - 0 Fiorentina/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 44:50",
            "label": "whistle",
            "description": "That's it for today, Massimiliano Irrati has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 43:33",
            "label": "substitution",
            "description": "A substitution has been made. Radja Nainggolan is replaced by Clement Grenier (AS Roma)."
        },
        {
            "gameTime": "2 - 40:51",
            "label": "corner",
            "description": "Emerson (AS Roma) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "2 - 39:05",
            "label": "substitution",
            "description": "Luciano Spalletti prepares a substitution. Daniele De Rossi is replaced by Leandro Paredes (AS Roma)."
        },
        {
            "gameTime": "2 - 37:44",
            "label": "soccer-ball",
            "description": "Goal! It's a catastrophic error from the opponent which has gifted a chance to Edin Dzeko (AS Roma), who rolls the ball into the back of the net from close range. 4:0."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "substitution",
            "description": "Substitution. Francesco Totti (AS Roma) in, Stephan El Shaarawy out."
        },
        {
            "gameTime": "2 - 33:03",
            "label": "",
            "description": "What a miskick by Emerson (AS Roma). He smashes a volley from long distance that goes into the stands."
        },
        {
            "gameTime": "2 - 32:19",
            "label": "substitution",
            "description": "Here is a change. Federico Chiesa is going off and Paulo Sousa gives the last tactical orders to Sebastian Cristoforo (Fiorentina)."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "soccer-ball",
            "description": "Goal! Kevin Strootman produces a great pass that finds Radja Nainggolan (AS Roma) inside the penalty area, who takes advantage of the situation to rifle a shot low shot into the back of the net. 3:0."
        },
        {
            "gameTime": "2 - 28:52",
            "label": "substitution",
            "description": "The game has come to an end for Federico Bernardeschi. He has contributed as much as he could today. He will be replaced by the fresh legs of Cristian Tello (Fiorentina)."
        },
        {
            "gameTime": "2 - 28:29",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) leaps high deep inside the box to meet a beautiful cross from the free kick and attempts to score with a header. His effort is not accurate at all and goes well wide of the right post."
        },
        {
            "gameTime": "2 - 26:37",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 25:34",
            "label": "",
            "description": "What a great touch by Edin Dzeko (AS Roma) as he controls a fine pass into the box and takes a shot to the bottom left corner, but an opposing player makes a clearance. Great defending."
        },
        {
            "gameTime": "2 - 24:39",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) receives a precise pass on the edge of the box and bends his effort inches wide of the left post."
        },
        {
            "gameTime": "2 - 24:03",
            "label": "corner",
            "description": "Emerson (AS Roma) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 23:49",
            "label": "",
            "description": "Emerson (AS Roma) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee points to the corner flag. It's a corner to AS Roma."
        },
        {
            "gameTime": "2 - 22:41",
            "label": "",
            "description": "Edin Dzeko (AS Roma) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "2 - 19:52",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) attempts to score as he rises near the penalty spot and heads the ball to the middle of the goal. Ciprian Tatarusanu pulls off a comfortable save to stop the ball from hitting the net."
        },
        {
            "gameTime": "2 - 17:13",
            "label": "substitution",
            "description": "Here comes a substitution. Josip Ilicic (Fiorentina) is brought on as a substitute for Maximiliano Olivera."
        },
        {
            "gameTime": "2 - 15:56",
            "label": "",
            "description": "Milan Badelj (Fiorentina) pulls the jersey of one of the opposition players and Massimiliano Irrati blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 12:49",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Federico Fazio (AS Roma) rises high near the penalty spot to meet the free kick from Daniele De Rossi and plants a bullet header in off the right post. The score is now 2:0."
        },
        {
            "gameTime": "2 - 11:43",
            "label": "y-card",
            "description": "Gonzalo Rodriguez (Fiorentina) picks up a yellow card for a foul. A free kick is awarded to AS Roma."
        },
        {
            "gameTime": "2 - 10:32",
            "label": "y-card",
            "description": "Daniele De Rossi (AS Roma) sees a yellow card from Massimiliano Irrati after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 09:23",
            "label": "",
            "description": "The resulting free kick from Daniele De Rossi (AS Roma) ends up in the gloves of the keeper."
        },
        {
            "gameTime": "2 - 08:40",
            "label": "",
            "description": "Federico Chiesa (Fiorentina) clearly handles the ball, but he is surprised when the referee blows his whistle. AS Roma have a free kick."
        },
        {
            "gameTime": "2 - 05:45",
            "label": "",
            "description": "Federico Bernardeschi (Fiorentina) collects a pass and has an effort from distance which is blocked."
        },
        {
            "gameTime": "2 - 04:13",
            "label": "",
            "description": "Edin Dzeko (AS Roma) sends a sweet pass into the penalty area, but one of the defenders averts the danger. The ball has crossed the sideline. AS Roma are taking a throw in."
        },
        {
            "gameTime": "2 - 02:19",
            "label": "",
            "description": "Borja Valero (Fiorentina) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 43:14",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) gets on the end of the resulting set piece and sends in a snap shot from the edge of the box. However, it sails high over the bar."
        },
        {
            "gameTime": "1 - 43:04",
            "label": "corner",
            "description": "Bruno Peres (AS Roma) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 42:11",
            "label": "",
            "description": "Edin Dzeko (AS Roma) fails to score from the rebound as the goalkeeper stops his effort from hitting the net. The ball is out of play. AS Roma will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) decides to have a shot at goal from the free kick, but it hits the defensive wall."
        },
        {
            "gameTime": "1 - 41:00",
            "label": "y-card",
            "description": "The foul by Iglesias Borja Valero (Fiorentina) is worthy of a card and a yellow is duly shown by Massimiliano Irrati. AS Roma are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 38:46",
            "label": "soccer-ball",
            "description": "Goal! Daniele De Rossi produces a great pass that finds Edin Dzeko (AS Roma) inside the penalty area, who takes advantage of the situation to rifle a shot into the bottom left corner. 1:0."
        },
        {
            "gameTime": "1 - 36:46",
            "label": "",
            "description": "Gonzalo Rodriguez (Fiorentina) commits a foul after making a slide tackle on his opponent. AS Roma are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 35:00",
            "label": "y-card",
            "description": "Massimiliano Irrati shows a yellow card to Carlos Sanchez (Fiorentina) for a tough tackle."
        },
        {
            "gameTime": "1 - 32:28",
            "label": "corner",
            "description": "Emerson (AS Roma) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 32:05",
            "label": "",
            "description": "Emerson (AS Roma) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball goes out of play and AS Roma have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 30:58",
            "label": "",
            "description": "That was a nice football moment. Edin Dzeko (AS Roma) receives an amazing defence splitting low pass on the edge of the box and blasts the ball towards the bottom left corner. Ciprian Tatarusanu guesses his intention and dives superbly to deny him with a remarkable save!"
        },
        {
            "gameTime": "1 - 28:53",
            "label": "",
            "description": "Emerson (AS Roma) latches onto the ball in the penalty box and takes a first time effort that goes a couple of yards over the crossbar."
        },
        {
            "gameTime": "1 - 27:26",
            "label": "",
            "description": "Federico Bernardeschi (Fiorentina) skips perfectly past challenges but misdirects his shot from the edge of the box. The ball flies a few yards over the bar."
        },
        {
            "gameTime": "1 - 26:22",
            "label": "",
            "description": "Khouma Babacar (Fiorentina) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 25:39",
            "label": "corner",
            "description": "Federico Bernardeschi (Fiorentina) works the corner short."
        },
        {
            "gameTime": "1 - 25:21",
            "label": "",
            "description": "Maximiliano Olivera (Fiorentina) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The linesman points to the corner flag, Fiorentina are going to take it."
        },
        {
            "gameTime": "1 - 24:46",
            "label": "",
            "description": "Federico Chiesa (Fiorentina) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity!"
        },
        {
            "gameTime": "1 - 23:55",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Borja Valero (Fiorentina)."
        },
        {
            "gameTime": "1 - 23:35",
            "label": "",
            "description": "Maximiliano Olivera (Fiorentina) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety. Fiorentina have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 19:48",
            "label": "",
            "description": "Emerson (AS Roma) shoots after receiving a good pass. His effort from the edge of the box goes just wide of the left post."
        },
        {
            "gameTime": "1 - 18:00",
            "label": "y-card",
            "description": "A yellow card for a tackle by Kevin Strootman (AS Roma). Massimiliano Irrati doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 17:21",
            "label": "",
            "description": "Antonio Rudiger (AS Roma) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 15:51",
            "label": "",
            "description": "Kevin Strootman (AS Roma) gets on the ball and beats an opponent, but his run is stopped by the referee Massimiliano Irrati who sees an offensive foul. That's a free kick to Fiorentina."
        },
        {
            "gameTime": "1 - 14:00",
            "label": "",
            "description": "Federico Bernardeschi (Fiorentina) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 12:24",
            "label": "",
            "description": "Emerson (AS Roma) gets on the end of a pass on the edge of the area, but he drags his shot just wide of the right post. The ball is off of the pitch and it's a goal kick for Fiorentina."
        },
        {
            "gameTime": "1 - 10:19",
            "label": "corner",
            "description": "Emerson (AS Roma) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 09:53",
            "label": "",
            "description": "A pass into the penalty area from Kevin Strootman (AS Roma) is intercepted by the defence. AS Roma have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 08:21",
            "label": "corner",
            "description": "Iglesias Borja Valero (Fiorentina) launches a cross from the corner, but Wojciech Szczesny is alert to thwart the effort."
        },
        {
            "gameTime": "1 - 08:00",
            "label": "",
            "description": "Borja Valero (Fiorentina) creates himself some space on the edge of the box and unleashes a strong shot which is blocked by a defender. Good work from Fiorentina as they win a corner."
        },
        {
            "gameTime": "1 - 06:25",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) commits a rough challenge and Massimiliano Irrati blows his whistle for a foul. Fiorentina have a free kick."
        },
        {
            "gameTime": "1 - 04:42",
            "label": "",
            "description": "Edin Dzeko (AS Roma) is picked out by one of his teammates with a great cross, but his poor control allows the defence to clear and avert the threat."
        },
        {
            "gameTime": "1 - 02:24",
            "label": "",
            "description": "Matias Vecino (Fiorentina) attempts to feed Khouma Babacar with a chip pass, but Wojciech Szczesny reacts well and comes off his line to intercept."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Fiorentina will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Massimiliano Irrati."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text commentary, ladies and gentleman! The starting lineups will be announced very soon, so just sit back and get ready to enjoy the action."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Fiorentina are unbeaten over their past 5 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most prolific goal scorer for AS Roma is Edin Dzeko with 15 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "That's it for today, Massimiliano Irrati has blown his whistle and the game is over."
        }
    ],
    "gameAwayTeam": "Fiorentina",
    "gameDate": "07/02/2017 - 22:45",
    "gameHomeTeam": "AS Roma",
    "gameScore": "4 - 0"
}