{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2016-11-01 - 22-45 Manchester City 3 - 1 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We have seen a great game today, let's hope the players will be able to maintain these high levels of play in order to keep fans entertained in future games. The home side dominated this game. The home players pressed a lot which put the away team in difficult situations, but they still played their possession football."
        },
        {
            "gameTime": "2 - 48:05",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 46:47",
            "label": "corner",
            "description": "David Silva (Manchester City) works the corner short."
        },
        {
            "gameTime": "2 - 46:32",
            "label": "",
            "description": "Sergio Aguero (Manchester City) races towards goal but the defender gets back well to make a challenge. Manchester City force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 45:31",
            "label": "",
            "description": "Lionel Messi (Barcelona) finds himself some space around the penalty spot and leaps high to meet the free kick. He tries to put his header into the middle of the goal, but Wilfredo Caballero keeps it out."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:59",
            "label": "",
            "description": "Jesus Navas (Manchester City) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. Barcelona win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 44:44",
            "label": "",
            "description": "Fernando (Manchester City) is penalised for holding. Viktor Kassai signals a set piece."
        },
        {
            "gameTime": "2 - 44:11",
            "label": "",
            "description": "Luis Suarez (Barcelona) latched on to a cross on the edge of the box, but his strike isn't accurate at all and the ball goes way wide of the left post."
        },
        {
            "gameTime": "2 - 43:21",
            "label": "substitution",
            "description": "The game has come to an end for Kevin De Bruyne. He has contributed as much as he could today. He will be replaced by the fresh legs of Nolito (Manchester City)."
        },
        {
            "gameTime": "2 - 42:56",
            "label": "",
            "description": "Luis Suarez (Barcelona) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "2 - 41:14",
            "label": "",
            "description": "Luis Suarez (Barcelona) is caught offside!"
        },
        {
            "gameTime": "2 - 37:51",
            "label": "corner",
            "description": "Neymar (Barcelona) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 37:37",
            "label": "corner",
            "description": "Neymar (Barcelona) floats the ball in from the corner but it's intercepted. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 37:17",
            "label": "corner",
            "description": "Neymar (Barcelona) swings in a cross from the corner, but Wilfredo Caballero reads it well and gathers the ball. Barcelona will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 36:51",
            "label": "",
            "description": "Lionel Messi (Barcelona) unleashes a shot from a mid range free kick that crashes into the defensive wall. The opposition's goalkeeper set it up perfectly. The ball is out of play and the linesman points at the corner flag. Corner to Barcelona."
        },
        {
            "gameTime": "2 - 35:43",
            "label": "",
            "description": "Nicolas Otamendi (Manchester City) commits a rough challenge and Viktor Kassai blows his whistle for a foul. Barcelona have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 34:37",
            "label": "",
            "description": "Chance! Sergio Aguero (Manchester City) comes within inches of scoring after picking up a pass from David Silva, but his shot from inside the box flashes inches wide of the left post."
        },
        {
            "gameTime": "2 - 33:24",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 13:8."
        },
        {
            "gameTime": "2 - 32:32",
            "label": "",
            "description": "Neymar (Barcelona) almost finds himself in a very promising position, but he is flagged offside by the linesman."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "substitution",
            "description": "Substitution. Rafinha (Barcelona) receives a signal from the referee and is now allowed to enter the pitch as Andre Gomes walks off."
        },
        {
            "gameTime": "2 - 28:55",
            "label": "y-card",
            "description": "Sergio Busquets (Barcelona) attempts to discuss the decision with Viktor Kassai, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "2 - 28:53",
            "label": "soccer-ball",
            "description": "It's a goal! Sergio Aguero plays the ball to the feet of Ilkay Gundogan (Manchester City), who hits a tremendous first time shot into the middle of the net. The goalkeeper was unable to keep it out. 3:1."
        },
        {
            "gameTime": "2 - 28:20",
            "label": "corner",
            "description": "The corner from Neymar (Barcelona) is intercepted by Wilfredo Caballero."
        },
        {
            "gameTime": "2 - 27:55",
            "label": "",
            "description": "Lucas Digne (Barcelona) is unable to control an accurate defence splitting pass properly and one of the defending players reacts well to rob him of the ball. Barcelona force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 26:46",
            "label": "",
            "description": "Pablo Zabaleta (Manchester City) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 25:21",
            "label": "substitution",
            "description": "Here is a change. Raheem Sterling is going off and Pep Guardiola gives the last tactical orders to Jesus Navas (Manchester City)."
        },
        {
            "gameTime": "2 - 24:31",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Pablo Zabaleta (Manchester City). Viktor Kassai saw the sliding tackle and blows for a foul."
        },
        {
            "gameTime": "2 - 22:30",
            "label": "",
            "description": "Raheem Sterling (Manchester City) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 21:42",
            "label": "",
            "description": "Ilkay Gundogan plays a lovely pass into David Silva (Manchester City), but he can't find the target. His strike from inside the box goes narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 20:35",
            "label": "",
            "description": "What a chance that is! Kevin De Bruyne (Manchester City) wastes a huge opportunity as he receives a beautiful pass on the edge of the box and fires towards the net. Unfortunately for him, he only hits the right post!"
        },
        {
            "gameTime": "2 - 19:27",
            "label": "",
            "description": "Andre Gomes (Barcelona) latches on to a sweet pass on the edge of the box and unleashes a brilliant shot towards the goal, but he hits the crossbar!"
        },
        {
            "gameTime": "2 - 18:20",
            "label": "corner",
            "description": "Kevin De Bruyne (Manchester City) takes a short corner kick."
        },
        {
            "gameTime": "2 - 18:08",
            "label": "",
            "description": "Sergio Aguero (Manchester City) receives a sweet pass inside the box, but his effort on goal is blocked by the defender. The ball is out of play and Manchester City manage to earn a corner."
        },
        {
            "gameTime": "2 - 18:05",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) breaks past challenges inside the box, but puts too much pace on his pass to Kevin De Bruyne."
        },
        {
            "gameTime": "2 - 15:35",
            "label": "substitution",
            "description": "Substitution. Ivan Rakitic will be replaced by Arda Turan (Barcelona)."
        },
        {
            "gameTime": "2 - 15:19",
            "label": "",
            "description": "Luis Suarez (Barcelona) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 14:37",
            "label": "substitution",
            "description": "Fernandinho is substituted due to injury. Pep Guardiola gives a chance to Fernando (Manchester City)."
        },
        {
            "gameTime": "2 - 14:16",
            "label": "y-card",
            "description": "Aleksandar Kolarov (Manchester City) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "",
            "description": "A clumsy foul by Sergio Busquets (Barcelona) and Viktor Kassai blows his whistle."
        },
        {
            "gameTime": "2 - 11:22",
            "label": "",
            "description": "David Silva (Manchester City) will take the free kick. Sergio Aguero (Manchester City) launches himself at the ball from the free kick and produces a header which lacks accuracy, sending it just wide of the left post."
        },
        {
            "gameTime": "2 - 10:56",
            "label": "",
            "description": "Sergio Busquets (Barcelona) is penalised after knocking an opponent down. Manchester City have a free kick."
        },
        {
            "gameTime": "2 - 10:28",
            "label": "",
            "description": "Lionel Messi (Barcelona) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 09:45",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) gives away a foul for a clumsy challenge. Referee Viktor Kassai saw the whole situation."
        },
        {
            "gameTime": "2 - 08:07",
            "label": "",
            "description": "Raheem Sterling (Manchester City) clips a neat ball into the box in the direction of Nicolas Otamendi, but he can't get on the end of the pass."
        },
        {
            "gameTime": "2 - 07:44",
            "label": "corner",
            "description": "David Silva (Manchester City) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 07:20",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) sends over a free kick from long range but the defence is alert. The referee signals a corner kick to Manchester City."
        },
        {
            "gameTime": "2 - 07:04",
            "label": "",
            "description": "The game is interrupted, a clear handball by Lucas Digne (Barcelona)."
        },
        {
            "gameTime": "2 - 05:29",
            "label": "soccer-ball",
            "description": "Kevin De Bruyne (Manchester City) produced a howitzer of a shot from about 20 metres straight into the roof of the net. The goalkeeper didn’t expect such a great free kick."
        },
        {
            "gameTime": "2 - 04:15",
            "label": "",
            "description": "Viktor Kassai blows his whistle for a foul after Sergio Busquets (Barcelona) hacks down one of his opponents. Manchester City are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 03:46",
            "label": "",
            "description": "Lionel Messi (Barcelona) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 03:07",
            "label": "",
            "description": "Nicolas Otamendi (Manchester City) was trying to get to the ball but clattered into the legs of the opponent as well. Viktor Kassai blows his whistle for an infringement. Barcelona are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 02:03",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Sergio Aguero (Manchester City), whose instinctive shot towards goal flashes inches wide of the right post."
        },
        {
            "gameTime": "2 - 01:26",
            "label": "",
            "description": "CHANCE! Sergio Aguero finds Raheem Sterling (Manchester City) with a sweet pass, but he can't find the target as his effort from inside the box goes just wide of the right post!"
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. There wasn't any evident superiority by either side during the first half. The home side is creating their opportunities using lightning fast counter attacks. The tactic of the away side is slow build up play."
        },
        {
            "gameTime": "1 - 45:08",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:02",
            "label": "",
            "description": "David Silva (Manchester City) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 44:34",
            "label": "",
            "description": "Viktor Kassai has a clear sight and sees a foul from Ivan Rakitic (Barcelona). A free kick is awarded to Manchester City."
        },
        {
            "gameTime": "1 - 43:51",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by David Silva (Manchester City)."
        },
        {
            "gameTime": "1 - 43:41",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Pablo Zabaleta (Manchester City). The referee points to the corner flag. It's a corner to Manchester City."
        },
        {
            "gameTime": "1 - 42:56",
            "label": "",
            "description": "David Silva (Manchester City) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 42:17",
            "label": "",
            "description": "Lionel Messi (Barcelona) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "",
            "description": "David Silva slides a brilliant pass into Fernandinho (Manchester City), but his shot from inside the box goes a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 38:58",
            "label": "soccer-ball",
            "description": "Goal! Ilkay Gundogan (Manchester City) scores after an assist by Raheem Sterling that allowed him to tap in the ball into an empty net. The score is 1:1."
        },
        {
            "gameTime": "1 - 37:56",
            "label": "corner",
            "description": "Neymar (Barcelona) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 37:32",
            "label": "",
            "description": "Luis Suarez (Barcelona) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The referee blows his whistle, Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "1 - 37:13",
            "label": "corner",
            "description": "The resulting corner from Neymar (Barcelona) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 36:56",
            "label": "",
            "description": "Andre Gomes (Barcelona) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Now Barcelona have a corner."
        },
        {
            "gameTime": "1 - 35:28",
            "label": "",
            "description": "Luis Suarez (Barcelona) gets on the end of a pass on the edge of the box but his shot is blocked."
        },
        {
            "gameTime": "1 - 34:54",
            "label": "",
            "description": "Luis Suarez (Barcelona) meets a cross from Lionel Messi, but he cannot keep his header on target. It goes well wide of the right post."
        },
        {
            "gameTime": "1 - 34:28",
            "label": "",
            "description": "Andre Gomes (Barcelona) receives the ball from the set piece on the edge of the box, but fails to score because his shot is blocked."
        },
        {
            "gameTime": "1 - 33:59",
            "label": "",
            "description": "Lionel Messi (Barcelona) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 33:32",
            "label": "",
            "description": "Nicolas Otamendi (Manchester City) trips an opposition player and Viktor Kassai signals a foul. A free kick has been awarded to Barcelona."
        },
        {
            "gameTime": "1 - 33:14",
            "label": "",
            "description": "The ball is cleared after Neymar (Barcelona) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 32:00",
            "label": "",
            "description": "Kevin De Bruyne (Manchester City) crosses the ball from the free kick, but it goes out of play."
        },
        {
            "gameTime": "1 - 31:27",
            "label": "",
            "description": "Rough tackle by Luis Suarez (Barcelona). The referee blows his whistle for a foul. That's a free kick to Manchester City."
        },
        {
            "gameTime": "1 - 30:57",
            "label": "",
            "description": "Lionel Messi (Barcelona) was too fierce in his attempt to get the ball from his opponent and Viktor Kassai blows for a foul."
        },
        {
            "gameTime": "1 - 28:29",
            "label": "y-card",
            "description": "Neymar (Barcelona) makes an awful challenge on his opponent and can count himself very lucky that the referee didn't issue a red card."
        },
        {
            "gameTime": "1 - 28:11",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 27:28",
            "label": "",
            "description": "Neymar (Barcelona) zig zags his way into the box and directs a shot into the top left corner, but the goalkeeper pulls off a miraculous stop. The ball is out of play. Barcelona win a corner kick."
        },
        {
            "gameTime": "1 - 26:55",
            "label": "",
            "description": "Samuel Umtiti (Barcelona) brings his opponent down. Viktor Kassai has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 26:07",
            "label": "",
            "description": "Lionel Messi (Barcelona) plays a through ball but overhits it."
        },
        {
            "gameTime": "1 - 23:46",
            "label": "",
            "description": "Chance! Ilkay Gundogan (Manchester City) gets to the rebound on the edge of the box and smashes the ball towards goal, but Marc Andre ter Stegen is alert and makes a great save to deny him."
        },
        {
            "gameTime": "1 - 23:31",
            "label": "",
            "description": "Raheem Sterling (Manchester City) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "1 - 22:56",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Kevin De Bruyne (Manchester City) takes it short."
        },
        {
            "gameTime": "1 - 22:37",
            "label": "",
            "description": "Sergio Aguero (Manchester City) sends a pass into the box, but his attempt is thwarted and cleared. The referee points to the corner flag and Manchester City will take a corner."
        },
        {
            "gameTime": "1 - 20:58",
            "label": "soccer-ball",
            "description": "Goal! Neymar plays a pass to the feet of Lionel Messi (Barcelona), and he shoots into the bottom left corner from inside the box. It's 0:1."
        },
        {
            "gameTime": "1 - 20:24",
            "label": "",
            "description": "Sergio Aguero (Manchester City) finds himself in a promising position after receiving a precise pass. He pulls the trigger but only hits one of the opposition, who gets in the way of his effort."
        },
        {
            "gameTime": "1 - 19:47",
            "label": "y-card",
            "description": "Ivan Rakitic (Barcelona) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Viktor Kassai didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "1 - 18:50",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) makes an overly aggressive challenge and Viktor Kassai blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 16:34",
            "label": "",
            "description": "A pass from Raheem Sterling (Manchester City) is intercepted by Marc Andre ter Stegen and the move breaks down."
        },
        {
            "gameTime": "1 - 14:19",
            "label": "",
            "description": "David Silva (Manchester City) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 13:52",
            "label": "",
            "description": "Javier Mascherano (Barcelona) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again. A free kick has been awarded to Manchester City."
        },
        {
            "gameTime": "1 - 12:04",
            "label": "",
            "description": "Viktor Kassai blows his whistle and signals a foul after Pablo Zabaleta (Manchester City) brought his opponent down."
        },
        {
            "gameTime": "1 - 10:30",
            "label": "y-card",
            "description": "The whistle blows and Raheem Sterling (Manchester City) is booked for an infringement."
        },
        {
            "gameTime": "1 - 10:29",
            "label": "",
            "description": "Raheem Sterling (Manchester City) went to the ground quite willingly."
        },
        {
            "gameTime": "1 - 09:41",
            "label": "",
            "description": "That was a poorly executed free kick from long distance. Lionel Messi (Barcelona) was trying to produce a cross into the penalty area, but his effort sailed off the pitch. The ball goes out of play and Manchester City will have a goal kick."
        },
        {
            "gameTime": "1 - 08:55",
            "label": "",
            "description": "Fernandinho (Manchester City) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 08:14",
            "label": "",
            "description": "Viktor Kassai blows his whistle after Lucas Digne (Barcelona) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 06:24",
            "label": "",
            "description": "Lucas Digne (Barcelona) pulls the jersey of one of the opposition players and Viktor Kassai blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 03:11",
            "label": "",
            "description": "Viktor Kassai interrupts the game for a tactical foul by Fernandinho (Manchester City)."
        },
        {
            "gameTime": "1 - 02:17",
            "label": "",
            "description": "The linesman raises his flag. Sergio Aguero (Manchester City) is adjudged offside."
        },
        {
            "gameTime": "1 - 01:01",
            "label": "",
            "description": "Lionel Messi (Barcelona) displays his superb passing ability after picking out Neymar with a fine lofted pass to continue their attacking move."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Barcelona will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Viktor Kassai."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have seen a great game today, let's hope the players will be able to maintain these high levels of play in order to keep fans entertained in future games. The home side dominated this game. The home players pressed a lot which put the away team in difficult situations, but they still played their possession football."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "01/11/2016 - 22:45",
    "gameHomeTeam": "Manchester City",
    "gameScore": "3 - 1"
}