{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-11-04 - 22-45 Real Madrid 1 - 0 Liverpool/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The host team were better throughout the game. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 47:56",
            "label": "",
            "description": "The linesman raises his flag for offside before Javier Manquillo (Liverpool) heads on."
        },
        {
            "gameTime": "2 - 46:47",
            "label": "",
            "description": "Javier Manquillo (Liverpool) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "2 - 46:30",
            "label": "",
            "description": "Flag up against Gareth Bale (Real Madrid). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 42:44",
            "label": "",
            "description": "Toni Kroos (Real Madrid) brings his opponent down. Viktor Kassai has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Chicharito (Real Madrid) comes onto the pitch for Karim Benzema."
        },
        {
            "gameTime": "2 - 41:45",
            "label": "",
            "description": "Fabio Borini (Liverpool) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 39:57",
            "label": "",
            "description": "Gareth Bale (Real Madrid) takes the resulting free kick from 18 metres out. He attempts to send his effort into the right side of the goal, but Simon Mignolet is alert and keeps the ball out."
        },
        {
            "gameTime": "2 - 39:15",
            "label": "y-card",
            "description": "Viktor Kassai shows a yellow card to Alberto Moreno (Liverpool), who isn't surprised as the tackle was really hard and late. Real Madrid are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 37:58",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Nacho (Real Madrid) replaces Alvaro Arbeloa."
        },
        {
            "gameTime": "2 - 34:57",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) displays his superb passing ability after picking out Alvaro Arbeloa with a fine lofted pass to continue their attacking move."
        },
        {
            "gameTime": "2 - 33:49",
            "label": "",
            "description": "Steven Gerrard (Liverpool) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "2 - 32:43",
            "label": "",
            "description": "Isco (Real Madrid) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety."
        },
        {
            "gameTime": "2 - 30:33",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Marcelo (Real Madrid) was quite harsh and Viktor Kassai didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 29:56",
            "label": "",
            "description": "The foul by Fabio Borini (Liverpool) was seen by Viktor Kassai who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 29:11",
            "label": "substitution",
            "description": "A substitution has been made. Emre Can goes off and Philippe Coutinho (Liverpool) comes on."
        },
        {
            "gameTime": "2 - 28:50",
            "label": "",
            "description": "A cross from the corner kick arrives at the feet of Toni Kroos (Real Madrid), giving him an opportunity to shoot. He misses completely, well to the left of the goal."
        },
        {
            "gameTime": "2 - 28:44",
            "label": "corner",
            "description": "Isco (Real Madrid) will take a corner kick."
        },
        {
            "gameTime": "2 - 28:20",
            "label": "",
            "description": "Marcelo (Real Madrid) wriggles into space and fires the ball from the edge of the area, but one of the defenders is there to block the effort. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 28:06",
            "label": "corner",
            "description": "The resulting corner, taken by Toni Kroos (Real Madrid), comes to nothing."
        },
        {
            "gameTime": "2 - 27:42",
            "label": "",
            "description": "Gareth Bale (Real Madrid) unleashes a shot from long range but it's well blocked. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 26:37",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sets the ball for the free kick from 18 metres out. His attempt is aimed towards the middle of the goal, but Simon Mignolet is alert and makes a comfortable save."
        },
        {
            "gameTime": "2 - 25:44",
            "label": "",
            "description": "Viktor Kassai blows the whistle, Emre Can (Liverpool) is penalised for a foul. Real Madrid have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 25:15",
            "label": "",
            "description": "What a chance that is! Gareth Bale (Real Madrid) wastes a huge opportunity as he receives a beautiful pass inside the box but is somehow only able to prod the ball onto the crossbar!"
        },
        {
            "gameTime": "2 - 23:57",
            "label": "substitution",
            "description": "It is time for a substitution. Steven Gerrard (Liverpool) is on for Lucas Leiva."
        },
        {
            "gameTime": "2 - 23:26",
            "label": "substitution",
            "description": "The referee signals a substitution. Raheem Sterling (Liverpool) is brought on as a substitute for Lazar Markovic."
        },
        {
            "gameTime": "2 - 23:09",
            "label": "",
            "description": "Karim Benzema (Real Madrid) does well to meet a cross from Marcelo, but he directs his shot just wide of the right post. The ball is off of the pitch and it's a goal kick for Liverpool."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 22:03",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) collects a brilliant pass inside the box and finds himself in a goal scoring opportunity. He takes a shot, but the effort is well blocked by one of the defending players. Corner kick. Real Madrid will have an opportunity."
        },
        {
            "gameTime": "2 - 20:16",
            "label": "",
            "description": "Alberto Moreno (Liverpool) receives a pass and decides to smash the ball from long range. His poor effort sails well wide of the right post. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "2 - 19:44",
            "label": "funfact",
            "description": "9:1 – this is the current number of shots on target."
        },
        {
            "gameTime": "2 - 18:40",
            "label": "",
            "description": "Cristiano Ronaldo loses the ball after receiving a sweet pass from Karim Benzema (Real Madrid)."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "",
            "description": "The linesman signals that Fabio Borini (Liverpool) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "substitution",
            "description": "James Rodriguez goes off the pitch and Gareth Bale (Real Madrid) comes on."
        },
        {
            "gameTime": "2 - 16:11",
            "label": "corner",
            "description": "Adam Lallana (Liverpool) whips in a cross from the corner, but Iker Casillas is well positioned and punches the ball away."
        },
        {
            "gameTime": "2 - 15:19",
            "label": "",
            "description": "Fabio Borini (Liverpool) fails to produce a decent enough free kick for a player of his ability and the only target that he finds is the wall of defenders in front of him. The ball is out of play. Liverpool will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 14:28",
            "label": "y-card",
            "description": "A yellow card for a tackle by Sergio Ramos (Real Madrid). Viktor Kassai doesn't hesitate at all to make this decision. Liverpool earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 12:17",
            "label": "",
            "description": "Alberto Moreno slides a brilliant pass into Adam Lallana (Liverpool), but his shot from inside the box goes a whisker wide of the right post. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "2 - 10:42",
            "label": "",
            "description": "Alberto Moreno (Liverpool) unleashes a shot from the edge of the box, but it goes straight at Iker Casillas."
        },
        {
            "gameTime": "2 - 10:19",
            "label": "",
            "description": "Viktor Kassai blows his whistle and it's Luka Modric (Real Madrid) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 09:27",
            "label": "",
            "description": "James Rodriguez (Real Madrid) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 08:58",
            "label": "",
            "description": "Alberto Moreno (Liverpool) touches the ball with his hand. Real Madrid will take a free kick."
        },
        {
            "gameTime": "2 - 08:18",
            "label": "",
            "description": "Lazar Markovic (Liverpool) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 07:34",
            "label": "y-card",
            "description": "James Rodriguez (Real Madrid) sees a yellow card from Viktor Kassai after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 07:14",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 05:48",
            "label": "",
            "description": "Alberto Moreno (Liverpool) fouls an opponent. At least that's what referee Viktor Kassai signals."
        },
        {
            "gameTime": "2 - 03:31",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Simon Mignolet was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 02:51",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to curl the ball over the defensive wall from the free kick, but his effort fails to reach the goal."
        },
        {
            "gameTime": "2 - 01:58",
            "label": "y-card",
            "description": "Viktor Kassai shows a yellow card to Martin Skrtel (Liverpool) for a tough tackle. Real Madrid are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 01:35",
            "label": "",
            "description": "Karim Benzema (Real Madrid) plays a one two with Cristiano Ronaldo (Real Madrid), but the move breaks down."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "There was plenty of entertainment during the first 45 minutes. Hopefully more of the same in the second half. The visitors played second fiddle to the home team in the first half. The home team is playing possession football and the away team is basing its game on a well organized defence."
        },
        {
            "gameTime": "1 - 45:14",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:48",
            "label": "",
            "description": "A cross is clipped into the penalty area by Alberto Moreno (Liverpool) but poses no threat. The linesman signals a throw in for Real Madrid."
        },
        {
            "gameTime": "1 - 43:11",
            "label": "",
            "description": "Isco (Real Madrid) pounces on the rebound on the edge of the box but his wild shot goes high over the crossbar. The ball is off of the pitch and it's a goal kick for Liverpool."
        },
        {
            "gameTime": "1 - 42:47",
            "label": "",
            "description": "Real Madrid seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 40:41",
            "label": "",
            "description": "Javier Manquillo (Liverpool) passes the ball into the box but an opposing player clears."
        },
        {
            "gameTime": "1 - 40:03",
            "label": "",
            "description": "Isco (Real Madrid) clips an inviting cross into the box, but there's no one in a position to get on the end of it."
        },
        {
            "gameTime": "1 - 39:02",
            "label": "",
            "description": "Marcelo (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the left post. Simon Mignolet is alert and denies him with a nice save."
        },
        {
            "gameTime": "1 - 38:38",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Real Madrid."
        },
        {
            "gameTime": "1 - 36:31",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 35:41",
            "label": "",
            "description": "Karim Benzema (Real Madrid) finds himself in a promising position after receiving a beautiful cross from the side, but the opposition defence is ready and one of the defenders averts the threat with a quick interception. Good work from Real Madrid as they win a corner."
        },
        {
            "gameTime": "1 - 35:01",
            "label": "",
            "description": "A cross by Isco (Real Madrid) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor. The ball goes out of play and Liverpool will have a goal kick."
        },
        {
            "gameTime": "1 - 34:02",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes the resulting free kick from 33 metres out. He attempts to send his effort into the middle of the goal, but Simon Mignolet is alert and keeps the ball out."
        },
        {
            "gameTime": "1 - 33:08",
            "label": "",
            "description": "Lucas Leiva (Liverpool) pulls the jersey of one of the opposition players and Viktor Kassai blows his whistle for a foul. Real Madrid get a free kick."
        },
        {
            "gameTime": "1 - 31:56",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 30:35",
            "label": "",
            "description": "Fabio Borini (Liverpool) whips the ball in from the long range free kick, but the first man gets it clear."
        },
        {
            "gameTime": "1 - 30:10",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) commits an ugly challenge. The referee sees it and immediately blows his whistle. There is a free kick near the sideline to Liverpool."
        },
        {
            "gameTime": "1 - 29:34",
            "label": "",
            "description": "Good clearance! Karim Benzema (Real Madrid) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him."
        },
        {
            "gameTime": "1 - 28:54",
            "label": "",
            "description": "Real Madrid are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 26:47",
            "label": "soccer-ball",
            "description": "Goal! Marcelo passes the ball to the feet of Karim Benzema (Real Madrid), who has an empty net in front of him and has no problems in tapping the ball in. 1:0."
        },
        {
            "gameTime": "1 - 25:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slips through the defence and passes the ball in from the edge of the box. Karim Benzema picks it up but loses it to one of the defenders."
        },
        {
            "gameTime": "1 - 24:52",
            "label": "",
            "description": "Wow, what an escape. Joe Allen (Liverpool) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "1 - 22:59",
            "label": "",
            "description": "This shall not pass! Cristiano Ronaldo (Real Madrid) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 22:33",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 21:59",
            "label": "",
            "description": "Neat passing move from Real Madrid in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 19:22",
            "label": "",
            "description": "Isco (Real Madrid) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "1 - 18:12",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a teasing cross into the area, but Simon Mignolet intercepts the ball."
        },
        {
            "gameTime": "1 - 17:37",
            "label": "",
            "description": "What an amazing save by Simon Mignolet! Cristiano Ronaldo (Real Madrid) swirls around the defenders and attempts to beat the keeper with a close range shot towards the bottom left corner, but fails."
        },
        {
            "gameTime": "1 - 15:38",
            "label": "",
            "description": "Luka Modric (Real Madrid) attempts to find Karim Benzema with a delicate little through ball from inside the box, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "1 - 14:44",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 14:23",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries to slide the ball through to a teammate but it's well blocked by a defender. The ball goes out for a corner. Real Madrid can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 12:55",
            "label": "",
            "description": "Toni Kroos (Real Madrid) goes on a mazy run and tries his luck with a mid range strike, but one of the defending players steps in and makes a block."
        },
        {
            "gameTime": "1 - 10:36",
            "label": "",
            "description": "An attempted cross from Marcelo (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 09:57",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 09:40",
            "label": "",
            "description": "Simon Mignolet pulls off a great save to deny Cristiano Ronaldo (Real Madrid), who makes himself some space inside the box and unleashes a quick shot towards the top of the net. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "1 - 09:07",
            "label": "",
            "description": "Lucas Leiva (Liverpool) commits a rough challenge and Viktor Kassai blows his whistle for a foul. Cristiano Ronaldo (Real Madrid) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "1 - 08:22",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Javier Manquillo (Liverpool)."
        },
        {
            "gameTime": "1 - 07:19",
            "label": "",
            "description": "Karim Benzema (Real Madrid) attempts to slip the ball through the defence, but is unable to find any of his teammates. The ball is out of play. Liverpool will have a throw in."
        },
        {
            "gameTime": "1 - 06:39",
            "label": "",
            "description": "Viktor Kassai blows his whistle for a foul after Alvaro Arbeloa (Real Madrid) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 04:55",
            "label": "",
            "description": "Adam Lallana (Liverpool) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 04:00",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 03:13",
            "label": "",
            "description": "James Rodriguez (Real Madrid) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the right hand post, but Simon Mignolet was alert and the score remains the same. It will be a corner kick for Real Madrid."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "",
            "description": "Adam Lallana (Liverpool) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "1 - 01:21",
            "label": "",
            "description": "Liverpool's players are in a nice combination. They show their ability to keep the ball possession, sending it precisely from one to another. But now the final pass is intercepted."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Liverpool will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Viktor Kassai."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The host team were better throughout the game. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        }
    ],
    "gameAwayTeam": "Liverpool",
    "gameDate": "04/11/2014 - 22:45",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "1 - 0"
}