{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2015-2016/2015-09-20 - 13-30 Chievo 0 - 1 Inter/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "The fans can't complain about what they saw on the pitch as both sides displayed a highly captivating football match. Neither of the teams had any obvious superiority in this game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        },
        {
            "gameTime": "2 - 50:26",
            "label": "whistle",
            "description": "That's it for today, Paolo Tagliavento has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 48:59",
            "label": "y-card",
            "description": "Paul Jose M'Poku (Chievo) has received a yellow card for his foul."
        },
        {
            "gameTime": "2 - 47:19",
            "label": "",
            "description": "Nicolas Frey (Chievo) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 46:18",
            "label": "",
            "description": "Paolo Tagliavento interrupts the game for a tactical foul by Massimo Gobbi (Chievo)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:45",
            "label": "",
            "description": "Bostjan Cesar (Chievo) jumps for a cross and produces a fine header from near the penalty spot, but it goes narrowly wide of the left post!"
        },
        {
            "gameTime": "2 - 44:32",
            "label": "corner",
            "description": "Simone Pepe (Chievo) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 44:12",
            "label": "",
            "description": "Perparim Hetemaj (Chievo) strikes a powerful volley towards goal, but one of the defenders blocks his attempt. Chievo have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 42:27",
            "label": "corner",
            "description": "Marcelo Brozovic (Inter) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 42:13",
            "label": "",
            "description": "Marcelo Brozovic (Inter) races towards goal but the defender gets back well to make a challenge. The referee signals a corner kick to Inter."
        },
        {
            "gameTime": "2 - 40:44",
            "label": "",
            "description": "Perparim Hetemaj (Chievo) robs an opponent of the ball and explodes in anger when Paolo Tagliavento blows for a foul."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "substitution",
            "description": "Substitution. Marcelo Brozovic (Inter) has come on for Geoffrey Kondogbia."
        },
        {
            "gameTime": "2 - 37:30",
            "label": "funfact",
            "description": "15:14 – the total goal attempt statistics."
        },
        {
            "gameTime": "2 - 35:58",
            "label": "",
            "description": "Ivan Perisic (Inter) breaks into the penalty area but his shot is blocked."
        },
        {
            "gameTime": "2 - 35:11",
            "label": "",
            "description": "Paul Jose M'Poku Ebunge (Chievo) sends a poor cross in from the free kick that is cleared by the head of a defender."
        },
        {
            "gameTime": "2 - 35:04",
            "label": "substitution",
            "description": "Substitution. Simone Pepe (Chievo) on for Nicola Rigoni."
        },
        {
            "gameTime": "2 - 34:48",
            "label": "",
            "description": "Foul! Fredy Guarin (Inter) is penalised for pulling back his opponent. Chievo will take a free kick."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "",
            "description": "A cross into the box from Rodrigo Palacio (Inter) is cleared."
        },
        {
            "gameTime": "2 - 31:25",
            "label": "",
            "description": "Paolo Tagliavento blows for a foul after Perparim Hetemaj (Chievo) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 30:39",
            "label": "substitution",
            "description": "Rolando Maran has decided to make a change. Paul Jose M'Poku Ebunge (Chievo) replaces Valter Birsa."
        },
        {
            "gameTime": "2 - 27:43",
            "label": "corner",
            "description": "Valter Birsa (Chievo) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 27:07",
            "label": "",
            "description": "Nicola Rigoni (Chievo) tries to send a pass but it's blocked. The ball goes out of play and Chievo have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 24:18",
            "label": "corner",
            "description": "Fredy Guarin (Inter) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 23:15",
            "label": "substitution",
            "description": "Andrea Ranocchia (Inter) comes onto the pitch after Jeison Murillo signals to the bench that he cannot continue any longer after picking up an injury."
        },
        {
            "gameTime": "2 - 23:11",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Rodrigo Palacio (Inter) comes onto the pitch for Stevan Jovetic."
        },
        {
            "gameTime": "2 - 22:54",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Roberto Inglese (Chievo) will replace Alberto Paloschi."
        },
        {
            "gameTime": "2 - 22:50",
            "label": "injury",
            "description": "Looks like Jeison Murillo (Inter) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "2 - 22:21",
            "label": "",
            "description": "Alex Nicolao Telles (Inter) tries to slide the ball through to a teammate but it's well blocked by a defender. The ball goes out for a corner. Inter can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 20:08",
            "label": "",
            "description": "Alberto Paloschi (Chievo) is caught offside!"
        },
        {
            "gameTime": "2 - 18:35",
            "label": "corner",
            "description": "Valter Birsa (Chievo) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "2 - 18:18",
            "label": "",
            "description": "Chievo are playing some nice combination football, sending it precisely from player to player, but a defender shows good anticipation and ends the move with a good block. Good work from Chievo as they win a corner."
        },
        {
            "gameTime": "2 - 14:37",
            "label": "",
            "description": "Paolo Tagliavento blows his whistle and signals a foul after Davide Santon (Inter) brought his opponent down."
        },
        {
            "gameTime": "2 - 13:27",
            "label": "",
            "description": "Davide Santon (Inter) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 11:52",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Valter Birsa (Chievo). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 11:41",
            "label": "",
            "description": "Alberto Paloschi (Chievo) looks to break free, but an opposing player clears the ball away. Chievo get a corner."
        },
        {
            "gameTime": "2 - 09:31",
            "label": "",
            "description": "Perparim Hetemaj (Chievo) controls a cross inside the six yard box, but unbelievably sends his shot wide of the left post."
        },
        {
            "gameTime": "2 - 08:06",
            "label": "",
            "description": "Stevan Jovetic (Inter) attempts to endanger the goal with the free kick from about 30 metres. The keeper can stay calm because he misses completely. The ball went well over the bar."
        },
        {
            "gameTime": "2 - 07:21",
            "label": "",
            "description": "Paolo Tagliavento couldn't ignore the rough tackle by Bostjan Cesar (Chievo) and blew his whistle. A free kick has been awarded to Inter."
        },
        {
            "gameTime": "2 - 04:51",
            "label": "",
            "description": "Alberto Paloschi (Chievo) creates some space for himself to pick up a pass on the edge of the box and unleashes a decent strike which goes a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 03:29",
            "label": "",
            "description": "Fredy Guarin (Inter) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went way over the bar."
        },
        {
            "gameTime": "2 - 03:22",
            "label": "corner",
            "description": "Alex Nicolao Telles (Inter) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 03:04",
            "label": "",
            "description": "Felipe Melo (Inter) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort. The ball is out of play. Inter will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 02:58",
            "label": "corner",
            "description": "Stevan Jovetic (Inter) will deliver the ball into the penalty box from a corner kick."
        },
        {
            "gameTime": "2 - 02:09",
            "label": "corner",
            "description": "Stevan Jovetic (Inter) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger. Inter have a corner."
        },
        {
            "gameTime": "2 - 01:47",
            "label": "",
            "description": "Stevan Jovetic (Inter) sprays a pass out to Mauro Icardi, but he can't beat his man to get to the ball. The ball is out of play and Inter manage to earn a corner."
        },
        {
            "gameTime": "2 - 00:50",
            "label": "",
            "description": "A cross, provided by Alex Nicolao Telles (Inter), caused no threat to the opposition's defence as the ball was cleared out of danger."
        },
        {
            "gameTime": "2 - 00:25",
            "label": "",
            "description": "Massimo Gobbi (Chievo) gives away a foul for a clumsy challenge. Referee Paolo Tagliavento saw the whole situation. Free kick. Inter will probably just try to cross the ball in from here."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Both sides have been very active in the first 45 minutes, providing the fans with an exciting show. There wasn't any evident superiority by either side during the first half. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 45:03",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Paolo Tagliavento has ended it."
        },
        {
            "gameTime": "1 - 44:31",
            "label": "",
            "description": "An attempted cross from Stevan Jovetic (Inter) is cleared."
        },
        {
            "gameTime": "1 - 44:09",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Stevan Jovetic (Inter)."
        },
        {
            "gameTime": "1 - 43:56",
            "label": "",
            "description": "Ivan Perisic (Inter) fails to send a pass into the box as his effort is cut out. It will be a corner kick for Inter."
        },
        {
            "gameTime": "1 - 41:25",
            "label": "soccer-ball",
            "description": "Goal! Mauro Icardi (Inter) pounced on a loose ball inside the box and beats the goalkeeper with a shot inside the right post. He makes it 0:1."
        },
        {
            "gameTime": "1 - 41:19",
            "label": "",
            "description": "Geoffrey Kondogbia (Inter) releases Mauro Icardi, who latched on to his perfect through pass and can continue with his team's attack."
        },
        {
            "gameTime": "1 - 39:46",
            "label": "y-card",
            "description": "Paolo Tagliavento shows a yellow card to Riccardo Meggiorini (Chievo), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 38:29",
            "label": "",
            "description": "Valter Birsa (Chievo) produces a poor cross from the free kick which is easily turned away."
        },
        {
            "gameTime": "1 - 38:11",
            "label": "",
            "description": "Fredy Guarin (Inter) pulls the shirt of his opponent and the referee stops play for a foul. Chievo will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 37:14",
            "label": "",
            "description": "Geoffrey Kondogbia (Inter) wins the ball near the penalty spot and unleashes a header towards the left post, but Albano Bizzarri is alert and denies him."
        },
        {
            "gameTime": "1 - 36:29",
            "label": "y-card",
            "description": "The foul by Nicola Rigoni (Chievo) is worthy of a card and a yellow is duly shown by Paolo Tagliavento."
        },
        {
            "gameTime": "1 - 34:43",
            "label": "corner",
            "description": "Nicola Rigoni (Chievo) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 34:17",
            "label": "",
            "description": "What a goal scoring opportunity! Alberto Paloschi (Chievo) makes a good run into the box to meet a cross and fires the ball in on goal, but the shot is amazingly blocked by a defender. Chievo win a corner."
        },
        {
            "gameTime": "1 - 32:11",
            "label": "",
            "description": "Close! Valter Birsa (Chievo) takes the resultant free kick from 22 metres out and his shot goes just over the crossbar."
        },
        {
            "gameTime": "1 - 30:58",
            "label": "",
            "description": "Felipe Melo (Inter) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision! Chievo are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 29:11",
            "label": "",
            "description": "Valter Birsa (Chievo) swings in a cross from a free kick, but Samir Handanovic collects calmly."
        },
        {
            "gameTime": "1 - 28:52",
            "label": "",
            "description": "Alex Nicolao Telles (Inter) was too forceful with his tackle and Paolo Tagliavento interrupted the game to signal a free kick. Chievo have a free kick."
        },
        {
            "gameTime": "1 - 26:56",
            "label": "y-card",
            "description": "Paolo Tagliavento shows a yellow card to Fredy Guarin (Inter) for a tough tackle."
        },
        {
            "gameTime": "1 - 25:17",
            "label": "",
            "description": "Ivan Perisic (Inter) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the right post."
        },
        {
            "gameTime": "1 - 22:53",
            "label": "corner",
            "description": "Stevan Jovetic (Inter) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 22:24",
            "label": "",
            "description": "Alex Nicolao Telles (Inter) darts into the penalty area to latch on to a pass, and he unleashes a shot in the direction of the right post. Albano Bizzarri is alert and denies him with a nice save. The ball is out of play and the linesman points at the corner flag. Corner to Inter."
        },
        {
            "gameTime": "1 - 22:00",
            "label": "",
            "description": "Fredy Guarin (Inter) sends a cross into the box, but the opposition's defence quickly intercepts the ball."
        },
        {
            "gameTime": "1 - 19:32",
            "label": "corner",
            "description": "Alex Nicolao Telles (Inter) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 19:20",
            "label": "",
            "description": "Inter are enjoying possession, but one of the opposition players steps in to end the sequence. The referee and his assistant both point at the corner flag. Inter will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 18:48",
            "label": "",
            "description": "Lucas Castro (Chievo) comes close to scoring! He gets the ball inside the box from the resulting corner but his shot flies just over the crossbar. This should be a big warning for the defence."
        },
        {
            "gameTime": "1 - 17:57",
            "label": "corner",
            "description": "Valter Birsa (Chievo) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 17:47",
            "label": "corner",
            "description": "Chievo force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 17:26",
            "label": "corner",
            "description": "Lucas Castro (Chievo) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 17:06",
            "label": "",
            "description": "Lucas Castro (Chievo) connects with a pass but sees his shot from the edge of the box blocked. The referee blows his whistle, Chievo are awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:01",
            "label": "",
            "description": "Lucas Castro (Chievo) commits a foul and Paolo Tagliavento immediately signals a free kick."
        },
        {
            "gameTime": "1 - 14:55",
            "label": "",
            "description": "Some great controlled play and passing from Inter. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 11:51",
            "label": "",
            "description": "Riccardo Meggiorini (Chievo) tries to play a through ball from just inside the box to Alberto Paloschi, but one of the defending players is alert to the danger and makes a timely interception."
        },
        {
            "gameTime": "1 - 10:51",
            "label": "",
            "description": "Riccardo Meggiorini (Chievo) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 10:07",
            "label": "",
            "description": "The resulting free kick from 27 metres out taken by Valter Birsa (Chievo) was blocked by the defensive wall, which was perfectly positioned by the goalkeeper."
        },
        {
            "gameTime": "1 - 09:01",
            "label": "",
            "description": "Paolo Tagliavento blows the whistle, Gary Medel (Inter) is penalised for a foul. Chievo win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 07:32",
            "label": "",
            "description": "Riccardo Meggiorini (Chievo) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 07:00",
            "label": "corner",
            "description": "Valter Birsa (Chievo) works the corner short."
        },
        {
            "gameTime": "1 - 06:27",
            "label": "",
            "description": "Valter Birsa (Chievo) whips in the resulting free kick but one of the defenders heads the ball to safety. Chievo have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 06:06",
            "label": "",
            "description": "Fredy Guarin (Inter) commits a rough foul. Paolo Tagliavento stops the game and makes a call. Chievo are awarded the free kick."
        },
        {
            "gameTime": "1 - 04:01",
            "label": "",
            "description": "Stevan Jovetic (Inter) receives a pass and tries his luck with a shot from 25 metres out. Albano Bizzarri pulls off a decent save to stop the effort going into the right side of the goal."
        },
        {
            "gameTime": "1 - 03:33",
            "label": "",
            "description": "Ivan Perisic (Inter) collects a wonderful lead pass and as he has a lot of space, smashes a terrific shot from long range. His shot goes painfully close to the crossbar!"
        },
        {
            "gameTime": "1 - 02:08",
            "label": "",
            "description": "Lucas Castro (Chievo) unleashes a sweet first timer from the edge of the box to the right side of the goal. The goalkeeper stops the shot with a quick save."
        },
        {
            "gameTime": "1 - 01:02",
            "label": "",
            "description": "A pass by Fredy Guarin (Inter) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Chievo will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paolo Tagliavento will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans can't complain about what they saw on the pitch as both sides displayed a highly captivating football match. Neither of the teams had any obvious superiority in this game. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        }
    ],
    "gameAwayTeam": "Inter",
    "gameDate": "20/09/2015 - 13:30",
    "gameHomeTeam": "Chievo",
    "gameScore": "0 - 1"
}