{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-10-01 - 14-30 Swansea 1 - 2 Liverpool/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. The visiting team was controlling the game most of the time. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        },
        {
            "gameTime": "2 - 49:10",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 48:15",
            "label": "",
            "description": "Mike van der Hoorn (Swansea) had a good opportunity when he latched on to a cross from the wing, but his strike from the six yard box wasn't accurate enough and the ball went a few inches wide of the left post."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "",
            "description": "Jay Fulton (Swansea) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 4 min. of added time."
        },
        {
            "gameTime": "2 - 42:39",
            "label": "attendance",
            "description": "The attendance is 20862."
        },
        {
            "gameTime": "2 - 39:40",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to introduce fresh legs, with Divock Origi (Liverpool) replacing Roberto Firmino."
        },
        {
            "gameTime": "2 - 39:36",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Emre Can (Liverpool) for Georginio Wijnaldum."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "soccer-ball",
            "description": "James Milner (Liverpool) slams the penalty home into the roof of the net."
        },
        {
            "gameTime": "2 - 38:20",
            "label": "",
            "description": "James Milner (Liverpool) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 38:15",
            "label": "penalty",
            "description": "Michael Oliver blows for a foul after Angel Rangel (Swansea) was too aggressive in the battle for the ball. The referee blows his whistle and awards Liverpool a penalty after chaos inside the box."
        },
        {
            "gameTime": "2 - 35:39",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "2 - 35:14",
            "label": "corner",
            "description": "A dangerous looking corner kick from Jordan Henderson (Liverpool) is cleared to safety by the defence. Liverpool force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 34:53",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) receives a pass and fires a shot in from long range, but it's blocked. The ball is out of play and Liverpool manage to earn a corner."
        },
        {
            "gameTime": "2 - 31:33",
            "label": "corner",
            "description": "Gylfi Sigurdsson (Swansea) swings the ball into the box from the corner kick but it's a bit too strong and it goes out of play."
        },
        {
            "gameTime": "2 - 31:13",
            "label": "",
            "description": "Gylfi Sigurdsson (Swansea) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. Now Swansea have a corner."
        },
        {
            "gameTime": "2 - 29:42",
            "label": "corner",
            "description": "Gylfi Sigurdsson (Swansea) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 29:29",
            "label": "",
            "description": "Modou Barrow (Swansea) sends a cross into the box, but the opposition's defence quickly intercepts the ball. Swansea have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 28:28",
            "label": "corner",
            "description": "The corner kick from James Milner (Liverpool) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 28:14",
            "label": "",
            "description": "Sadio Mane (Liverpool) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. Liverpool win a corner."
        },
        {
            "gameTime": "2 - 26:29",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Jay Fulton (Swansea) will replace Leroy Fer."
        },
        {
            "gameTime": "2 - 24:08",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the left post."
        },
        {
            "gameTime": "2 - 23:39",
            "label": "corner",
            "description": "Corner kick. Jordan Henderson (Liverpool) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 23:24",
            "label": "",
            "description": "Sadio Mane (Liverpool) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. The linesman points to the corner flag, Liverpool are going to take it."
        },
        {
            "gameTime": "2 - 22:45",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) picks up a pass and unleashes a low shot towards goal, but he can't generate enough power to trouble Lukasz Fabianski."
        },
        {
            "gameTime": "2 - 20:08",
            "label": "corner",
            "description": "James Milner (Liverpool) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 19:42",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) sends a pass into the box, but his attempt is thwarted and cleared. The referee points to the corner flag. It's a corner to Liverpool."
        },
        {
            "gameTime": "2 - 17:22",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Leon Britton leaves the pitch and Sung Yong Ki (Swansea) comes on."
        },
        {
            "gameTime": "2 - 16:16",
            "label": "substitution",
            "description": "Here is a change. Wayne Routledge is going off and Francesco Guidolin gives the last tactical orders to Modou Barrow (Swansea)."
        },
        {
            "gameTime": "2 - 14:35",
            "label": "corner",
            "description": "James Milner (Liverpool) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 14:09",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) swings in a cross, but the ball is cleared to safety by one of the defending players. The ball is out of play. A goal scoring opportunity from a corner for Liverpool."
        },
        {
            "gameTime": "2 - 13:35",
            "label": "",
            "description": "Good team movement sets up Philippe Coutinho (Liverpool) on the edge of the box, but he slices the ball narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 08:30",
            "label": "soccer-ball",
            "description": "The ball hits the back of the net! Jordan Henderson showcases his brilliant technique and produces a beautiful lofted cross into the box. Roberto Firmino (Liverpool) gets onto the scoresheets by sweetly heading it inside the left post – 1:1."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "",
            "description": "Philippe Coutinho (Liverpool) swings in a promising cross from the free kick, but one of the defenders does a perfect job to avert the danger."
        },
        {
            "gameTime": "2 - 07:45",
            "label": "y-card",
            "description": "The foul by Leon Britton (Swansea) is worthy of a card and a yellow is duly shown by Michael Oliver."
        },
        {
            "gameTime": "2 - 07:40",
            "label": "",
            "description": "The ball is behind the sideline. Daniel Sturridge (Liverpool) takes a throw in."
        },
        {
            "gameTime": "2 - 03:11",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) receives a precise pass and is given time inside the box to send a promising strike towards the bottom right corner. Lukasz Fabianski guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 02:30",
            "label": "",
            "description": "Roberto Firmino (Liverpool) has an effort from distance and sends the ball towards the bottom left corner, but the goalkeeper is equal to it."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Michael Oliver blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "There has not been much to choose between the sides after an absorbing 45 minutes. Let's hope they can continue in the same vein in the second period. In terms of the overall play, the match has been fairly even so far. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 47:07",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:05",
            "label": "corner",
            "description": "The corner from Jordan Henderson (Liverpool) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) crosses the ball into the box, but one of the defending players averts the threat. The linesman makes the right call and Liverpool will have a corner."
        },
        {
            "gameTime": "1 - 43:56",
            "label": "",
            "description": "Gylfi Sigurdsson (Swansea) tries his luck from a long range free kick and fires the ball to the roof of the net, but Loris Karius is alert and thwarts the effort."
        },
        {
            "gameTime": "1 - 43:25",
            "label": "",
            "description": "Gylfi Sigurdsson (Swansea) is going to send the ball in from the free kick."
        },
        {
            "gameTime": "1 - 43:03",
            "label": "",
            "description": "Joel Matip (Liverpool) makes a rough challenge and Michael Oliver blows his whistle for a foul. A free kick has been awarded to Swansea."
        },
        {
            "gameTime": "1 - 42:04",
            "label": "",
            "description": "Roberto Firmino (Liverpool) gets to the ball from the resulting corner and tries his luck with a shot, but one of the defenders steps in to block the effort."
        },
        {
            "gameTime": "1 - 41:40",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 41:22",
            "label": "",
            "description": "Sadio Mane (Liverpool) sends the ball into the box from the side of the pitch, but his cross is blocked. Liverpool will take a corner kick."
        },
        {
            "gameTime": "1 - 40:26",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 40:04",
            "label": "",
            "description": "Daniel Sturridge (Liverpool) races towards goal but the defender gets back well to make a challenge. The referee and one of his assistants signal for a corner kick to Liverpool."
        },
        {
            "gameTime": "1 - 39:43",
            "label": "",
            "description": "Wow, what an escape. Sadio Mane (Liverpool) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "1 - 38:36",
            "label": "y-card",
            "description": "The referee gives a yellow card to Daniel Sturridge (Liverpool)."
        },
        {
            "gameTime": "1 - 37:35",
            "label": "y-card",
            "description": "Jack Cork (Swansea) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Michael Oliver didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "1 - 35:26",
            "label": "",
            "description": "Dejan Lovren (Liverpool) connects with a precise cross inside the goalmouth and shoots. One of the defending players reacts in time and clears the ball to safety."
        },
        {
            "gameTime": "1 - 35:08",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Jordan Henderson (Liverpool)."
        },
        {
            "gameTime": "1 - 34:51",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) tries to send a pass but it's blocked. Liverpool force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 34:01",
            "label": "",
            "description": "Liverpool seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 30:31",
            "label": "",
            "description": "Mike van der Hoorn (Swansea) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Michael Oliver with no other option than to blow for a foul."
        },
        {
            "gameTime": "1 - 27:29",
            "label": "",
            "description": "Borja Baston (Swansea) jumps for a cross and produces a fine header from near the penalty spot, but it goes narrowly wide of the left post!"
        },
        {
            "gameTime": "1 - 24:30",
            "label": "y-card",
            "description": "Jordan Henderson (Liverpool) was probably a bit loose with his words to Michael Oliver, who decides to show him a yellow."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "Jordan Henderson (Liverpool) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation."
        },
        {
            "gameTime": "1 - 23:33",
            "label": "",
            "description": "Roberto Firmino (Liverpool) is caught offside by the linesman and it looks like it is the right decision despite being a very close call."
        },
        {
            "gameTime": "1 - 22:50",
            "label": "substitution",
            "description": "Here comes a substitution. Adam Lallana is given a rest as he is replaced by Daniel Sturridge (Liverpool)."
        },
        {
            "gameTime": "1 - 21:12",
            "label": "",
            "description": "Gylfi Sigurdsson (Swansea) sends a cross into the box, but Loris Karius comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 19:25",
            "label": "",
            "description": "Adam Lallana (Liverpool) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 18:40",
            "label": "",
            "description": "Flag up against Borja Baston (Swansea). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 18:15",
            "label": "injury",
            "description": "Adam Lallana (Liverpool) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 15:06",
            "label": "",
            "description": "Roberto Firmino (Liverpool) is adjudged offside."
        },
        {
            "gameTime": "1 - 14:10",
            "label": "",
            "description": "What a poor attempt! Leroy Fer (Swansea) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "1 - 12:16",
            "label": "",
            "description": "Referee Michael Oliver sees the trip by Gylfi Sigurdsson (Swansea) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 07:45",
            "label": "soccer-ball",
            "description": "Goal! The resulting corner is whipped into the box and Leroy Fer (Swansea) buries the ball into the back of the net from a Borja Baston knock down. 1:0."
        },
        {
            "gameTime": "1 - 07:10",
            "label": "corner",
            "description": "The referee and his assistant both point at the corner flag. Swansea will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 07:00",
            "label": "",
            "description": "Gylfi Sigurdsson (Swansea) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. The referee points to the corner flag and Swansea will take a corner."
        },
        {
            "gameTime": "1 - 05:09",
            "label": "",
            "description": "Borja Baston (Swansea) misses a promising opportunity! He rises for a cross and unleashes a poor header from near the penalty spot. The ball floats high over the crossbar!"
        },
        {
            "gameTime": "1 - 02:26",
            "label": "",
            "description": "A cross is clipped into the penalty area by Dejan Lovren (Liverpool) but poses no threat."
        },
        {
            "gameTime": "1 - 00:09",
            "label": "",
            "description": "Liverpool will kick the game off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Michael Oliver will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Liverpool have not tasted defeat in their last 4 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The leading assist man for Liverpool is Philippe Coutinho, with 5 assists so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Swansea managed to earn only 38 points from 37 matches this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Most of the fans probably aren't overly pleased with the development of the game as it wasn't very exciting. The visiting team was controlling the game most of the time. In terms of strategy, the hosts were waiting for the right moment to win the ball and launch a counter attack. The visiting side adopted a possession style of football."
        }
    ],
    "gameAwayTeam": "Liverpool",
    "gameDate": "01/10/2016 - 14:30",
    "gameHomeTeam": "Swansea",
    "gameScore": "1 - 2"
}