{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-11-04 - 22-45 Lyon 0 - 2 Zenit Petersburg/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. A very even game was seen on the pitch today. The home side's tactic was what is known as kick and rush football, while the away team adopted a counter attacking style."
        },
        {
            "gameTime": "2 - 48:25",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) launches a cross from the corner, but Yuri Lodygin is alert to thwart the effort."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "",
            "description": "Corentin Tolisso (Lyon) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being blocked by one of the defenders. The ball goes behind for a corner. Lyon will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "",
            "description": "Corentin Tolisso (Lyon) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "2 - 45:46",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Mapou Yanga Mbiwa (Lyon) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:55",
            "label": "y-card",
            "description": "The referee gives a yellow card to Oleg Shatov (Zenit Petersburg)."
        },
        {
            "gameTime": "2 - 43:39",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) got the ball on the edge of the box and fired in a first time shot on goal, but his effort floated well over the bar. High, wide and not at all handsome."
        },
        {
            "gameTime": "2 - 42:45",
            "label": "yr-card",
            "description": "Aleksandr Anyukov (Zenit Petersburg) must have known he would be sent off for this foul, but he had to stop the opponent at all costs. Felix Brych shows him a second yellow card and the game has ended for him."
        },
        {
            "gameTime": "2 - 42:40",
            "label": "",
            "description": "Mapou Yanga Mbiwa (Lyon) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone. The ball goes out of play and Zenit Petersburg will have a goal kick."
        },
        {
            "gameTime": "2 - 41:32",
            "label": "",
            "description": "Oleg Shatov (Zenit Petersburg) dribbles into the box, but Anthony Lopes is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 39:28",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 38:55",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Zenit Petersburg was in an offside position."
        },
        {
            "gameTime": "2 - 38:18",
            "label": "",
            "description": "Aleksandr Anyukov (Zenit Petersburg) looks to break free, but his touch lets him down and he loses the ball. The ball is out of play. Lyon will have a throw in."
        },
        {
            "gameTime": "2 - 37:53",
            "label": "substitution",
            "description": "Here is a change. Artem Dzyuba is going off and Luis Andre Pina Cabral Villas Boas gives the last tactical orders to Aleksander Ryazantsev (Zenit Petersburg)."
        },
        {
            "gameTime": "2 - 36:20",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 34:40",
            "label": "substitution",
            "description": "The substitution has been made. Artur Yusupov (Zenit Petersburg) has replaced Javi Garcia."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "",
            "description": "Lyon are ruled offside."
        },
        {
            "gameTime": "2 - 33:05",
            "label": "",
            "description": "Hulk (Zenit Petersburg) unleashes a shot goalwards from a mid range free kick. The ball heads towards the right post, but the goalkeeper makes a decent save to thwart him."
        },
        {
            "gameTime": "2 - 32:18",
            "label": "",
            "description": "Jordan Ferri (Lyon) gives away a foul for a clumsy challenge. Referee Felix Brych saw the whole situation. Zenit Petersburg are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 31:47",
            "label": "substitution",
            "description": "Hubert Fournier has decided to substitute Sergi Darder and he is replaced by Jordan Ferri (Lyon)."
        },
        {
            "gameTime": "2 - 31:24",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball into the stands. Nice run, but poor finish!"
        },
        {
            "gameTime": "2 - 30:19",
            "label": "",
            "description": "Zenit Petersburg hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "2 - 28:33",
            "label": "y-card",
            "description": "Danny (Zenit Petersburg) is yellow carded."
        },
        {
            "gameTime": "2 - 27:21",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Domenico Criscito will be replaced by Igor Smolnikov (Zenit Petersburg)."
        },
        {
            "gameTime": "2 - 26:59",
            "label": "yr-card",
            "description": "Felix Brych blows his whistle and Maxime Gonalons (Lyon) is shown a second yellow card for his foul. His manager will not be pleased. He has lot of time to think about it as he walks off."
        },
        {
            "gameTime": "2 - 26:25",
            "label": "",
            "description": "Sergi Darder (Lyon) smashes the ball with a volley from the edge of the box, but his poor attempt goes miles wide of the left post."
        },
        {
            "gameTime": "2 - 25:45",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 25:41",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Rafael (Lyon). The ball is out of play. Lyon will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 23:59",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Claudio Beauvue as he is replaced by Maxwel Cornet (Lyon)."
        },
        {
            "gameTime": "2 - 23:35",
            "label": "",
            "description": "Maxime Gonalons (Lyon) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 23:03",
            "label": "",
            "description": "Maxime Gonalons (Lyon) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 22:38",
            "label": "",
            "description": "Oleg Shatov (Zenit Petersburg) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 20:17",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) overhits the corner kick and none of his teammates can their head on it. The ball goes out of play and Zenit Petersburg will have a goal kick."
        },
        {
            "gameTime": "2 - 20:01",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Alexandre Lacazette (Lyon). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate. Lyon earn a corner."
        },
        {
            "gameTime": "2 - 19:32",
            "label": "",
            "description": "Flag up against Artem Dzyuba (Zenit Petersburg). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 18:44",
            "label": "",
            "description": "The foul by Alexandre Lacazette (Lyon) was seen by Felix Brych who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 17:10",
            "label": "",
            "description": "A long pass, executed by Aleksandr Anyukov (Zenit Petersburg), missed the precision to reach his teammates."
        },
        {
            "gameTime": "2 - 16:15",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) handles the ball and everyone in the stadium shouts 'handball'."
        },
        {
            "gameTime": "2 - 15:42",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) plays a through ball but overhits it."
        },
        {
            "gameTime": "2 - 15:17",
            "label": "substitution",
            "description": "Hubert Fournier has decided to introduce fresh legs, with Rafael (Lyon) replacing Christophe Jallet."
        },
        {
            "gameTime": "2 - 14:54",
            "label": "",
            "description": "It's a weak, uncertain finish and easy for the goalkeeper. Maxime Gonalons (Lyon) sends in a volley from just outside the box that goes a few yards wide of the left post."
        },
        {
            "gameTime": "2 - 14:26",
            "label": "",
            "description": "Some patient build up play from Lyon as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 11:59",
            "label": "soccer-ball",
            "description": "Goal! Hulk displays great vision and sends a pass to Artem Dzyuba (Zenit Petersburg), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 0:2."
        },
        {
            "gameTime": "2 - 10:15",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "2 - 10:06",
            "label": "y-card",
            "description": "Aleksandr Anyukov (Zenit Petersburg) is booked after bringing down an opponent. Felix Brych had an easy decision to make."
        },
        {
            "gameTime": "2 - 09:20",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) strikes the ball goalwards from a mid range free kick, but his effort only goes towards the middle of the goal and presents no problem for the goalkeeper."
        },
        {
            "gameTime": "2 - 08:52",
            "label": "",
            "description": "Lyon are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 08:42",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Javi Garcia (Zenit Petersburg) was quite harsh and Felix Brych didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 07:18",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 06:36",
            "label": "",
            "description": "Hulk (Zenit Petersburg) unleashed a promising strike from a long distance free kick, but his attempt flies way wide of the right post and it's going to be a goal kick."
        },
        {
            "gameTime": "2 - 06:11",
            "label": "",
            "description": "An opponent rises to his feet after being downed by Mapou Yanga Mbiwa (Lyon). Felix Brych saw the sliding tackle and blows for a foul. Another situation results in a direct free kick for Zenit Petersburg."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "",
            "description": "Danny (Zenit Petersburg) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 03:21",
            "label": "",
            "description": "The linesman raises his flag for offside before Artem Dzyuba (Zenit Petersburg) heads on."
        },
        {
            "gameTime": "2 - 01:40",
            "label": "",
            "description": "Henri Bedimo (Lyon) swings a cross into the box, but it's far too close to Yuri Lodygin, who smothers the ball."
        },
        {
            "gameTime": "2 - 01:24",
            "label": "",
            "description": "Lyon decide to take a short pass from the free kick and the attacking effort continues."
        },
        {
            "gameTime": "2 - 00:48",
            "label": "y-card",
            "description": "Domenico Criscito (Zenit Petersburg) has tested the patience of referee Felix Brych and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Felix Brych starts the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "There was certainly plenty of action during that opening 45 minutes. Both teams are unsuccessfully trying to control the game and it's pretty even so far. The home side have dominated the possession and midfield so far. The visitors have spent most of their time defending and waiting for the right moment to launch counter attacks."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:45",
            "label": "",
            "description": "Hulk (Zenit Petersburg) receives a low pass just outside the box and unleashes a fine strike towards the middle of the goal. Anthony Lopes pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed."
        },
        {
            "gameTime": "1 - 45:27",
            "label": "",
            "description": "Sergi Darder (Lyon) finds himself with a great opportunity! He unleashes a shot from the edge of the box, which whizzes just wide of the left post!"
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "1 - 43:59",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) is penalised for a foul. Felix Brych had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 43:24",
            "label": "",
            "description": "Hulk (Zenit Petersburg) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 42:32",
            "label": "",
            "description": "Danny (Zenit Petersburg) is able to continue to play."
        },
        {
            "gameTime": "1 - 41:35",
            "label": "injury",
            "description": "Danny (Zenit Petersburg) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "1 - 40:23",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) attempts to slip the ball through the defence, but is unable to find any of his teammates. The ball is off of the pitch and it's a goal kick for Zenit Petersburg."
        },
        {
            "gameTime": "1 - 39:54",
            "label": "",
            "description": "Lyon string together a series of short passes."
        },
        {
            "gameTime": "1 - 37:41",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) must feel embarrassed now. He received a killer pass, but his shot from the six yard box was a disaster. He miskicked and made it very easy for Yuri Lodygin to get hold of the ball."
        },
        {
            "gameTime": "1 - 36:20",
            "label": "corner",
            "description": "The resulting corner from Mathieu Valbuena (Lyon) is cleared by the defence."
        },
        {
            "gameTime": "1 - 36:09",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball is out of play. A goal scoring opportunity from a corner for Lyon."
        },
        {
            "gameTime": "1 - 35:21",
            "label": "",
            "description": "Henri Bedimo (Lyon) creates a good chance for himself and goes for goal from mid range, but he fails to change the score as his effort deflects away off the bar."
        },
        {
            "gameTime": "1 - 34:40",
            "label": "",
            "description": "Christophe Jallet (Lyon) skips past his man but can't keep the ball in play. The ball goes out of play and Zenit Petersburg will have a goal kick."
        },
        {
            "gameTime": "1 - 33:10",
            "label": "",
            "description": "Hulk (Zenit Petersburg) seems to have picked up a minor injury, but it looks like he will be able to continue playing."
        },
        {
            "gameTime": "1 - 32:59",
            "label": "injury",
            "description": "The game is interrupted now, Hulk (Zenit Petersburg) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 31:29",
            "label": "y-card",
            "description": "The referee had an easy decision to make. A yellow card is given to Maxime Gonalons (Lyon) for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 31:11",
            "label": "",
            "description": "Mapou Yanga Mbiwa (Lyon) can't believe his eyes as he blows an opportunity from close range. It looked really simple and he only needed to tap the ball in, but he failed. The ball goes well wide of the right post. Hang your head in shame son."
        },
        {
            "gameTime": "1 - 30:46",
            "label": "corner",
            "description": "The corner from Mathieu Valbuena (Lyon) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 30:34",
            "label": "",
            "description": "Claudio Beauvue (Lyon) looks to break free, but an opposing player clears the ball away. The referee and his assistant both point at the corner flag. Lyon will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 29:34",
            "label": "",
            "description": "Chance! Corentin Tolisso (Lyon) comes within inches of scoring after picking up a pass from Mathieu Valbuena, but his shot from inside the box flashes inches wide of the right post."
        },
        {
            "gameTime": "1 - 28:33",
            "label": "",
            "description": "A cross is clipped into the penalty area by Henri Bedimo (Lyon) but poses no threat."
        },
        {
            "gameTime": "1 - 27:10",
            "label": "",
            "description": "Lyon are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 26:54",
            "label": "",
            "description": "Christophe Jallet (Lyon) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 24:07",
            "label": "soccer-ball",
            "description": "Goal! Hulk puts the ball on a plate for Artem Dzyuba (Zenit Petersburg), who scores with a simple close range finish. It's 0:1."
        },
        {
            "gameTime": "1 - 23:05",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 22:59",
            "label": "",
            "description": "Mathieu Valbuena (Lyon) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 22:29",
            "label": "",
            "description": "Henri Bedimo (Lyon) zig zags his way into the box and fails to direct a shot inside the left post. The goalkeeper pulls off a miraculous stop."
        },
        {
            "gameTime": "1 - 21:01",
            "label": "",
            "description": "Alexandre Lacazette (Lyon) produces a lovely chip pass into the box, but one of the opposition players cuts it out."
        },
        {
            "gameTime": "1 - 20:36",
            "label": "",
            "description": "Danny (Zenit Petersburg) latches on to a precise pass and finds himself one on one with the keeper. He fires a low shot towards the right side of the net, but Anthony Lopes leaps like a salmon to deny him."
        },
        {
            "gameTime": "1 - 20:18",
            "label": "corner",
            "description": "Mathieu Valbuena (Lyon) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 19:54",
            "label": "",
            "description": "Claudio Beauvue (Lyon) takes the free kick but it is cleared by the first defender. The ball goes out of play. Lyon are awarded a corner kick."
        },
        {
            "gameTime": "1 - 19:22",
            "label": "",
            "description": "Lyon earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 19:13",
            "label": "y-card",
            "description": "Felix Brych shows a yellow card to Axel Witsel (Zenit Petersburg) for his blatant foul."
        },
        {
            "gameTime": "1 - 18:10",
            "label": "",
            "description": "Great chance! Sergi Darder (Lyon) collects a great pass inside the box, but the goalkeeper does well to stop his effort."
        },
        {
            "gameTime": "1 - 17:12",
            "label": "",
            "description": "Domenico Criscito (Zenit Petersburg) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "1 - 16:29",
            "label": "",
            "description": "Some great controlled play and passing from Zenit Petersburg. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 15:33",
            "label": "",
            "description": "Christophe Jallet sends a lovely lofted pass forward that flies over the top of the defence and into the path of Claudio Beauvue (Lyon), but he can't direct his header on target as it flies well wide of the left post. The ball is off of the pitch and it's a goal kick for Zenit Petersburg."
        },
        {
            "gameTime": "1 - 14:43",
            "label": "",
            "description": "Hulk (Zenit Petersburg) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 14:06",
            "label": "",
            "description": "Felix Brych interrupts the game for a tactical foul by Alexandre Lacazette (Lyon). Zenit Petersburg have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 13:08",
            "label": "",
            "description": "The game is interrupted as Hulk (Zenit Petersburg) is flagged offside."
        },
        {
            "gameTime": "1 - 12:51",
            "label": "",
            "description": "What a poor attempt! Domenico Criscito (Zenit Petersburg) drives another shot towards goal this time from further out, but it couldn't have been worse if he had shot blindfolded. The ball goes into the stands."
        },
        {
            "gameTime": "1 - 12:07",
            "label": "",
            "description": "The free kick is taken by Danny (Zenit Petersburg), but ball is cleared."
        },
        {
            "gameTime": "1 - 11:58",
            "label": "",
            "description": "Mapou Yanga Mbiwa (Lyon) gives away a foul for a fierce tackle on an opponent. Zenit Petersburg win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 10:16",
            "label": "",
            "description": "Domenico Criscito (Zenit Petersburg) plays a through ball but overhits it. The ball goes out of play and Lyon will have a goal kick."
        },
        {
            "gameTime": "1 - 12:59",
            "label": "",
            "description": "There was no time for the supporters to get bored during the game as it was full of action and thrilling moments. The game was quite balanced and neither team had any obvious advantage. The home side attempted to create scoring opportunities mostly with long balls, while the opposition focused on counter attacks to breach the home side's defences."
        },
        {
            "gameTime": "1 - 08:32",
            "label": "",
            "description": "Henri Bedimo (Lyon) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "",
            "description": "Lyon keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 05:23",
            "label": "",
            "description": "A long pass, executed by Domenico Criscito (Zenit Petersburg), missed the precision to reach his teammates. The referee and the linesman both signal a throw in for Lyon."
        },
        {
            "gameTime": "1 - 04:21",
            "label": "",
            "description": "Yuri Lodygin (Zenit Petersburg) sends in a lofted cross from a long range free kick, but it goes out of play."
        },
        {
            "gameTime": "1 - 03:31",
            "label": "",
            "description": "Henri Bedimo (Lyon) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. It's a free kick to Zenit Petersburg in a dangerous position."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "",
            "description": "Lyon try to speed play up by taking a quick free kick."
        },
        {
            "gameTime": "1 - 02:00",
            "label": "",
            "description": "Danny (Zenit Petersburg) commits a rough challenge and Felix Brych blows his whistle for an infringement. Lyon are awarded the free kick."
        },
        {
            "gameTime": "1 - 01:25",
            "label": "",
            "description": "Henri Bedimo (Lyon) sends a teasing cross into the area, but Yuri Lodygin intercepts the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Lyon will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Felix Brych will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. A very even game was seen on the pitch today. The home side's tactic was what is known as kick and rush football, while the away team adopted a counter attacking style."
        }
    ],
    "gameAwayTeam": "Zenit Petersburg",
    "gameDate": "04/11/2015 - 22:45",
    "gameHomeTeam": "Lyon",
    "gameScore": "0 - 2"
}