{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2016-2017/2016-11-05 - 17-30 Hamburger SV 2 - 5 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The away side was dominant and dictated the tempo of the game. The home side relied mainly on counter attacks for their chances, while the opposition constantly tried to keep their opponents under pressure."
        },
        {
            "gameTime": "2 - 45:15",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 44:44",
            "label": "",
            "description": "Nicolai Muller (Hamburger) receives an accurate pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, his effort goes high above the crossbar."
        },
        {
            "gameTime": "2 - 43:26",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Dortmund."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Douglas Santos (Hamburger) was quite harsh and Sascha Stegemann didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 39:14",
            "label": "corner",
            "description": "Aaron Hunt (Hamburger) takes a short corner kick."
        },
        {
            "gameTime": "2 - 38:58",
            "label": "",
            "description": "Aaron Hunt (Hamburger) sends the ball into the box from the side of the pitch, but his cross is blocked. It will be a corner kick for Hamburger SV."
        },
        {
            "gameTime": "2 - 38:10",
            "label": "",
            "description": "Pierre Emerick Aubameyang whips the ball in and it arrives at the feet of Andre Schurrle (Dortmund), whose wild shot goes well wide of the right post. The ball is off of the pitch and it's a goal kick for Hamburger SV."
        },
        {
            "gameTime": "2 - 36:00",
            "label": "soccer-ball",
            "description": "What a goal! Nicolai Muller (Hamburger) receives an accurate pass and tries his luck with a long range shot. He unleashes a superb strike that goes into the bottom left corner and behind the goalkeeper."
        },
        {
            "gameTime": "2 - 35:41",
            "label": "substitution",
            "description": "Problems for Thomas Tuchel as Sokratis is not able to play anymore. His injury is too serious and Felix Passlack (Dortmund) replaces him."
        },
        {
            "gameTime": "2 - 34:03",
            "label": "injury",
            "description": "Sokratis (Dortmund) is writhing in pain and can now receive medical treatment after the referee signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 33:26",
            "label": "",
            "description": "Ousmane Dembele (Dortmund) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "soccer-ball",
            "description": "Goal! Pierre Emerick Aubameyang tees up Ousmane Dembele (Dortmund) on the edge of the box and he fires the ball into the bottom left corner. 1:5."
        },
        {
            "gameTime": "2 - 29:36",
            "label": "",
            "description": "Nicolai Muller (Hamburger) gets on the ball and beats an opponent, but his run is stopped by the referee Sascha Stegemann who sees an offensive foul."
        },
        {
            "gameTime": "2 - 27:17",
            "label": "",
            "description": "Hamburger SV are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "substitution",
            "description": "Substitution. Aaron Hunt (Hamburger) in, Dennis Diekmeier out."
        },
        {
            "gameTime": "2 - 23:58",
            "label": "",
            "description": "Sokratis (Dortmund) leaps high deep inside the box to meet a beautiful cross from the resultant free kick. He glances a header goalwards, but it's not accurate and goes narrowly over the bar."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to substitute Emre Mor and he is replaced by Andre Schurrle (Dortmund)."
        },
        {
            "gameTime": "2 - 22:59",
            "label": "substitution",
            "description": "The referee signals a substitution. Ousmane Dembele (Dortmund) is brought on as a substitute for Christian Pulisic."
        },
        {
            "gameTime": "2 - 22:31",
            "label": "y-card",
            "description": "Gotoku Sakai (Hamburger) is booked after bringing down an opponent. Sascha Stegemann had an easy decision to make."
        },
        {
            "gameTime": "2 - 21:54",
            "label": "",
            "description": "Nicolai Muller (Hamburger) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "2 - 19:14",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) swings the ball into the box from the corner kick but it's a bit too strong and it goes out of play."
        },
        {
            "gameTime": "2 - 18:26",
            "label": "",
            "description": "Gotoku Sakai (Hamburger) meets a delivery on the edge of the penalty area and shoots towards the top of the net. He didn't put enough power into the effort, though, and Roman Burki produces an easy save."
        },
        {
            "gameTime": "2 - 18:10",
            "label": "",
            "description": "Superb touch by Gian Luca Waldschmidt (Hamburger) as he receives a precise pass inside the box. He finds the keeper prepared as he unleashes his shot to the left side of the goal. Wonderful save!"
        },
        {
            "gameTime": "2 - 15:23",
            "label": "",
            "description": "Christian Pulisic (Dortmund) and Lukasz Piszczek have been trying to find each other with some accurate passes ever since the match started. These two definitely combine the most and are the team's most creative players."
        },
        {
            "gameTime": "2 - 13:33",
            "label": "",
            "description": "Hamburger SV control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 13:00",
            "label": "corner",
            "description": "Corner kick. Michael Gregoritsch (Hamburger) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "soccer-ball",
            "description": "Goal 1:4! Nicolai Muller (Hamburger) gets a shot away from the edge of the box and scores into the bottom right corner. Gian Luca Waldschmidt provided an assist for the goal."
        },
        {
            "gameTime": "2 - 08:57",
            "label": "",
            "description": "A long cross from the side is directed to the well positioned Pierre Emerick Aubameyang (Dortmund), but the defence gets it clear."
        },
        {
            "gameTime": "2 - 06:42",
            "label": "substitution",
            "description": "Today's match ends for Pierre Michel Lasogga who will be replaced by Gian Luca Waldschmidt (Hamburger)."
        },
        {
            "gameTime": "2 - 04:17",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) weaves through the defence with ease and gets into a good position in front of goal. He pulls the trigger in an effort to beat the keeper, but fails as the ball zooms around the right post."
        },
        {
            "gameTime": "2 - 02:59",
            "label": "soccer-ball",
            "description": "Goal 0:4! Pierre Emerick Aubameyang (Dortmund) gets a shot away from the edge of the box and scores into the bottom left corner. Christian Pulisic provided an assist for the goal."
        },
        {
            "gameTime": "2 - 01:54",
            "label": "",
            "description": "Pierre Michel Lasogga (Hamburger) meets a cross inside the box, but Roman Burki wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Up to now it has been an action packed game full of wonderful movements and opportunities. The visitors are mostly controlling the match and making it tough for the home side to keep up. The home team's main weapon is fast counter attacks. The away team is applying strong pressure and leaving the opponents little space for combination play."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:30",
            "label": "",
            "description": "Raphael Guerreiro (Dortmund) and Lukasz Piszczek have been trying to find each other with some accurate passes ever since the match started. These two definitely combine the most and are the team's most creative players."
        },
        {
            "gameTime": "1 - 42:13",
            "label": "",
            "description": "Dortmund hold the ball and are exchanging some long passes."
        },
        {
            "gameTime": "1 - 38:47",
            "label": "",
            "description": "Emre Mor (Dortmund) connects with an accurate pass inside the box and fires the ball to the bottom right corner, but one of the defending players steps in to block the effort."
        },
        {
            "gameTime": "1 - 38:02",
            "label": "",
            "description": "Emir Spahic (Hamburger) makes an unfair challenge by holding his opponent to prevent him from getting the ball."
        },
        {
            "gameTime": "1 - 34:55",
            "label": "",
            "description": "Referee Sascha Stegemann sees the trip by Albin Ekdal (Hamburger) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 32:08",
            "label": "corner",
            "description": "Michael Gregoritsch (Hamburger) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "1 - 32:00",
            "label": "corner",
            "description": "Michael Gregoritsch (Hamburger) will deliver the corner kick."
        },
        {
            "gameTime": "1 - 30:41",
            "label": "substitution",
            "description": "We are about to witness a substitution. Albin Ekdal (Hamburger) is replacing Cleber."
        },
        {
            "gameTime": "1 - 28:46",
            "label": "",
            "description": "One of the Hamburger SV players tripped an opponent and conceded a foul."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "soccer-ball",
            "description": "Goal! Pierre Emerick Aubameyang (Dortmund) weaves his way past opponents, and he unleashes a magnificent effort from the edge of the box into the bottom right corner. Rene Adler had no chance of reaching it. The score is 0:3."
        },
        {
            "gameTime": "1 - 26:22",
            "label": "",
            "description": "Close! Christian Pulisic (Dortmund) is a whisker away from finishing off the move he started. His close range effort flies just over the bar. The ball is off of the pitch and it's a goal kick for Hamburger SV."
        },
        {
            "gameTime": "1 - 25:20",
            "label": "",
            "description": "Dortmund are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 22:49",
            "label": "soccer-ball",
            "description": "Pierre Emerick Aubameyang (Dortmund) latches on to a precise pass deep inside the box from Emre Mor, and he beats the goalkeeper with a low shot into the middle of the goal. He makes it 0:2."
        },
        {
            "gameTime": "1 - 20:40",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) commits a foul and Sascha Stegemann immediately signals a free kick."
        },
        {
            "gameTime": "1 - 20:30",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 19:25",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "1 - 18:47",
            "label": "",
            "description": "Sokratis (Dortmund) sends a long cross over to Pierre Emerick Aubameyang, but Rene Adler comes forward to gather the ball."
        },
        {
            "gameTime": "1 - 16:18",
            "label": "corner",
            "description": "Michael Gregoritsch (Hamburger) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "1 - 15:31",
            "label": "",
            "description": "Michael Gregoritsch (Hamburger) tries his luck with a long range shot from a rebound, but it isn't precise at all and the ball flies well wide of the right post towards the corner flag. Very poor shot."
        },
        {
            "gameTime": "1 - 13:19",
            "label": "",
            "description": "Neat passing move from Dortmund in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 11:16",
            "label": "",
            "description": "Emre Mor (Dortmund) feels very aggrieved after the referee stops play for a foul that he commits while in possession of the ball."
        },
        {
            "gameTime": "1 - 10:41",
            "label": "corner",
            "description": "Raphael Guerreiro (Dortmund) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "1 - 09:46",
            "label": "corner",
            "description": "Matthias Ginter (Dortmund) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 09:08",
            "label": "",
            "description": "Nicolai Muller (Hamburger) was too fierce in his attempt to get the ball from his opponent and Sascha Stegemann blows for a foul."
        },
        {
            "gameTime": "1 - 08:07",
            "label": "",
            "description": "Emre Mor (Dortmund) did his best to latch on to a crossfield pass, but it was too long and it goes out of play. The ball goes out of play and Hamburger SV will have a goal kick."
        },
        {
            "gameTime": "1 - 06:59",
            "label": "",
            "description": "Hamburger SV are ruled offside."
        },
        {
            "gameTime": "1 - 06:21",
            "label": "",
            "description": "Gideon Jung (Hamburger) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 05:09",
            "label": "",
            "description": "The ball is cleared after Pierre Emerick Aubameyang (Dortmund) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 03:59",
            "label": "soccer-ball",
            "description": "Goal! Pierre Emerick Aubameyang (Dortmund) fires the rebound low into the middle of the goal after the ball breaks to him in the box. The score is 0:1."
        },
        {
            "gameTime": "1 - 03:42",
            "label": "",
            "description": "Emre Mor (Dortmund) receives a precise low pass inside the box, controls the ball and releases it towards the left post. Unfortunately for him, Rene Adler makes a great save to stop his effort."
        },
        {
            "gameTime": "1 - 02:14",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) crosses the ball forward but it is intercepted."
        },
        {
            "gameTime": "1 - 01:43",
            "label": "",
            "description": "Nicolai Muller (Hamburger) serves up a nice cross, but Roman Burki punches the ball away."
        },
        {
            "gameTime": "1 - 01:22",
            "label": "",
            "description": "Pierre Michel Lasogga (Hamburger) received a clever through ball which could have put him in a promising position, but the defence was alert to the danger."
        },
        {
            "gameTime": "1 - 00:19",
            "label": "",
            "description": "The players are out at last! Dortmund will take the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sascha Stegemann will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Pierre Emerick Aubameyang is the biggest threat to an opponent! He has already scored 17 goals and is top scorer in this Dortmund team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hamburger SV have not tasted victory over their past 4 matches."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "11:27 The goals scored and conceded record for Hamburger SV in the league so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The away side was dominant and dictated the tempo of the game. The home side relied mainly on counter attacks for their chances, while the opposition constantly tried to keep their opponents under pressure."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "05/11/2016 - 17:30",
    "gameHomeTeam": "Hamburger SV",
    "gameScore": "2 - 5"
}