{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-29 - 21-45 Arsenal 2 - 3 Olympiakos Piraeus/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Great display from the home side, you have to say that they were the better side today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        },
        {
            "gameTime": "2 - 48:58",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 48:55",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) makes a yard for himself and goes for goal from long range. It never troubles the goalkeeper as it flies well wide of the left post."
        },
        {
            "gameTime": "2 - 47:14",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 45:29",
            "label": "",
            "description": "Per Mertesacker (Arsenal) after a cross wins the header inside the box and steers it goalwards, but Roberto Jimenez produces a wonderful reflex save."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:41",
            "label": "corner",
            "description": "Alex Oxlade Chamberlain (Arsenal) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "2 - 44:25",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance. Good work from Arsenal as they win a corner."
        },
        {
            "gameTime": "2 - 44:16",
            "label": "funfact",
            "description": "The ball possession is 63:37."
        },
        {
            "gameTime": "2 - 43:42",
            "label": "",
            "description": "Joel Campbell (Arsenal) swings a cross into the box, but it's far too close to Roberto Jimenez, who smothers the ball."
        },
        {
            "gameTime": "2 - 42:50",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 42:09",
            "label": "",
            "description": "Santi Cazorla (Arsenal) stands over the free kick and opts to take it himself, sending it towards the top right corner only for Roberto Jimenez to dive and make a save. The ball goes out for a corner. Arsenal can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 41:19",
            "label": "substitution",
            "description": "Marco da Silva has decided to substitute Konstantinos Fortounis and he is replaced by Praxitelis Vouros (Olympiakos Piraeus)."
        },
        {
            "gameTime": "2 - 40:31",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "2 - 40:27",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Joel Campbell (Arsenal) is coming onto the pitch as Hector Bellerin cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 39:49",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) latches onto a cross into the box from the wing and gets in a header. It went well towards the goal, but it was blocked by one of the defenders. Arsenal get a corner."
        },
        {
            "gameTime": "2 - 38:48",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 38:16",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal. Arsenal will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 38:14",
            "label": "",
            "description": "Mesut Ozil (Arsenal) is caught offside!"
        },
        {
            "gameTime": "2 - 37:04",
            "label": "",
            "description": "Pajtim Kasami (Olympiakos Piraeus) was too forceful with his tackle and Bas Nijhuis interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "",
            "description": "Arsenal seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "2 - 34:51",
            "label": "",
            "description": "Aaron Ramsey (Arsenal) receives a pass and decides to smash the ball from long range, but his poor effort sails high over the bar."
        },
        {
            "gameTime": "2 - 32:22",
            "label": "y-card",
            "description": "Mesut Ozil (Arsenal) takes out his opponent with a horrific tackle and is relieved when the referee only shows him a yellow card."
        },
        {
            "gameTime": "2 - 32:20",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) takes the free kick but it is cleared by the first defender."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "y-card",
            "description": "Konstantinos Fortounis (Olympiakos Piraeus) earns the yellow card."
        },
        {
            "gameTime": "2 - 30:37",
            "label": "y-card",
            "description": "Esteban Cambiasso (Olympiakos Piraeus) is given a yellow card."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "",
            "description": "Esteban Cambiasso (Olympiakos Piraeus) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him. Arsenal earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 29:44",
            "label": "y-card",
            "description": "Bas Nijhuis shows the yellow card to Alfred Finnbogason (Olympiakos Piraeus) for a heavy challenge."
        },
        {
            "gameTime": "2 - 28:53",
            "label": "",
            "description": "The linesman raises his flag. Mesut Ozil (Arsenal) is adjudged offside."
        },
        {
            "gameTime": "2 - 27:25",
            "label": "substitution",
            "description": "Here comes a substitution. Hernani (Olympiakos Piraeus) is brought on as a substitute for Seba."
        },
        {
            "gameTime": "2 - 23:54",
            "label": "corner",
            "description": "A dangerous looking corner kick from Konstantinos Fortounis (Olympiakos Piraeus) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 20:59",
            "label": "soccer-ball",
            "description": "Goal! After receiving a sweet pass, Alfred Finnbogason (Olympiakos Piraeus) unleashes a shot straight inside the left post. Good team effort!"
        },
        {
            "gameTime": "2 - 19:58",
            "label": "",
            "description": "Some great controlled play and passing from Arsenal. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 19:55",
            "label": "soccer-ball",
            "description": "Theo Walcott sends a superb cross into the box. Alexis Sanchez (Arsenal) latches on to it and from close range plants a header inside the left post, leaving Roberto Jimenez beaten. He displayed his eye for goal there excellent finish. The score is 1:2."
        },
        {
            "gameTime": "2 - 18:59",
            "label": "y-card",
            "description": "Roberto Jimenez (Olympiakos Piraeus) is awarded a yellow card for his behaviour."
        },
        {
            "gameTime": "2 - 18:58",
            "label": "",
            "description": "Santi Cazorla (Arsenal) fashions a shot from the edge of the box after receiving an accurate pass. Roberto Jimenez makes a stunning save to stop the effort from flying into the left side of the goal."
        },
        {
            "gameTime": "2 - 18:54",
            "label": "corner",
            "description": "Corner kick. Mesut Ozil (Arsenal) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 18:06",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) makes a good run to meet a precise cross just outside the box. He latches on to it and strikes the ball, but the goalkeeper pulls off a brilliant save. The referee points to the corner flag. It's a corner to Arsenal."
        },
        {
            "gameTime": "2 - 17:19",
            "label": "",
            "description": "Theo Walcott (Arsenal) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 16:42",
            "label": "",
            "description": "Santi Cazorla (Arsenal) is the first to arrive to a rebound inside the penalty area and unleashes a quick strike towards the middle of the target that beats the keeper. One of the defenders, however, makes a goal line clearance."
        },
        {
            "gameTime": "2 - 15:22",
            "label": "",
            "description": "Per Mertesacker (Arsenal) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "2 - 15:04",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 14:45",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Mesut Ozil (Arsenal). The defence is alert and manages to cut it out. The linesman makes the right call and Arsenal will have a corner."
        },
        {
            "gameTime": "2 - 14:39",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Aaron Ramsey (Arsenal) for Francis Coquelin."
        },
        {
            "gameTime": "2 - 13:59",
            "label": "",
            "description": "Hector Bellerin (Arsenal) passes the ball onto Santi Cazorla, but one of the defenders dispossesses him. The ball is out of play and Arsenal manage to earn a corner."
        },
        {
            "gameTime": "2 - 11:30",
            "label": "substitution",
            "description": "Laurent Koscielny is being substituted because of an injury. Arsene Wenger sends Per Mertesacker (Arsenal) on the pitch."
        },
        {
            "gameTime": "2 - 11:00",
            "label": "injury",
            "description": "Laurent Koscielny (Arsenal) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 10:45",
            "label": "corner",
            "description": "Santi Cazorla (Arsenal) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 10:20",
            "label": "",
            "description": "Arsenal are passing the ball across the pitch and keep possession. However, an opponent intercepts a pass and the situation changes. Arsenal force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 07:11",
            "label": "",
            "description": "The ball is behind the sideline. Kieran Gibbs (Arsenal) takes a throw in."
        },
        {
            "gameTime": "2 - 06:40",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) sends a sweet pass into the penalty area, but one of the defenders averts the danger. It's a throw in for Arsenal."
        },
        {
            "gameTime": "2 - 04:31",
            "label": "",
            "description": "Alfred Finnbogason (Olympiakos Piraeus) receives a fine low pass and attempts to send the ball past the goalkeeper, but his shot goes wide of the goal."
        },
        {
            "gameTime": "2 - 03:23",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Brown Ideye will not participate anymore and Alfred Finnbogason (Olympiakos Piraeus) is coming on."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The fans can't complain about what they have been seeing so far on the pitch as both sides are playing highly attractive football. The home side is easily dictating the tempo in this game. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 46:25",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 46:21",
            "label": "",
            "description": "Alexis Sanchez receives a sweet cross inside the box from Hector Bellerin (Arsenal), but one of the defenders rushes in bravely to intercept the move."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "1 - 44:25",
            "label": "y-card",
            "description": "Bas Nijhuis shows a yellow card to Gabriel (Arsenal), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 43:37",
            "label": "y-card",
            "description": "Alexis Sanchez (Arsenal) kept talking out of turn to the referee until Bas Nijhuis lost patience and pulled out a yellow card."
        },
        {
            "gameTime": "1 - 43:02",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 41:25",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 39:55",
            "label": "soccer-ball-own",
            "description": "An unfortunate moment for David Ospina (Arsenal), who has scored an own goal."
        },
        {
            "gameTime": "1 - 39:53",
            "label": "corner",
            "description": "There's an opportunity for Konstantinos Fortounis (Olympiakos Piraeus) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 39:11",
            "label": "",
            "description": "The ball is cleared after Esteban Cambiasso (Olympiakos Piraeus) attempted to dribble past an opposing player. It will be a corner kick for Olympiakos Piraeus."
        },
        {
            "gameTime": "1 - 37:54",
            "label": "",
            "description": "Felipe Pardo (Olympiakos Piraeus) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 35:25",
            "label": "injury",
            "description": "Looks like Felipe Pardo (Olympiakos Piraeus) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 34:59",
            "label": "soccer-ball",
            "description": "Goal! Alexis Sanchez displays great vision and sends a pass to Theo Walcott (Arsenal), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 1:1."
        },
        {
            "gameTime": "1 - 34:35",
            "label": "",
            "description": "Arsenal seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 32:51",
            "label": "soccer-ball",
            "description": "Felipe Pardo (Olympiakos Piraeus) picks it up in space and from the edge of the box lashes in a shot that is deflected past the helpless David Ospina. 0:1."
        },
        {
            "gameTime": "1 - 32:50",
            "label": "corner",
            "description": "Konstantinos Fortounis (Olympiakos Piraeus) will take a corner kick."
        },
        {
            "gameTime": "1 - 31:36",
            "label": "",
            "description": "Konstantinos Fortounis (Olympiakos Piraeus) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. The linesman points to the corner flag, Olympiakos Piraeus are going to take it."
        },
        {
            "gameTime": "1 - 31:08",
            "label": "",
            "description": "Gabriel (Arsenal) handles the ball and everyone in the stadium shouts 'handball'."
        },
        {
            "gameTime": "1 - 29:53",
            "label": "",
            "description": "Good clearance! Omar Elabdellaoui (Olympiakos Piraeus) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him."
        },
        {
            "gameTime": "1 - 27:22",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the right hand post, but Roberto Jimenez was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 25:41",
            "label": "",
            "description": "Leandro Salino (Olympiakos Piraeus) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "1 - 22:13",
            "label": "",
            "description": "Good touch by Konstantinos Fortounis (Olympiakos Piraeus) as he receives a great pass and attempts to threaten the goalkeeper with his long range strike. Unfortunately for him, the effort misses the net and flies well wide to the right."
        },
        {
            "gameTime": "1 - 21:44",
            "label": "",
            "description": "Seba (Olympiakos Piraeus) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 21:14",
            "label": "",
            "description": "Hector Bellerin (Arsenal) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 18:37",
            "label": "",
            "description": "Francis Coquelin (Arsenal) commits a rough challenge and Bas Nijhuis blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 15:44",
            "label": "",
            "description": "Esteban Cambiasso (Olympiakos Piraeus) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball goes out of play and Arsenal will have a goal kick."
        },
        {
            "gameTime": "1 - 13:49",
            "label": "",
            "description": "Alex Oxlade Chamberlain (Arsenal) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 13:23",
            "label": "",
            "description": "Kieran Gibbs (Arsenal) brings an opponent down and Bas Nijhuis interrupts the game."
        },
        {
            "gameTime": "1 - 12:25",
            "label": "",
            "description": "Brown Ideye (Olympiakos Piraeus) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 11:48",
            "label": "",
            "description": "Theo Walcott (Arsenal) meets a precise pass with a nice touch on the edge of the box and produces a shot to the middle of the goal. What an excellent save by the goalkeeper!"
        },
        {
            "gameTime": "1 - 11:17",
            "label": "",
            "description": "David Ospina reacts well to deny a long range free kick from Konstantinos Fortounis (Olympiakos Piraeus) towards the right side of the goal."
        },
        {
            "gameTime": "1 - 10:57",
            "label": "",
            "description": "Bas Nijhuis blows for a foul after Alex Oxlade Chamberlain (Arsenal) was too aggressive in the battle for the ball. There is a free kick near the sideline to Olympiakos Piraeus."
        },
        {
            "gameTime": "1 - 09:58",
            "label": "",
            "description": "Golden chance! Alexis Sanchez (Arsenal) meets a cross in the box and finds some space for a shot. He produces an inaccurate effort that goes wide of the right post."
        },
        {
            "gameTime": "1 - 09:36",
            "label": "corner",
            "description": "Konstantinos Fortounis (Olympiakos Piraeus) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 09:19",
            "label": "",
            "description": "A beautiful low pass from the side is received by Brown Ideye (Olympiakos Piraeus), who was waiting for his chance. However, the defence is alert and spanks the ball away. The ball is out of play. A goal scoring opportunity from a corner for Olympiakos Piraeus."
        },
        {
            "gameTime": "1 - 08:32",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 06:16",
            "label": "",
            "description": "Theo Walcott (Arsenal) attempts to find one of his teammates inside the box with a chip pass, but one of the defending players reacts superbly and intercepts the ball."
        },
        {
            "gameTime": "1 - 05:44",
            "label": "",
            "description": "A promising cross into the box is nearly received by the lurking Pajtim Kasami (Olympiakos Piraeus), but one of the defending players cuts it out to avert the threat."
        },
        {
            "gameTime": "1 - 04:42",
            "label": "",
            "description": "Hector Bellerin (Arsenal) produces a cunning chipped pass for Mesut Ozil, who takes it down well but fails to get past the defenders and loses the ball."
        },
        {
            "gameTime": "1 - 03:20",
            "label": "",
            "description": "Mesut Ozil (Arsenal) is picked out by one of his teammates with a brilliant low pass, but he doesn't control the ball well and the defence eliminates the danger without any problem. That should have been a goalscoring opportunity."
        },
        {
            "gameTime": "1 - 02:13",
            "label": "",
            "description": "The Arsenal players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 00:36",
            "label": "",
            "description": "Santi Cazorla (Arsenal) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Arsenal will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Bas Nijhuis."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Great display from the home side, you have to say that they were the better side today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        }
    ],
    "gameAwayTeam": "Olympiakos Piraeus",
    "gameDate": "29/09/2015 - 21:45",
    "gameHomeTeam": "Arsenal",
    "gameScore": "2 - 3"
}