{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-10-02 - 21-45 Celta Vigo 4 - 3 Barcelona/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "What a terrific football game that was, with everything included. The game was more or less balanced. The hosts tried to catch the opposition off guard and hit them on the break. The visiting side kept the ball at their feet and the main intention was to produce that final killer pass."
        },
        {
            "gameTime": "2 - 50:13",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 48:45",
            "label": "",
            "description": "Arda Turan (Barcelona) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 48:12",
            "label": "",
            "description": "That didn't go as planned! Pablo Pedro Hernandez (Celta Vigo) tried his luck from the edge of the box, but his effort towards the bottom left corner was too weak to get past Marc Andre ter Stegen, who easily kept it out."
        },
        {
            "gameTime": "2 - 47:44",
            "label": "",
            "description": "Jeremy Mathieu (Barcelona) commits a rough challenge and Inaki Vicandi Garrido blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 46:55",
            "label": "",
            "description": "What an opportunity! Gerard Pique (Barcelona) squanders a huge opportunity as he latches on to a perfect cross from the wing. He produces a bullet header from around the penalty spot which goes just wide of the left post!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 5 min. of added time."
        },
        {
            "gameTime": "2 - 44:52",
            "label": "injury",
            "description": "The game is interrupted now, Sergio Alvarez (Celta Vigo) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 44:26",
            "label": "",
            "description": "Neymar (Barcelona) jumps for a cross in the goal area and produces a fine header which goes narrowly wide of the left post! What a huge opportunity!"
        },
        {
            "gameTime": "2 - 44:00",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Neymar (Barcelona) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 42:59",
            "label": "substitution",
            "description": "The substitution is prepared. John Guidetti (Celta Vigo) joins the action as a substitute, replacing Iago Aspas."
        },
        {
            "gameTime": "2 - 42:23",
            "label": "y-card",
            "description": "The whistle blows and Luis Suarez (Barcelona) is booked for an infringement."
        },
        {
            "gameTime": "2 - 41:38",
            "label": "soccer-ball",
            "description": "A perfect lofted pass from Denis Suarez finds Gerard Pique (Barcelona), who jumps highest and steers a close range header to the middle in the countermovement of the keeper. His effort was both strong and precise, and Sergio Alvarez had no chance of stopping that. 3:2."
        },
        {
            "gameTime": "2 - 40:57",
            "label": "",
            "description": "Gerard Pique (Barcelona) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender."
        },
        {
            "gameTime": "2 - 40:40",
            "label": "corner",
            "description": "The resulting corner from Neymar (Barcelona) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 40:22",
            "label": "",
            "description": "Jeremy Mathieu (Barcelona) fails to find any of his teammates inside the box as his pass is blocked. The referee points to the corner flag. It's a corner to Barcelona."
        },
        {
            "gameTime": "2 - 37:16",
            "label": "substitution",
            "description": "Eduardo Berizzo has decided to substitute Daniel Wass and he is replaced by Jonny (Celta Vigo)."
        },
        {
            "gameTime": "2 - 35:55",
            "label": "substitution",
            "description": "Substitution. Alcacer Paco (Barcelona) in, Jordi Alba out."
        },
        {
            "gameTime": "2 - 34:51",
            "label": "",
            "description": "Iago Aspas (Celta Vigo) takes a great touch after receiving a pass inside the box. He immediately unleashes a low shot to the middle of the goal, but the keeper pulls off a decent save!"
        },
        {
            "gameTime": "2 - 31:45",
            "label": "soccer-ball",
            "description": "Goal! Pablo Pedro Hernandez (Celta Vigo) is gifted a chance inside the box and makes no mistake putting the ball into the net with a fine header. 4:2."
        },
        {
            "gameTime": "2 - 30:29",
            "label": "substitution",
            "description": "Substitution. Sergio Busquets did his best and is replaced by Denis Suarez (Barcelona)."
        },
        {
            "gameTime": "2 - 28:29",
            "label": "y-card",
            "description": "Gerard Pique (Barcelona) sees a yellow card from Inaki Vicandi Garrido after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 26:56",
            "label": "",
            "description": "Arda Turan (Barcelona) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "2 - 26:27",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 24:53",
            "label": "",
            "description": "The cross into the penalty area from Andre Gomes (Barcelona) needed to be more accurate in order to create a goal scoring opportunity for his team. The ball goes out of play and Celta Vigo will have a goal kick."
        },
        {
            "gameTime": "2 - 23:39",
            "label": "funfact",
            "description": "14:13 – the total goal attempt statistics."
        },
        {
            "gameTime": "2 - 21:35",
            "label": "",
            "description": "What a wasted opportunity by Pione Sisto (Celta Vigo)! He creates some space for himself inside the penalty box and unleashes a decent strike towards the middle of the net, but Marc Andre ter Stegen makes a comfortable save to thwart him."
        },
        {
            "gameTime": "2 - 18:55",
            "label": "soccer-ball",
            "description": "Neymar (Barcelona) steps up to take the penalty and leaves the keeper helpless with a low shot inside the left post."
        },
        {
            "gameTime": "2 - 18:40",
            "label": "",
            "description": "Neymar (Barcelona) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 17:56",
            "label": "y-card",
            "description": "Hugo Mallo (Celta Vigo) picks up a yellow card."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "penalty",
            "description": "Hugo Mallo (Celta Vigo) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Inaki Vicandi Garrido with no other option than to blow for a foul. The referee gives a penalty to Barcelona after a quick talk with the linesman, who had apparently seen the situation from a better perspective."
        },
        {
            "gameTime": "2 - 17:50",
            "label": "substitution",
            "description": "We are about to witness a substitution. Marcelo Diaz (Celta Vigo) is replacing Theo Bongonda."
        },
        {
            "gameTime": "2 - 16:33",
            "label": "",
            "description": "Sergi Roberto (Barcelona) attempts to find some of his teammates with a dangerous pass from the edge of the box. The opponent's defence, however, intercepts the effort and clears the ball to safety."
        },
        {
            "gameTime": "2 - 14:59",
            "label": "",
            "description": "Arda Turan (Barcelona) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence."
        },
        {
            "gameTime": "2 - 14:05",
            "label": "attendance",
            "description": "The attendance for today's match is 20901."
        },
        {
            "gameTime": "2 - 12:44",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Andres Iniesta puts the ball on a plate for Gerard Pique (Barcelona), who has an easy finish with a header into an empty net. The score is 3:1."
        },
        {
            "gameTime": "2 - 12:14",
            "label": "corner",
            "description": "Neymar (Barcelona) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 10:20",
            "label": "",
            "description": "Inaki Vicandi Garrido blows his whistle after Nemanja Radoja (Celta Vigo) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "2 - 09:02",
            "label": "corner",
            "description": "Neymar (Barcelona) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 08:40",
            "label": "",
            "description": "Andre Gomes (Barcelona) slides a pass forward, but one of the defenders cuts it out. The referee and his assistant both point at the corner flag. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 07:29",
            "label": "",
            "description": "The Barcelona players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition."
        },
        {
            "gameTime": "2 - 05:57",
            "label": "",
            "description": "Theo Bongonda (Celta Vigo) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging. The ball is out of play. Barcelona will take a throw in."
        },
        {
            "gameTime": "2 - 04:49",
            "label": "",
            "description": "Luis Suarez (Barcelona) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 04:22",
            "label": "",
            "description": "Luis Suarez (Barcelona) fails to produce a decent enough free kick for a player of his ability and the only target that he finds is the wall of defenders in front of him."
        },
        {
            "gameTime": "2 - 03:23",
            "label": "",
            "description": "Inaki Vicandi Garrido blows his whistle and signals a foul after Nemanja Radoja (Celta Vigo) brought his opponent down. Barcelona win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 02:07",
            "label": "corner",
            "description": "Daniel Wass (Celta Vigo) works the corner short."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Luis Enrique has decided to make a substitution during the half time break. Andres Iniesta (Barcelona) comes on the pitch for Rafinha."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Inaki Vicandi Garrido starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We are watching a run of the mill game with only a few moments to ignite the crowd. The players surely can surely perform better, they just need to motivate themselves. The hosts dominated much of the first period. The home team's main weapon is fast counter attacks, while the away side attempts to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 45:28",
            "label": "whistle",
            "description": "Inaki Vicandi Garrido has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 44:57",
            "label": "y-card",
            "description": "Sergio Busquets (Barcelona) gets a yellow card."
        },
        {
            "gameTime": "1 - 43:57",
            "label": "",
            "description": "Barcelona quickly take the free kick with a short pass."
        },
        {
            "gameTime": "1 - 43:49",
            "label": "",
            "description": "Inaki Vicandi Garrido has a clear sight and sees a foul from Hugo Mallo (Celta Vigo)."
        },
        {
            "gameTime": "1 - 42:05",
            "label": "",
            "description": "Neymar (Barcelona) fails to send in a decent cross from the free kick from the edge of the box. His effort goes out of play."
        },
        {
            "gameTime": "1 - 41:32",
            "label": "",
            "description": "Nemanja Radoja (Celta Vigo) holds his opponent to prevent him from getting the ball and the referee blows for a foul after seeing the whole situation. That's a free kick to Barcelona."
        },
        {
            "gameTime": "1 - 39:48",
            "label": "",
            "description": "CHANCE! Luis Suarez (Barcelona) picks up a pass inside the box and has a sight of goal, but he sends his shot well wide of the left post."
        },
        {
            "gameTime": "1 - 37:59",
            "label": "",
            "description": "Poor challenge! Facundo Roncaglia (Celta Vigo) is penalised for tripping and Inaki Vicandi Garrido blows his whistle."
        },
        {
            "gameTime": "1 - 36:38",
            "label": "",
            "description": "Sergi Roberto (Barcelona) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 35:49",
            "label": "corner",
            "description": "Neymar (Barcelona) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 35:05",
            "label": "",
            "description": "That didn't go as planned. Hugo Mallo (Celta Vigo) tried his luck from the edge of the box, but his effort towards the left side of the goal was too weak to get past Marc Andre ter Stegen, who easily kept it out."
        },
        {
            "gameTime": "1 - 32:17",
            "label": "soccer-ball-own",
            "description": "Jeremy Mathieu (Barcelona) gets on the scoresheet, but unfortunately for him it's an own goal."
        },
        {
            "gameTime": "1 - 30:25",
            "label": "soccer-ball",
            "description": "What a beauty from just outside the box! Iago Aspas (Celta Vigo) lashed the ball with incredible pace and power into the bottom right corner."
        },
        {
            "gameTime": "1 - 29:00",
            "label": "",
            "description": "Andre Gomes (Barcelona) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "1 - 27:31",
            "label": "",
            "description": "Daniel Wass (Celta Vigo) makes a rough challenge and Inaki Vicandi Garrido blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 26:53",
            "label": "",
            "description": "Neymar (Barcelona) produces a cross from the resulting free kick from just outside the box, but the goalkeeper smothers the ball."
        },
        {
            "gameTime": "1 - 26:24",
            "label": "",
            "description": "Nemanja Radoja (Celta Vigo) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul. A free kick to Barcelona."
        },
        {
            "gameTime": "1 - 24:12",
            "label": "corner",
            "description": "A corner kick by Celta Vigo is thwarted by the well prepared Marc Andre ter Stegen (Barcelona)."
        },
        {
            "gameTime": "1 - 23:26",
            "label": "",
            "description": "Iago Aspas (Celta Vigo) wasted a huge opportunity! The fans already began to celebrate as he produced a shot from the edge of the box after a brilliant solo effort. The ball went straight towards the roof of the net, but Marc Andre ter Stegen made an astonishing save! Celta Vigo will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 21:33",
            "label": "soccer-ball",
            "description": "Goal! After receiving a sweet pass, Pione Sisto (Celta Vigo) unleashes a shot straight into the bottom left corner. Good team effort!"
        },
        {
            "gameTime": "1 - 21:02",
            "label": "",
            "description": "Theo Bongonda (Celta Vigo) shoots from the edge of the penalty area. The ball travels towards the target, but Marc Andre ter Stegen easily deals with the threat."
        },
        {
            "gameTime": "1 - 19:35",
            "label": "",
            "description": "A pass from Theo Bongonda (Celta Vigo) is intercepted by Marc Andre ter Stegen and the move breaks down."
        },
        {
            "gameTime": "1 - 17:08",
            "label": "",
            "description": "Neymar (Barcelona) attempts to find one of his teammates with a ball from a free kick outside the box. The goalkeeper climbs high above all the players in the box to intercept the cross and snuff out the opportunity."
        },
        {
            "gameTime": "1 - 16:35",
            "label": "",
            "description": "Inaki Vicandi Garrido blows for a foul after Hugo Mallo (Celta Vigo) was too aggressive in the battle for the ball. Barcelona have a free kick."
        },
        {
            "gameTime": "1 - 15:03",
            "label": "",
            "description": "Sergi Roberto (Barcelona) tries his luck with a long range shot from a rebound, but it isn't precise at all and the ball flies miles over the crossbar. Very poor shot."
        },
        {
            "gameTime": "1 - 14:21",
            "label": "",
            "description": "Pione Sisto (Celta Vigo) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 12:56",
            "label": "corner",
            "description": "The resulting set piece from Celta Vigo is comfortably intercepted by one of the defending players."
        },
        {
            "gameTime": "1 - 12:10",
            "label": "",
            "description": "Theo Bongonda (Celta Vigo) tries to slide the ball through to a teammate but it's well blocked by a defender. The ball is out of play and Celta Vigo manage to earn a corner."
        },
        {
            "gameTime": "1 - 11:00",
            "label": "",
            "description": "Luis Suarez (Barcelona) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Sergio Alvarez is alert and denies him."
        },
        {
            "gameTime": "1 - 10:19",
            "label": "",
            "description": "Luis Suarez (Barcelona) and Neymar attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 09:08",
            "label": "",
            "description": "Hugo Mallo (Celta Vigo) sends a teasing cross into the area, but Marc Andre ter Stegen intercepts the ball."
        },
        {
            "gameTime": "1 - 07:19",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Neymar (Barcelona), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 06:54",
            "label": "",
            "description": "Neymar (Barcelona) floats the free kick into the box, but it's easily cleared by the first man. Barcelona earn a corner."
        },
        {
            "gameTime": "1 - 06:20",
            "label": "",
            "description": "Gustavo Daniel Cabral (Celta Vigo) commits a rough foul. Inaki Vicandi Garrido stops the game and makes a call."
        },
        {
            "gameTime": "1 - 04:01",
            "label": "",
            "description": "Luis Suarez (Barcelona) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 02:07",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 01:46",
            "label": "",
            "description": "Neymar (Barcelona) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort. The ball goes out for a corner. Barcelona can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 00:39",
            "label": "",
            "description": "Celta Vigo concede a free kick after one of their players holds onto an opposition player. Another situation results in a direct free kick for Barcelona."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Celta Vigo will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Inaki Vicandi Garrido is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Sergi Roberto from Barcelona is in good form this season, he's assisted in a goal 4 times."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Lionel Messi is the leading goal scorer for Barcelona with 9 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Celta Vigo have not tasted defeat in their last 3 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most cautioned player for Celta Vigo is Facundo Roncaglia with 3 yellow cards."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a terrific football game that was, with everything included. The game was more or less balanced. The hosts tried to catch the opposition off guard and hit them on the break. The visiting side kept the ball at their feet and the main intention was to produce that final killer pass."
        }
    ],
    "gameAwayTeam": "Barcelona",
    "gameDate": "02/10/2016 - 21:45",
    "gameHomeTeam": "Celta Vigo",
    "gameScore": "4 - 3"
}