{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-09-25 - 21-45 Fiorentina 0 - 0 AC Milan/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "We can only hope that the managers will be able to motivate the players and spark them into life in the next games. The football on offer today has been disappointing. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        },
        {
            "gameTime": "2 - 50:11",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 50:00",
            "label": "y-card",
            "description": "Luca Antonelli (AC Milan) picks up a yellow card for an infringement."
        },
        {
            "gameTime": "2 - 48:31",
            "label": "",
            "description": "Luiz Adriano (AC Milan) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 47:10",
            "label": "",
            "description": "The referee blows his whistle for a foul after Khouma Babacar (Fiorentina) overruns the ball during an attack and makes an aggressive challenge on his opponent."
        },
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "Great teamplay by Fiorentina as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 45:58",
            "label": "y-card",
            "description": "Daniele Orsato shows a yellow card to Hrvoje Milic (Fiorentina) for a tough tackle."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 5 min. of added time."
        },
        {
            "gameTime": "2 - 41:20",
            "label": "substitution",
            "description": "Substitution. Carlos Bacca will be replaced by Luiz Adriano (AC Milan)."
        },
        {
            "gameTime": "2 - 40:10",
            "label": "",
            "description": "Fiorentina are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 37:20",
            "label": "",
            "description": "Close! Carlos Bacca (AC Milan) picks up the ball in space and from inside the penalty area sends a shot inches wide of the right post."
        },
        {
            "gameTime": "2 - 36:41",
            "label": "substitution",
            "description": "Paulo Sousa decides to make a substitution. Josip Ilicic will be replaced by Khouma Babacar (Fiorentina)."
        },
        {
            "gameTime": "2 - 34:44",
            "label": "y-card",
            "description": "The foul by Manuel Locatelli (AC Milan) is worthy of a card and a yellow is duly shown by Daniele Orsato."
        },
        {
            "gameTime": "2 - 34:01",
            "label": "",
            "description": "Nikola Kalinic (Fiorentina) hits an explosive shot from outside the penalty area and forces the goalkeeper to make a good save."
        },
        {
            "gameTime": "2 - 33:23",
            "label": "substitution",
            "description": "Here comes a substitution. Luca Antonelli (AC Milan) is brought on as a substitute for Giacomo Bonaventura."
        },
        {
            "gameTime": "2 - 29:31",
            "label": "",
            "description": "The ball is cleared after Cristian Tello (Fiorentina) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 27:40",
            "label": "substitution",
            "description": "Paulo Sousa prepares a substitution. Milan Badelj is replaced by Cristian Tello (Fiorentina)."
        },
        {
            "gameTime": "2 - 27:27",
            "label": "",
            "description": "Gabriel Paletta (AC Milan) gets the ball from a rebound and shoots from long range, but sends the ball high over the crossbar. The goalkeeper doesn't have to worry about this one. Very poor attempt."
        },
        {
            "gameTime": "2 - 27:01",
            "label": "corner",
            "description": "The resulting corner, taken by Suso (AC Milan), comes to nothing."
        },
        {
            "gameTime": "2 - 26:43",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) sends a cross into the box, but the opposition's defence clears the ball to safety. Now AC Milan have a corner."
        },
        {
            "gameTime": "2 - 25:55",
            "label": "",
            "description": "The linesman raises his flag. Hrvoje Milic (Fiorentina) is adjudged offside."
        },
        {
            "gameTime": "2 - 24:30",
            "label": "",
            "description": "Juraj Kucka (AC Milan) receives a reproachful look from his teammates after he attempted to surprise the goalkeeper with a shot from long distance. The ball flew far wide of the right post."
        },
        {
            "gameTime": "2 - 22:46",
            "label": "",
            "description": "Federico Bernardeschi (Fiorentina) gets into a good shooting position. He wins some space for himself and drills a long range daisy cutter towards the middle of the goal. His good effort is, however, superbly saved by Gianluigi Donnarumma!"
        },
        {
            "gameTime": "2 - 21:43",
            "label": "corner",
            "description": "Josip Ilicic (Fiorentina) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 21:24",
            "label": "substitution",
            "description": "Substitution. Manuel Locatelli (AC Milan) in, M'Baye Niang out."
        },
        {
            "gameTime": "2 - 20:42",
            "label": "",
            "description": "What a wasted opportunity by Iglesias Borja Valero (Fiorentina)! He creates himself some space inside the penalty box and unleashes a decent strike towards the left side of the goal, but Gianluigi Donnarumma makes an astonishing save to thwart him. The referee signals a corner kick to Fiorentina."
        },
        {
            "gameTime": "2 - 19:24",
            "label": "corner",
            "description": "Josip Ilicic (Fiorentina) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 19:08",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Hrvoje Milic (Fiorentina). Fiorentina have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 17:23",
            "label": "",
            "description": "Suso (AC Milan) latches on to a precise pass and one on one with the keeper slams the ball towards the left hand post. Ciprian Tatarusanu is alert, though, and leaps like a salmon to deny him."
        },
        {
            "gameTime": "2 - 15:12",
            "label": "injury",
            "description": "M'Baye Niang (AC Milan) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 14:21",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) takes a shot from the edge of the box, but it's not a big threat for the goalkeeper as his effort is blocked by a defender."
        },
        {
            "gameTime": "2 - 13:12",
            "label": "substitution",
            "description": "It's time for a substitution. Matias Vecino (Fiorentina) comes on in place of Gonzalo Rodriguez."
        },
        {
            "gameTime": "2 - 12:39",
            "label": "",
            "description": "Ciprian Tatarusanu had to pull off an exquisite save to thwart a knuckleball from Mattia De Sciglio (AC Milan), even though it only went towards the middle of the target."
        },
        {
            "gameTime": "2 - 11:04",
            "label": "",
            "description": "Carlos Bacca (AC Milan) decides to strike the ball towards goal, but his effort fails to threaten the goalkeeper after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 09:13",
            "label": "",
            "description": "Gianluigi Donnarumma pulls off a great save to deny Nikola Kalinic (Fiorentina) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "2 - 07:30",
            "label": "",
            "description": "Borja Valero (Fiorentina) attempts to surprise the keeper with a nice shot, but it lacks accuracy and goes well wide of the right post."
        },
        {
            "gameTime": "2 - 07:17",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Federico Bernardeschi (Fiorentina)."
        },
        {
            "gameTime": "2 - 07:11",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Hrvoje Milic (Fiorentina), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 05:58",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender."
        },
        {
            "gameTime": "2 - 03:25",
            "label": "",
            "description": "Carlos Sanchez (Fiorentina) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "2 - 01:37",
            "label": "",
            "description": "Iglesias Borja Valero (Fiorentina) has a sight of goal and shoots towards the roof of the net, but the goalkeeper makes a superb save."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. It's difficult to say if one side enjoyed any superiority over the other in the first half. Both team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 46:13",
            "label": "whistle",
            "description": "Daniele Orsato has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:54",
            "label": "y-card",
            "description": "A yellow card for a tackle by Riccardo Montolivo (AC Milan). Daniele Orsato doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 42:06",
            "label": "",
            "description": "Federico Bernardeschi (Fiorentina) fails to pick a body out in the box with an over hit cross to the back post. The ball is off of the pitch and it's a goal kick for AC Milan."
        },
        {
            "gameTime": "1 - 40:51",
            "label": "corner",
            "description": "Suso (AC Milan) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 40:12",
            "label": "",
            "description": "M'Baye Niang (AC Milan) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee blows his whistle, AC Milan are awarded a corner kick."
        },
        {
            "gameTime": "1 - 39:43",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) unleashes a shot, but his effort is poor and flies well wide of the left post."
        },
        {
            "gameTime": "1 - 39:04",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) plays a one two with Borja Valero, but the move breaks down."
        },
        {
            "gameTime": "1 - 36:41",
            "label": "",
            "description": "The free kick from the edge of the box is taken by Josip Ilicic (Fiorentina), but he hits it straight in the defensive wall."
        },
        {
            "gameTime": "1 - 35:51",
            "label": "",
            "description": "Gabriel Paletta (AC Milan) brings down his opponent with a very late tackle. Fiorentina win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 35:26",
            "label": "",
            "description": "The foul by M'Baye Niang (AC Milan) was seen by Daniele Orsato who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 32:12",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Giacomo Bonaventura (AC Milan) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "1 - 30:53",
            "label": "",
            "description": "Riccardo Montolivo (AC Milan) takes a free kick from the edge of the box. He sends a nice cross into the box, but his intention is well anticipated by the goalkeeper who comes out to collect the ball."
        },
        {
            "gameTime": "1 - 29:44",
            "label": "",
            "description": "Milan Badelj (Fiorentina) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. There is a free kick near the sideline to AC Milan."
        },
        {
            "gameTime": "1 - 29:12",
            "label": "",
            "description": "Federico Bernardeschi (Fiorentina) attempted to pick out a free teammate inside the box, but Gianluigi Donnarumma comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 28:15",
            "label": "",
            "description": "Fiorentina seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 26:41",
            "label": "",
            "description": "Juraj Kucka (AC Milan) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 22:59",
            "label": "penalty-missed",
            "description": "Josip Ilicic (Fiorentina) fails to score from the penalty as his shot only hits the right post."
        },
        {
            "gameTime": "1 - 22:57",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "1 - 22:40",
            "label": "y-card",
            "description": "Davide Calabria (AC Milan) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Daniele Orsato ignores the protests."
        },
        {
            "gameTime": "1 - 22:35",
            "label": "penalty",
            "description": "A clumsy foul by Davide Calabria (AC Milan) and Daniele Orsato blows his whistle. PENALTY to Fiorentina!"
        },
        {
            "gameTime": "1 - 20:57",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 17:30",
            "label": "",
            "description": "M'Baye Niang (AC Milan) misses a rebound from the penalty spot. The ball flies just a few inches over the bar."
        },
        {
            "gameTime": "1 - 17:07",
            "label": "",
            "description": "M'Baye Niang (AC Milan) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "1 - 15:22",
            "label": "corner",
            "description": "Iglesias Borja Valero (Fiorentina) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger. Fiorentina will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 12:48",
            "label": "",
            "description": "Carlos Bacca (AC Milan) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 11:09",
            "label": "corner",
            "description": "Federico Bernardeschi (Fiorentina) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 10:42",
            "label": "",
            "description": "Hrvoje Milic (Fiorentina) wastes a good opportunity as his pass into the box is blocked by the defence. The ball is out of play and Fiorentina manage to earn a corner."
        },
        {
            "gameTime": "1 - 09:21",
            "label": "",
            "description": "Daniele Orsato has a clear sight and sees a foul from Juraj Kucka (AC Milan)."
        },
        {
            "gameTime": "1 - 08:31",
            "label": "",
            "description": "Carlos Sanchez (Fiorentina) attempts to surprise the keeper with a shot from distance, but it lacks accuracy and goes high over the crossbar."
        },
        {
            "gameTime": "1 - 07:54",
            "label": "corner",
            "description": "The resulting set piece from Fiorentina is comfortably intercepted by one of the defending players."
        },
        {
            "gameTime": "1 - 07:24",
            "label": "",
            "description": "A pass from M'Baye Niang (AC Milan) is intercepted by Ciprian Tatarusanu and the move breaks down."
        },
        {
            "gameTime": "1 - 05:18",
            "label": "",
            "description": "Josip Ilicic (Fiorentina) unleashes a decent effort from just outside the box which goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 04:34",
            "label": "corner",
            "description": "Ciprian Tatarusanu leaps to intercept the corner kick from Riccardo Montolivo (AC Milan)."
        },
        {
            "gameTime": "1 - 04:12",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) attempts to curl the ball over the defensive wall from the free kick, but his effort fails to reach the goal. AC Milan earn a corner."
        },
        {
            "gameTime": "1 - 02:56",
            "label": "y-card",
            "description": "Gonzalo Rodriguez (Fiorentina) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Daniele Orsato didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "1 - 02:04",
            "label": "",
            "description": "Federico Bernardeschi (Fiorentina) wastes a big chance! He unleashes a shot from the edge of the box and it goes narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Daniele Orsato."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Nenad Tomovic has more yellow cards (3) than any other Fiorentina player."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Fiorentina have managed to earn only 59 points from 36 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Bacca have rippled the net 6x and is the top scorer for AC Milan this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We can only hope that the managers will be able to motivate the players and spark them into life in the next games. The football on offer today has been disappointing. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        }
    ],
    "gameAwayTeam": "AC Milan",
    "gameDate": "25/09/2016 - 21:45",
    "gameHomeTeam": "Fiorentina",
    "gameScore": "0 - 0"
}