{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-01-21 - 22-45 AC Milan 1 - 2 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. We saw a very balanced game over the 90 minutes. Long balls and crosses were the main weapons of both teams."
        },
        {
            "gameTime": "2 - 50:22",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 49:43",
            "label": "",
            "description": "Gianluigi Donnarumma (AC Milan) leaps high near the penalty spot and gets a header in from the free kick. The attempt goes down towards the middle of the net, but the goalkeeper makes a comfortable save. It was a difficult header and it's always tough to put the ball inside the net from positions like that."
        },
        {
            "gameTime": "2 - 48:51",
            "label": "",
            "description": "Amadou Diawara (Napoli) jumps into a tackle and Gianluca Rocchi blows his whistle for a foul. That's a free kick to AC Milan."
        },
        {
            "gameTime": "2 - 48:35",
            "label": "",
            "description": "The ball is cleared after Gianluca Lapadula (AC Milan) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 45:44",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) is caught offside after the linesman raises his flag."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:59",
            "label": "",
            "description": "Gabriel Paletta (AC Milan) connects with the corner but his looping header goes well over."
        },
        {
            "gameTime": "2 - 43:51",
            "label": "corner",
            "description": "Suso (AC Milan) will take the corner."
        },
        {
            "gameTime": "2 - 43:24",
            "label": "",
            "description": "Andrea Bertolacci (AC Milan) gets on the end of a pass on the edge of the box but his shot is blocked. The ball goes out of play and AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Jose Callejon (Napoli)."
        },
        {
            "gameTime": "2 - 40:55",
            "label": "substitution",
            "description": "Vincenzo Montella decides to make a substitution. Mario Pasalic will be replaced by M'Baye Niang (AC Milan)."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Allan will be replaced by Marko Rog (Napoli)."
        },
        {
            "gameTime": "2 - 39:20",
            "label": "",
            "description": "Dries Mertens (Napoli) fails to send a pass into the box as his effort is cut out. The ball goes out for a corner. Napoli can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 38:03",
            "label": "",
            "description": "Andrea Bertolacci (AC Milan) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 36:37",
            "label": "y-card",
            "description": "Jose Callejon (Napoli) was probably a bit loose with his words to Gianluca Rocchi, who decides to show him a yellow."
        },
        {
            "gameTime": "2 - 34:07",
            "label": "",
            "description": "The AC Milan players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 31:15",
            "label": "",
            "description": "Napoli produce a short pass from the free kick."
        },
        {
            "gameTime": "2 - 30:52",
            "label": "",
            "description": "Gustavo Gomez (AC Milan) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul. There is a free kick near the sideline to Napoli."
        },
        {
            "gameTime": "2 - 28:57",
            "label": "substitution",
            "description": "The manager makes a subsitution with Andrea Bertolacci (AC Milan) coming on for Jose Sosa."
        },
        {
            "gameTime": "2 - 28:51",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to introduce fresh legs, with replacing Marek Hamsik (Napoli)."
        },
        {
            "gameTime": "2 - 27:59",
            "label": "substitution",
            "description": "The referee signals a substitution. Gianluca Lapadula (AC Milan) is brought on as a substitute for Carlos Bacca."
        },
        {
            "gameTime": "2 - 26:59",
            "label": "corner",
            "description": "Suso (AC Milan) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 26:53",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) swings in the corner kick, but one of the defenders leaps highest to head the ball away. AC Milan win a corner."
        },
        {
            "gameTime": "2 - 26:35",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) looks to break free, but an opposing player clears the ball away. AC Milan force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 24:53",
            "label": "",
            "description": "Dries Mertens (Napoli) goes on a mazy run through the defence and gets within shooting range inside the box, but his effort to the bottom right corner is thwarted by Gianluigi Donnarumma."
        },
        {
            "gameTime": "2 - 22:28",
            "label": "",
            "description": "Carlos Bacca (AC Milan) collects a pass on the edge of the box and unleashes a low drive to the middle, but Pepe Reina makes a save."
        },
        {
            "gameTime": "2 - 21:35",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) meets a cross inside the box, but Gianluigi Donnarumma wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "2 - 20:31",
            "label": "",
            "description": "Marek Hamsik (Napoli) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 18:38",
            "label": "",
            "description": "A brilliant individual effort! Lorenzo Insigne (Napoli) tricks his way past challenges into the box and drags his shot narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 16:39",
            "label": "corner",
            "description": "Suso (AC Milan) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "2 - 16:16",
            "label": "",
            "description": "A cross into the box from Suso (AC Milan) is cleared. The ball goes out of play. AC Milan are awarded a corner kick."
        },
        {
            "gameTime": "2 - 15:35",
            "label": "substitution",
            "description": "Substitution. Jorginho leaves the pitch and is replaced by Amadou Diawara (Napoli)."
        },
        {
            "gameTime": "2 - 14:52",
            "label": "",
            "description": "Suso (AC Milan) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball into the stands. Nice run, but poor finish!"
        },
        {
            "gameTime": "2 - 13:14",
            "label": "corner",
            "description": "AC Milan take a short corner kick."
        },
        {
            "gameTime": "2 - 13:02",
            "label": "",
            "description": "Carlos Bacca (AC Milan) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. The linesman points to the corner flag, AC Milan are going to take it."
        },
        {
            "gameTime": "2 - 10:56",
            "label": "y-card",
            "description": "Carlos Bacca (AC Milan) gets booked for the first time in this match."
        },
        {
            "gameTime": "2 - 08:52",
            "label": "funfact",
            "description": "4:5 – this is the current number of shots on target."
        },
        {
            "gameTime": "2 - 06:36",
            "label": "",
            "description": "Close! Lorenzo Insigne (Napoli) takes the resultant free kick from 25 metres out and his shot goes just over the crossbar."
        },
        {
            "gameTime": "2 - 05:22",
            "label": "y-card",
            "description": "Gustavo Gomez (AC Milan) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Gianluca Rocchi didn't think twice about pulling it out of his pocket. A free kick is awarded to Napoli."
        },
        {
            "gameTime": "2 - 02:51",
            "label": "",
            "description": "Jose Sosa (AC Milan) collects a rebound and produces a mid range attempt. The ball goes low to the middle of the target, but Pepe Reina keeps it out."
        },
        {
            "gameTime": "2 - 02:40",
            "label": "corner",
            "description": "Suso (AC Milan) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 02:24",
            "label": "",
            "description": "Mario Pasalic (AC Milan) slides a pass forward, but one of the defenders cuts it out. Corner kick. AC Milan will have an opportunity."
        },
        {
            "gameTime": "2 - 01:28",
            "label": "",
            "description": "Mario Pasalic (AC Milan) had a good opportunity when he latched on to a cross from the wing, but his header from the six yard box wasn't accurate enough and the ball glanced away off the left post!"
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "We have seen an attractive offensive game so far and the fans have nothing to complain about. The away side are dominant and dictating the tempo of the game, mainly because of their higher activity and more accurate passing. Both sides have adopted a tactic known as kick and rush football."
        },
        {
            "gameTime": "1 - 46:50",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 46:40",
            "label": "",
            "description": "Suso (AC Milan) fires in an effort from the free kick from some 20 metres. His strike is very inaccurate and ends in row Z."
        },
        {
            "gameTime": "1 - 45:50",
            "label": "y-card",
            "description": "Lorenzo Tonelli (Napoli) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent. AC Milan are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:34",
            "label": "",
            "description": "This shall not pass! Jorginho (Napoli) lines up a shot from the edge of the box and goes for goal, but the effort is well blocked by a defender."
        },
        {
            "gameTime": "1 - 41:50",
            "label": "",
            "description": "The Napoli players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 37:54",
            "label": "y-card",
            "description": "A yellow card for a tackle by Ivan Strinic (Napoli). Gianluca Rocchi doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 36:43",
            "label": "soccer-ball",
            "description": "Juraj Kucka (AC Milan) has a great chance inside the box and puts the ball into the back of the net."
        },
        {
            "gameTime": "1 - 35:54",
            "label": "",
            "description": "Carlos Bacca (AC Milan) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "1 - 34:58",
            "label": "",
            "description": "Gustavo Gomez (AC Milan) blows a huge opportunity! He latches on to a perfect cross from the wing into the penalty area, but sends his bullet header just wide of the right post."
        },
        {
            "gameTime": "1 - 34:51",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 34:38",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. Now AC Milan have a corner."
        },
        {
            "gameTime": "1 - 32:32",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Ignazio Abate (AC Milan)."
        },
        {
            "gameTime": "1 - 31:39",
            "label": "",
            "description": "Flag goes up against Lorenzo Insigne (Napoli) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 29:59",
            "label": "",
            "description": "Jose Sosa (AC Milan) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 28:28",
            "label": "",
            "description": "Dries Mertens (Napoli) picks up a lofted cross inside the box and fires a quick shot to the middle of the goal. His promising effort is kept out by Gianluigi Donnarumma, who pulls off a stunning save!"
        },
        {
            "gameTime": "1 - 27:56",
            "label": "",
            "description": "Ignazio Abate (AC Milan) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "1 - 27:35",
            "label": "",
            "description": "Ivan Strinic (Napoli) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "1 - 25:59",
            "label": "y-card",
            "description": "The foul by Jose Sosa (AC Milan) is worthy of a card and a yellow is duly shown by Gianluca Rocchi."
        },
        {
            "gameTime": "1 - 23:52",
            "label": "",
            "description": "AC Milan keep the ball well and push forward with purpose, but here comes an interception from the opposition."
        },
        {
            "gameTime": "1 - 21:51",
            "label": "y-card",
            "description": "Gianluca Rocchi shows a yellow card to Davide Calabria (AC Milan) for a tough tackle."
        },
        {
            "gameTime": "1 - 18:51",
            "label": "",
            "description": "Jorginho (Napoli) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 16:38",
            "label": "",
            "description": "Davide Calabria (AC Milan) commits a foul and Gianluca Rocchi immediately signals a free kick."
        },
        {
            "gameTime": "1 - 15:13",
            "label": "",
            "description": "Jose Callejon (Napoli) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 14:37",
            "label": "injury",
            "description": "Looks like Jose Callejon (Napoli) is struggling after picking up a knock. Hopefully he can run it off."
        },
        {
            "gameTime": "1 - 13:51",
            "label": "",
            "description": "Dries Mertens (Napoli) threads a pass through to Jose Callejon, but Gianluigi Donnarumma breaks up the move."
        },
        {
            "gameTime": "1 - 11:43",
            "label": "y-card",
            "description": "Dries Mertens (Napoli) picked up a yellow card from referee."
        },
        {
            "gameTime": "1 - 11:35",
            "label": "",
            "description": "Dries Mertens (Napoli) dived to the ground without any contact with the opponent."
        },
        {
            "gameTime": "1 - 10:28",
            "label": "",
            "description": "Suso (AC Milan) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 08:25",
            "label": "soccer-ball",
            "description": "Goal Jose Callejon (Napoli)! Jose Callejon (Napoli) was put through by Dries Mertens and he showed brilliant composure inside the box to bury the ball into the back of the net. 0:2."
        },
        {
            "gameTime": "1 - 07:30",
            "label": "",
            "description": "Neat passing move from Napoli in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 05:18",
            "label": "soccer-ball",
            "description": "Stunning strike! Lorenzo Insigne (Napoli) latches on to a precise through ball from Dries Mertens before unleashing an unstoppable shot inside the right post from the edge of the area. Fantastic goal. The score is now 0:1."
        },
        {
            "gameTime": "1 - 03:52",
            "label": "",
            "description": "Ignazio Abate (AC Milan) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 02:30",
            "label": "",
            "description": "Good clearance! Dries Mertens (Napoli) receives a brilliant short pass and finds himself in a good position inside the box, but he's robbed of the ball by one of the defending players."
        },
        {
            "gameTime": "1 - 01:45",
            "label": "",
            "description": "AC Milan play a few nice passes from player to player, but their possession doesn't last long as an opposition player intercepts a pass."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AC Milan will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gianluca Rocchi was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dries Mertens is the leading goal scorer for Napoli with 12 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "2:2 This was the result of the last match between AC Milan and Torino."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The fans must be pleased with the show they have seen on the pitch today. There was no chance to get bored as the game was very attractive. Let's hope the players won't lose their passion and determination in the future matches. We saw a very balanced game over the 90 minutes. Long balls and crosses were the main weapons of both teams."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "21/01/2017 - 22:45",
    "gameHomeTeam": "AC Milan",
    "gameScore": "1 - 2"
}