{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-10-23 - 16-00 Crotone 1 - 2 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The away side dominated the game. It's obvious that defence had the highest priority for the home side. The away team tried to constantly keep their opponents under pressure."
        },
        {
            "gameTime": "2 - 48:11",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:59",
            "label": "soccer-ball",
            "description": "Aleandro Rosi (Crotone) receives the ball inside the box, reacts quickly and without any problems fires the ball into the back of the net."
        },
        {
            "gameTime": "2 - 43:54",
            "label": "corner",
            "description": "Aleandro Rosi (Crotone) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "2 - 42:03",
            "label": "corner",
            "description": "Adrian Stoian (Crotone) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 37:59",
            "label": "substitution",
            "description": "That's the end of the game for Dries Mertens, who is replaced by Omar El Kaddouri (Napoli)."
        },
        {
            "gameTime": "2 - 35:59",
            "label": "corner",
            "description": "Leonardo Capezzi (Crotone) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "2 - 34:59",
            "label": "corner",
            "description": "Aleandro Rosi (Crotone) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 33:59",
            "label": "",
            "description": "Simy (Crotone) was trying to get to the ball but clattered into the legs of the opponent as well. Paolo Mazzoleni blows his whistle for an infringement."
        },
        {
            "gameTime": "2 - 31:42",
            "label": "corner",
            "description": "Leonardo Capezzi (Crotone) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "substitution",
            "description": "Maurizio Sarri prepares a substitution. Jose Callejon is replaced by Emanuele Giaccherini (Napoli)."
        },
        {
            "gameTime": "2 - 29:59",
            "label": "substitution",
            "description": "A substitution has been made. Raffaele Palladino is replaced by Marcus Rohden (Crotone)."
        },
        {
            "gameTime": "2 - 29:15",
            "label": "",
            "description": "The cross into the penalty area from Jose Callejon (Napoli) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "2 - 25:59",
            "label": "",
            "description": "Dries Mertens (Napoli) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 23:41",
            "label": "",
            "description": "Jose Callejon (Napoli) fires the resulting free kick on goal from a medium range, but sees his shot saved by the goalkeeper."
        },
        {
            "gameTime": "2 - 22:17",
            "label": "",
            "description": "Simy (Crotone) latched on to an accurate pass deep into the box and attempted to fire the ball past the keeper, but the shot is way off target. What a miskick!"
        },
        {
            "gameTime": "2 - 20:59",
            "label": "corner",
            "description": "Jose Callejon (Napoli) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "corner",
            "description": "The corner kick from Ivan Strinic (Napoli) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to make a change. replaces Marek Hamsik (Napoli)."
        },
        {
            "gameTime": "2 - 17:55",
            "label": "corner",
            "description": "Leonardo Capezzi (Crotone) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 12:52",
            "label": "y-card",
            "description": "Lorenzo Crisetig (Crotone) sees a yellow card from Paolo Mazzoleni after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 08:39",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Simy (Crotone) comes onto the pitch so that Aleksandar Tonev can be given a rest."
        },
        {
            "gameTime": "2 - 07:32",
            "label": "",
            "description": "Adrian Stoian (Crotone) sends a chip pass into the box, but Pepe Reina is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 01:57",
            "label": "corner",
            "description": "Ivan Strinic (Napoli) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "2 - 00:24",
            "label": "substitution",
            "description": "Davide Nicola makes a switch. Adrian Stoian (Crotone) is coming on in place of Aniello Salzano at the start of the second period."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. The hosts played second fiddle to the visitors in the first half. It's obvious that defence has the highest priority for the home side and the away team constantly try to keep them under pressure."
        },
        {
            "gameTime": "1 - 45:14",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "corner",
            "description": "Lorenzo Crisetig (Crotone) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 43:45",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 43:40",
            "label": "",
            "description": "Jose Callejon (Napoli) gets inside the penalty area and sends a powerful shot that almost ends inside the net. The keeper is alert and makes a good save."
        },
        {
            "gameTime": "1 - 41:00",
            "label": "",
            "description": "Aleksandar Tonev (Crotone) escapes the opposition's pressure by passing the ball on the ground."
        },
        {
            "gameTime": "1 - 36:59",
            "label": "corner",
            "description": "Jose Callejon (Napoli) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 35:55",
            "label": "",
            "description": "Aleksandar Tonev (Crotone) is adjudged offside."
        },
        {
            "gameTime": "1 - 32:59",
            "label": "soccer-ball",
            "description": "Nikola Maksimovic (Napoli) gets on the end of the corner kick deep inside the box and scores past the keeper with a superb low shot into the bottom right corner."
        },
        {
            "gameTime": "1 - 32:58",
            "label": "corner",
            "description": "There's an opportunity for Ivan Strinic (Napoli) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "1 - 31:25",
            "label": "y-card",
            "description": "The foul by Gianmarco Ferrari (Crotone) is worthy of a card and a yellow is duly shown by Paolo Mazzoleni."
        },
        {
            "gameTime": "1 - 30:59",
            "label": "r-card",
            "description": "Manolo Gabbiadini (Napoli) is sent off! He receives a red card and the match ends for him. He attempts to argue, but the referee's decision is final."
        },
        {
            "gameTime": "1 - 28:41",
            "label": "",
            "description": "Wow, what an escape. Raffaele Palladino (Crotone) has an effort from inside the box but it's brilliantly blocked."
        },
        {
            "gameTime": "1 - 27:01",
            "label": "",
            "description": "The referee stops play as the linesman flags Manolo Gabbiadini (Napoli) offside."
        },
        {
            "gameTime": "1 - 25:24",
            "label": "",
            "description": "Jose Callejon (Napoli) again sends a long range pass to his teammate to start a counter attack."
        },
        {
            "gameTime": "1 - 22:23",
            "label": "",
            "description": "Dries Mertens (Napoli) controls a cross inside the box and shoots towards goal, but one of the defenders reacts superbly to block his effort."
        },
        {
            "gameTime": "1 - 20:27",
            "label": "",
            "description": "Dries Mertens (Napoli) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again."
        },
        {
            "gameTime": "1 - 16:59",
            "label": "soccer-ball",
            "description": "What an excellent finish! Jose Callejon (Napoli) latched on to an inch perfect cross into the box and rifled an unstoppable low drive into the middle of the net and past the helpless goalkeeper."
        },
        {
            "gameTime": "1 - 15:20",
            "label": "",
            "description": "Aleandro Rosi (Crotone) takes the free kick which is inaccurate and the defence has no problem with the clearance."
        },
        {
            "gameTime": "1 - 14:00",
            "label": "",
            "description": "Paolo Mazzoleni blows his whistle after Alexander Soderlund kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "1 - 12:26",
            "label": "corner",
            "description": "Ivan Strinic (Napoli) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 10:26",
            "label": "",
            "description": "Aleksandar Tonev (Crotone) goes on a weaving run through the defence and gets within shooting range but his effort is blocked."
        },
        {
            "gameTime": "1 - 06:56",
            "label": "",
            "description": "A spell of possession for Crotone in an attempt to control the game."
        },
        {
            "gameTime": "1 - 04:19",
            "label": "",
            "description": "Marek Hamsik (Napoli) latched on to an accurate pass deep into the box and attempted to fire the ball past the keeper, but the shot is way off target. What a miskick!"
        },
        {
            "gameTime": "1 - 02:11",
            "label": "",
            "description": "Ivan Strinic (Napoli) and Marek Hamsik have been trying to find each other with some accurate passes ever since the match started. These two definitely combine the most and are the team's most creative players."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Crotone will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paolo Mazzoleni will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last game that Napoli played was against Torino and it ended 5:0."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Napoli is Jose Callejon with 7 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Crotone have lost 5x away this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The away side dominated the game. It's obvious that defence had the highest priority for the home side. The away team tried to constantly keep their opponents under pressure."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "23/10/2016 - 16:00",
    "gameHomeTeam": "Crotone",
    "gameScore": "1 - 2"
}