{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-10-22 - 17-00 Arsenal 0 - 0 Middlesbrough/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. The hosts were largely in control of the game today. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        },
        {
            "gameTime": "2 - 49:55",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 48:58",
            "label": "",
            "description": "Theo Walcott (Arsenal) is flagged for offside."
        },
        {
            "gameTime": "2 - 48:02",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Mesut Ozil (Arsenal) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "2 - 46:55",
            "label": "substitution",
            "description": "Aitor Karanka de la Hoz has decided to introduce fresh legs, with Christian Stuani (Middlesbrough) replacing Alvaro Negredo."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:32",
            "label": "",
            "description": "Alvaro Negredo (Middlesbrough) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 40:37",
            "label": "",
            "description": "Adam Forshaw (Middlesbrough) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the right post."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "substitution",
            "description": "Here is a change. Gaston Ramirez is going off and Aitor Karanka de la Hoz gives the last tactical orders to Stewart Downing (Middlesbrough)."
        },
        {
            "gameTime": "2 - 34:27",
            "label": "",
            "description": "Mesut Ozil (Arsenal) sends a cross into the box, but Victor Valdes comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 31:24",
            "label": "attendance",
            "description": "The attendance is 59962."
        },
        {
            "gameTime": "2 - 28:51",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Mohamed Elneny leaves the pitch and Alex Oxlade Chamberlain (Arsenal) comes on."
        },
        {
            "gameTime": "2 - 27:41",
            "label": "",
            "description": "Gaston Ramirez (Middlesbrough) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "2 - 25:59",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 25:54",
            "label": "",
            "description": "Nacho Monreal (Arsenal) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. Corner kick. Arsenal will have an opportunity."
        },
        {
            "gameTime": "2 - 21:59",
            "label": "substitution",
            "description": "Substitution. Alex Iwobi walks off the pitch and Lucas Perez (Arsenal) comes on as a substitute."
        },
        {
            "gameTime": "2 - 21:09",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Victor Valdes is alert and denies him."
        },
        {
            "gameTime": "2 - 18:59",
            "label": "y-card",
            "description": "Michael Dean shows the yellow card to Shkodran Mustafi (Arsenal) for a heavy challenge."
        },
        {
            "gameTime": "2 - 16:49",
            "label": "corner",
            "description": "Gaston Ramirez (Middlesbrough) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 13:39",
            "label": "corner",
            "description": "Middlesbrough force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 13:11",
            "label": "",
            "description": "Benjamin Gibson (Middlesbrough) weaves through the defence with ease and gets one on one with the keeper, but fails to score with his strike towards the left side of the target as Petr Cech produces a good save."
        },
        {
            "gameTime": "2 - 11:12",
            "label": "corner",
            "description": "Adam Forshaw (Middlesbrough) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 10:56",
            "label": "",
            "description": "Antonio Barragan (Middlesbrough) serves up a nice cross, but the defence clears the danger. The referee and his assistant both point at the corner flag. Middlesbrough will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 08:30",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) fashions a shot from the edge of the box after receiving an accurate pass. Victor Valdes makes a stunning save to stop the effort from flying into the right side of the goal. Arsenal have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 07:02",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) sends the resulting free kick a whisker wide of the left post!"
        },
        {
            "gameTime": "2 - 05:29",
            "label": "",
            "description": "Hector Bellerin (Arsenal) produces a poor pass. He attempts to get the ball into the box but it's hacked away."
        },
        {
            "gameTime": "2 - 03:16",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "There has been no time for the supporters to get bored during an eventful opening 45 minutes. Both teams provided some breathtaking moments. The hosts were superior in their performance in the first half. They were more active and precise. The home side are keeping possession of the ball with some short passes, while the visitors are waiting to open up their defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:51",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Mesut Ozil (Arsenal), but one of the defenders gets it clear."
        },
        {
            "gameTime": "1 - 44:41",
            "label": "",
            "description": "Theo Walcott (Arsenal) slaloms his way past challenges, but an opposing player does well to get the ball away. Arsenal have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 43:50",
            "label": "",
            "description": "Theo Walcott (Arsenal) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 40:12",
            "label": "",
            "description": "Arsenal players are exchanging short passes with one another, waiting for the right moment to beat the opposition's defence."
        },
        {
            "gameTime": "1 - 37:56",
            "label": "corner",
            "description": "Mohamed Elneny (Arsenal) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "1 - 37:35",
            "label": "",
            "description": "Theo Walcott (Arsenal) produces a dangerous low pass into the penalty area, but the defence manage to cut it out. Arsenal force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 35:46",
            "label": "corner",
            "description": "Gaston Ramirez (Middlesbrough) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 33:18",
            "label": "",
            "description": "A header by Gaston Ramirez (Middlesbrough) from very close range goes towards the middle of the target, but doesn't get past Petr Cech, who makes a nice save. The ball is out of play. Middlesbrough win a corner kick."
        },
        {
            "gameTime": "1 - 31:14",
            "label": "",
            "description": "Referee Michael Dean sees the trip by Adam Clayton (Middlesbrough) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 29:04",
            "label": "",
            "description": "Theo Walcott (Arsenal) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "1 - 26:25",
            "label": "",
            "description": "Hector Bellerin (Arsenal) is penalised for holding. Michael Dean signals a set piece."
        },
        {
            "gameTime": "1 - 23:04",
            "label": "corner",
            "description": "The resulting corner from Mesut Ozil (Arsenal) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 22:44",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) produces a shot on goal from a mid range free kick. It heads towards the top right corner, but the keeper averts the danger with a stunning save! The ball is out of play. Arsenal will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 19:56",
            "label": "",
            "description": "Gaston Ramirez (Middlesbrough) takes a mid range free kick and his stunning strike crashes against the crossbar."
        },
        {
            "gameTime": "1 - 19:22",
            "label": "",
            "description": "Alvaro Negredo (Middlesbrough) fails to score from the rebound as the goalkeeper stops his effort from hitting the net."
        },
        {
            "gameTime": "1 - 18:50",
            "label": "",
            "description": "Adama Traore (Middlesbrough) unleashes a promising shot towards the middle of the goal after his wonderful solo run, but Petr Cech thwarts the effort with a fabulous save. The score remains the same."
        },
        {
            "gameTime": "1 - 17:51",
            "label": "",
            "description": "Mohamed Elneny (Arsenal) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 16:03",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 15:36",
            "label": "",
            "description": "Alexis Sanchez (Arsenal) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee blows his whistle, Arsenal are awarded a corner kick."
        },
        {
            "gameTime": "1 - 12:03",
            "label": "",
            "description": "Theo Walcott (Arsenal) produces a brilliant low pass into the box, where Mesut Ozil is already waiting. He attempts to dribble past the defence, but one of the defenders does well to dispossess him."
        },
        {
            "gameTime": "1 - 09:53",
            "label": "",
            "description": "Mohamed Elneny (Arsenal) collects a wonderful lead pass and creates some space to smash the ball goalwards from long range. His shot goes painfully close to the right post!"
        },
        {
            "gameTime": "1 - 08:44",
            "label": "corner",
            "description": "Mohamed Elneny (Arsenal) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 08:25",
            "label": "",
            "description": "Nacho Monreal (Arsenal) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety. Arsenal get a corner."
        },
        {
            "gameTime": "1 - 06:57",
            "label": "",
            "description": "Mesut Ozil (Arsenal) misses a great opportunity to convert the free kick from the edge of the penalty box after firing the ball high over the crossbar of the goal."
        },
        {
            "gameTime": "1 - 05:26",
            "label": "",
            "description": "Alex Iwobi (Arsenal) sends a sweet pass into the penalty area, but one of the defenders averts the danger."
        },
        {
            "gameTime": "1 - 03:20",
            "label": "corner",
            "description": "Mesut Ozil (Arsenal) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 03:04",
            "label": "",
            "description": "Arsenal are showing great team chemistry. They are passing the ball around seamlessly but finally one of the defending players makes an interception. Arsenal force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 00:44",
            "label": "",
            "description": "A long pass, executed by Shkodran Mustafi (Arsenal), missed the precision to reach his teammates."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Arsenal will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Michael Dean got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "720 Stewart Downing has played more minutes than anyone in this Middlesbrough team."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Arsenal will be striving to extend their brilliant 6 match winning run in this competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Arsenal is Alexis Sanchez with 11 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The performance from both sides could be described as average. There were only a few stirring moments and the fans probably expected more from this game. The hosts were largely in control of the game today. The home team made a lot of passes and attempted to maintain possession, while the away side made defence their highest priority."
        }
    ],
    "gameAwayTeam": "Middlesbrough",
    "gameDate": "22/10/2016 - 17:00",
    "gameHomeTeam": "Arsenal",
    "gameScore": "0 - 0"
}