{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-10-02 - 21-45 AS Roma 2 - 1 Inter/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The game was quite balanced and neither team had any obvious advantage. The home team attempted to leave the opposition defence outnumbered and hit them on the break. The visitors tried to keep the ball on the ground and play a passing game."
        },
        {
            "gameTime": "2 - 48:13",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 48:05",
            "label": "",
            "description": "Ever Banega (Inter) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 47:49",
            "label": "",
            "description": "Juan Jesus (AS Roma) was too fierce in his attempt to get the ball from his opponent and Luca Banti blows for a foul. Inter are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 47:27",
            "label": "corner",
            "description": "Ever Banega (Inter) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 47:00",
            "label": "",
            "description": "Stevan Jovetic (Inter) passes the ball from the edge of the box in order to find his teammate, who is in a good scoring position, but the defender blocks the pass and spanks the ball to safety. The referee signals a corner kick to Inter."
        },
        {
            "gameTime": "2 - 45:56",
            "label": "",
            "description": "Luca Banti blows his whistle for a foul after Assane Gnoukouri (Inter) hacks down one of his opponents."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:10",
            "label": "substitution",
            "description": "That will be all from Alessandro Florenzi who is being replaced by the fresh legs of Radja Nainggolan (AS Roma)."
        },
        {
            "gameTime": "2 - 43:31",
            "label": "",
            "description": "Assane Gnoukouri (Inter) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 41:45",
            "label": "",
            "description": "Edin Dzeko (AS Roma) creates himself some space inside the goalmouth and connects with the resulting free kick. His accurate header would have probably ended up inside the left post, but Samir Handanovic pulls off a superb reflex save to thwart him."
        },
        {
            "gameTime": "2 - 40:45",
            "label": "",
            "description": "Yuto Nagatomo (Inter) fouls an opponent. At least that's what referee Luca Banti signals. AS Roma are awarded the free kick."
        },
        {
            "gameTime": "2 - 38:17",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 19:17."
        },
        {
            "gameTime": "2 - 36:48",
            "label": "",
            "description": "Inter are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "2 - 34:53",
            "label": "",
            "description": "The game is interrupted as Stevan Jovetic (Inter) is flagged offside."
        },
        {
            "gameTime": "2 - 33:26",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Leandro Paredes (AS Roma) is coming onto the pitch as Diego Perotti cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 32:45",
            "label": "",
            "description": "Great teamplay by Inter as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 30:00",
            "label": "",
            "description": "Stevan Jovetic (Inter) brings an opponent down and Luca Banti interrupts the game. AS Roma have been awarded a free kick."
        },
        {
            "gameTime": "2 - 29:48",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) puts a cross into the box from the free kick but it's cleared."
        },
        {
            "gameTime": "2 - 28:59",
            "label": "",
            "description": "Miranda (Inter) makes a strong challenge and Luca Banti blows for a foul. That's a free kick to AS Roma."
        },
        {
            "gameTime": "2 - 28:48",
            "label": "",
            "description": "Some neat passing and movement from AS Roma as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "2 - 26:52",
            "label": "soccer-ball",
            "description": "Mauro Icardi produces a sweet pass and picks out Ever Banega (Inter) inside the box. He quickly takes a shot which goes into the bottom right corner and leaves the goalkeeper helpless. He makes it 1:0!"
        },
        {
            "gameTime": "2 - 24:40",
            "label": "substitution",
            "description": "Luciano Spalletti decides to make a substitution. Mohamed Salah will be replaced by Stephan El Shaarawy (AS Roma)."
        },
        {
            "gameTime": "2 - 24:00",
            "label": "substitution",
            "description": "Substitution. Antonio Candreva did his best and is replaced by Stevan Jovetic (Inter)."
        },
        {
            "gameTime": "2 - 23:47",
            "label": "",
            "description": "The linesman raises his flag. Mohamed Salah (AS Roma) is adjudged offside."
        },
        {
            "gameTime": "2 - 23:35",
            "label": "",
            "description": "Unbelievable miss! Assane Gnoukouri (Inter) reacts superbly to latch on to a rebound, but he blazes the ball high over the crossbar!"
        },
        {
            "gameTime": "2 - 22:00",
            "label": "soccer-ball-own",
            "description": "Mauro Icardi (Inter) attempts to head the ball away after a cross into the penalty area, but instead he accidentally sends it under the roof of his own goal. The goalkeeper was helpless."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "",
            "description": "Ever Banega (Inter) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 19:48",
            "label": "",
            "description": "Close! Ivan Perisic (Inter) takes the resulting free kick from a promising positon, but his effort flies inches wide of the right post."
        },
        {
            "gameTime": "2 - 18:44",
            "label": "y-card",
            "description": "Luca Banti shows a yellow card to Juan Jesus (AS Roma) for a tough tackle. Inter win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 17:29",
            "label": "",
            "description": "The effort by Ever Banega (Inter) failed to give the goalkeeper anything to worry about. He unleashed a poor shot from 20 metres which flew high over the bar."
        },
        {
            "gameTime": "2 - 16:37",
            "label": "substitution",
            "description": "Here is a change. Cristian Ansaldi is going off and Frank de Boer gives the last tactical orders to Yuto Nagatomo (Inter)."
        },
        {
            "gameTime": "2 - 15:52",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but his attempt went well wide of the right post. The ball goes out of play and Inter will have a goal kick."
        },
        {
            "gameTime": "2 - 15:11",
            "label": "corner",
            "description": "The ball is out of play. AS Roma will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 15:04",
            "label": "",
            "description": "Mohamed Salah (AS Roma) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 14:37",
            "label": "substitution",
            "description": "Today's match ends for Joao Mario who will be replaced by Assane Gnoukouri (Inter)."
        },
        {
            "gameTime": "2 - 13:15",
            "label": "",
            "description": "What a chance that is! Mohamed Salah swings the ball into the box, and Kevin Strootman (AS Roma) gets in front of his man and powers his header just over the bar."
        },
        {
            "gameTime": "2 - 12:08",
            "label": "",
            "description": "Antonio Candreva (Inter) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 11:18",
            "label": "",
            "description": "Ever Banega (Inter) wastes a big opportunity! He controls the ball after a nice low pass and shoots from a promising distance. His poor effort goes miles wide of the left post."
        },
        {
            "gameTime": "2 - 09:35",
            "label": "",
            "description": "The AS Roma players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 08:00",
            "label": "corner",
            "description": "Antonio Candreva (Inter) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 07:52",
            "label": "",
            "description": "Ivan Perisic (Inter) latches on to an accurate pass on the edge of the box and unleashes a strong shot towards the right side of the goal, but his effort is denied by the well positioned keeper with a stunning save. The referee and his assistant both point at the corner flag. Inter will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 07:22",
            "label": "",
            "description": "Diego Perotti (AS Roma) wasted a huge opportunity! The fans already began to celebrate as he produced a shot from the edge of the box after a brilliant solo effort. The ball went towards the bottom left corner, but Samir Handanovic made an astonishing save!"
        },
        {
            "gameTime": "2 - 06:59",
            "label": "",
            "description": "Diego Perotti (AS Roma) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat."
        },
        {
            "gameTime": "2 - 06:00",
            "label": "",
            "description": "A pass from Ivan Perisic (Inter) is intercepted by Wojciech Szczesny and the move breaks down."
        },
        {
            "gameTime": "2 - 03:45",
            "label": "",
            "description": "Kevin Strootman (AS Roma) sends a long ball in, but Samir Handanovic comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 01:49",
            "label": "",
            "description": "Some patient build up play from Inter as they look to unlock the defence."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "It's a wonderful experience for every football lover to behold this hugely entertaining encounter. The players are performing at a high level, making the game very attractive. The game is quite balanced. The home team tries to find the weakness in the opposition's defence, especially with rapid counter attacks, while the away team play possession football."
        },
        {
            "gameTime": "1 - 46:10",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "",
            "description": "Cristian Ansaldi (Inter) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "1 - 43:52",
            "label": "injury",
            "description": "Cristian Ansaldi (Inter) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "1 - 43:00",
            "label": "",
            "description": "Edin Dzeko (AS Roma) jinks his way past multiple challenges and fires the ball from the edge of the box to the bottom right corner, but Samir Handanovic shows his agility and makes a save."
        },
        {
            "gameTime": "1 - 42:35",
            "label": "",
            "description": "Miranda (Inter) rises high to meet a perfect cross, but luckily for the goalkeeper he steers his header just over the crossbar."
        },
        {
            "gameTime": "1 - 42:00",
            "label": "corner",
            "description": "Ever Banega (Inter) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 41:38",
            "label": "",
            "description": "Wojciech Szczesny makes a sensational save to thwart a great chance. A rebound falls to Antonio Candreva (Inter) on the edge of the box and he strikes goalwards, but the ball ends up in the keeper's gloves instead of inside the left post. The linesman points to the corner flag, Inter are going to take it."
        },
        {
            "gameTime": "1 - 40:42",
            "label": "",
            "description": "Alessandro Florenzi (AS Roma) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the left post."
        },
        {
            "gameTime": "1 - 40:00",
            "label": "",
            "description": "Some great controlled play and passing from Inter. They are increasing their possession of the ball and trying to open up the opposition's defence to hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 38:31",
            "label": "",
            "description": "That was close by Diego Perotti (AS Roma)! He receives a pass on the edge of the box and shoots, but the ball goes inches wide of the right post. The ball is off of the pitch and it's a goal kick for Inter."
        },
        {
            "gameTime": "1 - 38:00",
            "label": "funfact",
            "description": "The actual number of corner kicks in this match – 3:10."
        },
        {
            "gameTime": "1 - 36:00",
            "label": "y-card",
            "description": "Today's referee Luca Banti rightly decides to book Cristian Ansaldi (Inter) for his harsh tackle."
        },
        {
            "gameTime": "1 - 35:39",
            "label": "",
            "description": "Mauro Icardi (Inter) tries to latch onto a through ball, but it's too long."
        },
        {
            "gameTime": "1 - 34:39",
            "label": "corner",
            "description": "Antonio Candreva (Inter) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 34:23",
            "label": "",
            "description": "Gary Medel (Inter) looks to break free, but an opposing player clears the ball away. Inter have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 33:49",
            "label": "",
            "description": "Diego Perotti (AS Roma) sends a teasing cross into the area, but Samir Handanovic intercepts the ball."
        },
        {
            "gameTime": "1 - 32:00",
            "label": "",
            "description": "Antonio Candreva (Inter) receives a lofted pass from out wide and shoots from close range, but the ball flies way past the left hand post."
        },
        {
            "gameTime": "1 - 31:47",
            "label": "corner",
            "description": "Ever Banega (Inter) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 31:24",
            "label": "",
            "description": "Joao Mario (Inter) attempts to find one of his teammates with a fine lofted pass, but the defence reacts well to intercept the effort. The ball is out of play and the linesman points at the corner flag. Corner to Inter."
        },
        {
            "gameTime": "1 - 30:20",
            "label": "corner",
            "description": "Inter work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "1 - 30:00",
            "label": "corner",
            "description": "Ever Banega (Inter) takes the corner, but one of the defenders reacts well and rises highest to head the ball away. Corner kick. Inter will have an opportunity."
        },
        {
            "gameTime": "1 - 29:48",
            "label": "",
            "description": "Ever Banega (Inter) whips the ball in from the long range free kick, but the first man gets it clear. The ball goes out for a corner. Inter can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 29:39",
            "label": "",
            "description": "Referee Luca Banti sees the trip by Edin Dzeko (AS Roma) and doesn't hesitate to blow his whistle. Inter will take a free kick."
        },
        {
            "gameTime": "1 - 28:37",
            "label": "",
            "description": "Cristian Ansaldi (Inter) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 27:50",
            "label": "",
            "description": "Edin Dzeko (AS Roma) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the middle of the target, but Samir Handanovic was alert and the score remains the same."
        },
        {
            "gameTime": "1 - 26:48",
            "label": "",
            "description": "Joao Mario (Inter) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 25:00",
            "label": "",
            "description": "Federico Fazio (AS Roma) wastes a great chance as he climbs high around the penalty spot to connect with a cross from the resulting free kick. He produces a header which goes well over the bar."
        },
        {
            "gameTime": "1 - 23:58",
            "label": "y-card",
            "description": "A yellow card for a tackle by Davide Santon (Inter). Luca Banti doesn't hesitate at all to make this decision. AS Roma win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 22:00",
            "label": "corner",
            "description": "Ever Banega (Inter) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "1 - 21:56",
            "label": "",
            "description": "Ivan Perisic (Inter) produces a dangerous low pass into the penalty area, but the defence manage to cut it out. Inter force their opponents to concede a corner."
        },
        {
            "gameTime": "1 - 21:00",
            "label": "",
            "description": "Mohamed Salah (AS Roma) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Samir Handanovic guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 20:18",
            "label": "",
            "description": "OFF THE POST! Mohamed Salah (AS Roma) drifts into the box to give his teammate support. He receives a fantastic pass and shoots from close range, but it crashes against the right post! It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "1 - 18:36",
            "label": "",
            "description": "Antonio Candreva (Inter) receives a pass and decides to smash the ball from long range. His poor effort sails well wide of the right post. The ball goes out of play and AS Roma will have a goal kick."
        },
        {
            "gameTime": "1 - 16:45",
            "label": "",
            "description": "Mohamed Salah (AS Roma) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 16:08",
            "label": "",
            "description": "Cristian Ansaldi (Inter) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "1 - 15:28",
            "label": "",
            "description": "Inter keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "1 - 13:46",
            "label": "",
            "description": "Diego Perotti (AS Roma) bursts into the penalty area with the ball at his feet after a wonderful individual effort that left fans breathless and in awe. However, he sends the ball in a completely different direction than intended, well wide of the target."
        },
        {
            "gameTime": "1 - 12:57",
            "label": "",
            "description": "Half chance! Antonio Candreva (Inter) plays a pass into the box, but Wojciech Szczesny reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 11:46",
            "label": "corner",
            "description": "This corner kick is taken with a short pass by Ever Banega (Inter)."
        },
        {
            "gameTime": "1 - 11:27",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from 25 metres out by Ever Banega (Inter) as his effort only hit the wall. Inter have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 10:54",
            "label": "",
            "description": "Alessandro Florenzi (AS Roma) brings his opponent down with a tackle and Luca Banti blows his whistle for a foul. Inter get a free kick."
        },
        {
            "gameTime": "1 - 09:54",
            "label": "",
            "description": "Bruno Peres (AS Roma) receives a precise pass on the edge of the box and shoots. His poorly placed shot flies well wide of the left post."
        },
        {
            "gameTime": "1 - 09:00",
            "label": "",
            "description": "OFF THE POST! Out of nothing, Ever Banega (Inter) meanders towards the goal before wriggling away from a defender and unleashing a shot from 25 metres out that hits the left post!"
        },
        {
            "gameTime": "1 - 07:50",
            "label": "",
            "description": "Miranda (Inter) pulls the jersey of one of the opposition players and Luca Banti blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 06:11",
            "label": "",
            "description": "Edin Dzeko (AS Roma) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 04:46",
            "label": "soccer-ball",
            "description": "Goal! Bruno Peres puts the ball on a plate for Edin Dzeko (AS Roma), who scores with a simple close range finish. It's 1:0."
        },
        {
            "gameTime": "1 - 02:46",
            "label": "corner",
            "description": "Alessandro Florenzi (AS Roma) launches the ball from the resulting corner, but one of the defenders is first to the ball and deals with the threat."
        },
        {
            "gameTime": "1 - 02:20",
            "label": "corner",
            "description": "Alessandro Florenzi (AS Roma) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety. AS Roma win a corner."
        },
        {
            "gameTime": "1 - 01:50",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Mohamed Salah (AS Roma). The ball goes behind for a corner. AS Roma will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 00:51",
            "label": "corner",
            "description": "A quickly taken corner by Inter."
        },
        {
            "gameTime": "1 - 00:34",
            "label": "",
            "description": "Antonio Candreva (Inter) produces a dangerous lofted cross into the box which is intercepted. The ball is out of play. Inter win a corner kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "",
            "description": "The players are out at last! AS Roma will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Inter are unbeaten over their past 5 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Luca Banti."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Inter is Mauro Icardi with 12 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Edin Dzeko from AS Roma will look to add to his goal tally, he has netted 4 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The game was quite balanced and neither team had any obvious advantage. The home team attempted to leave the opposition defence outnumbered and hit them on the break. The visitors tried to keep the ball on the ground and play a passing game."
        }
    ],
    "gameAwayTeam": "Inter",
    "gameDate": "02/10/2016 - 21:45",
    "gameHomeTeam": "AS Roma",
    "gameScore": "2 - 1"
}