{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-03-04 - 18-15 Eibar 1 - 4 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:50",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 2 min. of added time."
        },
        {
            "gameTime": "2 - 42:33",
            "label": "",
            "description": "Mariano Diaz (Real Madrid) commits a foul and Gonzalez Gonzalez immediately signals a free kick."
        },
        {
            "gameTime": "2 - 41:44",
            "label": "corner",
            "description": "The corner kick from Isco (Real Madrid) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 41:34",
            "label": "",
            "description": "Lucas (Real Madrid) races towards goal but the defender gets back well to make a challenge. Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 41:17",
            "label": "substitution",
            "description": "Substitution. Pedro Leon makes way for Takashi Inui (Eibar)."
        },
        {
            "gameTime": "2 - 40:32",
            "label": "",
            "description": "Sergio Enrich (Eibar) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "attendance",
            "description": "The attendance for today's match is 6740."
        },
        {
            "gameTime": "2 - 37:58",
            "label": "",
            "description": "Anaitz Arbilla (Eibar) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 37:31",
            "label": "injury",
            "description": "Anaitz Arbilla (Eibar) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 33:34",
            "label": "corner",
            "description": "Pedro Leon (Eibar) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 33:20",
            "label": "",
            "description": "Gonzalo Escalante (Eibar) serves up a nice cross, but the defence clears the danger. The ball is out of play. Eibar win a corner kick."
        },
        {
            "gameTime": "2 - 32:29",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) trips an opposition player and Gonzalez Gonzalez signals a foul."
        },
        {
            "gameTime": "2 - 29:59",
            "label": "substitution",
            "description": "The referee allows time for a substitution. James Rodriguez will be replaced by Isco (Real Madrid)."
        },
        {
            "gameTime": "2 - 29:24",
            "label": "",
            "description": "Mariano Diaz (Real Madrid) is flagged offside and it's not the first time today."
        },
        {
            "gameTime": "2 - 28:50",
            "label": "",
            "description": "Mariano Diaz (Real Madrid) almost finds himself in a very promising position, but he is flagged offside by the linesman."
        },
        {
            "gameTime": "2 - 26:21",
            "label": "soccer-ball",
            "description": "Goal! Pedro Leon puts a cross into the box and finds Ruben Pena (Eibar), who latches on to it and strikes the ball inside the right post. He makes it 1:4."
        },
        {
            "gameTime": "2 - 25:56",
            "label": "substitution",
            "description": "Substitution. Luka Modric will be replaced by Mateo Kovacic (Real Madrid)."
        },
        {
            "gameTime": "2 - 23:52",
            "label": "",
            "description": "Pedro Leon (Eibar) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "2 - 22:55",
            "label": "",
            "description": "Gonzalo Escalante (Eibar) has a goal ruled out for offside!"
        },
        {
            "gameTime": "2 - 22:30",
            "label": "",
            "description": "Sergio Enrich (Eibar) peeled away from his marker and got on the end of the resulting corner, but he sends his header straight at the goalkeeper."
        },
        {
            "gameTime": "2 - 22:20",
            "label": "corner",
            "description": "Pedro Leon (Eibar) will try to find the head of one of his teammates from a corner kick."
        },
        {
            "gameTime": "2 - 20:47",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to make a change. Mariano Diaz (Real Madrid) replaces Karim Benzema."
        },
        {
            "gameTime": "2 - 19:36",
            "label": "y-card",
            "description": "Casemiro (Real Madrid) sees a yellow card from Gonzalez Gonzalez after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 18:55",
            "label": "",
            "description": "Sergio Enrich (Eibar) gets in a good position inside the box and is only inches away from getting on the end of a through ball from the edge of the area."
        },
        {
            "gameTime": "2 - 17:59",
            "label": "substitution",
            "description": "We are about to witness a substitution. Cristian Rivera (Eibar) is replacing Adrian."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "y-card",
            "description": "Is that a yellow card in the referee's hand? It is! Nacho (Real Madrid) gets booked."
        },
        {
            "gameTime": "2 - 16:46",
            "label": "",
            "description": "Karim Benzema (Real Madrid) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 14:36",
            "label": "soccer-ball",
            "description": "Goal! Marco Asensio (Real Madrid) fires the rebound inside the right post after the ball breaks to him in the box. The score is 0:4."
        },
        {
            "gameTime": "2 - 14:30",
            "label": "",
            "description": "What a chance that is! James Rodriguez (Real Madrid) wastes a huge opportunity as he receives a beautiful pass inside the box but is somehow only able to prod the ball onto the left post!"
        },
        {
            "gameTime": "2 - 12:50",
            "label": "corner",
            "description": "The resulting corner from James Rodriguez (Real Madrid) is cleared by the defence."
        },
        {
            "gameTime": "2 - 09:58",
            "label": "substitution",
            "description": "It will be a substitution. Anaitz Arbilla (Eibar) is ready to enter the pitch as Antonio Luna walks off."
        },
        {
            "gameTime": "2 - 07:51",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from James Rodriguez (Real Madrid). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 07:28",
            "label": "",
            "description": "Marco Asensio (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is out of play and Real Madrid manage to earn a corner."
        },
        {
            "gameTime": "2 - 06:08",
            "label": "",
            "description": "Ruben Pena (Eibar) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him."
        },
        {
            "gameTime": "2 - 03:08",
            "label": "",
            "description": "Karim Benzema (Real Madrid) receives a precise pass inside the box and takes a shot that flies just wide of the right post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Gonzalez Gonzalez blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 43:39",
            "label": "",
            "description": "Yoel makes a brilliant save! Marco Asensio (Real Madrid) easily weaves through the defence and unleashes a shot from just outside of the box. His low shot goes towards the middle of the goal but is saved by keeper!"
        },
        {
            "gameTime": "1 - 43:18",
            "label": "",
            "description": "Karim Benzema (Real Madrid) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the left post. Yoel is alert and denies him with a nice save."
        },
        {
            "gameTime": "1 - 41:51",
            "label": "",
            "description": "What a chance that is! Marco Asensio (Real Madrid) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "corner",
            "description": "Pedro Leon (Eibar) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 39:15",
            "label": "",
            "description": "Ruben Pena (Eibar) flights in the cross, but the defender is alert and clears to safety. Eibar have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 37:56",
            "label": "",
            "description": "Sergio Enrich (Eibar) misses a good chance to score. An inch perfect cross into the box finds Sergio Enrich (Eibar) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 31:42",
            "label": "y-card",
            "description": "Gonzalo Escalante (Eibar) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Gonzalez Gonzalez didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "1 - 28:26",
            "label": "soccer-ball",
            "description": "James Rodriguez (Real Madrid) with a wonderful piece of finishing. He makes a yard for himself after a well taken pass inside the box and nets under the crossbar."
        },
        {
            "gameTime": "1 - 28:24",
            "label": "",
            "description": "The foul by Sergio Enrich (Eibar) was seen by Gonzalez Gonzalez who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 27:49",
            "label": "corner",
            "description": "Pedro Leon (Eibar) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "1 - 27:37",
            "label": "",
            "description": "Adrian (Eibar) attempts to find one of his teammates with a sweet pass into the box, but one of the defending players reacts well and intercepts the effort. The linesman points to the corner flag, Eibar are going to take it."
        },
        {
            "gameTime": "1 - 24:26",
            "label": "soccer-ball",
            "description": "A cross from the free kick is whipped deep into the box by James Rodriguez and Karim Benzema (Real Madrid) gets in a shot, sending the ball into the middle of the net. 0:2."
        },
        {
            "gameTime": "1 - 22:50",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 22:34",
            "label": "",
            "description": "Lucas (Real Madrid) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The referee blows his whistle, Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 21:15",
            "label": "",
            "description": "Good movement by Casemiro (Real Madrid), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "1 - 19:34",
            "label": "",
            "description": "A precise low pass is received by Gonzalo Escalante (Eibar), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well over the bar."
        },
        {
            "gameTime": "1 - 17:51",
            "label": "",
            "description": "Gonzalez Gonzalez blows for a foul after Sergio Enrich (Eibar) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 14:20",
            "label": "",
            "description": "A pass from Karim Benzema (Real Madrid) is intercepted by Yoel and the move breaks down."
        },
        {
            "gameTime": "1 - 13:47",
            "label": "soccer-ball",
            "description": "Goal! Karim Benzema (Real Madrid) was in the right place at the right time to get to the rebound inside the box and gleefully rifles the ball low into the middle of the net. It's 0:1."
        },
        {
            "gameTime": "1 - 13:10",
            "label": "",
            "description": "Karim Benzema (Real Madrid) receives a precise low pass inside the box, controls the ball and drills it towards the right post. Unfortunately for him, Yoel makes a great save to stop his effort."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "",
            "description": "A cross from Pedro Leon (Eibar) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 10:15",
            "label": "",
            "description": "Gonzalez Gonzalez blows his whistle and it's Karim Benzema (Real Madrid) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 06:46",
            "label": "",
            "description": "Karim Benzema (Real Madrid) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 05:08",
            "label": "",
            "description": "Karim Benzema (Real Madrid) attempts to find Lucas, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 02:39",
            "label": "",
            "description": "Flag up against Sergio Enrich (Eibar). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 00:54",
            "label": "",
            "description": "Sergio Enrich (Eibar) robs an opponent of the ball and explodes in anger when Gonzalez Gonzalez blows for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gonzalez Gonzalez will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Cristiano Ronaldo is the leading goal scorer for Real Madrid with 18 goals so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "From a total of 37 games that Eibar played there were 18 matches with over 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "04/03/2017 - 18:15",
    "gameHomeTeam": "Eibar",
    "gameScore": "1 - 4"
}