{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-04-21 - 21-45 Bayern Munich 6 - 1 FC Porto/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Great display from the home side, you have to say that they were the better side today. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        },
        {
            "gameTime": "2 - 48:06",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 47:53",
            "label": "",
            "description": "Bayern Munich keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "2 - 46:20",
            "label": "",
            "description": "Mitchell Weiser (Bayern Munich) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "2 - 46:07",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Fabiano guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:43",
            "label": "substitution",
            "description": "Pep Guardiola has decided to introduce fresh legs, with Dante (Bayern Munich) replacing Thiago Alcantara."
        },
        {
            "gameTime": "2 - 42:59",
            "label": "soccer-ball",
            "description": "Xabi Alonso (Bayern Munich) sets the ball for the 25 metre free kick. He unleashes a wonderful strike that goes inside the left post. What a goal!"
        },
        {
            "gameTime": "2 - 41:49",
            "label": "yr-card",
            "description": "Ivan Marcano (FC Porto) is told to leave the pitch by the referee after receiving a yellow card for misconduct!"
        },
        {
            "gameTime": "2 - 40:46",
            "label": "substitution",
            "description": "Here comes a substitution. Mitchell Weiser (Bayern Munich) is brought on as a substitute for Mario Gotze."
        },
        {
            "gameTime": "2 - 40:17",
            "label": "",
            "description": "A cross by Hector Herrera (FC Porto) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "2 - 39:14",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) plays another first time pass to Robert Lewandowski and the two of them continue to link up brilliantly."
        },
        {
            "gameTime": "2 - 38:17",
            "label": "",
            "description": "The ball is cleared after Jackson Martinez (FC Porto) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "",
            "description": "Oliver Torres (FC Porto) attempted to pick out a free teammate inside the box, but Manuel Neuer comes off the line to clear the ball away."
        },
        {
            "gameTime": "2 - 36:58",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) dinks a fine lofted pass from the free kick. However, one of the defenders heads the ball out of danger."
        },
        {
            "gameTime": "2 - 36:18",
            "label": "",
            "description": "Ivan Marcano (FC Porto) makes a rough challenge and the referee blows for a foul. Bayern Munich will take a free kick near the side line."
        },
        {
            "gameTime": "2 - 35:41",
            "label": "",
            "description": "Jackson Martinez (FC Porto) is adjudged offside."
        },
        {
            "gameTime": "2 - 35:13",
            "label": "",
            "description": "Jackson Martinez (FC Porto) was too forceful with his tackle and Martin Atkinson interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 33:05",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Robert Lewandowski (Bayern Munich), whose instinctive shot towards goal flashes inches wide of the left post."
        },
        {
            "gameTime": "2 - 31:59",
            "label": "",
            "description": "Referee Martin Atkinson sees the trip by Xabi Alonso (Bayern Munich) and doesn't hesitate to blow his whistle. FC Porto take the free kick with a short pass."
        },
        {
            "gameTime": "2 - 31:13",
            "label": "",
            "description": "Jackson Martinez (FC Porto) makes a good run with the ball, but his shot from the edge of the penalty area goes just wide of the left post. Terrific solo effort, though."
        },
        {
            "gameTime": "2 - 30:22",
            "label": "",
            "description": "Rough tackle by Mario Gotze (Bayern Munich). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 30:05",
            "label": "",
            "description": "FC Porto try to speed play up by taking a quick free kick."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "",
            "description": "Holger Badstuber (Bayern Munich) commits a rough foul. Martin Atkinson stops the game and makes a call."
        },
        {
            "gameTime": "2 - 27:13",
            "label": "soccer-ball",
            "description": "Goal! Hector Herrera finds Jackson Martinez (FC Porto) and he shows great determination to get to the ball and plant a header into the back of the net. 5:1."
        },
        {
            "gameTime": "2 - 26:58",
            "label": "substitution",
            "description": "Pep Guardiola has decided to substitute Rafinha and he is replaced by Sebastian Rode (Bayern Munich)."
        },
        {
            "gameTime": "2 - 25:46",
            "label": "y-card",
            "description": "Ivan Marcano (FC Porto) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 23:46",
            "label": "",
            "description": "Good movement by Hector Herrera (FC Porto), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "2 - 21:56",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Yacine Brahimi will be replaced by Evandro (FC Porto)."
        },
        {
            "gameTime": "2 - 21:29",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) makes a bad challenge and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 20:18",
            "label": "",
            "description": "Bayern Munich take a quick free kick and immediately restart play."
        },
        {
            "gameTime": "2 - 19:58",
            "label": "y-card",
            "description": "Martin Atkinson shows a yellow card to Pereira Ricardo (FC Porto) for a tough tackle."
        },
        {
            "gameTime": "2 - 18:49",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) pulls the jersey of one of the opposition players and Martin Atkinson blows his whistle for a foul. FC Porto quickly take the free kick with a short pass."
        },
        {
            "gameTime": "2 - 18:13",
            "label": "",
            "description": "Holger Badstuber (Bayern Munich) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the left post."
        },
        {
            "gameTime": "2 - 17:29",
            "label": "corner",
            "description": "The ball is out of play and the linesman points at the corner flag. Corner to Bayern Munich."
        },
        {
            "gameTime": "2 - 17:23",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Thomas Muller (Bayern Munich)."
        },
        {
            "gameTime": "2 - 16:20",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) breaks past challenges inside the box, but puts too much pace on his pass to Mario Gotze. The ball goes out of play and FC Porto will have a goal kick."
        },
        {
            "gameTime": "2 - 16:07",
            "label": "corner",
            "description": "Thiago Alcantara (Bayern Munich) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 15:22",
            "label": "",
            "description": "Juan Bernat (Bayern Munich) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender. Bayern Munich have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 15:03",
            "label": "",
            "description": "Bayern Munich are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "2 - 13:32",
            "label": "funfact",
            "description": "We can have a look at the statistics now, particularly the total attempts – 21:2."
        },
        {
            "gameTime": "2 - 13:08",
            "label": "",
            "description": "Yacine Brahimi (FC Porto) and Hector Herrera attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "2 - 12:06",
            "label": "",
            "description": "Close! Xabi Alonso (Bayern Munich) takes the resultant free kick from 20 metres out and his shot goes just over the crossbar."
        },
        {
            "gameTime": "2 - 10:56",
            "label": "",
            "description": "Pereira Ricardo (FC Porto) gives away a foul for a clumsy challenge. Referee Martin Atkinson saw the whole situation. Bayern Munich earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "2 - 10:43",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "2 - 10:14",
            "label": "",
            "description": "A spell of possession for Bayern Munich in an attempt to control the game."
        },
        {
            "gameTime": "2 - 09:12",
            "label": "",
            "description": "Pereira Ricardo (FC Porto) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "2 - 06:21",
            "label": "",
            "description": "Pereira Ricardo (FC Porto) breaks past challenges inside the box, but puts too much pace on his pass to Maicon."
        },
        {
            "gameTime": "2 - 04:59",
            "label": "",
            "description": "Martin Atkinson blows his whistle after Pereira Ricardo (FC Porto) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "2 - 03:25",
            "label": "",
            "description": "Oliver Torres (FC Porto) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone. The ball goes out of play and Bayern Munich will have a goal kick."
        },
        {
            "gameTime": "2 - 01:33",
            "label": "",
            "description": "Maicon (FC Porto) sends a long ball in, but Manuel Neuer comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 00:42",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) missed a big chance! He produces a stunning volley from inside the box, but his effort goes not far wide of the right post."
        },
        {
            "gameTime": "2 - 00:22",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 00:17",
            "label": "substitution",
            "description": "Half time substitution. Julen Lopetegui decided to make a change. Ricardo Quaresma is replaced by Ruben Neves (FC Porto)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Martin Atkinson blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "There was certainly plenty of action during that opening 45 minutes. Bayern Munich dominated the opening period and easily created the most chances. The home side are keeping possession of the ball with some short passes, while the visitors are waiting to open up their defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 47:05",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Martin Atkinson has ended it."
        },
        {
            "gameTime": "1 - 46:28",
            "label": "",
            "description": "Poor challenge! Thiago Alcantara (Bayern Munich) is penalised for tripping and Martin Atkinson blows his whistle."
        },
        {
            "gameTime": "1 - 45:51",
            "label": "",
            "description": "Holger Badstuber (Bayern Munich) tries to take the opposition by surprise with a quick free kick into the box."
        },
        {
            "gameTime": "1 - 45:31",
            "label": "",
            "description": "The referee blows his whistle after Jackson Martinez (FC Porto) does a good impression of a basketball player and handles the ball."
        },
        {
            "gameTime": "1 - 45:02",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) shoots from the edge of the penalty area. The ball travels towards the target, but Fabiano easily deals with the threat."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "1 - 44:27",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) switches the play to Rafinha and their attacking move continues. Rafinha (Bayern Munich) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 43:32",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 21:2."
        },
        {
            "gameTime": "1 - 43:09",
            "label": "",
            "description": "The game is pretty dull as Bayern Munich are just passing the ball from player to player. Nothing lasts forever, though, and they finally make a mistake, allowing the opposition to pick up the ball."
        },
        {
            "gameTime": "1 - 42:19",
            "label": "",
            "description": "A free kick into the box, taken by Oliver Torres (FC Porto), is comfortably cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 41:22",
            "label": "y-card",
            "description": "Holger Badstuber (Bayern Munich) sees a yellow card from Martin Atkinson after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "1 - 39:58",
            "label": "soccer-ball",
            "description": "Robert Lewandowski (Bayern Munich) latches on to a precise pass deep inside the box from Thomas Muller, and he beats the goalkeeper with a low accurate shot into the bottom left corner. He makes it 5:0."
        },
        {
            "gameTime": "1 - 39:12",
            "label": "corner",
            "description": "Holger Badstuber (Bayern Munich) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "1 - 38:41",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) slips through the defence and passes the ball in from the edge of the box. Juan Bernat picks it up but loses it to one of the defenders. Bayern Munich win a corner."
        },
        {
            "gameTime": "1 - 38:22",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) commits a foul after unfairly battling his opponent for the ball. FC Porto try to maintain the tempo of the game by taking a quick free kick."
        },
        {
            "gameTime": "1 - 37:37",
            "label": "y-card",
            "description": "The referee demonstrates he won't tolerate this behaviour. Jackson Martinez (FC Porto) is given a yellow card."
        },
        {
            "gameTime": "1 - 37:14",
            "label": "",
            "description": "Jackson Martinez (FC Porto) passes the ball onto Yacine Brahimi, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 35:21",
            "label": "soccer-ball",
            "description": "Goal! Thomas Muller (Bayern Munich) shoots from distance and his effort takes a nick off the defender and goes past Fabiano. 4:0."
        },
        {
            "gameTime": "1 - 34:30",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) gets on the ball and beats an opponent, but his run is stopped by the referee Martin Atkinson who sees an offensive foul."
        },
        {
            "gameTime": "1 - 33:42",
            "label": "y-card",
            "description": "The game is interrupted. Hector Herrera (FC Porto) is given a yellow card. He has to be more careful now."
        },
        {
            "gameTime": "1 - 32:35",
            "label": "",
            "description": "Bayern Munich keep possession of the ball by producing one two passes, but an opponent steps in and wins the ball."
        },
        {
            "gameTime": "1 - 32:05",
            "label": "substitution",
            "description": "Substitution. Diego Reyes makes way for Pereira Ricardo (FC Porto)."
        },
        {
            "gameTime": "1 - 30:25",
            "label": "corner",
            "description": "Ricardo Quaresma (FC Porto) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance."
        },
        {
            "gameTime": "1 - 29:34",
            "label": "",
            "description": "Ricardo Quaresma (FC Porto) looks to break free, but an opposing player clears the ball away. FC Porto have a corner."
        },
        {
            "gameTime": "1 - 28:19",
            "label": "",
            "description": "Ivan Marcano (FC Porto) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Martin Atkinson blows for the foul but keeps his cards in his pocket on this occasion."
        },
        {
            "gameTime": "1 - 26:46",
            "label": "soccer-ball",
            "description": "Goal! Thomas Muller plays the ball into the area and Robert Lewandowski (Bayern Munich) gets on the end of it to glance a header into the back of the net. He makes it 3:0."
        },
        {
            "gameTime": "1 - 26:40",
            "label": "",
            "description": "Quick reactions by Philipp Lahm (Bayern Munich) and Thomas Muller, tricking their opponents with a cheeky chip pass. A beautiful football moment and great skill, which caused the noise in the stadium to go up a notch."
        },
        {
            "gameTime": "1 - 26:01",
            "label": "",
            "description": "Some patient build up play from Bayern Munich as they look to unlock the defence."
        },
        {
            "gameTime": "1 - 25:01",
            "label": "",
            "description": "Holger Badstuber (Bayern Munich) attempts to find one of his teammates with a cross from the resultant free kick, but he fails to hit the ball properly and sends it off the pitch."
        },
        {
            "gameTime": "1 - 24:22",
            "label": "",
            "description": "Ricardo Quaresma (FC Porto) makes a reckless foul in order to win the ball from his opponent. Martin Atkinson has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 21:55",
            "label": "soccer-ball",
            "description": "Goal! Holger Badstuber gets up really well from the corner and heads the ball into the six yard box where Jerome Boateng (Bayern Munich) glances a header into the net. 2:0."
        },
        {
            "gameTime": "1 - 21:50",
            "label": "corner",
            "description": "Thiago Alcantara (Bayern Munich) steps up to send the ball in."
        },
        {
            "gameTime": "1 - 20:30",
            "label": "",
            "description": "Philipp Lahm (Bayern Munich) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Bayern Munich will take a corner kick."
        },
        {
            "gameTime": "1 - 20:08",
            "label": "",
            "description": "That didn't go as planned! Thomas Muller (Bayern Munich) tried his luck from the edge of the box, but his effort towards the middle of the goal was too weak to get past Fabiano, who easily kept it out."
        },
        {
            "gameTime": "1 - 19:07",
            "label": "",
            "description": "Neat passing move from Bayern Munich in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 17:58",
            "label": "",
            "description": "Rafinha (Bayern Munich) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 17:13",
            "label": "",
            "description": "Diego Reyes (FC Porto) commits a sliding tackle while hitting his opponent's legs. The referee blows his whistle for infringement. A free kick to Bayern Munich."
        },
        {
            "gameTime": "1 - 15:37",
            "label": "",
            "description": "The free kick from long range, taken by FC Porto, is overhit and the ball goes out of play. The ball is off of the pitch and it's a goal kick for Bayern Munich."
        },
        {
            "gameTime": "1 - 15:24",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) was too fierce in his attempt to get the ball from his opponent and Martin Atkinson blows for a foul."
        },
        {
            "gameTime": "1 - 13:58",
            "label": "soccer-ball",
            "description": "Juan Bernat produces a beautiful lofted cross into the box, where Thiago Alcantara (Bayern Munich) rises high to head the ball into the left side of the goal and beyond the goalkeeper. He makes it 1:0."
        },
        {
            "gameTime": "1 - 13:03",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 12:08",
            "label": "",
            "description": "Yacine Brahimi (FC Porto) sends a cross into the box, but Manuel Neuer comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 10:24",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) misses a great chance. He gets to the rebound inside the box and sees his shot smash against the left post!"
        },
        {
            "gameTime": "1 - 09:56",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) blows a big chance from close range. World class save by the goalkeeper."
        },
        {
            "gameTime": "1 - 08:28",
            "label": "",
            "description": "Holger Badstuber (Bayern Munich) shows his incredible technical ability by sending the ball into free space and Philipp Lahm latches onto his pass. Philipp Lahm (Bayern Munich) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 07:49",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) sprays a pass out to Robert Lewandowski, but he can't beat his man inside the box."
        },
        {
            "gameTime": "1 - 07:08",
            "label": "",
            "description": "Casemiro (FC Porto) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 06:35",
            "label": "",
            "description": "Martin Atkinson blows his whistle and signals a foul after Diego Reyes (FC Porto) brought his opponent down."
        },
        {
            "gameTime": "1 - 05:38",
            "label": "",
            "description": "Dangerous play by Mario Gotze (Bayern Munich). Martin Atkinson blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 05:02",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 03:56",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) unleashes a bullet of a shot that is blocked by a defender."
        },
        {
            "gameTime": "1 - 03:16",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) tested Fabiano with a strike from just outside the box, but the effort is saved."
        },
        {
            "gameTime": "1 - 02:40",
            "label": "",
            "description": "Casemiro (FC Porto) probably handled the ball. Bayern Munich continue the game with a quickly taken free kick."
        },
        {
            "gameTime": "1 - 01:54",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 01:06",
            "label": "",
            "description": "Bayern Munich produce a short pass from the free kick."
        },
        {
            "gameTime": "1 - 00:47",
            "label": "",
            "description": "Hector Herrera (FC Porto) pulls the shirt of his opponent and the referee stops play for a foul."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and FC Porto will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Martin Atkinson is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. Great display from the home side, you have to say that they were the better side today. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        }
    ],
    "gameAwayTeam": "FC Porto",
    "gameDate": "21/04/2015 - 21:45",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "6 - 1"
}