{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2014-11-04 - 20-00 Zenit Petersburg 1 - 2 Bayer Leverkusen/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. The home team was applying high pressure, leaving the opponents little space for combination play. The away side attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 47:40",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 46:43",
            "label": "",
            "description": "A precise cross aimed towards the penalty spot was met by Robbie Kruse (Bayer Leverkusen). He outjumped the defence and produced a decent header which went a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 45:52",
            "label": "substitution",
            "description": "The substitution is prepared. Robbie Kruse (Bayer Leverkusen) joins the action as a substitute, replacing Stefan Kiessling."
        },
        {
            "gameTime": "2 - 45:23",
            "label": "",
            "description": "Zenit Petersburg keep possession of the ball with some short passes, waiting for the moment to hit the opposition swiftly on the break."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 43:36",
            "label": "soccer-ball",
            "description": "Goal! Aleksander Ryazantsev puts a cross into the box and finds Jose Rondon (Zenit Petersburg), who latches on to it and strikes the ball into the top left corner. He makes it 1:2."
        },
        {
            "gameTime": "2 - 41:41",
            "label": "substitution",
            "description": "The manager makes a subsitution with Andrej Arshavin (Zenit Petersburg) coming on for ."
        },
        {
            "gameTime": "2 - 40:41",
            "label": "corner",
            "description": "Hulk (Zenit Petersburg) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "2 - 40:27",
            "label": "",
            "description": "Decent spell from Zenit Petersburg here and they're keeping the pressure on, until one of the defending players comes in."
        },
        {
            "gameTime": "2 - 38:54",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Hakan Calhanoglu (Bayer Leverkusen) sends it out of play."
        },
        {
            "gameTime": "2 - 38:37",
            "label": "",
            "description": "Heung Min Son (Bayer Leverkusen) sends a cross into the box, but the opposition's defence quickly intercepts the ball. The referee and his assistant both point at the corner flag. Bayer Leverkusen will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 37:11",
            "label": "",
            "description": "Hulk (Zenit Petersburg) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again."
        },
        {
            "gameTime": "2 - 36:28",
            "label": "y-card",
            "description": "Oleg Shatov (Zenit Petersburg) uses bad language while talking to the referee and receives a yellow card for dissent."
        },
        {
            "gameTime": "2 - 36:16",
            "label": "y-card",
            "description": "Karim Bellarabi (Bayer Leverkusen) sees a yellow! His tackle wasn't that harsh, but he probably talked himself into Alberto Undiano Mallenco's book."
        },
        {
            "gameTime": "2 - 34:24",
            "label": "",
            "description": "Nicolas Lombaerts (Zenit Petersburg) creates himself some space around the penalty spot and connects with the free kick. His header is aimed towards the middle of the net, but Bernd Leno pulls off a comfortable save to thwart him."
        },
        {
            "gameTime": "2 - 33:32",
            "label": "substitution",
            "description": "Substitution. Aleksander Ryazantsev (Zenit Petersburg) replaces Danny."
        },
        {
            "gameTime": "2 - 33:31",
            "label": "substitution",
            "description": "Substitution. Aleksandr Kerzhakov walks off the pitch and Jose Rondon (Zenit Petersburg) comes on as a substitute."
        },
        {
            "gameTime": "2 - 33:30",
            "label": "y-card",
            "description": "Giulio Donati (Bayer Leverkusen) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Alberto Undiano Mallenco ignores the protests."
        },
        {
            "gameTime": "2 - 32:30",
            "label": "",
            "description": "The Zenit Petersburg players find open spaces, and they are able to move the ball from one to another. But now comes an error, and they involuntarily pass the ball to their opponent."
        },
        {
            "gameTime": "2 - 30:47",
            "label": "y-card",
            "description": "Axel Witsel (Zenit Petersburg) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Alberto Undiano Mallenco didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 29:57",
            "label": "",
            "description": "Hulk (Zenit Petersburg) brings an opponent down and Alberto Undiano Mallenco interrupts the game."
        },
        {
            "gameTime": "2 - 27:37",
            "label": "soccer-ball",
            "description": "Goal Heung Min Son (Bayer Leverkusen)! Heung Min Son (Bayer Leverkusen) was put through by Stefan Kiessling and he showed brilliant composure inside the box to fire into the bottom left corner. 0:2."
        },
        {
            "gameTime": "2 - 25:52",
            "label": "corner",
            "description": "Hulk (Zenit Petersburg) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 25:03",
            "label": "",
            "description": "Hulk (Zenit Petersburg) hammered the ball from a long range free kick only into the defensive wall. Zenit Petersburg have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 22:53",
            "label": "soccer-ball",
            "description": "Karim Bellarabi slides a pass towards Heung Min Son (Bayer Leverkusen) who unleashes a fabulous shot from long range. The ball goes behind the surprised goalkeeper and into the top right corner. The score is now 0:1."
        },
        {
            "gameTime": "2 - 22:44",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) takes the free kick and immediately restarts play with a short pass."
        },
        {
            "gameTime": "2 - 21:25",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco shows the yellow card to Ezequiel Garay (Zenit Petersburg) for a heavy challenge. Bayer Leverkusen win a free kick."
        },
        {
            "gameTime": "2 - 20:50",
            "label": "",
            "description": "Zenit Petersburg are showing great team chemistry. They are passing the ball around seamlessly but finally one of the defending players makes an intereception."
        },
        {
            "gameTime": "2 - 19:31",
            "label": "substitution",
            "description": "Substitution. Sebastian Boenisch (Bayer Leverkusen) receives a signal from the referee and is now allowed to enter the pitch as Tin Jedvaj walks off."
        },
        {
            "gameTime": "2 - 18:35",
            "label": "corner",
            "description": "The resulting corner from Hakan Calhanoglu (Bayer Leverkusen) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 18:19",
            "label": "",
            "description": "Bayer Leverkusen possess the ball and make numerous short passes, but here comes an error and they lose possession. The main referee and one of his assistants signal for a corner kick. It will be taken by Bayer Leverkusen."
        },
        {
            "gameTime": "2 - 16:47",
            "label": "",
            "description": "Danny (Zenit Petersburg) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 14:04",
            "label": "",
            "description": "Zenit Petersburg are seeing far more of the ball now."
        },
        {
            "gameTime": "2 - 12:59",
            "label": "",
            "description": "Josip Drmic (Bayer Leverkusen) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 12:10",
            "label": "corner",
            "description": "Aleksandr Kerzhakov (Zenit Petersburg) takes the corner with a short pass."
        },
        {
            "gameTime": "2 - 12:08",
            "label": "corner",
            "description": "The Zenit Petersburg players are exchanging some short passes, and they control the game at the moment, but one of the defending players steps in and intercepts the effort. Zenit Petersburg forced their opponent to concede a corner."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "",
            "description": "The cross into the penalty area from Hulk (Zenit Petersburg) needed to be more accurate in order to create a goal scoring opportunity for his team."
        },
        {
            "gameTime": "2 - 10:21",
            "label": "",
            "description": "Hulk (Zenit Petersburg) is unable to control an accurate defence splitting pass properly and one of the defending players reacts well to rob him of the ball."
        },
        {
            "gameTime": "2 - 08:08",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) unleashes a strike towards goal from long range, but the ball is blocked by one of his teammates."
        },
        {
            "gameTime": "2 - 07:44",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Julian Brandt as he is replaced by Josip Drmic (Bayer Leverkusen)."
        },
        {
            "gameTime": "2 - 06:59",
            "label": "",
            "description": "Lars Bender (Bayer Leverkusen) commits a foul after bringing down his opponent with a slide tackle."
        },
        {
            "gameTime": "2 - 05:40",
            "label": "",
            "description": "Zenit Petersburg keep the ball well and push forward with purpose, but here comes an interception from the opposition."
        },
        {
            "gameTime": "2 - 03:39",
            "label": "",
            "description": "Poor challenge! Axel Witsel (Zenit Petersburg) is penalised for tripping and Alberto Undiano Mallenco blows his whistle."
        },
        {
            "gameTime": "2 - 03:00",
            "label": "",
            "description": "The Zenit Petersburg players are exchanging fine passes and wait for an opportunity to start an attack. Now, a mistake came which caused the loss of possession."
        },
        {
            "gameTime": "2 - 01:51",
            "label": "",
            "description": "Heung Min Son (Bayer Leverkusen) loses the defending players and unloads a powerful, but inaccurate effort from long distance. The goalkeeper remains completely calm as the ball ends somewhere in row Z."
        },
        {
            "gameTime": "2 - 00:30",
            "label": "corner",
            "description": "Hulk (Zenit Petersburg) launches a cross from the corner, but Bernd Leno is alert to thwart the effort."
        },
        {
            "gameTime": "2 - 00:25",
            "label": "",
            "description": "The free kick from long range, taken by Zenit Petersburg, is intercepted by one of the defenders. The ball is out of play. Zenit Petersburg win a corner kick."
        },
        {
            "gameTime": "2 - 00:20",
            "label": "",
            "description": "Emir Spahic (Bayer Leverkusen) trips an opposition player and Alberto Undiano Mallenco signals a foul."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Alberto Undiano Mallenco starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We are watching a run of the mill game with only a few moments to ignite the crowd. The players surely can surely perform better, they just need to motivate themselves. We are witnessing quite a balanced game with both teams struggling to prevail. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 45:29",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Alberto Undiano Mallenco has ended it."
        },
        {
            "gameTime": "1 - 45:24",
            "label": "",
            "description": "The linesman raises his flag for offside before Danny (Zenit Petersburg) heads on."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:01",
            "label": "",
            "description": "Hulk (Zenit Petersburg) produces a long range strike, but he only hits one of his own teammates standing in its way."
        },
        {
            "gameTime": "1 - 43:02",
            "label": "",
            "description": "Stefan Kiessling (Bayer Leverkusen) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 42:50",
            "label": "",
            "description": "Bayer Leverkusen control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 41:20",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) tackles a bit over zealously and Alberto Undiano Mallenco blows for a foul. There is a free kick near the sideline to Zenit Petersburg."
        },
        {
            "gameTime": "1 - 40:05",
            "label": "",
            "description": "Stefan Kiessling (Bayer Leverkusen) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 39:05",
            "label": "",
            "description": "Domenico Criscito (Zenit Petersburg) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "1 - 38:11",
            "label": "",
            "description": "Emir Spahic (Bayer Leverkusen) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 36:09",
            "label": "y-card",
            "description": "Alberto Undiano Mallenco shows a yellow card to Danny (Zenit Petersburg) for a tough tackle."
        },
        {
            "gameTime": "1 - 35:59",
            "label": "injury",
            "description": "Emir Spahic (Bayer Leverkusen) is writhing in pain and can now receive medical treatment after the referee decides to stop play."
        },
        {
            "gameTime": "1 - 34:08",
            "label": "",
            "description": "Heung Min Son (Bayer Leverkusen) tries his luck with a low long range effort after receiving a precise pass, but Yuri Lodygin has a clear view of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 32:59",
            "label": "",
            "description": "The linesman raises his flag. Karim Bellarabi (Bayer Leverkusen) is adjudged offside."
        },
        {
            "gameTime": "1 - 31:50",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) fires the ball from distance, but it's blocked by a defender."
        },
        {
            "gameTime": "1 - 30:56",
            "label": "",
            "description": "Stefan Kiessling (Bayer Leverkusen) gets inside the penalty area and sends a powerful shot that almost ends inside the net. The keeper is alert and makes a good save."
        },
        {
            "gameTime": "1 - 30:07",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle after Karim Bellarabi (Bayer Leverkusen) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "",
            "description": "It's a throw in for Bayer Leverkusen."
        },
        {
            "gameTime": "1 - 27:25",
            "label": "",
            "description": "Axel Witsel (Zenit Petersburg) swings a cross into the box, but it's far too close to Bernd Leno, who smothers the ball."
        },
        {
            "gameTime": "1 - 25:27",
            "label": "corner",
            "description": "The corner from Aleksandr Kerzhakov (Zenit Petersburg) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 25:09",
            "label": "",
            "description": "Wow, what an escape. has an effort from inside the box but it's brilliantly blocked. Zenit Petersburg have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 24:18",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "1 - 23:53",
            "label": "corner",
            "description": "Bayer Leverkusen enjoying a spell of pressure at the moment, but one of the defenders gets it clear. Bayer Leverkusen force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 22:37",
            "label": "",
            "description": "What a big chance! Aleksandr Kerzhakov (Zenit Petersburg) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 21:06",
            "label": "",
            "description": "Flag up against Hulk (Zenit Petersburg). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 20:38",
            "label": "",
            "description": "Axel Witsel (Zenit Petersburg) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "1 - 20:15",
            "label": "",
            "description": "Aleksandr Kerzhakov (Zenit Petersburg) doesn't hesitate and begins a run towards the opponent's goal. Defenders try to tackle him, but he manages to keep the ball at his feet and pulls the trigger in front of the goal. The strike, though, was not as successful as the solo run and the ball is easily stopped by the keeper."
        },
        {
            "gameTime": "1 - 19:55",
            "label": "",
            "description": "Stefan Kiessling (Bayer Leverkusen) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 19:06",
            "label": "",
            "description": "Omer Toprak (Bayer Leverkusen) jumps for a cross and produces a fine header from near the penalty spot, but it goes narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 18:46",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety."
        },
        {
            "gameTime": "1 - 18:12",
            "label": "",
            "description": "A precise low pass is received by Karim Bellarabi (Bayer Leverkusen), who makes a yard for himself on the edge of the box, but his poorly placed shot sails well wide of the left post. The ball is off of the pitch and it's a goal kick for Zenit Petersburg."
        },
        {
            "gameTime": "1 - 16:28",
            "label": "",
            "description": "Flag goes up against Karim Bellarabi (Bayer Leverkusen) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 14:46",
            "label": "",
            "description": "Lars Bender (Bayer Leverkusen) reacts well and displays good awareness near the penalty spot to get on the end of a cross from the free kick. He jumps high and produces a header which goes well wide of the right post."
        },
        {
            "gameTime": "1 - 13:54",
            "label": "",
            "description": "Domenico Criscito (Zenit Petersburg) brings his opponent down. Alberto Undiano Mallenco has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 13:19",
            "label": "",
            "description": "Hulk (Zenit Petersburg) tried his luck from a long range free kick, but the effort came back off the left post!"
        },
        {
            "gameTime": "1 - 12:40",
            "label": "",
            "description": "Zenit Petersburg are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "1 - 12:37",
            "label": "",
            "description": "Lars Bender (Bayer Leverkusen) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "1 - 10:08",
            "label": "",
            "description": "Nicolas Lombaerts (Zenit Petersburg) was trying to get to the ball but clattered into the legs of the opponent as well. Alberto Undiano Mallenco blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 09:31",
            "label": "",
            "description": "Hulk (Zenit Petersburg) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 07:55",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) gets the ball from a rebound and shoots from long range, but sends the ball high over the crossbar. The goalkeeper doesn't have to worry about this one. Very poor attempt."
        },
        {
            "gameTime": "1 - 07:32",
            "label": "",
            "description": "Bayer Leverkusen hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 06:41",
            "label": "",
            "description": "Axel Witsel (Zenit Petersburg) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 05:55",
            "label": "",
            "description": "Julian Brandt (Bayer Leverkusen) brings his opponent down with a tackle and Alberto Undiano Mallenco blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 04:27",
            "label": "",
            "description": "Zenit Petersburg players perform combination football, attempting to create a goal scoring opportunity, but they will have to wait for that as they just lose possession due to an inaccurate pass."
        },
        {
            "gameTime": "1 - 02:59",
            "label": "",
            "description": "Omer Toprak (Bayer Leverkusen) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "1 - 01:26",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle for a foul after Tin Jedvaj (Bayer Leverkusen) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "",
            "description": "Bayer Leverkusen will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Alberto Undiano Mallenco."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. Both teams tried unsuccessfully to control the game. Their overall performances were more or less even. The home team was applying high pressure, leaving the opponents little space for combination play. The away side attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "Bayer Leverkusen",
    "gameDate": "04/11/2014 - 20:00",
    "gameHomeTeam": "Zenit Petersburg",
    "gameScore": "1 - 2"
}