{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-10-15 - 16-00 Napoli 1 - 3 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. There wasn't any significant dominance by either side in this game. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        },
        {
            "gameTime": "2 - 50:02",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 45:36",
            "label": "substitution",
            "description": "Substitution. Diego Perotti is replaced by Gerson (AS Roma)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "5 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:15",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner and sends it into the penalty area, but the opposition's defence is ready and makes a good clearance. Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 43:15",
            "label": "",
            "description": "Napoli show off their ball retention skills as they exchange one two passes and the move is only interrupted when the final pass is intercepted. Napoli force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "soccer-ball",
            "description": "GOAL! Mohamed Salah (AS Roma) got to the ball in front of the goal and he couldn't miss from there. His low drive went in off the left hand post. The score is 1:2."
        },
        {
            "gameTime": "2 - 39:34",
            "label": "y-card",
            "description": "Allan (Napoli) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Daniele Orsato ignores the protests."
        },
        {
            "gameTime": "2 - 37:49",
            "label": "y-card",
            "description": "Edin Dzeko (AS Roma) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Daniele Orsato didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 35:19",
            "label": "substitution",
            "description": "The substitution is prepared. joins the action as a substitute, replacing Marek Hamsik (Napoli)."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to make a change. Stephan El Shaarawy (AS Roma) replaces Radja Nainggolan."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Omar El Kaddouri (Napoli) for Jose Callejon."
        },
        {
            "gameTime": "2 - 30:55",
            "label": "corner",
            "description": "The resulting corner from Jose Callejon (Napoli) is cleared by the defence."
        },
        {
            "gameTime": "2 - 30:54",
            "label": "",
            "description": "Napoli show off their ball retention skills as they exchange one two passes and the move is only interrupted when the final pass is intercepted. Napoli have a corner."
        },
        {
            "gameTime": "2 - 25:00",
            "label": "substitution",
            "description": "Juan Jesus has picked up an injury and is replaced by Emerson (AS Roma)."
        },
        {
            "gameTime": "2 - 24:43",
            "label": "injury",
            "description": "Juan Jesus (AS Roma) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "2 - 23:49",
            "label": "",
            "description": "That didn't go as planned! Allan (Napoli) tried his luck from the edge of the box, but his effort low towards the middle of the goal was too weak to get past Wojciech Szczesny, who easily kept it out."
        },
        {
            "gameTime": "2 - 23:23",
            "label": "",
            "description": "Jose Callejon (Napoli) announces himself with a close range shot after a cross, but one of the defenders gets in the way of the ball to thwart him."
        },
        {
            "gameTime": "2 - 20:08",
            "label": "",
            "description": "It looks like Dries Mertens (Napoli) saw red with that tackle. Daniele Orsato won't tolerate such behaviour on the pitch and blows for a foul."
        },
        {
            "gameTime": "2 - 13:00",
            "label": "soccer-ball",
            "description": "Kalidou Koulibaly (Napoli) connects with the ball from the resulting corner and places a precise header past the stranded goalkeeper and into the top left corner. The opposing players are staring at each other, unable to understand what happened. Who will take the blame for that one? Kalidou Koulibaly (Napoli) has a reason to celebrate!"
        },
        {
            "gameTime": "2 - 12:20",
            "label": "corner",
            "description": "Corner kick. Faouzi Ghoulam (Napoli) is ready to send the ball into the box."
        },
        {
            "gameTime": "2 - 12:15",
            "label": "",
            "description": "Napoli show off their ball retention skills as they exchange one two passes and the move is only interrupted when the final pass is intercepted. Napoli win a corner."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "substitution",
            "description": "Maurizio Sarri prepares a substitution. Manolo Gabbiadini is replaced by Dries Mertens (Napoli)."
        },
        {
            "gameTime": "2 - 09:00",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Alessandro Florenzi flights the free kick into the box, where Edin Dzeko (AS Roma) peels off his marker and heads straight into the left side of the net from the edge of the six yard box. He makes it 0:2."
        },
        {
            "gameTime": "2 - 07:22",
            "label": "y-card",
            "description": "Although Dries Mertens (Napoli) is just on the bench, Daniele Orsato has awarded him with a yellow card. Unsporting behavior says the referee."
        },
        {
            "gameTime": "2 - 07:13",
            "label": "",
            "description": "That didn't go as planned! Faouzi Ghoulam (Napoli) tried his luck from the edge of the box, but his effort towards the bottom right corner was too weak to get past Wojciech Szczesny, who easily kept it out."
        },
        {
            "gameTime": "2 - 04:54",
            "label": "y-card",
            "description": "Juan Jesus (AS Roma) sees a yellow card from Daniele Orsato after he sent one of the opposing players to the ground."
        },
        {
            "gameTime": "2 - 01:43",
            "label": "",
            "description": "The players claim that Mohamed Salah (AS Roma) handled the ball and it seems they are right."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Not a lot happening in the first half, it hasn't been the best game so far in terms of quality. Both teams are unsuccessfully trying to control the game and it's pretty even so far. The home players have grown in confidence and started to string some passes together. The visiting side have relied on their defence and counter attacks."
        },
        {
            "gameTime": "1 - 46:33",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 46:00",
            "label": "y-card",
            "description": "Daniele Orsato shows a yellow card to Leandro Paredes (AS Roma), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "1 - 45:55",
            "label": "",
            "description": "Edin Dzeko (AS Roma) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:00",
            "label": "soccer-ball",
            "description": "Goal! Mohamed Salah puts the ball on a plate for Edin Dzeko (AS Roma), who scores with a simple close range finish. It's 0:1."
        },
        {
            "gameTime": "1 - 42:19",
            "label": "",
            "description": "Jose Callejon (Napoli) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 41:21",
            "label": "",
            "description": "Diego Perotti (AS Roma) fizzes over a cross which doesn't cause any problems."
        },
        {
            "gameTime": "1 - 40:00",
            "label": "",
            "description": "Mohamed Salah (AS Roma) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "1 - 38:55",
            "label": "",
            "description": "Daniele Orsato has a clear sight and sees a foul from Diego Perotti (AS Roma)."
        },
        {
            "gameTime": "1 - 37:33",
            "label": "",
            "description": "Allan (Napoli) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 37:15",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 34:35",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner kick but the ball only finds the head of an opponent."
        },
        {
            "gameTime": "1 - 34:20",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) has an effort from distance and sends the ball towards the right post, but the goalkeeper is equal to it. Now Napoli have a corner."
        },
        {
            "gameTime": "1 - 33:22",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner kick, but Wojciech Szczesny reads it well and stops the effort."
        },
        {
            "gameTime": "1 - 33:08",
            "label": "",
            "description": "Marek Hamsik (Napoli) tries to send a pass but it's blocked. Napoli will take a corner kick."
        },
        {
            "gameTime": "1 - 31:25",
            "label": "",
            "description": "Pepe Reina displays his ability to read the game and clears the danger after Edin Dzeko (AS Roma) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "1 - 30:55",
            "label": "",
            "description": "Jorginho (Napoli) strikes from the edge of the box, but hits it really poorly and sends the ball way over the bar."
        },
        {
            "gameTime": "1 - 30:46",
            "label": "corner",
            "description": "Jose Callejon (Napoli) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 30:05",
            "label": "",
            "description": "Wow, what an escape. Marek Hamsik (Napoli) has an effort from inside the box but it's brilliantly blocked. The referee and his assistant both point at the corner flag. Napoli will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 29:15",
            "label": "",
            "description": "Flag up against Manolo Gabbiadini (Napoli). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 27:50",
            "label": "",
            "description": "Elseid Hysaj (Napoli) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "1 - 27:22",
            "label": "",
            "description": "Diego Perotti (AS Roma) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 26:54",
            "label": "",
            "description": "That didn't go as planned! Radja Nainggolan (AS Roma) tried his luck from the edge of the box, but his effort towards the bottom left corner was too weak to get past Pepe Reina, who easily kept it out."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "",
            "description": "Jorginho (Napoli) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 24:30",
            "label": "",
            "description": "Jose Callejon (Napoli) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "1 - 23:43",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner but it's cleared."
        },
        {
            "gameTime": "1 - 23:26",
            "label": "",
            "description": "Jose Callejon (Napoli) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The ball goes out for a corner. Napoli can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 22:57",
            "label": "corner",
            "description": "Jose Callejon (Napoli) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 22:40",
            "label": "",
            "description": "Jose Callejon (Napoli) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. Napoli force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 21:58",
            "label": "",
            "description": "Edin Dzeko (AS Roma) shoots from the edge of the penalty area. The ball travels low towards the middle of the target, but Pepe Reina easily deals with the threat."
        },
        {
            "gameTime": "1 - 21:05",
            "label": "",
            "description": "Diego Perotti (AS Roma) attempts to surprise the keeper with a nice shot, but the ball goes narrowly wide of the right post."
        },
        {
            "gameTime": "1 - 20:20",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) receives a precise pass on the edge of the box and bends his effort inches wide of the left post."
        },
        {
            "gameTime": "1 - 19:11",
            "label": "",
            "description": "The ball is cleared after Allan (Napoli) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 17:00",
            "label": "",
            "description": "A poor finish by Allan (Napoli) as he misdirects his shot well wide of the right post."
        },
        {
            "gameTime": "1 - 16:00",
            "label": "",
            "description": "Jose Callejon (Napoli) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 15:26",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) takes a short corner kick."
        },
        {
            "gameTime": "1 - 15:11",
            "label": "",
            "description": "AS Roma are happy to keep the ball as they wait for gaps in defence to open up. However, an opposing player steps in and clears. The referee signals a corner kick to AS Roma."
        },
        {
            "gameTime": "1 - 13:58",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "1 - 11:22",
            "label": "",
            "description": "Marek Hamsik (Napoli) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the right post."
        },
        {
            "gameTime": "1 - 09:55",
            "label": "",
            "description": "Leandro Paredes (AS Roma) brings his opponent down with a tackle and Daniele Orsato blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 09:31",
            "label": "",
            "description": "Daniele De Rossi (AS Roma) commits a rough foul. Daniele Orsato stops the game and makes a call."
        },
        {
            "gameTime": "1 - 08:45",
            "label": "",
            "description": "CHANCE! Jose Callejon (Napoli) connects with a cross but he cannot direct his shot on target."
        },
        {
            "gameTime": "1 - 07:05",
            "label": "",
            "description": "AS Roma seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "1 - 05:20",
            "label": "",
            "description": "Edin Dzeko (AS Roma) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "1 - 04:41",
            "label": "",
            "description": "Close! Lorenzo Insigne (Napoli) takes the resulting free kick from a promising positon, but his effort flies inches wide of the right post."
        },
        {
            "gameTime": "1 - 03:20",
            "label": "",
            "description": "Konstantinos Manolas (AS Roma) commits a foul after making a slide tackle on his opponent. Napoli have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 01:50",
            "label": "",
            "description": "Juan Jesus (AS Roma) was too fierce in his attempt to get the ball from his opponent and Daniele Orsato blows for a foul."
        },
        {
            "gameTime": "1 - 00:22",
            "label": "",
            "description": "The players are out and the match is about to start. AS Roma will have the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Daniele Orsato was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "AS Roma scored at least one goal in each of their last 21 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of AS Roma is Edin Dzeko with 12 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The most prolific goal scorer for Napoli is Dries Mertens with 11 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The current goals for and against Napoli: 27:15."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. There wasn't any significant dominance by either side in this game. It was obvious that the hosts tried to outplay their opponents with some passing football, while the visitors focused on counter attacking play."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "15/10/2016 - 16:00",
    "gameHomeTeam": "Napoli",
    "gameScore": "1 - 3"
}