{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-01-14 - 18-15 Barcelona 5 - 0 Las Palmas/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 46:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The home side dominated this game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        },
        {
            "gameTime": "2 - 46:01",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:39",
            "label": "",
            "description": "A player from Las Palmas commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "2 - 44:21",
            "label": "corner",
            "description": "Marko Livaja (UD Las Palmas) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 44:07",
            "label": "",
            "description": "Good clearance! Mateo Ezequiel Garcia (UD Las Palmas) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him. Las Palmas have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 43:01",
            "label": "",
            "description": "Aleix Vidal (Barcelona) makes a strong challenge and Alberto Undiano Mallenco blows for a foul."
        },
        {
            "gameTime": "2 - 41:20",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Las Palmas was in an offside position."
        },
        {
            "gameTime": "2 - 41:00",
            "label": "",
            "description": "Mauricio Lemos (UD Las Palmas) crosses the ball into the box from the free kick, but the defence clears the danger."
        },
        {
            "gameTime": "2 - 38:22",
            "label": "",
            "description": "A player from Las Palmas takes his opponent down, the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 37:06",
            "label": "attendance",
            "description": "The attendance for today's match is 81480."
        },
        {
            "gameTime": "2 - 37:02",
            "label": "",
            "description": "What a big chance! Alcacer Paco (Barcelona) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post. The ball goes out of play and Las Palmas will have a goal kick."
        },
        {
            "gameTime": "2 - 36:19",
            "label": "",
            "description": "Lionel Messi (Barcelona) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 34:24",
            "label": "soccer-ball",
            "description": "Goal Aleix Vidal (Barcelona)! Aleix Vidal (Barcelona) was put through by Alcacer Paco and he showed brilliant composure inside the box to fire into the bottom left corner. 5:0."
        },
        {
            "gameTime": "2 - 33:52",
            "label": "funfact",
            "description": "22:7 – the total goal attempt statistics."
        },
        {
            "gameTime": "2 - 33:20",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from the edge of the box by Ivan Rakitic (Barcelona) as his effort only hit the wall."
        },
        {
            "gameTime": "2 - 32:38",
            "label": "",
            "description": "Barcelona are about to take a free kick from a very dangerous position."
        },
        {
            "gameTime": "2 - 32:08",
            "label": "y-card",
            "description": "Marko Livaja (UD Las Palmas) receives a yellow card from the referee as expected."
        },
        {
            "gameTime": "2 - 30:22",
            "label": "",
            "description": "Kevin Prince Boateng (UD Las Palmas) collects a pass on the edge of the box and unleashes a low drive to the middle, but Marc Andre ter Stegen makes a save."
        },
        {
            "gameTime": "2 - 28:20",
            "label": "substitution",
            "description": "Quique Setien has decided to substitute Nabil El Zhar and he is replaced by Marko Livaja (UD Las Palmas)."
        },
        {
            "gameTime": "2 - 28:10",
            "label": "substitution",
            "description": "That will be all from Sergio Busquets who is being replaced by the fresh legs of Jeremy Mathieu (Barcelona)."
        },
        {
            "gameTime": "2 - 26:24",
            "label": "",
            "description": "Lionel Messi (Barcelona) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 25:46",
            "label": "",
            "description": "Lionel Messi (Barcelona) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 25:06",
            "label": "",
            "description": "The linesman signals that Kevin Prince Boateng (UD Las Palmas) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 23:17",
            "label": "",
            "description": "Las Palmas concede a free kick following a bad challenge."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "substitution",
            "description": "Here is a change. Luis Suarez is going off and Luis Enrique gives the last tactical orders to Alcacer Paco (Barcelona)."
        },
        {
            "gameTime": "2 - 22:36",
            "label": "",
            "description": "misses a sitter from inside the six yard box after striking the ball narrowly wide of the goal."
        },
        {
            "gameTime": "2 - 20:41",
            "label": "corner",
            "description": "Javi Varas leaps to intercept the corner kick from Lionel Messi (Barcelona)."
        },
        {
            "gameTime": "2 - 20:10",
            "label": "",
            "description": "Luis Suarez (Barcelona) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. The ball goes out for a corner. Barcelona can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 18:34",
            "label": "",
            "description": "The game is interrupted as Jordi Alba (Barcelona) is flagged offside."
        },
        {
            "gameTime": "2 - 17:00",
            "label": "substitution",
            "description": "Andre Gomes will be replaced by Ivan Rakitic (Barcelona)."
        },
        {
            "gameTime": "2 - 16:56",
            "label": "substitution",
            "description": "Quique Setien decides to make a substitution. Vicente Gomez will be replaced by Mateo Ezequiel Garcia (UD Las Palmas)."
        },
        {
            "gameTime": "2 - 15:47",
            "label": "",
            "description": "Luis Suarez (Barcelona) meets a cross from Lionel Messi, but he cannot keep his header on target. It goes high over the crossbar."
        },
        {
            "gameTime": "2 - 13:58",
            "label": "soccer-ball",
            "description": "Goal! Arda Turan (Barcelona) is quickest to react to the rebound and stabs the ball into the back of the net. It's 4:0."
        },
        {
            "gameTime": "2 - 13:57",
            "label": "",
            "description": "Luis Suarez (Barcelona) gets inside the penalty area and sends a powerful shot that almost ends inside the net. The keeper is alert and makes a good save."
        },
        {
            "gameTime": "2 - 11:36",
            "label": "soccer-ball",
            "description": "Luis Suarez (Barcelona) has acres of space after latching on to a precise pass into the box. He doesn't hesitate to release a low effort which ends up in the bottom right corner."
        },
        {
            "gameTime": "2 - 09:14",
            "label": "y-card",
            "description": "Kevin Prince Boateng (UD Las Palmas) is punished with a yellow card for violating the rules."
        },
        {
            "gameTime": "2 - 09:13",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Kevin Prince Boateng (UD Las Palmas)."
        },
        {
            "gameTime": "2 - 06:50",
            "label": "soccer-ball",
            "description": "Goal! The rebound fell to Lionel Messi (Barcelona) and he fired home from close range. The score is 2:0."
        },
        {
            "gameTime": "2 - 06:45",
            "label": "",
            "description": "Half chance! Luis Suarez (Barcelona) plays a pass into the box, but Javi Varas reacts well to snuff out the attack."
        },
        {
            "gameTime": "2 - 05:27",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a precise pass inside the box and takes a shot that flies just wide of the left post."
        },
        {
            "gameTime": "2 - 03:59",
            "label": "",
            "description": "Kevin Prince Boateng (UD Las Palmas) misses a good chance to score. A perfect cross into the box finds Kevin Prince Boateng (UD Las Palmas) who rises for a header, but he sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 01:00",
            "label": "",
            "description": "Kevin Prince Boateng (UD Las Palmas) fires the ball on goal, but his attempt goes well wide of the left post."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Alberto Undiano Mallenco starts the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Up to now the game has been rather average in terms of entertainment, with little in the way of thrilling moments. The home side is easily dictating the tempo in this game. The home side are keeping possession of the ball with some short passes, while the visitors are waiting to open up their defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 46:04",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:55",
            "label": "",
            "description": "Rafinha (Barcelona) blasts the ball high over the crossbar."
        },
        {
            "gameTime": "1 - 45:09",
            "label": "corner",
            "description": "Luis Suarez (Barcelona) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "1 - 45:02",
            "label": "",
            "description": "Lionel Messi (Barcelona) doesn't hesitate and begins a run towards the opponent's goal. Defenders try to tackle him, but he manages to keep the ball at his feet and pulls the trigger in front of the goal. The strike, though, was not as successful as the solo run and the ball is easily stopped by the keeper. Barcelona will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:27",
            "label": "",
            "description": "Jordi Alba (Barcelona) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 43:10",
            "label": "funfact",
            "description": "Let's have a look at the offside statistics – 7:3."
        },
        {
            "gameTime": "1 - 42:27",
            "label": "corner",
            "description": "Aleix Vidal (Barcelona) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 41:33",
            "label": "",
            "description": "Lionel Messi (Barcelona) releases a promising shot from the free kick from around 24 metres out. The ball goes towards the top right corner, but the goalkeeper makes a save and denies him. The linesman points to the corner flag, Barcelona are going to take it."
        },
        {
            "gameTime": "1 - 41:22",
            "label": "",
            "description": "Barcelona win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 41:07",
            "label": "y-card",
            "description": "The game is interrupted because of a yellow card that is shown to Helder Lopes (UD Las Palmas)."
        },
        {
            "gameTime": "1 - 40:40",
            "label": "",
            "description": "Kevin Prince Boateng (UD Las Palmas) should know this behaviour is beyond the rules. He was too careless with his challenge and left Alberto Undiano Mallenco no option but to blow his whistle."
        },
        {
            "gameTime": "1 - 39:17",
            "label": "",
            "description": "Luis Suarez (Barcelona) is caught offside after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 37:50",
            "label": "",
            "description": "Jonathan Viera (UD Las Palmas) controls a nice low pass and shoots from just outside the box, but it's a poor effort that flies into the stands. Wasted opportunity!"
        },
        {
            "gameTime": "1 - 36:01",
            "label": "",
            "description": "Flag up against Lionel Messi (Barcelona). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 33:46",
            "label": "substitution",
            "description": "Here's the change. David Garcia leaves the pitch and Aythami (UD Las Palmas) comes on as a substitute."
        },
        {
            "gameTime": "1 - 32:59",
            "label": "",
            "description": "Lionel Messi (Barcelona) has an opportunity, but isn't able to direct the ball into the net."
        },
        {
            "gameTime": "1 - 32:56",
            "label": "",
            "description": "Arda Turan (Barcelona) shoots from the edge of the penalty area. The ball travels low towards the middle of the target, but Javi Varas easily deals with the threat."
        },
        {
            "gameTime": "1 - 31:59",
            "label": "y-card",
            "description": "What was Andre Gomes (Barcelona) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "1 - 31:14",
            "label": "",
            "description": "CHANCE! Sergio Busquets finds Andre Gomes (Barcelona) with a sweet pass, but he can't find the target as his effort from inside the box goes just wide of the left post! The ball is off of the pitch and it's a goal kick for Las Palmas."
        },
        {
            "gameTime": "1 - 28:47",
            "label": "y-card",
            "description": "Javier Mascherano (Barcelona) is booked after bringing down an opponent. Alberto Undiano Mallenco had an easy decision to make."
        },
        {
            "gameTime": "1 - 28:17",
            "label": "",
            "description": "Las Palmas players are playing combination football and attempting to create a goal scoring opportunity, but they will have to wait for that as they have just lost possession due to a poor pass. The ball is out of play. Barcelona will take a throw in."
        },
        {
            "gameTime": "1 - 26:30",
            "label": "",
            "description": "Aleix Vidal (Barcelona) gives away a foul for a clumsy challenge. Referee Alberto Undiano Mallenco saw the whole situation."
        },
        {
            "gameTime": "1 - 26:30",
            "label": "",
            "description": "The game is interrupted. Andre Gomes (Barcelona) has violated the rules in the battle for the ball. No protests or gestures are being made as he is quite aware of what he did."
        },
        {
            "gameTime": "1 - 24:59",
            "label": "y-card",
            "description": "Rafinha (Barcelona) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "corner",
            "description": "Aleix Vidal (Barcelona) takes the corner, but it's intercepted by the defender."
        },
        {
            "gameTime": "1 - 23:55",
            "label": "",
            "description": "Andre Gomes (Barcelona) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the right post. Javi Varas is alert and denies him with a nice save. The ball goes out of play. Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "1 - 23:02",
            "label": "",
            "description": "Sergio Busquets (Barcelona) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 21:52",
            "label": "",
            "description": "Alberto Undiano Mallenco blows his whistle for a foul after Kevin Prince Boateng (UD Las Palmas) hacks down one of his opponents."
        },
        {
            "gameTime": "1 - 20:20",
            "label": "",
            "description": "Lionel Messi picks out Rafinha (Barcelona) unmarked inside the box, but his strike goes well wide of the right post."
        },
        {
            "gameTime": "1 - 19:31",
            "label": "",
            "description": "Jordi Alba (Barcelona) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "1 - 18:04",
            "label": "",
            "description": "CHANCE! Kevin Prince Boateng (UD Las Palmas) connects with a cross but he cannot direct his shot on target. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "1 - 16:43",
            "label": "",
            "description": "Arda Turan (Barcelona) attempted to pick out a free teammate inside the box, but Javi Varas comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 15:40",
            "label": "",
            "description": "Barcelona are showing great team chemistry. They are passing the ball around seamlessly but finally one of the defending players makes an interception."
        },
        {
            "gameTime": "1 - 13:39",
            "label": "soccer-ball",
            "description": "Goal! Andre Gomes plays a pass to the feet of Luis Suarez (Barcelona), and he shoots into the bottom right corner from inside the box. It's 1:0."
        },
        {
            "gameTime": "1 - 11:50",
            "label": "",
            "description": "Helder Lopes (UD Las Palmas) was too fierce in his attempt to get the ball from his opponent and Alberto Undiano Mallenco blows for a foul."
        },
        {
            "gameTime": "1 - 10:46",
            "label": "",
            "description": "Jordi Alba (Barcelona) sends a cross into the box, but the opposition's defence clears the ball to safety."
        },
        {
            "gameTime": "1 - 10:15",
            "label": "",
            "description": "Barcelona spell of possession comes to an end after a mistake."
        },
        {
            "gameTime": "1 - 09:13",
            "label": "",
            "description": "David Garcia (UD Las Palmas) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 08:51",
            "label": "injury",
            "description": "David Garcia (UD Las Palmas) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 07:44",
            "label": "",
            "description": "The ball is behind the touchline and Las Palmas will take a throw in."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "A pass by Andre Gomes (Barcelona) ends up in no man's land, and the attacking effort comes to an end."
        },
        {
            "gameTime": "1 - 04:25",
            "label": "",
            "description": "The linesman raises his flag for offside before Aleix Vidal (Barcelona) heads on."
        },
        {
            "gameTime": "1 - 03:16",
            "label": "",
            "description": "Lionel Messi (Barcelona) blazes a shot from a long range free kick and the ball ends somewhere in row Z. The ball is off of the pitch and it's a goal kick for Las Palmas."
        },
        {
            "gameTime": "1 - 02:57",
            "label": "",
            "description": "Lionel Messi (Barcelona) is always a threat to goalkeepers from set pieces and he will take the long range free kick."
        },
        {
            "gameTime": "1 - 02:36",
            "label": "y-card",
            "description": "Roque Mesa (UD Las Palmas) is cautioned by the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 01:33",
            "label": "",
            "description": "Alberto Undiano Mallenco interrupts the game for a tactical foul by Aleix Vidal (Barcelona). Las Palmas are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 01:26",
            "label": "corner",
            "description": "The resulting corner, taken by Lionel Messi (Barcelona), comes to nothing."
        },
        {
            "gameTime": "1 - 00:40",
            "label": "",
            "description": "The ball is cleared after Luis Suarez (Barcelona) attempted to dribble past an opposing player. Barcelona win a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Barcelona will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Alberto Undiano Mallenco was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The best result this season for Las Palmas was a 5:1 victory."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "1:1 is the most common score for Barcelona in this competition. 4 of their all matches finished with that score."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. The home side dominated this game. The home team made a lot of passes and attempted to maintain possession. The away side's tactic was counter attacking."
        }
    ],
    "gameAwayTeam": "Las Palmas",
    "gameDate": "14/01/2017 - 18:15",
    "gameHomeTeam": "Barcelona",
    "gameScore": "5 - 0"
}