{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-03-13 - 22-30 Las Palmas 1 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The home side dominated the game. The tactic of the home side was slow build up play, while the away side gave the opposition a hard time by closing them down quickly and aggressively."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 48:00",
            "label": "",
            "description": "Sergio Araujo (UD Las Palmas) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the left post."
        },
        {
            "gameTime": "2 - 47:08",
            "label": "",
            "description": "The players claim that Alvaro Arbeloa (Real Madrid) handled the ball and it seems they are right. A free kick is awarded to Las Palmas."
        },
        {
            "gameTime": "2 - 46:51",
            "label": "",
            "description": "Jonathan Viera (UD Las Palmas) tries his luck from a long range free kick and fires the ball to the right side of the goal, but Keylor Navas is alert and thwarts the effort."
        },
        {
            "gameTime": "2 - 45:54",
            "label": "yr-card",
            "description": "Sergio Ramos (Real Madrid) should have been more careful. He commits a bad foul, receives his second yellow card and is sent off!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 44:59",
            "label": "substitution",
            "description": "Luka Modric will be replaced by Marcelo (Real Madrid)."
        },
        {
            "gameTime": "2 - 43:59",
            "label": "soccer-ball",
            "description": "Casemiro (Real Madrid) outjumps the defence inside the six yard box to meet the corner and scores with a great header into the left side of the goal. The keeper had no chance to react. The score is now 1:2."
        },
        {
            "gameTime": "2 - 43:50",
            "label": "corner",
            "description": "Jese (Real Madrid) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 43:40",
            "label": "",
            "description": "Jese (Real Madrid) fails to find any of his teammates inside the box as his pass is blocked. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 41:50",
            "label": "soccer-ball",
            "description": "Figueroa Cabrera Momo plays a neat ball into the path of Da Silva Willian Jose (UD Las Palmas), who makes room for a shot and fires the ball into the back of the net! 0:1."
        },
        {
            "gameTime": "2 - 40:00",
            "label": "",
            "description": "Sergio Araujo (UD Las Palmas) rises high to meet a perfect cross, but powers his header just wide of the left post. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "2 - 39:26",
            "label": "substitution",
            "description": "Quique Setien decides to make a substitution. David Garcia will be replaced by Sergio Araujo (UD Las Palmas)."
        },
        {
            "gameTime": "2 - 38:12",
            "label": "",
            "description": "Pedro Bigas (UD Las Palmas) delivers a crossfield pass, but the ball is cut out before it reaches its intended target."
        },
        {
            "gameTime": "2 - 36:27",
            "label": "",
            "description": "Long passes, short passes and one two passes. Real Madrid are showcasing great team work by keeping possession and producing pin point passes from player to player. The opposition's players are finding it very difficult to intercept at the moment."
        },
        {
            "gameTime": "2 - 33:32",
            "label": "substitution",
            "description": "Substitution. Gareth Bale will be replaced by Jese (Real Madrid)."
        },
        {
            "gameTime": "2 - 32:46",
            "label": "",
            "description": "Great teamplay by Las Palmas as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "2 - 31:06",
            "label": "attendance",
            "description": "The attendance for today's match is 25846."
        },
        {
            "gameTime": "2 - 30:05",
            "label": "",
            "description": "Pedro Bigas (UD Las Palmas) receives a fine cross inside the box and attempts to score a goal, but his shot flies just wide of the right post."
        },
        {
            "gameTime": "2 - 29:52",
            "label": "corner",
            "description": "Las Palmas earn a corner."
        },
        {
            "gameTime": "2 - 29:35",
            "label": "",
            "description": "What a chance! Figueroa Cabrera Momo (UD Las Palmas) gets on the end of a pass inside the box and takes a shot to the bottom right corner, but one of the defending players makes a crucial goal line clearance. Las Palmas have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 29:22",
            "label": "y-card",
            "description": "The game is interrupted because of a yellow card that is shown to Jonathan Viera (UD Las Palmas)."
        },
        {
            "gameTime": "2 - 28:27",
            "label": "",
            "description": "Las Palmas are all set to take the indirect free kick from inside the box. These situations are quite rare and everyone is curious what they are going to do with it."
        },
        {
            "gameTime": "2 - 26:25",
            "label": "substitution",
            "description": "That's the end of the game for Nili, who is replaced by Nabil El Zhar (UD Las Palmas)."
        },
        {
            "gameTime": "2 - 24:55",
            "label": "",
            "description": "Gareth Bale (Real Madrid) collects a pass and has an effort from 20 metres out, but it flies just wide of the right post."
        },
        {
            "gameTime": "2 - 21:52",
            "label": "",
            "description": "Nili (UD Las Palmas) fails to pick a body out in the box with an over hit cross to the back post. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "2 - 20:23",
            "label": "",
            "description": "Great touch by Nili (UD Las Palmas) as he receives a precise pass deep inside the box and rips a shot goalwards, but the keeper pulls off an amazing save!"
        },
        {
            "gameTime": "2 - 19:15",
            "label": "",
            "description": "Gareth Bale (Real Madrid) whips the ball in, but it fails to reach any of his teammates as the opposition's defence averts the threat."
        },
        {
            "gameTime": "2 - 18:04",
            "label": "",
            "description": "Gareth Bale (Real Madrid) creates a good chance for himself and goes for goal from mid range, but the effort is well wide of the right post."
        },
        {
            "gameTime": "2 - 15:50",
            "label": "",
            "description": "Pepe (Real Madrid) will miss the next game."
        },
        {
            "gameTime": "2 - 15:49",
            "label": "y-card",
            "description": "The foul by Pepe (Real Madrid) is worthy of a card and a yellow is duly shown by David Fernandez Borbalan."
        },
        {
            "gameTime": "2 - 14:54",
            "label": "substitution",
            "description": "The game has come to an end for Isco. He has contributed as much as he could today. He will be replaced by the fresh legs of Mateo Kovacic (Real Madrid)."
        },
        {
            "gameTime": "2 - 14:43",
            "label": "",
            "description": "Pedro Bigas (UD Las Palmas) will miss the next game because of that yellow card."
        },
        {
            "gameTime": "2 - 14:42",
            "label": "y-card",
            "description": "Pedro Bigas (UD Las Palmas) has tested the patience of referee David Fernandez Borbalan and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 14:19",
            "label": "corner",
            "description": "Las Palmas didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "2 - 13:58",
            "label": "",
            "description": "Dani Castellano (UD Las Palmas) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The ball is out of play and Las Palmas manage to earn a corner."
        },
        {
            "gameTime": "2 - 12:17",
            "label": "corner",
            "description": "Angel Montoro (UD Las Palmas) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 12:02",
            "label": "",
            "description": "Las Palmas are enjoying possession, but one of the opposition players steps in to end the sequence. Las Palmas get a corner."
        },
        {
            "gameTime": "2 - 09:55",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) picks up a yellow card."
        },
        {
            "gameTime": "2 - 09:54",
            "label": "y-card",
            "description": "Yellow card. Mauricio Lemos (UD Las Palmas) goes into the referee's book after a bad challenge."
        },
        {
            "gameTime": "2 - 09:25",
            "label": "y-card",
            "description": "David Fernandez Borbalan shows a yellow card to Isco (Real Madrid) for his blatant foul."
        },
        {
            "gameTime": "2 - 08:30",
            "label": "",
            "description": "The game is interrupted as Isco (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "2 - 08:02",
            "label": "",
            "description": "Da Silva Willian Jose (UD Las Palmas) didn't manage to convert the resulting corner kick into a goal. He produced a header from a dangerous position inside the box, but he sent it well over the bar."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "corner",
            "description": "Angel Montoro (UD Las Palmas) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "2 - 07:22",
            "label": "",
            "description": "The resulting set piece, sent into the penalty area by Figueroa Cabrera Momo (UD Las Palmas), was easily dealt with by one of the defenders. Corner kick. Las Palmas will have an opportunity."
        },
        {
            "gameTime": "2 - 06:34",
            "label": "",
            "description": "David Fernandez Borbalan blows the whistle, Lucas (Real Madrid) is penalised for a foul. That's a free kick to Las Palmas."
        },
        {
            "gameTime": "2 - 05:38",
            "label": "",
            "description": "Gareth Bale (Real Madrid) does his best to latch onto a cross into the box, but he can't get to the ball."
        },
        {
            "gameTime": "2 - 05:01",
            "label": "corner",
            "description": "Jonathan Viera (UD Las Palmas) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 04:28",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Dani Castellano (UD Las Palmas). The linesman makes the right call and Las Palmas will have a corner."
        },
        {
            "gameTime": "2 - 02:20",
            "label": "funfact",
            "description": "The total shots for both teams statistics – 15:12."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Quique Setien gives a chance to Dani Castellano (UD Las Palmas) and Javier Garrido is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "We have seen an attractive offensive game so far and the fans have nothing to complain about. Neither team was able to take the initiative and dominate the first half. The home side attempts to hold onto the ball for as long as possible. The away team is applying strong pressure, leaving the opponent little space for combination play."
        },
        {
            "gameTime": "1 - 45:04",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:27",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) passes the ball onto Cristiano Ronaldo, but one of the defenders dispossesses him."
        },
        {
            "gameTime": "1 - 42:53",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "1 - 40:50",
            "label": "",
            "description": "Javier Garrido (UD Las Palmas) is penalised for holding. David Fernandez Borbalan signals a set piece."
        },
        {
            "gameTime": "1 - 37:48",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Angel Montoro (UD Las Palmas) was quite harsh and David Fernandez Borbalan didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 36:38",
            "label": "",
            "description": "Nili (UD Las Palmas) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "1 - 36:12",
            "label": "",
            "description": "Lucas (Real Madrid) was too forceful with his tackle and David Fernandez Borbalan interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 35:51",
            "label": "",
            "description": "Lucas (Real Madrid) is picked out by his teammate with a brilliant short pass, but it takes him too long to control the ball inside the box and this allows one of the defending players to rob him."
        },
        {
            "gameTime": "1 - 33:40",
            "label": "corner",
            "description": "Isco (Real Madrid) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "1 - 33:14",
            "label": "",
            "description": "Isco (Real Madrid) misses a good chance to score. An inch perfect cross into the box finds Isco (Real Madrid) who rises for a header, but sends the ball well over the bar. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 31:34",
            "label": "",
            "description": "Pedro Bigas (UD Las Palmas) gets to the ball from the resulting corner but blazes it well over the bar. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "1 - 31:21",
            "label": "corner",
            "description": "Angel Montoro (UD Las Palmas) will take a corner kick."
        },
        {
            "gameTime": "1 - 30:57",
            "label": "",
            "description": "Da Silva Willian Jose (UD Las Palmas) latches on to a through ball inside the box, but one of the defenders steps in with a timely interception. It could have been a great chance otherwise. The ball goes out of play and Las Palmas have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 30:12",
            "label": "",
            "description": "Gareth Bale (Real Madrid) timed his run perfectly to connect with the resulting corner kick, but his finish from around the penalty spot was rather poor as it went well wide of the right post."
        },
        {
            "gameTime": "1 - 29:49",
            "label": "corner",
            "description": "Isco (Real Madrid) goes over to take the corner kick and it looks like he will send the ball into the penalty box."
        },
        {
            "gameTime": "1 - 28:45",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes a first time shot from the edge of the box, but his effort is well blocked by the defender. Now Real Madrid have a corner."
        },
        {
            "gameTime": "1 - 27:57",
            "label": "",
            "description": "Javier Garrido (UD Las Palmas) sends a long ball in, but Keylor Navas comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 25:20",
            "label": "",
            "description": "Las Palmas slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "1 - 23:58",
            "label": "soccer-ball",
            "description": "Goal! Sergio Ramos (Real Madrid) jumps highest inside the box to meet the resulting corner from Isco. His well placed header ends up in the top of the net, leaving the goalkeeper flapping in the wind. 0:1."
        },
        {
            "gameTime": "1 - 23:40",
            "label": "corner",
            "description": "Isco (Real Madrid) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 23:09",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) zig zags his way into the box and fires the ball towards the middle of the goal, but the goalkeeper makes a great reaction save to stop the effort. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 20:40",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 20:20",
            "label": "corner",
            "description": "Isco (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 19:50",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) connects with the free kick and produces a header goalwards which is well blocked. The goalkeeper doesn't have to worry about that one. The ball is out of play. Real Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 19:30",
            "label": "",
            "description": "A player from Las Palmas commits a rough challenge. David Fernandez Borbalan blows for a foul and keeps the game under control. Real Madrid get a free kick."
        },
        {
            "gameTime": "1 - 16:55",
            "label": "",
            "description": "Roque Mesa (UD Las Palmas) had a good opportunity from long range. His shot was directed towards the bottom left corner, but Keylor Navas was alert and made a comfortable save."
        },
        {
            "gameTime": "1 - 16:40",
            "label": "",
            "description": "Angel Montoro (UD Las Palmas) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "1 - 15:48",
            "label": "y-card",
            "description": "Casemiro (Real Madrid) has to be very careful for the rest of the match after receiving a yellow card from the referee for a bad tackle on an opponent. Las Palmas have a free kick."
        },
        {
            "gameTime": "1 - 15:04",
            "label": "",
            "description": "Alvaro Arbeloa (Real Madrid) makes a reckless foul in order to win the ball from his opponent. David Fernandez Borbalan has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 14:35",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Real Madrid."
        },
        {
            "gameTime": "1 - 13:08",
            "label": "",
            "description": "Gareth Bale (Real Madrid) is disappointed with himself because he got into a good area but produced a poor cross."
        },
        {
            "gameTime": "1 - 12:35",
            "label": "",
            "description": "CHANCE! Angel Montoro (UD Las Palmas) picks up a pass inside the box and has a sight of goal, but he blazes his shot well over the top."
        },
        {
            "gameTime": "1 - 10:32",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) has a good chance to score with a mid range attempt after collecting a pass. He aims for the bottom left corner, but he can't generate enough power to trouble Javi Varas."
        },
        {
            "gameTime": "1 - 09:25",
            "label": "",
            "description": "Da Silva Willian Jose (UD Las Palmas) picks up a precise pass deep inside the box, but his strike is saved by the keeper."
        },
        {
            "gameTime": "1 - 08:57",
            "label": "",
            "description": "Nili (UD Las Palmas) finds himself in an offside position and the referee stops play after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 07:41",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) collects a pass and strikes from about 24 metres out. It's a poor attempt which flies well wide of the right post."
        },
        {
            "gameTime": "1 - 07:07",
            "label": "",
            "description": "Javier Garrido (UD Las Palmas) serves up a nice cross, but Keylor Navas punches the ball away."
        },
        {
            "gameTime": "1 - 06:37",
            "label": "",
            "description": "Neat passing move from Las Palmas in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 04:41",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) produces an effort from the edge of the box, but doesn't hit the ball properly and sends it yards wide of the left post."
        },
        {
            "gameTime": "1 - 03:51",
            "label": "",
            "description": "David Fernandez Borbalan blows his whistle after Javier Garrido (UD Las Palmas) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 02:23",
            "label": "",
            "description": "A player from Real Madrid commits an attacking foul. The referee blows his whistle."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Las Palmas will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "David Fernandez Borbalan was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. The home side dominated the game. The tactic of the home side was slow build up play, while the away side gave the opposition a hard time by closing them down quickly and aggressively."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "13/03/2016 - 22:30",
    "gameHomeTeam": "Las Palmas",
    "gameScore": "1 - 2"
}