{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2015-2016/2015-09-16 - 21-45 Bayer Leverkusen 4 - 1 BATE/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. The hosts were largely in control of the game today. The home team played possession football and the away players really focused on a well organized defence."
        },
        {
            "gameTime": "2 - 47:35",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:43",
            "label": "injury",
            "description": "Denis Polyakov (BATE) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "2 - 41:51",
            "label": "y-card",
            "description": "Danny Makkelie shows the yellow card to Nikolai Signevich (BATE) for a heavy challenge."
        },
        {
            "gameTime": "2 - 41:07",
            "label": "",
            "description": "Stefan Kiessling (Bayer Leverkusen) creates a good chance for himself and goes for goal from mid range, but he misses the left post by a whisker."
        },
        {
            "gameTime": "2 - 39:24",
            "label": "attendance",
            "description": "The attendance is 24280."
        },
        {
            "gameTime": "2 - 36:19",
            "label": "corner",
            "description": "Igor Stasevich (BATE) whips in the corner, but one of the defending players gets a head on it and intercepts."
        },
        {
            "gameTime": "2 - 36:05",
            "label": "",
            "description": "Aleksandr Volodjko (BATE) produces a poor cross from the free kick which is easily turned away. The ball is out of play. BATE will have a chance to score from a corner."
        },
        {
            "gameTime": "2 - 32:38",
            "label": "substitution",
            "description": "Aleksandr Yermakovich prepares a substitution. Mikhail Gordejchuk is replaced by Maksim Volodjko (BATE)."
        },
        {
            "gameTime": "2 - 31:57",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Hakan Calhanoglu will be replaced by Julian Brandt (Bayer Leverkusen)."
        },
        {
            "gameTime": "2 - 30:39",
            "label": "soccer-ball",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) gives no chance to the keeper and converts the penalty with a sharp low drive into the left side of the net."
        },
        {
            "gameTime": "2 - 30:34",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 29:15",
            "label": "y-card",
            "description": "Filip Mladenovic (BATE) is punished with a yellow card for violating the rules."
        },
        {
            "gameTime": "2 - 29:00",
            "label": "penalty",
            "description": "Filip Mladenovic (BATE) probably handled the ball inside the penalty area. The referee uncompromisingly points to the spot and it's a penalty to Bayer Leverkusen."
        },
        {
            "gameTime": "2 - 28:59",
            "label": "",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) fails to produce a decent enough free kick for a player of his ability and the only target that he finds is the wall of defenders in front of him."
        },
        {
            "gameTime": "2 - 28:58",
            "label": "",
            "description": "Aleksandr Volodjko (BATE) is penalised for holding. Danny Makkelie signals a set piece. Another situation results in a direct free kick for Bayer Leverkusen."
        },
        {
            "gameTime": "2 - 26:29",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Stefan Kiessling (Bayer Leverkusen) comes onto the pitch so that Chicharito can be given a rest."
        },
        {
            "gameTime": "2 - 23:44",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "2 - 20:32",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) unleashes a shot from a mid range free kick that crashes into the defensive wall. The opposition's goalkeeper set it up perfectly."
        },
        {
            "gameTime": "2 - 19:44",
            "label": "",
            "description": "Dangerous play by Aleksandr Volodjko (BATE). Danny Makkelie blows his whistle for a foul. Bayer Leverkusen have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 16:46",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 16:08",
            "label": "",
            "description": "Chicharito (Bayer Leverkusen) strikes a volley towards goal, but one of the defenders blocks his effort. The ball goes out of play and Bayer Leverkusen have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 15:39",
            "label": "",
            "description": "A cross by Igor Stasevich (BATE) from the side of the pitch flies into the box, but fails to find its intended target as the aim was poor."
        },
        {
            "gameTime": "2 - 14:47",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Aleksandr Karnitskiy (BATE) comes onto the pitch for Dmitri Baga."
        },
        {
            "gameTime": "2 - 13:21",
            "label": "soccer-ball",
            "description": "Goal! Kevin Kampl provides Chicharito (Bayer Leverkusen) with a nice pass inside the box. It allows him to finish with a precise effort into the bottom left corner. 3:1."
        },
        {
            "gameTime": "2 - 11:14",
            "label": "",
            "description": "Denis Polyakov (BATE) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 09:40",
            "label": "",
            "description": "Kevin Kampl (Bayer Leverkusen) and Karim Bellarabi perform a quick tiki taka to get past two defenders and then continue the move along the side line."
        },
        {
            "gameTime": "2 - 07:23",
            "label": "",
            "description": "It's unbelievable, Chicharito (Bayer Leverkusen) blows a huge opportunity! He is totally unmarked and fires a first time shot to the bottom left corner from a few yards out, but Sergey Chernik reacts superbly to keep the ball out."
        },
        {
            "gameTime": "2 - 01:13",
            "label": "soccer-ball",
            "description": "Goal! Karim Bellarabi passes the ball to Hakan Calhanoglu (Bayer Leverkusen) and he fires in a shot from the edge of the box which is deflected. Sergey Chernik couldn't do anything about it. 2:1."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "Up to now the match has suffered in terms of attractiveness as the game has been devoid of any interesting moments. The home side dominated the first half in most aspects of the game, but the visitors will surely attempt to turn the situation around in the second half. The home team is playing possession football and the away team is basing its game on a well organized defence."
        },
        {
            "gameTime": "1 - 48:09",
            "label": "whistle",
            "description": "Danny Makkelie has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 47:50",
            "label": "",
            "description": "A cross following the corner kick finds its way to Chicharito (Bayer Leverkusen) inside the box and he manages to steer it to the middle of the target. He is about to start celebrating a goal, but Sergey Chernik makes a save in the nick of time and maintains the current score."
        },
        {
            "gameTime": "1 - 47:45",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 47:35",
            "label": "",
            "description": "Christoph Kramer (Bayer Leverkusen) races towards goal but the defender gets back well to make a challenge. The ball is out of play. A goal scoring opportunity from a corner for Bayer Leverkusen."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "1 - 44:26",
            "label": "y-card",
            "description": "Danny Makkelie shows a yellow card to Dmitri Baga (BATE) for a tough tackle."
        },
        {
            "gameTime": "1 - 43:38",
            "label": "substitution",
            "description": "Lars Bender doesn't have to suffer any longer with the painful injury as Christoph Kramer (Bayer Leverkusen) comes onto the pitch to replace him."
        },
        {
            "gameTime": "1 - 40:30",
            "label": "y-card",
            "description": "Kyriakos Papadopoulos (Bayer Leverkusen) receives a yellow card from the referee for a foul that he committed a little earlier."
        },
        {
            "gameTime": "1 - 40:27",
            "label": "",
            "description": "A big opportunity is wasted by Kevin Kampl (Bayer Leverkusen), who makes a yard for himself and produces a mid range rocket of a shot towards the middle of the goal. Unfortunately for him, Sergey Chernik pulls off a fantastic save to stop the effort."
        },
        {
            "gameTime": "1 - 39:56",
            "label": "",
            "description": "Admir Mehmedi (Bayer Leverkusen) smashes the ball upfield and Hakan Calhanoglu controls it with a great first touch."
        },
        {
            "gameTime": "1 - 36:26",
            "label": "",
            "description": "Lars Bender (Bayer Leverkusen) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 34:50",
            "label": "",
            "description": "Kevin Kampl (Bayer Leverkusen) swings a cross into the box, but it's far too close to Sergey Chernik, who smothers the ball."
        },
        {
            "gameTime": "1 - 32:30",
            "label": "injury",
            "description": "The game is interrupted now, Lars Bender (Bayer Leverkusen) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 29:31",
            "label": "substitution",
            "description": "The manager has been forced to make a substitution and the injured Aljaksandr Hleb limps off the pitch to be replaced by Aleksandr Volodjko (BATE)."
        },
        {
            "gameTime": "1 - 28:20",
            "label": "",
            "description": "Jonathan Tah (Bayer Leverkusen) misses a big chance! He fires the ball high over the crossbar from inside the 6 yard box after the ball rebounded to him."
        },
        {
            "gameTime": "1 - 27:45",
            "label": "corner",
            "description": "Hakan Calhanoglu (Bayer Leverkusen) sends the corner into the box, but Sergey Chernik intercepts it and averts the threat."
        },
        {
            "gameTime": "1 - 27:41",
            "label": "",
            "description": "Chicharito (Bayer Leverkusen) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. Corner kick. Bayer Leverkusen will have an opportunity."
        },
        {
            "gameTime": "1 - 25:45",
            "label": "",
            "description": "Karim Bellarabi slides a brilliant pass into Admir Mehmedi (Bayer Leverkusen), but his shot from inside the box goes a whisker wide of the right post."
        },
        {
            "gameTime": "1 - 25:28",
            "label": "corner",
            "description": "Igor Stasevich (BATE) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 24:58",
            "label": "",
            "description": "Denis Polyakov (BATE) fails to find any of his teammates inside the box as his pass is blocked. BATE will take a corner kick."
        },
        {
            "gameTime": "1 - 22:45",
            "label": "",
            "description": "Lars Bender (Bayer Leverkusen) and Kevin Kampl matched up again to find some space for an unmarked teammate."
        },
        {
            "gameTime": "1 - 17:45",
            "label": "",
            "description": "Nikolai Signevich (BATE) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 16:08",
            "label": "",
            "description": "Chicharito (Bayer Leverkusen) displays brilliant individual ability, gets inside the box and pulls the trigger. His promising effort is blocked by one of the defenders."
        },
        {
            "gameTime": "1 - 12:45",
            "label": "soccer-ball",
            "description": "Nemanja Milunovic (BATE) jumped highest inside the box to meet a perfectly executed corner kick by Igor Stasevich. His bullet header went towards the middle of the goal and behind the goalkeeper. It's 1:1."
        },
        {
            "gameTime": "1 - 11:30",
            "label": "corner",
            "description": "Igor Stasevich (BATE) will take the corner."
        },
        {
            "gameTime": "1 - 10:30",
            "label": "",
            "description": "The ball is cleared after Igor Stasevich (BATE) attempted to dribble past an opposing player. The linesman points to the corner flag, BATE are going to take it."
        },
        {
            "gameTime": "1 - 09:14",
            "label": "",
            "description": "Sergey Chernik was forced into action to thwart Kevin Kampl (Bayer Leverkusen). He found himself some space after latching on to a pass and unleashed a shot to the bottom right corner but couldn't beat the keeper."
        },
        {
            "gameTime": "1 - 07:26",
            "label": "",
            "description": "The Bayer Leverkusen players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 03:36",
            "label": "soccer-ball",
            "description": "Goal! Admir Mehmedi (Bayer Leverkusen) pounced on a loose ball inside the box and beats the goalkeeper with a shot into the top left corner. He makes it 0:0."
        },
        {
            "gameTime": "1 - 02:39",
            "label": "",
            "description": "Karim Bellarabi (Bayer Leverkusen) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 01:41",
            "label": "",
            "description": "Kevin Kampl (Bayer Leverkusen) tries to create a chance, but puts too much weight on his pass."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "",
            "description": "Kyriakos Papadopoulos (Bayer Leverkusen) and Jonathan Tah have been trying to find each other with some accurate passes ever since the match started. These two definitely combine the most and are the team's most creative players."
        },
        {
            "gameTime": "1 - 00:13",
            "label": "",
            "description": "The players are out at last! BATE will take the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Danny Makkelie will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We saw a few chances and nice plays, but the overall impression of the game is uninspiring and not hugely entertaining. The hosts were largely in control of the game today. The home team played possession football and the away players really focused on a well organized defence."
        }
    ],
    "gameAwayTeam": "BATE",
    "gameDate": "16/09/2015 - 21:45",
    "gameHomeTeam": "Bayer Leverkusen",
    "gameScore": "4 - 1"
}