{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2016-09-28 - 21-45 Napoli 4 - 2 Benfica/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "We have seen a great game today, let's hope the players will be able to maintain these high levels of play in order to keep fans entertained in future games. The home side dominated this game. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        },
        {
            "gameTime": "2 - 49:11",
            "label": "whistle",
            "description": "The referee checks his watch and blows his whistle to signal the end of this match."
        },
        {
            "gameTime": "2 - 47:47",
            "label": "",
            "description": "Victor Lindelof (Benfica) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "",
            "description": "Andre Almeida (Benfica) should know this behaviour is beyond the rules. He was too careless with his challenge and left Felix Brych no option but to blow his whistle."
        },
        {
            "gameTime": "2 - 46:47",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Napoli."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:43",
            "label": "",
            "description": "Nelson Semedo (Benfica) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 40:57",
            "label": "y-card",
            "description": "Pepe Reina (Napoli) goes into the referee's book for dissent."
        },
        {
            "gameTime": "2 - 40:54",
            "label": "soccer-ball",
            "description": "Andre Almeida plays a terrific cross over to Eduardo Salvio (Benfica), who finds some space inside the box and puts the ball into the back of the net."
        },
        {
            "gameTime": "2 - 39:50",
            "label": "",
            "description": "Eduardo Salvio (Benfica) is caught offside!"
        },
        {
            "gameTime": "2 - 36:59",
            "label": "substitution",
            "description": "Rui Vitoria has decided to make a change. Jose Gomes (Benfica) replaces Ljubomir Fejsa."
        },
        {
            "gameTime": "2 - 36:54",
            "label": "substitution",
            "description": "The game has come to an end for Dries Mertens. He has contributed as much as he could today. He will be replaced by the fresh legs of Emanuele Giaccherini (Napoli)."
        },
        {
            "gameTime": "2 - 36:17",
            "label": "",
            "description": "Eduardo Salvio (Benfica) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "2 - 33:18",
            "label": "",
            "description": "Goncalo Guedes (Benfica) serves up a nice cross, but Pepe Reina punches the ball away."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "y-card",
            "description": "Ljubomir Fejsa (Benfica) commits a foul and is shown a yellow card without any hesitation from the referee."
        },
        {
            "gameTime": "2 - 30:59",
            "label": "",
            "description": "Dangerous play by Ljubomir Fejsa (Benfica). Felix Brych blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 29:26",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) produces a dangerous low pass into the penalty area, but the defence manage to cut it out."
        },
        {
            "gameTime": "2 - 28:46",
            "label": "",
            "description": "Marek Hamsik (Napoli) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "2 - 27:54",
            "label": "",
            "description": "Jorginho (Napoli) whips in the resulting set piece but it's cleared."
        },
        {
            "gameTime": "2 - 27:19",
            "label": "",
            "description": "Goncalo Guedes (Benfica) brings down his opponent with a very late tackle. Napoli have a free kick."
        },
        {
            "gameTime": "2 - 26:44",
            "label": "",
            "description": "Alex Grimaldo (Benfica) brings an opponent down and Felix Brych interrupts the game."
        },
        {
            "gameTime": "2 - 24:57",
            "label": "soccer-ball",
            "description": "An amazing individual effort from Goncalo Guedes (Benfica) ends with a strike from inside the penalty area. He sends the ball precisely into the bottom right corner and makes it 4:1. Pepe Reina was helpless."
        },
        {
            "gameTime": "2 - 24:01",
            "label": "substitution",
            "description": "Maurizio Sarri decides to make a substitution. Jose Callejon will be replaced by Lorenzo Insigne (Napoli)."
        },
        {
            "gameTime": "2 - 22:14",
            "label": "",
            "description": "Andre Almeida (Benfica) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 21:26",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Goncalo Guedes (Benfica) replaces Andre Carrillo."
        },
        {
            "gameTime": "2 - 19:27",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Andre Carrillo (Benfica) was quite harsh and Felix Brych didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 19:20",
            "label": "",
            "description": "Andre Carrillo (Benfica) makes a strong challenge and Felix Brych blows for a foul."
        },
        {
            "gameTime": "2 - 17:35",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) misses a rebound from the penalty spot. The ball flies just a few inches over the bar."
        },
        {
            "gameTime": "2 - 17:13",
            "label": "",
            "description": "Dries Mertens (Napoli) goes on a mazy run, skips past two defenders and pulls the trigger in front of the keeper. Julio Cesar makes a great save to stop the effort going low into the middle of the goal."
        },
        {
            "gameTime": "2 - 16:39",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "2 - 15:03",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "2 - 14:49",
            "label": "corner",
            "description": "The resulting corner from Jose Callejon (Napoli) is cleared by the defence. The ball is out of play. A goal scoring opportunity from a corner for Napoli."
        },
        {
            "gameTime": "2 - 14:14",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) passes the ball into the box but an opposing player clears. Napoli will have a chance to score from a corner kick."
        },
        {
            "gameTime": "2 - 12:41",
            "label": "soccer-ball",
            "description": "Goal 4:0! Dries Mertens (Napoli) taps home from close range after the rebound fell kindly into his path."
        },
        {
            "gameTime": "2 - 10:50",
            "label": "",
            "description": "Referee Felix Brych sees the trip by Andre Carrillo (Benfica) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "2 - 10:15",
            "label": "substitution",
            "description": "Here is a change. Andre Horta is going off and Rui Vitoria gives the last tactical orders to Eduardo Salvio (Benfica)."
        },
        {
            "gameTime": "2 - 08:59",
            "label": "soccer-ball",
            "description": "Arkadiusz Milik (Napoli) steps up to take the penalty and leaves the keeper helpless with a low shot inside the left post."
        },
        {
            "gameTime": "2 - 07:59",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 07:51",
            "label": "y-card",
            "description": "Felix Brych shows a yellow card to Julio Cesar (Benfica) for his blatant foul."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "penalty",
            "description": "Julio Cesar (Benfica) trips an opposition player and Felix Brych signals a foul. That is a penalty kick for Napoli."
        },
        {
            "gameTime": "2 - 06:20",
            "label": "",
            "description": "The Napoli players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 05:55",
            "label": "soccer-ball",
            "description": "Dries Mertens (Napoli) curls the ball over the defensive wall via a free kick and it flies into the top left corner of the net. What a brilliant technique!"
        },
        {
            "gameTime": "2 - 04:40",
            "label": "y-card",
            "description": "Lisandro Lopez (Benfica) is booked after bringing down an opponent. Felix Brych had an easy decision to make."
        },
        {
            "gameTime": "2 - 04:34",
            "label": "",
            "description": "Lisandro Lopez (Benfica) is penalised for holding. Felix Brych signals a set piece. Napoli win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 02:56",
            "label": "",
            "description": "Victor Lindelof (Benfica) makes a good run with the ball, but his shot from the edge of the penalty area goes narrowly over the bar. Terrific solo effort, though."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "",
            "description": "Marek Hamsik (Napoli) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat. The ball goes out of play and Benfica will have a goal kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The half time break is over and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "This is how football should be full of action, thrilling moments and spectacular opportunities. And we have only had the first 45 minutes, so the expectations for the second half are high. Neither side has gained the upper hand as yet. The home side have dominated the possession and midfield so far. The visitors have spent most of their time defending and waiting for the right moment to launch counter attacks."
        },
        {
            "gameTime": "1 - 46:10",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:58",
            "label": "",
            "description": "Jose Callejon (Napoli) attempts to find his teammate with a final pass from outside of the box, but one of the defenders clears the ball to safety."
        },
        {
            "gameTime": "1 - 41:27",
            "label": "",
            "description": "Andre Horta (Benfica) commits a rough challenge and Felix Brych blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 40:23",
            "label": "",
            "description": "Andre Horta (Benfica) commits a rough challenge and Felix Brych blows his whistle for an infringement."
        },
        {
            "gameTime": "1 - 39:24",
            "label": "",
            "description": "Andre Horta (Benfica) collects a pass and finds himself in a good position to strike from the edge of the box, but his attempt is blocked."
        },
        {
            "gameTime": "1 - 38:47",
            "label": "",
            "description": "Elseid Hysaj (Napoli) is caught offside after the linesman raises his flag."
        },
        {
            "gameTime": "1 - 36:28",
            "label": "",
            "description": "Allan (Napoli) covers his face with his hands after wasting a promising chance. He takes the rebound on the edge of the box but blazes the ball high over the crossbar."
        },
        {
            "gameTime": "1 - 36:15",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the ball to the corner flag and sends it into the box."
        },
        {
            "gameTime": "1 - 35:38",
            "label": "",
            "description": "Dries Mertens (Napoli) sends a pass into the box, but his attempt is thwarted and cleared. The referee blows his whistle, Napoli are awarded a corner kick."
        },
        {
            "gameTime": "1 - 34:06",
            "label": "",
            "description": "Felix Brych blows his whistle and it's Kalidou Koulibaly (Napoli) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 33:49",
            "label": "corner",
            "description": "Jose Callejon (Napoli) works the corner short."
        },
        {
            "gameTime": "1 - 33:28",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player. The linesman points to the corner flag, Napoli are going to take it."
        },
        {
            "gameTime": "1 - 33:13",
            "label": "",
            "description": "Dries Mertens (Napoli) sends in a pass which fails to reach any of his teammates. The ball is behind the touchline and Napoli will take a throw in."
        },
        {
            "gameTime": "1 - 31:30",
            "label": "",
            "description": "CHANCE! Jose Callejon finds Marek Hamsik (Napoli) with a sweet pass, but he can't find the target as his effort from inside the box goes just wide of the right post!"
        },
        {
            "gameTime": "1 - 31:08",
            "label": "",
            "description": "Andre Horta (Benfica) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 29:20",
            "label": "",
            "description": "Jorginho (Napoli) stands over the free kick and opts to take it himself, but his low effort is straight at Julio Cesar."
        },
        {
            "gameTime": "1 - 28:40",
            "label": "",
            "description": "Rough tackle by Andre Carrillo (Benfica). The referee blows his whistle for a foul. Napoli win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "1 - 25:25",
            "label": "",
            "description": "Benfica enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 22:32",
            "label": "",
            "description": "A cross is clipped into the penalty area by Dries Mertens (Napoli) but poses no threat."
        },
        {
            "gameTime": "1 - 19:55",
            "label": "soccer-ball",
            "description": "Gooal! Faouzi Ghoulam takes over corner duties. Marek Hamsik (Napoli) gets his head on the ball from the corner and puts it into the top right corner. 1:0."
        },
        {
            "gameTime": "1 - 19:50",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 19:05",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Dries Mertens (Napoli). The ball goes out of play. Napoli are awarded a corner kick."
        },
        {
            "gameTime": "1 - 17:43",
            "label": "",
            "description": "Felix Brych blows his whistle and signals a foul after Andre Almeida (Benfica) brought his opponent down."
        },
        {
            "gameTime": "1 - 17:19",
            "label": "",
            "description": "Allan (Napoli) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 16:49",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 16:26",
            "label": "",
            "description": "Jose Callejon (Napoli) races towards goal but the defender gets back well to make a challenge. It will be a corner kick for Napoli."
        },
        {
            "gameTime": "1 - 15:39",
            "label": "",
            "description": "Andre Almeida (Benfica) got the ball on the edge of the box and smashed a first time shot, but his effort flew high over the crossbar."
        },
        {
            "gameTime": "1 - 13:30",
            "label": "",
            "description": "Dries Mertens (Napoli) is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 13:01",
            "label": "",
            "description": "Nelson Semedo (Benfica) sends a teasing cross into the area, but Pepe Reina intercepts the ball."
        },
        {
            "gameTime": "1 - 11:46",
            "label": "",
            "description": "Dries Mertens (Napoli) brings his opponent down. Felix Brych has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 10:48",
            "label": "substitution",
            "description": "Raul Albiol is being substituted because of an injury. Maurizio Sarri sends Nikola Maksimovic (Napoli) on the pitch."
        },
        {
            "gameTime": "1 - 09:17",
            "label": "",
            "description": "Pepe Reina pulls off a great save to deny Konstantinos Mitroglou (Benfica), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "1 - 08:59",
            "label": "",
            "description": "Dries Mertens (Napoli) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him."
        },
        {
            "gameTime": "1 - 08:20",
            "label": "",
            "description": "Elseid Hysaj (Napoli) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 07:00",
            "label": "",
            "description": "Napoli keep the ball and are displaying some tiki taka style passing at the moment."
        },
        {
            "gameTime": "1 - 04:49",
            "label": "",
            "description": "Konstantinos Mitroglou (Benfica) is first to the rebound but his shot is blocked. Wow, what an escape there for the opposition."
        },
        {
            "gameTime": "1 - 03:31",
            "label": "",
            "description": "The flag is raised by the referee's assistant. Arkadiusz Milik (Napoli) is repeatedly being caught offside. He's always hanging on the shoulder of the last man to try and get into a scoring position."
        },
        {
            "gameTime": "1 - 03:14",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "1 - 02:07",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) is clearly in an offside position after the ball is played through to him and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 01:42",
            "label": "",
            "description": "Andre Horta (Benfica) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 00:25",
            "label": "",
            "description": "Arkadiusz Milik (Napoli) makes contact with a cross but fails to connect perfectly. His low drive heads straight towards the middle of the goal where the goalkeeper makes a decent save to deny him."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Benfica will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Felix Brych."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have seen a great game today, let's hope the players will be able to maintain these high levels of play in order to keep fans entertained in future games. The home side dominated this game. The strategy of the home side was to control the pace of the match with possession style football. Whereas the strategy of the away side was a bit risky and reliant on solid defending to dispossess the opponent and break fast."
        }
    ],
    "gameAwayTeam": "Benfica",
    "gameDate": "28/09/2016 - 21:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "4 - 2"
}