{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-04-29 - 17-15 Real Madrid 2 - 1 Valencia/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 48:45",
            "label": "",
            "description": "Ezequiel Garay (Valencia) was too fierce in his attempt to get the ball from his opponent and Jesus Gil Manzano blows for a foul."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Lucas (Real Madrid) will replace Luka Modric."
        },
        {
            "gameTime": "2 - 46:47",
            "label": "corner",
            "description": "Daniel Parejo (Valencia) takes the corner kick, but Keylor Navas reads it well and stops the effort."
        },
        {
            "gameTime": "2 - 45:46",
            "label": "",
            "description": "Marco Asensio (Real Madrid) couldn't beat the offside trap and the flag goes up. The assistant referee quickly made a difficult call as it was a really tight offside."
        },
        {
            "gameTime": "2 - 45:17",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) attempts to find Daniel Carvajal, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 4 min. of added time."
        },
        {
            "gameTime": "2 - 43:47",
            "label": "substitution",
            "description": "Voro has decided to make a change. Zakaria Bakkali (Valencia) replaces Fabian Orellana."
        },
        {
            "gameTime": "2 - 42:52",
            "label": "",
            "description": "Casemiro (Real Madrid) tries his luck with a shot from long range, but his effort is well blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 40:54",
            "label": "soccer-ball",
            "description": "Marcelo (Real Madrid) collects a sweet pass and fires a low shot into the bottom right corner, leaving the keeper helpless."
        },
        {
            "gameTime": "2 - 40:05",
            "label": "substitution",
            "description": "Jose Gaya (Valencia) comes onto the pitch after Antonio Latorre signals to the bench that he cannot continue any longer after picking up an injury."
        },
        {
            "gameTime": "2 - 36:50",
            "label": "soccer-ball",
            "description": "Daniel Parejo (Valencia) scores a glorious goal after converting the long range free kick by hammering the ball into the top left corner!"
        },
        {
            "gameTime": "2 - 36:28",
            "label": "",
            "description": "Daniel Parejo (Valencia) sets the ball up and is ready to take the free kick from a promising distance. Many goals have been scored from this distance. Let's see what happens."
        },
        {
            "gameTime": "2 - 36:21",
            "label": "y-card",
            "description": "Luka Modric (Real Madrid) is punished with a yellow card for violating the rules."
        },
        {
            "gameTime": "2 - 35:56",
            "label": "",
            "description": "Poor challenge! Alvaro Morata (Real Madrid) is penalised for tripping and Jesus Gil Manzano blows his whistle. Valencia are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "",
            "description": "Antonio Latorre (Valencia) is moving okay again after that injury scare."
        },
        {
            "gameTime": "2 - 34:35",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 34:27",
            "label": "injury",
            "description": "The game is interrupted now, Cristiano Ronaldo (Real Madrid) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 34:14",
            "label": "injury",
            "description": "Antonio Latorre (Valencia) is clearly asking for some medical attention with his painful gestures. The extent of his injury is yet to be discovered."
        },
        {
            "gameTime": "2 - 33:32",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) meets a cross inside the box and heads it goalwards. Unfortunately for him, he sends the ball narrowly over the crossbar. What a chance! The ball goes out of play and Valencia will have a goal kick."
        },
        {
            "gameTime": "2 - 31:43",
            "label": "y-card",
            "description": "Alvaro Morata (Real Madrid) has tested the patience of referee Jesus Gil Manzano and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 31:30",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) jumps into a tackle and Jesus Gil Manzano blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 28:02",
            "label": "",
            "description": "Marco Asensio (Real Madrid) almost finds himself in a very promising position, but he is flagged offside by the linesman."
        },
        {
            "gameTime": "2 - 26:43",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to substitute Karim Benzema and he is replaced by Alvaro Morata (Real Madrid)."
        },
        {
            "gameTime": "2 - 25:11",
            "label": "",
            "description": "Good chance for Rodrigo (Valencia) as he latched on to a cross on the edge of the box and blasted the ball towards the net! It flew wide of the right post. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "2 - 24:16",
            "label": "substitution",
            "description": "Substitution. Nani makes way for Rodrigo (Valencia)."
        },
        {
            "gameTime": "2 - 22:01",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) creates himself some space on the edge of the box and unleashes a strong shot which is blocked by a defender."
        },
        {
            "gameTime": "2 - 20:40",
            "label": "substitution",
            "description": "Here is a change. James Rodriguez is going off and Zinedine Zidane gives the last tactical orders to Marco Asensio (Real Madrid)."
        },
        {
            "gameTime": "2 - 20:15",
            "label": "",
            "description": "James Rodriguez (Real Madrid) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort."
        },
        {
            "gameTime": "2 - 19:36",
            "label": "",
            "description": "The free kick will be taken by James Rodriguez (Real Madrid)."
        },
        {
            "gameTime": "2 - 18:43",
            "label": "y-card",
            "description": "The referee had an easy decision to make. A yellow card is given to Eliaquim Mangala (Valencia) for a foul that he committed a little earlier."
        },
        {
            "gameTime": "2 - 18:40",
            "label": "",
            "description": "Jesus Gil Manzano blows the whistle, Sergio Ramos (Real Madrid) is penalised for a foul."
        },
        {
            "gameTime": "2 - 18:40",
            "label": "",
            "description": "Eliaquim Mangala (Valencia) brings an opponent down and Jesus Gil Manzano interrupts the game. Real Madrid have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 17:40",
            "label": "",
            "description": "What a chance that is! Karim Benzema (Real Madrid) finds himself in a promising position after receiving a pass on the edge of the box. His attempt goes just over the bar. The ball is off of the pitch and it's a goal kick for Valencia."
        },
        {
            "gameTime": "2 - 15:53",
            "label": "",
            "description": "James Rodriguez (Real Madrid) commits a foul and Jesus Gil Manzano immediately signals a free kick."
        },
        {
            "gameTime": "2 - 14:25",
            "label": "attendance",
            "description": "The attendance for today's match is 75180."
        },
        {
            "gameTime": "2 - 12:43",
            "label": "",
            "description": "CLOSE! James Rodriguez (Real Madrid) shows off his amazing skills with a solo run to the edge of the box before fashioning a shot that whistles over the bar. The ball is off of the pitch and it's a goal kick for Valencia."
        },
        {
            "gameTime": "2 - 11:23",
            "label": "penalty-missed",
            "description": "Cristiano Ronaldo (Real Madrid) wastes a huge opportunity to score from the penalty spot. He attempts to slot into the bottom right corner, but Diego Alves pulls off a superb save."
        },
        {
            "gameTime": "2 - 10:57",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "2 - 10:47",
            "label": "y-card",
            "description": "Ezequiel Garay (Valencia) receives a yellow card for talking out of turn to the referee."
        },
        {
            "gameTime": "2 - 09:46",
            "label": "penalty",
            "description": "Daniel Parejo (Valencia) was too forceful with his tackle and Jesus Gil Manzano interrupted the game to signal a free kick. The referee points to the penalty spot. Real Madrid are awarded a penalty kick!"
        },
        {
            "gameTime": "2 - 09:11",
            "label": "",
            "description": "Karim Benzema (Real Madrid) takes a good first touch just outside the box and unloads a shot without any hesitation that bounces off the right post. Not a bad try."
        },
        {
            "gameTime": "2 - 08:21",
            "label": "",
            "description": "Wasted opportunity. Nani (Valencia) gets to the rebound inside the box and smashes the ball just wide of the right post. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "2 - 06:34",
            "label": "y-card",
            "description": "Casemiro (Real Madrid) is booked after bringing down an opponent. Jesus Gil Manzano had an easy decision to make."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "",
            "description": "Casemiro (Real Madrid) holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 03:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) unleashed a monstrous piledriver. He controlled a pass, glanced up at goal and shot from the edge of the box. It could have been a difficult one for the keeper, but the ball fortunately hit one of the defenders and ball bounced away."
        },
        {
            "gameTime": "2 - 03:28",
            "label": "",
            "description": "Toni Kroos (Real Madrid) collects an inch perfect pass and strikes the ball from far out, but his shot is blocked."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 44:59",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 43:57",
            "label": "",
            "description": "Munir El Haddadi (Valencia) makes a good run with the ball, but his shot from the edge of the penalty area goes just wide of the left post. Terrific solo effort, though. The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "1 - 42:47",
            "label": "",
            "description": "James Rodriguez (Real Madrid) produces a lovely chip pass into the box, but one of the opposition players cuts it out."
        },
        {
            "gameTime": "1 - 42:25",
            "label": "",
            "description": "Real Madrid seem to be finding their feet as they enjoy some possession. Great movement by the offensive players allows the defenders to set up the attack."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "",
            "description": "Casemiro (Real Madrid) clips a neat ball into the box in the direction of Cristiano Ronaldo, but he can't get on the end of the pass."
        },
        {
            "gameTime": "1 - 36:33",
            "label": "",
            "description": "Valencia keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "1 - 33:54",
            "label": "",
            "description": "James Rodriguez (Real Madrid) plays a one two with Karim Benzema, but the move breaks down."
        },
        {
            "gameTime": "1 - 30:34",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) swings the ball into the box from the corner kick but it's a bit too strong and it goes out of play. The ball goes out of play and Valencia will have a goal kick."
        },
        {
            "gameTime": "1 - 29:46",
            "label": "corner",
            "description": "Daniel Parejo (Valencia) sends in a poor cross from the corner and Keylor Navas has no trouble gathering it."
        },
        {
            "gameTime": "1 - 29:25",
            "label": "",
            "description": "Daniel Parejo (Valencia) smashes the ball towards goal from the edge of the penalty box, but it fails to bother the goalkeeper as it hits the defensive wall. The linesman points to the corner flag, Valencia are going to take it."
        },
        {
            "gameTime": "1 - 26:52",
            "label": "soccer-ball",
            "description": "Goal! Daniel Carvajal clips a neat ball into the box in the direction of Cristiano Ronaldo (Real Madrid), who jumps highest and steers a bullet header from the centre of the box into the bottom left corner. Diego Alves had no chance of stopping that. 1:0."
        },
        {
            "gameTime": "1 - 24:46",
            "label": "y-card",
            "description": "Jesus Gil Manzano shows a yellow card to Antonio Latorre (Valencia) for his blatant foul."
        },
        {
            "gameTime": "1 - 22:46",
            "label": "",
            "description": "Casemiro (Real Madrid) fouls an opponent. At least that's what referee Jesus Gil Manzano signals."
        },
        {
            "gameTime": "1 - 21:17",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) failed to convert a long range free kick and sends the ball narrowly over the bar. The ball goes out of play and Valencia will have a goal kick."
        },
        {
            "gameTime": "1 - 20:42",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Daniel Parejo (Valencia) was quite harsh and Jesus Gil Manzano didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 20:30",
            "label": "",
            "description": "A clumsy foul by Daniel Parejo (Valencia) and Jesus Gil Manzano blows his whistle. Another situation results in a direct free kick for Real Madrid."
        },
        {
            "gameTime": "1 - 17:47",
            "label": "",
            "description": "Karim Benzema (Real Madrid) produces a ferocious strike from the edge of the box. His dangerous low effort towards the middle of the goal is blocked by Diego Alves, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 17:02",
            "label": "",
            "description": "Fabian Orellana (Valencia) collects a pass on the edge of the box but he slips the ball just wide of the right post. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "1 - 14:18",
            "label": "",
            "description": "Nani (Valencia) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "1 - 12:35",
            "label": "",
            "description": "Karim Benzema (Real Madrid) starts his run too early and the referee blows for offside."
        },
        {
            "gameTime": "1 - 11:54",
            "label": "",
            "description": "Karim Benzema (Real Madrid) attempts to convert a cross into a goal, but his promising header from near the penalty spot towards the middle of the net is denied by Diego Alves. This effort really didn't trouble him."
        },
        {
            "gameTime": "1 - 10:36",
            "label": "",
            "description": "Karim Benzema (Real Madrid) and Cristiano Ronaldo attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 08:49",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 08:35",
            "label": "",
            "description": "Toni Kroos (Real Madrid) produces a poor pass. He attempts to get the ball into the box but it's hacked away. Real Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 07:45",
            "label": "",
            "description": "Nani (Valencia) found some space to dink a cross from the side into the box, but it needed to be more precise to threaten the opposition."
        },
        {
            "gameTime": "1 - 07:17",
            "label": "",
            "description": "Toni Kroos (Real Madrid) did his best to latch on to a crossfield pass, but it was too long and it goes out of play. The ball has crossed the sideline. Valencia are taking a throw in."
        },
        {
            "gameTime": "1 - 05:31",
            "label": "corner",
            "description": "Daniel Parejo (Valencia) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 05:15",
            "label": "",
            "description": "Martin Montoya (Valencia) crosses the ball into the box, but one of the defending players averts the threat. Now Valencia have a corner."
        },
        {
            "gameTime": "1 - 03:54",
            "label": "",
            "description": "Real Madrid are showcasing great team work and neat passing moves."
        },
        {
            "gameTime": "1 - 02:00",
            "label": "",
            "description": "Santi Mina (Valencia) fails to score from inside the box as his rebound smashes against the right post! The ball is off of the pitch and it's a goal kick for Real Madrid."
        },
        {
            "gameTime": "1 - 01:23",
            "label": "",
            "description": "Santi Mina (Valencia) makes a good run inside the box to meet a precise cross. He latches on to it and shoots, but the goalkeeper pulls off an excellent save."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Real Madrid will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jesus Gil Manzano will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "6 that's the number of matches that Valencia have lost at home so far this season, while they have lost 10x away."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid have played 27 games so far this season that have had over 2.5 total goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The Real Madrid players have managed to score 90 goals this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        }
    ],
    "gameAwayTeam": "Valencia",
    "gameDate": "29/04/2017 - 17:15",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "2 - 1"
}