{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-03-18 - 22-45 Barcelona 1 - 0 Manchester City/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. Great display from the home side, you have to say that they were the better side today. Both teams attempted to play possession football."
        },
        {
            "gameTime": "2 - 47:52",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 47:22",
            "label": "corner",
            "description": "Neymar (Barcelona) takes a short corner kick."
        },
        {
            "gameTime": "2 - 46:48",
            "label": "",
            "description": "Neymar (Barcelona) receives a precise pass and is given time inside the box to send a promising strike towards the left post. Joe Hart guesses his intentions and denies him with a fine save. The ball goes out of play. Barcelona are awarded a corner kick."
        },
        {
            "gameTime": "2 - 46:35",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Jesus Navas (Manchester City), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 46:31",
            "label": "",
            "description": "Good clearance! Sergio Aguero (Manchester City) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him. Manchester City will take a corner kick."
        },
        {
            "gameTime": "2 - 45:51",
            "label": "substitution",
            "description": "Substitution. Dani Alves makes his way off the pitch and Adriano (Barcelona) comes on as his replacement."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 additional min. will be played."
        },
        {
            "gameTime": "2 - 44:30",
            "label": "corner",
            "description": "Neymar (Barcelona) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 43:26",
            "label": "",
            "description": "Joe Hart pulls off a great save to deny Lionel Messi (Barcelona), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal."
        },
        {
            "gameTime": "2 - 41:22",
            "label": "substitution",
            "description": "Here is a change. James Milner is going off and Manuel Pellegrini gives the last tactical orders to Frank Lampard (Manchester City)."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "",
            "description": "Luis Suarez (Barcelona) is caught offside!"
        },
        {
            "gameTime": "2 - 40:55",
            "label": "attendance",
            "description": "The attendance for today's match is 92551."
        },
        {
            "gameTime": "2 - 40:50",
            "label": "",
            "description": "Lionel Messi (Barcelona) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "2 - 40:40",
            "label": "",
            "description": "Luis Suarez (Barcelona) darts into the penalty area to latch on to a pass, and he unleashes a shot towards the middle of the net, but Joe Hart is alert and denies him."
        },
        {
            "gameTime": "2 - 38:19",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Ivan Rakitic as he is replaced by Rafinha (Barcelona)."
        },
        {
            "gameTime": "2 - 37:40",
            "label": "",
            "description": "Close! Lionel Messi (Barcelona) stands over the resulting free kick from around 19 metres out and his shot goes just over the crossbar. The ball goes out of play and Manchester City will have a goal kick."
        },
        {
            "gameTime": "2 - 36:42",
            "label": "y-card",
            "description": "The foul by Martin Demichelis (Manchester City) is worthy of a card and a yellow is duly shown by Gianluca Rocchi. Barcelona have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 35:45",
            "label": "",
            "description": "A pass from Aleksandar Kolarov (Manchester City) is intercepted by Marc Andre ter Stegen and the move breaks down."
        },
        {
            "gameTime": "2 - 34:22",
            "label": "y-card",
            "description": "Gianluca Rocchi shows the yellow card to Dani Alves (Barcelona) for a heavy challenge."
        },
        {
            "gameTime": "2 - 32:59",
            "label": "corner",
            "description": "The ball goes out of play and it will be a corner kick. David Silva (Manchester City) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 32:47",
            "label": "penalty-missed",
            "description": "Penalty saved! Sergio Aguero (Manchester City) sends the penalty towards the left hand side of the goal, but Marc Andre ter Stegen pulls off a wonderful save to deny him."
        },
        {
            "gameTime": "2 - 32:40",
            "label": "",
            "description": "Sergio Aguero (Manchester City) is going to take the penalty!"
        },
        {
            "gameTime": "2 - 31:36",
            "label": "penalty",
            "description": "A player from Barcelona pulled an opponent down, forcing the referee to blow his whistle. PENALTY! Wonderful opportunity to score for Manchester City."
        },
        {
            "gameTime": "2 - 31:06",
            "label": "",
            "description": "Neymar (Barcelona) collects a pass on the edge of the box and unleashes a low drive to the middle, but Joe Hart makes a save."
        },
        {
            "gameTime": "2 - 30:25",
            "label": "",
            "description": "Lionel Messi (Barcelona) tries to play a long through ball into Neymar, but the defence breaks the move down."
        },
        {
            "gameTime": "2 - 29:30",
            "label": "funfact",
            "description": "59:41 – the ratio of ball possession."
        },
        {
            "gameTime": "2 - 28:55",
            "label": "",
            "description": "Sergio Aguero (Manchester City) wriggles into space and fires the ball from the edge of the area, but one of the defenders is there to block the effort."
        },
        {
            "gameTime": "2 - 27:45",
            "label": "",
            "description": "That was close by Wilfried Bony (Manchester City)! He receives a pass on the edge of the box and shoots, but the ball goes by a whisker over the crossbar. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "2 - 26:36",
            "label": "substitution",
            "description": "The substitution is prepared. Wilfried Bony (Manchester City) joins the action as a substitute, replacing Yaya Toure."
        },
        {
            "gameTime": "2 - 25:40",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Jordi Alba (Barcelona) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "2 - 25:30",
            "label": "",
            "description": "Neymar (Barcelona) wastes a huge opportunity! He receives a precise cross inside the penalty area and produces a low shot that sails towards the middle of a goal. His effort, however, lacks power and the goalkeeper makes a comfortable save."
        },
        {
            "gameTime": "2 - 25:06",
            "label": "",
            "description": "Barcelona are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "2 - 24:33",
            "label": "funfact",
            "description": "The number of shots on goal at present is 11:4."
        },
        {
            "gameTime": "2 - 21:47",
            "label": "",
            "description": "That was close. Yaya Toure (Manchester City) fires a shot from the edge of the box which goes a whisker wide of the right post. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "2 - 21:31",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Yaya Toure (Manchester City), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 20:51",
            "label": "corner",
            "description": "The corner from Ivan Rakitic (Barcelona) is intercepted by the defence."
        },
        {
            "gameTime": "2 - 20:13",
            "label": "",
            "description": "Lionel Messi (Barcelona) sends a pass into the box, but his attempt is thwarted and cleared. The ball goes behind for a corner. Barcelona will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 18:53",
            "label": "",
            "description": "Lionel Messi (Barcelona) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Joe Hart."
        },
        {
            "gameTime": "2 - 18:30",
            "label": "",
            "description": "James Milner (Manchester City) receives a sweet pass inside the box, but his effort on goal is blocked by the defender."
        },
        {
            "gameTime": "2 - 17:35",
            "label": "",
            "description": "Luis Suarez (Barcelona) receives a precise pass inside the box and takes a shot that flies just wide of the left post. The ball is off of the pitch and it's a goal kick for Manchester City."
        },
        {
            "gameTime": "2 - 16:39",
            "label": "",
            "description": "Bacary Sagna (Manchester City) is disappointed with himself because he got into a good area but produced a poor cross. The linesman signals a throw in for Barcelona."
        },
        {
            "gameTime": "2 - 15:07",
            "label": "",
            "description": "Jesus Navas (Manchester City) sends a teasing cross into the area, but Marc Andre ter Stegen intercepts the ball."
        },
        {
            "gameTime": "2 - 14:37",
            "label": "",
            "description": "Sergio Aguero (Manchester City) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 13:30",
            "label": "",
            "description": "The linesman signals that Luis Suarez (Barcelona) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 13:13",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 12:34",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender. Barcelona earn a corner."
        },
        {
            "gameTime": "2 - 11:18",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) gets into a good shooting position. He wins some space for himself and drills a long range daisy cutter towards the middle of the goal. His good effort is, however, superbly saved by Marc Andre ter Stegen!"
        },
        {
            "gameTime": "2 - 10:54",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Jesus Navas (Manchester City)."
        },
        {
            "gameTime": "2 - 10:32",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Bacary Sagna (Manchester City)."
        },
        {
            "gameTime": "2 - 09:26",
            "label": "",
            "description": "Javier Mascherano (Barcelona) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "2 - 08:31",
            "label": "",
            "description": "The free kick is taken by Jesus Navas (Manchester City), but ball is cleared."
        },
        {
            "gameTime": "2 - 07:51",
            "label": "",
            "description": "Jordi Alba (Barcelona) tackles a bit over zealously and Gianluca Rocchi blows for a foul. Manchester City have a free kick."
        },
        {
            "gameTime": "2 - 07:39",
            "label": "",
            "description": "Manchester City are enjoying a spell of pressure at the moment, but one of the defenders gets it clear. The ball is behind the touchline and Manchester City will take a throw in."
        },
        {
            "gameTime": "2 - 06:30",
            "label": "",
            "description": "Dani Alves (Barcelona) trips an opposition player and Gianluca Rocchi signals a foul."
        },
        {
            "gameTime": "2 - 06:00",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 03:08",
            "label": "",
            "description": "Close! Lionel Messi (Barcelona) picks up a pass and produces a ferocious strike towards the right post, but the goalkeeper gets his fingertips to the ball to keep it out."
        },
        {
            "gameTime": "2 - 02:40",
            "label": "",
            "description": "A nice lofted cross finds Jordi Alba (Barcelona) unmarked. He takes an excellent touch and gets in a shot that goes towards the middle of the net. An easy save for the goalkeeper, though."
        },
        {
            "gameTime": "2 - 02:04",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball miles of the left post. Nice run, but poor finish! The ball goes out of play and Manchester City will have a goal kick."
        },
        {
            "gameTime": "2 - 00:57",
            "label": "",
            "description": "Andres Iniesta (Barcelona) blows a good opportunity. He has a lot of space around him and fires a decent low shot from the edge of the box towards the middle of the net, but the goalkeeper makes a brilliant save and stops this one!"
        },
        {
            "gameTime": "2 - 00:49",
            "label": "",
            "description": "A cross from Luis Suarez (Barcelona) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Manuel Pellegrini has decided to make a substitution during the half time break. Jesus Navas (Manchester City) comes on the pitch for Samir Nasri."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Gianluca Rocchi blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "This is how football should be full of action, thrilling moments and spectacular opportunities. And we have only had the first 45 minutes, so the expectations for the second half are high. The home side were more active and dominant in the first half. The opposition found it tough to keep up. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 45:04",
            "label": "whistle",
            "description": "That is it for the first half after the referee blows his whistle and the players head to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 44:50",
            "label": "corner",
            "description": "James Milner (Manchester City) takes the corner which is cleared."
        },
        {
            "gameTime": "1 - 44:40",
            "label": "",
            "description": "Sergio Aguero (Manchester City) goes on a mazy run and tries his luck with a mid range strike, but one of the defending players steps in and makes a block. Manchester City will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 43:24",
            "label": "",
            "description": "Luis Suarez (Barcelona) gathers the ball inside the box and produces a snap shot. The ball only rattles the right post."
        },
        {
            "gameTime": "1 - 43:10",
            "label": "",
            "description": "The ball is cleared after Bacary Sagna (Manchester City) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 42:39",
            "label": "",
            "description": "Sergio Aguero (Manchester City) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "1 - 41:10",
            "label": "",
            "description": "Luis Suarez (Barcelona) leaps highest to meet the resulting corner and attempts to head home, but the effort goes harmlessly wide of the left post."
        },
        {
            "gameTime": "1 - 40:59",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) goes over to take the corner kick and it looks like he will swing the ball into the penalty box."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "",
            "description": "Neymar (Barcelona) sends a pass into the penalty area, but the opponent manages to cut it out. The linesman makes the right call and Barcelona will have a corner."
        },
        {
            "gameTime": "1 - 38:29",
            "label": "corner",
            "description": "Ivan Rakitic (Barcelona) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 38:07",
            "label": "",
            "description": "Neymar (Barcelona) races towards goal but the defender gets back well to make a challenge. The ball is out of play. Barcelona win a corner kick."
        },
        {
            "gameTime": "1 - 35:10",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Samir Nasri (Manchester City) was quite harsh and Gianluca Rocchi didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "1 - 34:15",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) stands over the resultant free kick from 23 metres out and his shot goes well over the bar. The ball goes out of play and Manchester City will have a goal kick."
        },
        {
            "gameTime": "1 - 33:12",
            "label": "",
            "description": "Yaya Toure (Manchester City) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. Barcelona are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "1 - 30:58",
            "label": "soccer-ball",
            "description": "GOAL! Ivan Rakitic (Barcelona) collects a pass and from inside the box he lifts the ball over Joe Hart, who was off his line. What a finish that is! 1:0."
        },
        {
            "gameTime": "1 - 30:33",
            "label": "",
            "description": "Samir Nasri (Manchester City) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 29:48",
            "label": "",
            "description": "Barcelona keep hold of the ball with numerous one two passes, but one error and they surrender possession."
        },
        {
            "gameTime": "1 - 28:36",
            "label": "",
            "description": "Luis Suarez (Barcelona) picks up a pass and unleashes a strong shot from inside the box, but the goalkeeper is equal to it!"
        },
        {
            "gameTime": "1 - 27:25",
            "label": "",
            "description": "Close! Lionel Messi (Barcelona) takes the resultant free kick from 21 metres out and his shot goes just over the crossbar. The ball is off of the pitch and it's a goal kick for Manchester City."
        },
        {
            "gameTime": "1 - 26:18",
            "label": "y-card",
            "description": "Gianluca Rocchi shows a yellow card to David Silva (Manchester City), who isn't surprised as the tackle was really hard and late. Barcelona win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "1 - 25:47",
            "label": "",
            "description": "Jordi Alba (Barcelona) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 24:51",
            "label": "",
            "description": "Fernandinho (Manchester City) brings his opponent down. Gianluca Rocchi has a clear sight of it and blows his whistle for a foul. Barcelona get a free kick. Neymar (Barcelona) quickly takes the free kick with a short pass."
        },
        {
            "gameTime": "1 - 24:09",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by James Milner (Manchester City) is thwarted and cleared to safety."
        },
        {
            "gameTime": "1 - 23:09",
            "label": "",
            "description": "Andres Iniesta (Barcelona) fouls an opponent during an attacking move."
        },
        {
            "gameTime": "1 - 22:28",
            "label": "",
            "description": "Neymar (Barcelona) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "1 - 21:22",
            "label": "",
            "description": "Neymar received a clever long ball from Andres Iniesta (Barcelona) which could have put him in a promising position, but the defence was alert and managed to avert the threat."
        },
        {
            "gameTime": "1 - 19:29",
            "label": "y-card",
            "description": "Gianluca Rocchi shows a yellow card to Aleksandar Kolarov (Manchester City) for his blatant foul."
        },
        {
            "gameTime": "1 - 18:45",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "1 - 17:54",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) receives a pass and tries his luck with a low shot from 23 metres out. Marc Andre ter Stegen pulls off a comfortable save to stop the effort going into the middle of the net."
        },
        {
            "gameTime": "1 - 17:21",
            "label": "corner",
            "description": "David Silva (Manchester City) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "1 - 16:52",
            "label": "",
            "description": "Aleksandar Kolarov (Manchester City) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The ball is out of play. A goal scoring opportunity from a corner for Manchester City."
        },
        {
            "gameTime": "1 - 15:19",
            "label": "",
            "description": "Close! Lionel Messi (Barcelona) stands over the resulting free kick from around 23 metres out and his shot goes just over the crossbar. The ball is off of the pitch and it's a goal kick for Manchester City."
        },
        {
            "gameTime": "1 - 14:24",
            "label": "y-card",
            "description": "Gianluca Rocchi shows a yellow card to Fernandinho (Manchester City) for a tough tackle. Barcelona will take a free kick."
        },
        {
            "gameTime": "1 - 13:45",
            "label": "",
            "description": "A short through ball almost allows James Milner (Manchester City) to get in a good shooting position, but he loses it to one of the defenders."
        },
        {
            "gameTime": "1 - 12:47",
            "label": "",
            "description": "David Silva (Manchester City) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 11:07",
            "label": "corner",
            "description": "Neymar (Barcelona) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "1 - 10:38",
            "label": "",
            "description": "Lionel Messi (Barcelona) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Joe Hart guesses his intention and denies him with a fine save. Barcelona have a corner."
        },
        {
            "gameTime": "1 - 10:06",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball."
        },
        {
            "gameTime": "1 - 08:52",
            "label": "corner",
            "description": "The corner from David Silva (Manchester City) is cleared away by the defence."
        },
        {
            "gameTime": "1 - 08:38",
            "label": "",
            "description": "Sergio Aguero (Manchester City) strikes the ball towards goal, but it fails to reach the target after being well blocked by one of the defenders. The ball goes out of play. Manchester City are awarded a corner kick."
        },
        {
            "gameTime": "1 - 07:35",
            "label": "",
            "description": "Luis Suarez (Barcelona) tries to send a low pass into the box, but it's blocked and cleared."
        },
        {
            "gameTime": "1 - 07:12",
            "label": "",
            "description": "Neymar (Barcelona) sends in a pass which fails to reach any of his teammates. The ball goes out of play and Manchester City will have a goal kick."
        },
        {
            "gameTime": "1 - 05:25",
            "label": "",
            "description": "Neymar (Barcelona) expertly controls a neat clever pass inside the box, but his effort crashes against the left post! What an opportunity that was!"
        },
        {
            "gameTime": "1 - 04:41",
            "label": "",
            "description": "Lionel Messi (Barcelona) sprays a pass out to Neymar, but he can't beat his man inside the box."
        },
        {
            "gameTime": "1 - 03:31",
            "label": "",
            "description": "Bacary Sagna (Manchester City) releases a low pass from just outside the box in an attempt to find his teammate, but one of the defenders calmly averts the threat. The ball has crossed the sideline. Manchester City are taking a throw in."
        },
        {
            "gameTime": "1 - 01:48",
            "label": "",
            "description": "Ivan Rakitic (Barcelona) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 01:19",
            "label": "",
            "description": "Manchester City control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "1 - 00:17",
            "label": "",
            "description": "Fernandinho (Manchester City) slips past one challenge, but is unable to feed a low pass into the path of one of his teammates. It's a throw in for Barcelona."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Manchester City will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Gianluca Rocchi."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "All in all that was an entertaining 90 minutes of football thanks to some decent attacking play. Great display from the home side, you have to say that they were the better side today. Both teams attempted to play possession football."
        }
    ],
    "gameAwayTeam": "Manchester City",
    "gameDate": "18/03/2015 - 22:45",
    "gameHomeTeam": "Barcelona",
    "gameScore": "1 - 0"
}