{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2016-01-03 - 22-30 Valencia 2 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:30",
            "label": "",
            "description": "We have seen a great game today, let's hope the players will be able to maintain these high levels of play in order to keep fans entertained in future games. We didn't see either team enjoy any significant control of the game. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        },
        {
            "gameTime": "2 - 48:11",
            "label": "whistle",
            "description": "Jose Sanchez is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:45",
            "label": "",
            "description": "Andre Gomes (Valencia) gets the ball from a rebound and thumps a terrific long range shot towards the net. Unfortunately for him, it sails narrowly wide of the left post. Unlucky finish."
        },
        {
            "gameTime": "2 - 47:40",
            "label": "",
            "description": "Alvaro Negredo (Valencia) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the middle of the goal. Keylor Navas has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 47:27",
            "label": "attendance",
            "description": "The attendance is 47185."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 46:51",
            "label": "corner",
            "description": "The resulting corner from Luka Modric (Real Madrid) is cleared by the defence. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 46:30",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) takes the corner but only sends it into a huddle of the defenders and one of them makes a good clearance. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 45:58",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a pass into the box, but his attempt is thwarted and cleared. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:39",
            "label": "",
            "description": "The ball is cleared after Andre Gomes (Valencia) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "2 - 43:16",
            "label": "",
            "description": "Pepe (Real Madrid) gives away a foul during an attacking move and the referee blows his whistle."
        },
        {
            "gameTime": "2 - 43:00",
            "label": "corner",
            "description": "Real Madrid work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "2 - 42:27",
            "label": "",
            "description": "Gareth Bale (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 41:58",
            "label": "substitution",
            "description": "Gary Neville prepares a substitution. Rodrigo De Paul is replaced by Javi Fuego (Valencia)."
        },
        {
            "gameTime": "2 - 39:56",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 38:49",
            "label": "substitution",
            "description": "It is time for a substitution. Alvaro Negredo (Valencia) is on for Daniel Parejo."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "soccer-ball",
            "description": "GOAL! Rodrigo connects with a delightful cross and heads it towards Alcacer Paco (Valencia), whose header goes past Keylor Navas. 2:2."
        },
        {
            "gameTime": "2 - 36:30",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Toni Kroos flighted in the free kick and the ball found the head of Gareth Bale (Real Madrid), whose excellent bullet header sailed into the left side of the goal. 1:2."
        },
        {
            "gameTime": "2 - 35:37",
            "label": "",
            "description": "Joao Cancelo (Valencia) clearly holds his opponent to prevent him from getting the ball and the referee immediately stops play. Real Madrid are given an advantage. They have a free kick."
        },
        {
            "gameTime": "2 - 34:20",
            "label": "substitution",
            "description": "The referee signals a substitution. Rodrigo (Valencia) is brought on as a substitute for Lucas Orban."
        },
        {
            "gameTime": "2 - 33:10",
            "label": "",
            "description": "Lucas (Real Madrid) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "2 - 32:19",
            "label": "corner",
            "description": "Real Madrid quickly take a corner kick with a short pass."
        },
        {
            "gameTime": "2 - 32:01",
            "label": "",
            "description": "The ball is cleared after Lucas (Real Madrid) attempted to dribble past an opposing player. Now Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 30:17",
            "label": "",
            "description": "Gareth Bale (Real Madrid) sends a teasing cross into the area, but Jaume Domenech intercepts the ball."
        },
        {
            "gameTime": "2 - 29:24",
            "label": "",
            "description": "Handball by Andre Gomes (Valencia)."
        },
        {
            "gameTime": "2 - 28:34",
            "label": "",
            "description": "Luka Modric (Real Madrid) had a good opportunity from long range. His shot was directed towards the bottom left corner, but Jaume Domenech was alert and made a comfortable save."
        },
        {
            "gameTime": "2 - 28:27",
            "label": "",
            "description": "One of the Valencia players unfairly tackled his opponent and conceded a foul."
        },
        {
            "gameTime": "2 - 24:56",
            "label": "",
            "description": "Luka Modric (Real Madrid) clearly holds his opponent to prevent him from getting the ball and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 22:40",
            "label": "r-card",
            "description": "Jose Sanchez shows a red card with no hesitation. Mateo Kovacic (Real Madrid) can have an early bath and think about his challenge."
        },
        {
            "gameTime": "2 - 22:10",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) dived to the ground without any contact with the opponent."
        },
        {
            "gameTime": "2 - 21:35",
            "label": "substitution",
            "description": "Rafael Benitez decides to make a substitution. Karim Benzema will be replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 20:39",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "2 - 19:22",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) dribbles into the box, but Jaume Domenech is quick enough to come off his line and stop him."
        },
        {
            "gameTime": "2 - 18:56",
            "label": "corner",
            "description": "The resulting corner from Rodrigo De Paul (Valencia) comes to nothing."
        },
        {
            "gameTime": "2 - 17:50",
            "label": "",
            "description": "Andre Gomes (Valencia) aims for the middle of the goal, but that's an easy job for the goalkeeper. It will take more than that to test him! It will be a corner kick for Valencia."
        },
        {
            "gameTime": "2 - 15:30",
            "label": "",
            "description": "Danilo (Real Madrid) controls a nice lofted pass and shoots from the edge of the box, but his attempt is neither hard nor precise, so Jaume Domenech stops it easily."
        },
        {
            "gameTime": "2 - 13:31",
            "label": "",
            "description": "Gareth Bale (Real Madrid) is penalised for a foul. Jose Sanchez had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 11:31",
            "label": "y-card",
            "description": "Jose Sanchez has issued a yellow card to Antonio Barragan (Valencia)."
        },
        {
            "gameTime": "2 - 11:30",
            "label": "",
            "description": "Antonio Barragan (Valencia) went to the ground quite willingly."
        },
        {
            "gameTime": "2 - 09:41",
            "label": "",
            "description": "Marcelo (Real Madrid) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 08:46",
            "label": "",
            "description": "Marcelo (Real Madrid) unleashes a close range volley low towards the middle of the goal, but his effort is thwarted by the keeper, and the score remains unchanged."
        },
        {
            "gameTime": "2 - 07:33",
            "label": "",
            "description": "Danilo (Real Madrid) sends over a cross from the side into the penalty area in order to find one of his teammates, but he fails and the opportunity goes begging."
        },
        {
            "gameTime": "2 - 06:07",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "2 - 04:30",
            "label": "",
            "description": "Karim Benzema (Real Madrid) sprays a pass out to Marcelo, but he can't beat his man inside the box."
        },
        {
            "gameTime": "2 - 02:09",
            "label": "",
            "description": "Gareth Bale (Real Madrid) steps up and sends the mid range free kick miles over the bar. Strong but inaccurate shot."
        },
        {
            "gameTime": "2 - 01:23",
            "label": "",
            "description": "A player from Valencia brings down an opponent and commits a foul. Another situation results in a direct free kick for Real Madrid."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Jose Sanchez starts the second half."
        },
        {
            "gameTime": "1 - 46:30",
            "label": "",
            "description": "There has been no time for the supporters to get bored during an eventful opening 45 minutes. Both teams provided some breathtaking moments. It's difficult to say if one side enjoyed any superiority over the other in the first half. The home side relies mostly on counter attacks for their chances, while the away team adopts the opposite approach of possession football."
        },
        {
            "gameTime": "1 - 46:20",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:28",
            "label": "soccer-ball",
            "description": "Goal! Daniel Parejo (Valencia) slams home the penalty with a precise low shot into the bottom right corner."
        },
        {
            "gameTime": "1 - 45:23",
            "label": "",
            "description": "Daniel Parejo (Valencia) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 44:55",
            "label": "y-card",
            "description": "Pepe (Real Madrid) picks up a yellow card for a foul."
        },
        {
            "gameTime": "1 - 44:52",
            "label": "penalty",
            "description": "Pepe (Real Madrid) is penalised after knocking an opponent down. PENALTY to Valencia! Let's see who will take responsibility."
        },
        {
            "gameTime": "1 - 44:07",
            "label": "",
            "description": "Gareth Bale (Real Madrid) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 42:22",
            "label": "",
            "description": "Antonio Barragan (Valencia) tries to slide the ball through to a teammate but it's well blocked by a defender."
        },
        {
            "gameTime": "1 - 41:57",
            "label": "",
            "description": "Karim Benzema (Real Madrid) gets on the ball and beats an opponent, but his run is stopped by the referee Jose Sanchez who sees an offensive foul."
        },
        {
            "gameTime": "1 - 41:09",
            "label": "",
            "description": "Gareth Bale (Real Madrid) had an opportunity from long range. His low shot was directed towards the middle of the goal, but Jaume Domenech was alert and made a comfortable save."
        },
        {
            "gameTime": "1 - 40:23",
            "label": "corner",
            "description": "Rodrigo De Paul (Valencia) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "1 - 38:57",
            "label": "",
            "description": "Aymen Abdennour (Valencia) wins the ball from the corner kick and strikes. The effort lacks accuracy and goes miles wide of the left post."
        },
        {
            "gameTime": "1 - 38:32",
            "label": "corner",
            "description": "Rodrigo De Paul (Valencia) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 37:49",
            "label": "",
            "description": "Rodrigo De Paul plays a lovely pass into Andre Gomes (Valencia), but he can't find the target. His strike from inside the box goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 36:23",
            "label": "",
            "description": "Luka Modric (Real Madrid) blasts the ball high over the crossbar."
        },
        {
            "gameTime": "1 - 36:09",
            "label": "corner",
            "description": "A quickly taken corner by Real Madrid."
        },
        {
            "gameTime": "1 - 35:27",
            "label": "",
            "description": "Marcelo (Real Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort. The referee blows his whistle, Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "1 - 34:05",
            "label": "",
            "description": "Rough tackle by Andre Gomes (Valencia). The referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 32:54",
            "label": "",
            "description": "Alcacer Paco (Valencia) jumps into a tackle and Jose Sanchez blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 30:43",
            "label": "",
            "description": "Joao Cancelo (Valencia) rises above the defence inside the box, but his header flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 28:55",
            "label": "",
            "description": "Lucas Orban (Valencia) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 25:48",
            "label": "",
            "description": "Andre Gomes (Valencia) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 25:36",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fires the ball at goal from inside the area, but it's well blocked."
        },
        {
            "gameTime": "1 - 24:55",
            "label": "",
            "description": "Marcelo (Real Madrid) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 23:29",
            "label": "",
            "description": "Andre Gomes (Valencia) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "1 - 23:02",
            "label": "",
            "description": "Danilo (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 20:38",
            "label": "",
            "description": "Andre Gomes (Valencia) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 18:56",
            "label": "",
            "description": "The Valencia players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "1 - 15:25",
            "label": "soccer-ball",
            "description": "Fantastic team goal! Karim Benzema (Real Madrid) was set free in the area by Cristiano Ronaldo and he made no mistake with a lovely finish into the bottom left corner. 0:1."
        },
        {
            "gameTime": "1 - 14:51",
            "label": "",
            "description": "Lucas Orban (Valencia) gives away a foul for a fierce tackle on an opponent."
        },
        {
            "gameTime": "1 - 14:18",
            "label": "",
            "description": "Daniel Parejo (Valencia) unleashes a powerful shot towards goal from a mid range free kick, but the ball is blocked by the defensive wall."
        },
        {
            "gameTime": "1 - 13:34",
            "label": "",
            "description": "Jose Sanchez blows his whistle after Toni Kroos (Real Madrid) brings one of his opponents down with a strong tackle. Valencia have been awarded a free kick."
        },
        {
            "gameTime": "1 - 12:49",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "1 - 11:32",
            "label": "",
            "description": "Karim Benzema (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes behind for a corner. Real Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 10:39",
            "label": "",
            "description": "Karim Benzema (Real Madrid) connects with a pass but sees his shot from the edge of the box blocked."
        },
        {
            "gameTime": "1 - 09:50",
            "label": "",
            "description": "Daniel Parejo (Valencia) finds enough space to climb high and plants a header well wide of the right post. What a poor effort."
        },
        {
            "gameTime": "1 - 09:31",
            "label": "corner",
            "description": "The referee awards a corner and Andre Gomes (Valencia) goes over to take it."
        },
        {
            "gameTime": "1 - 09:30",
            "label": "",
            "description": "Andre Gomes (Valencia) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 08:33",
            "label": "",
            "description": "Karim Benzema (Real Madrid) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "1 - 08:07",
            "label": "",
            "description": "Alcacer Paco (Valencia) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "1 - 07:12",
            "label": "",
            "description": "Luka Modric (Real Madrid) attempts to send a pass but the effort is blocked."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "injury",
            "description": "Alcacer Paco (Valencia) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "1 - 05:29",
            "label": "",
            "description": "Joao Cancelo (Valencia) threads a pass through the eye of a needle into the box for Alcacer Paco, but Keylor Navas displays great awareness to stop him."
        },
        {
            "gameTime": "1 - 04:43",
            "label": "",
            "description": "Karim Benzema passes to Danilo (Real Madrid), but he produces a wild shot from the edge of the box which goes high over the bar."
        },
        {
            "gameTime": "1 - 04:08",
            "label": "",
            "description": "Toni Kroos (Real Madrid) commits a foul during an attacking move."
        },
        {
            "gameTime": "1 - 03:49",
            "label": "",
            "description": "The ball is cleared after Cristiano Ronaldo (Real Madrid) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 01:53",
            "label": "",
            "description": "Jose Sanchez couldn't ignore the rough tackle by Danilo (Valencia) and blew his whistle."
        },
        {
            "gameTime": "1 - 01:08",
            "label": "",
            "description": "Real Madrid enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out at last! Real Madrid will take the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jose Sanchez is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We have seen a great game today, let's hope the players will be able to maintain these high levels of play in order to keep fans entertained in future games. We didn't see either team enjoy any significant control of the game. The home side were defending patiently to win the ball off the opponent and launch the counter. However, the away side moved the ball around and were waiting for a gap to appear in the home side's defence."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "03/01/2016 - 22:30",
    "gameHomeTeam": "Valencia",
    "gameScore": "2 - 2"
}