{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2014-2015/2015-02-18 - 22-45 Schalke 0 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. The visitors certainly had the better of things. The home team really focused on a well organized defence, while the away team played possession football."
        },
        {
            "gameTime": "2 - 48:06",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:58",
            "label": "",
            "description": "Max Meyer (Schalke) sprays a pass out to Maxim Choupo Moting, but he can't beat his man inside the box."
        },
        {
            "gameTime": "2 - 45:22",
            "label": "",
            "description": "Marcelo (Real Madrid) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:56",
            "label": "",
            "description": "Real Madrid continue the game with a quickly taken free kick."
        },
        {
            "gameTime": "2 - 43:35",
            "label": "",
            "description": "Martin Atkinson couldn't ignore the rough tackle by Dennis Aogo (Schalke) and blew his whistle. It's a free kick to Real Madrid in a dangerous position."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "",
            "description": "The Real Madrid players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 41:14",
            "label": "",
            "description": "A lofted cross from Atsuto Uchida (Schalke) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 39:24",
            "label": "substitution",
            "description": "Carlo Ancelotti has decided to substitute Isco and he is replaced by Asier Illarramendi (Real Madrid)."
        },
        {
            "gameTime": "2 - 37:26",
            "label": "",
            "description": "Dennis Aogo (Schalke) sends a cross into the box. However, the opponent's defence eliminates the danger by clearing the ball out."
        },
        {
            "gameTime": "2 - 36:34",
            "label": "substitution",
            "description": "We are about to witness a substitution. Alvaro Arbeloa (Real Madrid) is replacing Daniel Carvajal."
        },
        {
            "gameTime": "2 - 35:08",
            "label": "",
            "description": "Max Meyer (Schalke) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "2 - 34:45",
            "label": "substitution",
            "description": "Roberto Di Matteo prepares a substitution. Marco Hoger is replaced by Max Meyer (Schalke)."
        },
        {
            "gameTime": "2 - 33:51",
            "label": "soccer-ball",
            "description": "Marcelo (Real Madrid) latches on to a pass and controls it with a good first touch. He unleashes a deadly strike from around 18 metres out which goes into the top right corner."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "substitution",
            "description": "A substitution has been made. Karim Benzema goes off and Chicharito (Real Madrid) comes on."
        },
        {
            "gameTime": "2 - 32:21",
            "label": "",
            "description": "Flag up against Karim Benzema (Real Madrid). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "",
            "description": "Marco Hoger (Schalke) is penalised for a foul. Martin Atkinson had a clear view and blows his whistle."
        },
        {
            "gameTime": "2 - 30:09",
            "label": "corner",
            "description": "Dennis Aogo (Schalke) floats the ball in from the corner but it's intercepted."
        },
        {
            "gameTime": "2 - 29:51",
            "label": "",
            "description": "Maxim Choupo Moting (Schalke) serves up a nice cross, but the defence clears the danger. Schalke earn a corner."
        },
        {
            "gameTime": "2 - 28:46",
            "label": "",
            "description": "OFF THE CROSSBAR! Felix Platte (Schalke) runs towards the goal to give his teammate support. He receives a fantastic pass and shoots from the edge of the box, but it crashes against the crossbar. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "2 - 27:52",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to produce a decent enough free kick for a player of his ability and the only target that he finds is the wall of defenders in front of him."
        },
        {
            "gameTime": "2 - 26:56",
            "label": "",
            "description": "Benedikt Howedes (Schalke) is penalised for holding. Martin Atkinson signals a set piece. Real Madrid are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 26:06",
            "label": "",
            "description": "Isco (Real Madrid) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just over the crossbar."
        },
        {
            "gameTime": "2 - 25:51",
            "label": "attendance",
            "description": "The attendance for today's match is 54400."
        },
        {
            "gameTime": "2 - 23:47",
            "label": "",
            "description": "Kevin Prince Boateng (Schalke) produces a long range cannon of a shot after a nice pass. The ball heads towards the middle of the goal, but is easily stopped by a save from Iker Casillas and the score remains the same."
        },
        {
            "gameTime": "2 - 22:44",
            "label": "",
            "description": "Karim Benzema (Real Madrid) serves up a nice cross, but Timon Wellenreuther punches the ball away."
        },
        {
            "gameTime": "2 - 20:22",
            "label": "",
            "description": "Real Madrid are dominating the game at the moment by exchanging a combination of one or two touch passes. Great harmony between the players."
        },
        {
            "gameTime": "2 - 19:33",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) hasn't suffered any serious injury which would see him leave the pitch. He's back in the game now."
        },
        {
            "gameTime": "2 - 18:12",
            "label": "injury",
            "description": "Daniel Carvajal (Real Madrid) is having a really tough time right now. We are about to find out how serious his injury is."
        },
        {
            "gameTime": "2 - 17:36",
            "label": "y-card",
            "description": "The foul by Jan Kirchhoff (Schalke) is worthy of a card and a yellow is duly shown by Martin Atkinson."
        },
        {
            "gameTime": "2 - 16:55",
            "label": "",
            "description": "It wasn't the best example of how to strike the ball. Kevin Prince Boateng (Schalke) unleashed a first time shot from the edge of the box that went high over the crossbar."
        },
        {
            "gameTime": "2 - 15:47",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Jan Kirchhoff (Schalke), is intercepted by the opposition's defence."
        },
        {
            "gameTime": "2 - 14:36",
            "label": "",
            "description": "Marco Hoger (Schalke) commits a rough foul. Martin Atkinson stops the game and makes a call."
        },
        {
            "gameTime": "2 - 12:45",
            "label": "",
            "description": "Schalke exchange some short passes over a small area and control the game. Now they make a mistake and lose the ball and the whole situation changes completely."
        },
        {
            "gameTime": "2 - 11:26",
            "label": "substitution",
            "description": "The game has come to an end for Roman Neustadter. He has contributed as much as he could today. He will be replaced by the fresh legs of Jan Kirchhoff (Schalke)."
        },
        {
            "gameTime": "2 - 10:59",
            "label": "",
            "description": "The linesman raises his flag for offside before Isco (Real Madrid) heads on."
        },
        {
            "gameTime": "2 - 09:42",
            "label": "",
            "description": "Gareth Bale (Real Madrid) swings a cross into the box, but it's far too close to Timon Wellenreuther, who smothers the ball."
        },
        {
            "gameTime": "2 - 07:57",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "2 - 07:29",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) sends a low pass from outside the box to Karim Benzema. He lines up a shot, but the defence intercepts at the last moment. Real Madrid win a corner."
        },
        {
            "gameTime": "2 - 06:20",
            "label": "",
            "description": "Good clearance! Felix Platte (Schalke) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him."
        },
        {
            "gameTime": "2 - 04:24",
            "label": "",
            "description": "Dennis Aogo (Schalke) swings a cross into the box, but it's far too close to Iker Casillas, who smothers the ball."
        },
        {
            "gameTime": "2 - 03:14",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a teasing cross into the area, but Timon Wellenreuther intercepts the ball."
        },
        {
            "gameTime": "2 - 02:59",
            "label": "",
            "description": "The Real Madrid players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "2 - 01:27",
            "label": "",
            "description": "Felix Platte (Schalke) shows too much aggression while trying to break free from his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 00:29",
            "label": "",
            "description": "Isco (Real Madrid) was too forceful with his tackle and Martin Atkinson interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The game restarts for the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "We have seen a few chances and nice movements, but the overall impression of the game is rather average and not hugely entertaining. The first half was definitely edged by the visiting team. The home team's main priority is a flawless defence, while the away side's style is slow build up play."
        },
        {
            "gameTime": "1 - 47:14",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Martin Atkinson has ended it."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) attempts to beat the goalkeeper with a powerful strike from a long range free kick. His effort, however, goes way wide of the left post."
        },
        {
            "gameTime": "1 - 46:36",
            "label": "y-card",
            "description": "Roman Neustadter (Schalke) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Martin Atkinson ignores the protests. Real Madrid are given an advantage. They have a free kick."
        },
        {
            "gameTime": "1 - 45:30",
            "label": "",
            "description": "Karim Benzema (Real Madrid) clutches his head after wasting a good opportunity. He expertly collected the ball from a rebound and fired from long range, but his effort wasn't accurate at all and the ball went miles over the crossbar. The ball is off of the pitch and it's a goal kick for Schalke."
        },
        {
            "gameTime": "1 - 45:13",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:41",
            "label": "",
            "description": "An attempted cross from Cristiano Ronaldo (Real Madrid) is cleared. The referee points to the corner flag and Real Madrid will take a corner."
        },
        {
            "gameTime": "1 - 44:18",
            "label": "",
            "description": "Good defending. Atsuto Uchida (Schalke) tries to find Maxim Choupo Moting inside the box, but the pass is cut out."
        },
        {
            "gameTime": "1 - 42:29",
            "label": "",
            "description": "Schalke hold the ball and display nice passing from player to player."
        },
        {
            "gameTime": "1 - 40:38",
            "label": "",
            "description": "Gareth Bale (Real Madrid) delivers a low pass into the box which is intercepted."
        },
        {
            "gameTime": "1 - 39:21",
            "label": "",
            "description": "Toni Kroos (Real Madrid) attempts to find Cristiano Ronaldo, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 37:38",
            "label": "",
            "description": "Maxim Choupo Moting (Schalke) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 37:02",
            "label": "",
            "description": "The foul by Cristiano Ronaldo (Real Madrid) was seen by Martin Atkinson who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 35:37",
            "label": "",
            "description": "Real Madrid are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "1 - 34:11",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) takes the mid range free kick and sends it towards the roof of the net, but he is denied by the goalkeeper."
        },
        {
            "gameTime": "1 - 34:10",
            "label": "y-card",
            "description": "Kevin Prince Boateng (Schalke) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Martin Atkinson doesn't think twice to pull it out of his pocket. A free kick to Real Madrid."
        },
        {
            "gameTime": "1 - 32:22",
            "label": "substitution",
            "description": "Klaas Jan Huntelaar is being substituted because of an injury. Roberto Di Matteo sends Felix Platte (Schalke) on the pitch."
        },
        {
            "gameTime": "1 - 30:33",
            "label": "",
            "description": "Timon Wellenreuther pulls off a great save to deny Karim Benzema (Real Madrid) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "1 - 29:42",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) tries to find the head of a teammate in the box but overhits the cross."
        },
        {
            "gameTime": "1 - 28:59",
            "label": "",
            "description": "Klaas Jan Huntelaar (Schalke) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 27:09",
            "label": "injury",
            "description": "Klaas Jan Huntelaar (Schalke) picks up an injury."
        },
        {
            "gameTime": "1 - 25:14",
            "label": "soccer-ball",
            "description": "Daniel Carvajal produces a beautiful lofted cross into the box, where Cristiano Ronaldo (Real Madrid) rises high to head the ball straight under the crossbar and beyond the goalkeeper. He makes it 0:1."
        },
        {
            "gameTime": "1 - 24:17",
            "label": "",
            "description": "Klaas Jan Huntelaar (Schalke) jinks his way past multiple challenges and fires the ball from the edge of the box to the bottom right corner, but Iker Casillas shows his agility and makes a save."
        },
        {
            "gameTime": "1 - 23:40",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) probably spotted the goalkeeper off his line, but he misdirected his long range shot as it went a few yards wide of the right post."
        },
        {
            "gameTime": "1 - 22:23",
            "label": "",
            "description": "Atsuto Uchida (Schalke) makes a strong challenge and Martin Atkinson blows for a foul."
        },
        {
            "gameTime": "1 - 21:46",
            "label": "",
            "description": "A pass into the penalty area from Marcelo (Real Madrid) is intercepted by the defence. The ball is behind the touchline and Real Madrid will take a throw in."
        },
        {
            "gameTime": "1 - 19:59",
            "label": "",
            "description": "Dennis Aogo (Schalke) gets the ball and drives a shot high over the bar from the edge of the area."
        },
        {
            "gameTime": "1 - 18:02",
            "label": "",
            "description": "Lucas Silva (Real Madrid) unleashes a shot, but his effort is poor and flies well wide of the left post."
        },
        {
            "gameTime": "1 - 17:51",
            "label": "",
            "description": "Some neat passing and movement from Real Madrid as they ping around some short passes in order to create a new attacking opportunity."
        },
        {
            "gameTime": "1 - 15:57",
            "label": "",
            "description": "Martin Atkinson blows his whistle. Pepe (Real Madrid) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 15:37",
            "label": "corner",
            "description": "The corner from Marco Hoger (Schalke) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 14:58",
            "label": "",
            "description": "Marco Hoger (Schalke) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance. Schalke force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 13:23",
            "label": "",
            "description": "The resulting free kick from 27 metres out taken by Dennis Aogo (Schalke) was blocked by the defensive wall, which was perfectly positioned by the goalkeeper."
        },
        {
            "gameTime": "1 - 12:36",
            "label": "",
            "description": "Lucas Silva (Real Madrid) is penalised after knocking an opponent down. Schalke have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 10:04",
            "label": "",
            "description": "Marco Hoger (Schalke) sends a cross into the box, but Iker Casillas comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 08:52",
            "label": "y-card",
            "description": "Martin Atkinson shows the yellow card to Toni Kroos (Real Madrid) for a heavy challenge."
        },
        {
            "gameTime": "1 - 08:33",
            "label": "",
            "description": "The referee blows his whistle as Kevin Prince Boateng (Schalke) was too aggressive in his challenge."
        },
        {
            "gameTime": "1 - 06:38",
            "label": "",
            "description": "Karim Benzema (Real Madrid) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 05:35",
            "label": "",
            "description": "Gareth Bale (Real Madrid) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 04:11",
            "label": "",
            "description": "Martin Atkinson blows for a foul after Marco Hoger (Schalke) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 03:07",
            "label": "",
            "description": "The game is interrupted as Karim Benzema (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "1 - 01:49",
            "label": "",
            "description": "Schalke will kick off."
        },
        {
            "gameTime": "1 - 01:46",
            "label": "",
            "description": "Martin Atkinson blows his whistle and it's Cristiano Ronaldo (Real Madrid) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 01:12",
            "label": "",
            "description": "Real Madrid are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Martin Atkinson will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups of both teams are already revealed and you can check them out in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "We were witnesses to an uneventful game without many stirring moments. There is definitely room for improvement in future games. The visitors certainly had the better of things. The home team really focused on a well organized defence, while the away team played possession football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "18/02/2015 - 22:45",
    "gameHomeTeam": "Schalke",
    "gameScore": "0 - 2"
}