{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-11-05 - 22-45 Napoli 1 - 1 Lazio/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side dominated today's game. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        },
        {
            "gameTime": "2 - 48:02",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 47:19",
            "label": "",
            "description": "Allan (Napoli) escapes without any punishment from the referee after using excessive force to foul his opponent."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 43:13",
            "label": "",
            "description": "Felipe Anderson (Lazio) looks to break free, but an opposing player clears the ball away. The ball is off of the pitch and it's a goal kick for Napoli."
        },
        {
            "gameTime": "2 - 41:54",
            "label": "substitution",
            "description": "Ciro Immobile comes off the pitch to be replaced by Cristiano Lombardi (Lazio)."
        },
        {
            "gameTime": "2 - 41:43",
            "label": "substitution",
            "description": "Maurizio Sarri decides to make a substitution. Marek Hamsik will be replaced by Allan (Napoli)."
        },
        {
            "gameTime": "2 - 40:38",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "2 - 39:12",
            "label": "",
            "description": "Napoli seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 37:44",
            "label": "substitution",
            "description": "Substitution. Balde Keita makes his way off the pitch and Filip Dordevic (Lazio) comes on as his replacement."
        },
        {
            "gameTime": "2 - 37:11",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) whips the ball into the penalty area, but one of the defenders is alert and spanks it away."
        },
        {
            "gameTime": "2 - 35:53",
            "label": "substitution",
            "description": "Here is a change. Jose Callejon is going off and Maurizio Sarri gives the last tactical orders to Omar El Kaddouri (Napoli)."
        },
        {
            "gameTime": "2 - 35:28",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner but it's cleared."
        },
        {
            "gameTime": "2 - 35:00",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) fires the ball from distance, but it's blocked by a defender. The ball is out of play and the linesman points at the corner flag. Corner to Napoli."
        },
        {
            "gameTime": "2 - 34:05",
            "label": "",
            "description": "Antonio Damato blows for a foul after Dries Mertens (Napoli) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "substitution",
            "description": "It's time for a substitution. Patric Gabarron (Lazio) comes on in place of Senad Lulic."
        },
        {
            "gameTime": "2 - 29:40",
            "label": "",
            "description": "Marek Hamsik (Napoli) receives a pass and unleashes a shot which goes well wide of the right post."
        },
        {
            "gameTime": "2 - 29:09",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Jose Callejon (Napoli), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 28:51",
            "label": "",
            "description": "A beautiful low pass from the side is received by Marek Hamsik (Napoli), who was waiting for his chance. However, the defence is alert and spanks the ball away. Napoli get a corner."
        },
        {
            "gameTime": "2 - 27:29",
            "label": "",
            "description": "Marek Hamsik (Napoli) attempts to scoop the ball into the box over the defence, but one of the defending players makes a timely intervention."
        },
        {
            "gameTime": "2 - 27:06",
            "label": "",
            "description": "Napoli enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "2 - 26:08",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "2 - 24:48",
            "label": "",
            "description": "Manolo Gabbiadini (Napoli) connected with a pass around the edge of the box, aimed and shot. His attempt went low towards the middle of the target, but Federico Marchetti was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 23:22",
            "label": "funfact",
            "description": "We can have a look at the statistics now, shots on target are 8:3."
        },
        {
            "gameTime": "2 - 22:01",
            "label": "",
            "description": "Federico Marchetti displays his ability to read the game and clears the danger after Manolo Gabbiadini (Napoli) threatened to latch onto a through ball from just outside the box."
        },
        {
            "gameTime": "2 - 21:37",
            "label": "substitution",
            "description": "The substitution has been made. Manolo Gabbiadini (Napoli) has replaced Lorenzo Insigne."
        },
        {
            "gameTime": "2 - 20:53",
            "label": "",
            "description": "Ambitious effort from Lorenzo Insigne (Napoli). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well wide of the left post."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "",
            "description": "The game is pretty dull as Napoli are just passing the ball from player to player. Nothing lasts forever, though, and they finally make a mistake, allowing the opposition to pick up the ball."
        },
        {
            "gameTime": "2 - 16:59",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) fails to produce a decent cross from the corner kick. The ball goes well out of play."
        },
        {
            "gameTime": "2 - 16:50",
            "label": "",
            "description": "Elseid Hysaj (Napoli) receives a pass and tries his luck with a shot from 23 metres out. Federico Marchetti pulls off a decent save to stop the effort going into the right side of the goal. The ball goes out of play and Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 16:46",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) overhits the corner kick and none of his teammates can their head on it."
        },
        {
            "gameTime": "2 - 15:56",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) takes the corner kick and sends the ball among a huddle of players inside the penalty area, but one of the defenders clears it to safety. The referee points to the corner flag. It's a corner to Napoli."
        },
        {
            "gameTime": "2 - 15:31",
            "label": "",
            "description": "Jose Callejon (Napoli) tries to slide the ball through to a teammate but it's well blocked by a defender. Corner kick. Napoli will have an opportunity."
        },
        {
            "gameTime": "2 - 15:16",
            "label": "funfact",
            "description": "65:35 – this is the current ball possession ratio."
        },
        {
            "gameTime": "2 - 14:46",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 13:25",
            "label": "",
            "description": "A crossfield pass from Wallace (Lazio) fails to find any of his teammates. The ball has crossed the sideline. Napoli are taking a throw in."
        },
        {
            "gameTime": "2 - 11:50",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "2 - 11:31",
            "label": "",
            "description": "Marek Hamsik (Napoli) takes the ball on and fires in a shot from 22 metres out. Federico Marchetti stops the effort which is headed to the right post. The ball is out of play. Napoli win a corner kick."
        },
        {
            "gameTime": "2 - 08:47",
            "label": "soccer-ball",
            "description": "Goal 0:0! Balde Keita (Lazio) receives a precise pass inside the box from Marco Parolo and he beats the goalkeeper with a neat finish into the bottom right corner."
        },
        {
            "gameTime": "2 - 07:30",
            "label": "",
            "description": "The Lazio players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 06:58",
            "label": "soccer-ball",
            "description": "An amazing individual effort from Marek Hamsik (Napoli) ends with a strike from inside the penalty area. He sends the ball precisely into the bottom right corner and makes it 1:0. Federico Marchetti was helpless."
        },
        {
            "gameTime": "2 - 06:17",
            "label": "corner",
            "description": "Faouzi Ghoulam (Napoli) launches a cross from the corner, but Federico Marchetti is alert to thwart the effort."
        },
        {
            "gameTime": "2 - 05:55",
            "label": "y-card",
            "description": "Stefan Radu (Lazio) violates the rules and gets a yellow card."
        },
        {
            "gameTime": "2 - 04:54",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) picks up the ball, dribbles to the edge of the penalty area and unleashes a brilliant shot to the right side of the goal, but is thwarted by a great save from Federico Marchetti. Napoli have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 02:48",
            "label": "",
            "description": "Ciro Immobile (Lazio) makes a good run with the ball into the box, but mishits his shot as it goes well wide of the right post."
        },
        {
            "gameTime": "2 - 01:54",
            "label": "",
            "description": "Ciro Immobile (Lazio) darts into the penalty area to latch on to a pass, and he unleashes a low shot in the direction of the right post. Pepe Reina is alert and denies him with a nice save."
        },
        {
            "gameTime": "2 - 01:48",
            "label": "",
            "description": "Wallace (Lazio) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Antonio Damato starts the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Well, it hasn't been the most exciting game in the world but there has been some nice football on display. We hope that the second period will bring more action. The home side dominated the first half in most aspects of the game, but the visitors will surely attempt to turn the situation around in the second half. The home team tries to prevail using combination football, while the away teams uses mostly counter attacks."
        },
        {
            "gameTime": "1 - 45:58",
            "label": "whistle",
            "description": "The referee blows his whistle to end the first half and the players are now heading to their respective dressing rooms."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:25",
            "label": "",
            "description": "Sergej Milinkovic Savic (Lazio) wasted a great chance as he climbed high to connect with a cross from the free kick inside the penalty area. He produced a header, but sent the ball into the stands."
        },
        {
            "gameTime": "1 - 44:14",
            "label": "",
            "description": "Lucas Biglia (Lazio) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 43:39",
            "label": "",
            "description": "Antonio Damato blows his whistle for a foul after Kalidou Koulibaly (Napoli) hacks down one of his opponents. Lazio will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 41:58",
            "label": "",
            "description": "Neat passing move from Napoli in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 39:54",
            "label": "corner",
            "description": "Lucas Biglia (Lazio) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "1 - 39:35",
            "label": "",
            "description": "Felipe Anderson (Lazio) goes on a solo run, but he fails to create a chance as an opposition player blocks him. Lazio will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 39:08",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance."
        },
        {
            "gameTime": "1 - 36:26",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 34:56",
            "label": "",
            "description": "Dries Mertens (Napoli) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "1 - 33:47",
            "label": "",
            "description": "Elseid Hysaj (Napoli) seems to be alright and is okay to carry on."
        },
        {
            "gameTime": "1 - 33:01",
            "label": "injury",
            "description": "The game is interrupted now, Elseid Hysaj (Napoli) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 32:15",
            "label": "",
            "description": "Marek Hamsik (Napoli) tries his luck and takes a shot from inside the box. His effort on goal is blocked by a defender."
        },
        {
            "gameTime": "1 - 31:50",
            "label": "",
            "description": "Antonio Damato blows his whistle after Sergej Milinkovic Savic (Lazio) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 30:33",
            "label": "",
            "description": "Ciro Immobile (Lazio) makes his forward run a little too early and is caught in an offside position after his teammate tries to play a pass to him."
        },
        {
            "gameTime": "1 - 27:23",
            "label": "y-card",
            "description": "Antonio Damato shows the yellow card to Marco Parolo (Lazio) for a heavy challenge."
        },
        {
            "gameTime": "1 - 25:10",
            "label": "corner",
            "description": "The resulting corner from Faouzi Ghoulam (Napoli) is cleared by the defence."
        },
        {
            "gameTime": "1 - 24:44",
            "label": "",
            "description": "The resulting free kick from 25 metres out taken by Dries Mertens (Napoli) was blocked by the defensive wall, which was perfectly positioned by the goalkeeper. Napoli force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 23:43",
            "label": "",
            "description": "A clumsy foul by Dusan Basta (Lazio) and Antonio Damato blows his whistle. Napoli have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 22:14",
            "label": "",
            "description": "Marek Hamsik (Napoli) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball."
        },
        {
            "gameTime": "1 - 20:46",
            "label": "",
            "description": "Elseid Hysaj (Napoli) sends a long ball in, but Federico Marchetti comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 20:01",
            "label": "",
            "description": "The game is interrupted as Lorenzo Insigne (Napoli) is flagged offside."
        },
        {
            "gameTime": "1 - 19:44",
            "label": "",
            "description": "Dries Mertens (Napoli) commits a foul and Antonio Damato immediately signals a free kick."
        },
        {
            "gameTime": "1 - 17:48",
            "label": "corner",
            "description": "Lazio work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "1 - 17:26",
            "label": "",
            "description": "Felipe Anderson (Lazio) looks to break free, but an opposing player clears the ball away. It will be a corner kick for Lazio."
        },
        {
            "gameTime": "1 - 15:59",
            "label": "",
            "description": "A pass from Lorenzo Insigne (Napoli) is intercepted by Federico Marchetti and the move breaks down."
        },
        {
            "gameTime": "1 - 13:23",
            "label": "",
            "description": "The ball is cleared after Ciro Immobile (Lazio) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 12:50",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) picks up the ball, dribbles to the edge of the penalty area and unleashes a brilliant shot to the left side of the goal, but is thwarted by a great save from Federico Marchetti."
        },
        {
            "gameTime": "1 - 11:40",
            "label": "",
            "description": "Excellent touch by Balde Keita (Lazio)! He latches on to a precise pass on the edge of the box but miskicks and the ball goes well wide of the right post. Poor effort."
        },
        {
            "gameTime": "1 - 11:07",
            "label": "",
            "description": "Dries Mertens (Napoli) tries his luck with a shot from 23 metres out. His effort, however, flies low to the middle of the target and Federico Marchetti pulls off a comfortable save."
        },
        {
            "gameTime": "1 - 10:29",
            "label": "",
            "description": "Jose Callejon (Napoli) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 08:13",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 07:48",
            "label": "",
            "description": "Ciro Immobile (Lazio) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "1 - 07:21",
            "label": "",
            "description": "Felipe Anderson (Lazio) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 05:17",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) darts into the box and immediately fires a first time effort. He produces a poor shot which goes well over the crossbar."
        },
        {
            "gameTime": "1 - 03:17",
            "label": "corner",
            "description": "Jose Callejon (Napoli) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "1 - 03:00",
            "label": "",
            "description": "Good clearance! Dries Mertens (Napoli) received a low pass, but he didn't have time to do anything as one of the defenders quickly stole the ball off him. The referee signals a corner kick to Napoli."
        },
        {
            "gameTime": "1 - 00:50",
            "label": "",
            "description": "CLOSE! Dries Mertens (Napoli) shows off his amazing skills with a solo run to the edge of the box before fashioning a shot that goes inches wide of the left post!"
        },
        {
            "gameTime": "1 - 00:34",
            "label": "",
            "description": "Lazio will kick off."
        },
        {
            "gameTime": "1 - 00:27",
            "label": "",
            "description": "Ciro Immobile (Lazio) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the middle of the goal. Pepe Reina has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Antonio Damato is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The top scorer of Lazio is Ciro Immobile with 9 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Napoli have won 4x at home this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Jose Callejon have rippled the net 7x and is the top scorer for Napoli this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The home side dominated today's game. The home side attempted to hold onto the ball for as long as possible. The away team's main weapon was fast counter attacks."
        }
    ],
    "gameAwayTeam": "Lazio",
    "gameDate": "05/11/2016 - 22:45",
    "gameHomeTeam": "Napoli",
    "gameScore": "1 - 1"
}