{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2015-11-08 - 17-30 Dortmund 3 - 2 Schalke/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. The home team had more of the game. Short passing and possession was the style of the home side, while the visiting side tried to hit their opposition on the break."
        },
        {
            "gameTime": "2 - 49:04",
            "label": "whistle",
            "description": "That's all for today as the game is over."
        },
        {
            "gameTime": "2 - 48:05",
            "label": "substitution",
            "description": "Substitution. Pierre Emerick Aubameyang will be replaced by Adrian Ramos (Dortmund)."
        },
        {
            "gameTime": "2 - 47:05",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) picks up a precise pass deep inside the box, but his strike is saved by the keeper."
        },
        {
            "gameTime": "2 - 46:51",
            "label": "",
            "description": "Dortmund take a quick free kick with a short pass and play continues."
        },
        {
            "gameTime": "2 - 46:30",
            "label": "",
            "description": "Felix Brych interrupts the game for a tactical foul by Leon Goretzka (Schalke). Another situation results in a direct free kick for Dortmund."
        },
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) produces an inaccurate low pass into the box that is blocked by the one of the defenders. If this pass had slipped through, the ball would have probably ended up in the back of the net."
        },
        {
            "gameTime": "2 - 45:05",
            "label": "y-card",
            "description": "Felix Platte (Schalke) picks up a caution."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "y-card",
            "description": "Julian Weigl (Dortmund) goes into the book and receives a yellow card."
        },
        {
            "gameTime": "2 - 43:25",
            "label": "substitution",
            "description": "That will be all from Roman Neustadter who is being replaced by the fresh legs of Felix Platte (Schalke)."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Pierre Emerick Aubameyang (Dortmund) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 41:55",
            "label": "",
            "description": "Schalke are ruled offside."
        },
        {
            "gameTime": "2 - 41:30",
            "label": "",
            "description": "Leroy Sane (Schalke) shoots from outside the box, but his effort is blocked."
        },
        {
            "gameTime": "2 - 41:04",
            "label": "substitution",
            "description": "The manager has decided to make a substitution and Gonzalo Castro walks off the pitch to be replaced by Sven Bender (Dortmund)."
        },
        {
            "gameTime": "2 - 39:56",
            "label": "",
            "description": "Franco Di Santo (Schalke) is adjudged offside."
        },
        {
            "gameTime": "2 - 38:55",
            "label": "",
            "description": "Schalke are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. The linesman signals a throw in for Dortmund."
        },
        {
            "gameTime": "2 - 37:28",
            "label": "corner",
            "description": "Dennis Aogo (Schalke) takes the corner kick, but Roman Burki reads it well and stops the effort."
        },
        {
            "gameTime": "2 - 37:08",
            "label": "",
            "description": "Maxim Choupo Moting (Schalke) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender. The ball is out of play and Schalke manage to earn a corner."
        },
        {
            "gameTime": "2 - 36:36",
            "label": "y-card",
            "description": "Marcel Schmelzer (Dortmund) is booked after bringing down an opponent. Felix Brych had an easy decision to make."
        },
        {
            "gameTime": "2 - 34:48",
            "label": "corner",
            "description": "Dennis Aogo (Schalke) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "2 - 34:15",
            "label": "",
            "description": "A great job from two opposing players there. Pierre Emile Hojbjerg (Schalke) fired a shot nicely in on goal from distance towards the bottom right corner, while Roman Burki produced a wonderful piece of goalkeeping to parry the ball onto the post. Schalke have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 32:54",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "2 - 31:33",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) makes contact with a cross and strikes a shot that lacks the power to find the back of the net, but the goalkeeper still has to make a good save to keep his effort out."
        },
        {
            "gameTime": "2 - 30:36",
            "label": "",
            "description": "Matthias Ginter (Dortmund) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "2 - 29:29",
            "label": "",
            "description": "Schalke are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error. The ball has crossed the sideline. Dortmund are taking a throw in."
        },
        {
            "gameTime": "2 - 27:22",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) tries to send a low pass into the box, but it's blocked and cleared."
        },
        {
            "gameTime": "2 - 26:56",
            "label": "",
            "description": "Matthias Ginter (Dortmund) sends a long ball in, but Ralf Fahrmann comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 25:32",
            "label": "soccer-ball",
            "description": "GOAL! Klaas Jan Huntelaar (Schalke) collects a pass and from inside the box he lifts the ball over Roman Burki, who was off his line. What a finish that is! 3:2."
        },
        {
            "gameTime": "2 - 25:05",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 24:45",
            "label": "",
            "description": "The Dortmund players are exchanging short passes in an attempt to create a shooting opportunity."
        },
        {
            "gameTime": "2 - 23:56",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Pierre Emile Hojbjerg (Schalke) is coming onto the pitch as Sead Kolasinac cannot continue after picking up an injury."
        },
        {
            "gameTime": "2 - 23:23",
            "label": "",
            "description": "Sokratis (Dortmund) wins himself just enough space inside the box to connect with the corner. His header flies towards the left post, but the goalkeeper dives superbly to stop the effort."
        },
        {
            "gameTime": "2 - 23:04",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 22:49",
            "label": "",
            "description": "Matthias Ginter (Dortmund) fails to send a pass into the box as his effort is cut out. The referee blows his whistle, Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "2 - 21:52",
            "label": "",
            "description": "Dortmund continue the game with a quickly taken free kick."
        },
        {
            "gameTime": "2 - 21:25",
            "label": "",
            "description": "Julian Weigl (Dortmund) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 20:59",
            "label": "injury",
            "description": "The game is interrupted now, Julian Weigl (Dortmund) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 20:24",
            "label": "",
            "description": "The referee blows his whistle as Klaas Jan Huntelaar (Schalke) was too aggressive in his challenge. Dortmund win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 19:40",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 18:58",
            "label": "attendance",
            "description": "The attendance for today's match is 79956."
        },
        {
            "gameTime": "2 - 17:34",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) wastes a good opportunity as his pass into the box is blocked by the defence. The ball is behind the touchline and Dortmund will take a throw in."
        },
        {
            "gameTime": "2 - 16:14",
            "label": "",
            "description": "Maxim Choupo Moting (Schalke) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it."
        },
        {
            "gameTime": "2 - 15:43",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) swings a cross into the box, but it's far too close to Ralf Fahrmann, who smothers the ball."
        },
        {
            "gameTime": "2 - 14:58",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Franco Di Santo (Schalke) was quite harsh and Felix Brych didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 14:35",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "2 - 13:57",
            "label": "corner",
            "description": "Junior Caicara (Schalke) takes the corner, but he overhits it and none of his teammates are able to reach the ball."
        },
        {
            "gameTime": "2 - 13:45",
            "label": "",
            "description": "Franco Di Santo (Schalke) flights in the cross, but the defender is alert and clears to safety. Schalke win a corner."
        },
        {
            "gameTime": "2 - 12:25",
            "label": "",
            "description": "Dortmund are playing possession football and controlling the game at present. They are exchanging inch perfect passes from player to player, making it difficult for the opposition to win the ball."
        },
        {
            "gameTime": "2 - 10:20",
            "label": "substitution",
            "description": "Andre Breitenreiter has decided to substitute Max Meyer and he is replaced by Maxim Choupo Moting (Schalke)."
        },
        {
            "gameTime": "2 - 09:52",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball is out of play. Dortmund will have a throw in."
        },
        {
            "gameTime": "2 - 08:15",
            "label": "",
            "description": "Ralf Fahrmann pulls off a great save to deny Henrikh Mkhitaryan (Dortmund), who makes himself some space inside the box and unleashes a quick low drive to the bottom left corner."
        },
        {
            "gameTime": "2 - 07:33",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 06:42",
            "label": "",
            "description": "Dortmund are showcasing great team work by exchanging some short passes and one two passes, waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 06:25",
            "label": "",
            "description": "Leon Goretzka (Schalke) sends a promising through ball, but the defence is alert and cuts out the pass."
        },
        {
            "gameTime": "2 - 05:05",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the left post. Ralf Fahrmann has a clear sight of it and makes a comfortable save."
        },
        {
            "gameTime": "2 - 04:35",
            "label": "",
            "description": "Ralf Fahrmann is alert and has a clear sight of a long through ball from Shinji Kagawa (Dortmund). Easy save!"
        },
        {
            "gameTime": "2 - 03:52",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) receives a pass and unleashes a shot which goes well wide of the right post."
        },
        {
            "gameTime": "2 - 02:59",
            "label": "y-card",
            "description": "Pierre Emerick Aubameyang (Dortmund) picks up a yellow card."
        },
        {
            "gameTime": "2 - 01:59",
            "label": "soccer-ball",
            "description": "Goal! Gonzalo Castro displays great vision and sends a pass to Pierre Emerick Aubameyang (Dortmund), who shows brilliant composure inside the box to bury the ball into the bottom right corner. The score is 3:1."
        },
        {
            "gameTime": "2 - 01:34",
            "label": "",
            "description": "Close effort! Ilkay Gundogan (Dortmund) takes the resulting free kick from a promising distance, but he sends it narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 01:28",
            "label": "",
            "description": "Dortmund are awarded a free kick from a dangerous position."
        },
        {
            "gameTime": "2 - 00:57",
            "label": "y-card",
            "description": "Felix Brych shows a yellow card to Junior Caicara (Schalke) for his blatant foul."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half has just started."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they continue playing this attractive football, the fans will surely be satisfied. The hosts dominated much of the first period. The home team are playing possession football, while the away team look to find a weakness in the opposition's defence mainly with their rapid counter attacks."
        },
        {
            "gameTime": "1 - 46:12",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Felix Brych has ended it."
        },
        {
            "gameTime": "1 - 45:55",
            "label": "",
            "description": "The ball is cleared after Leroy Sane (Schalke) attempted to dribble past an opposing player."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 42:59",
            "label": "soccer-ball",
            "description": "Matthias Ginter (Dortmund) outjumps the defenders inside the six yard box to meet the corner and scores with a header into the middle of the goal. The keeper had no chance to react. The score is now 2:1."
        },
        {
            "gameTime": "1 - 42:23",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) looks like he will be the one to take the corner kick."
        },
        {
            "gameTime": "1 - 42:11",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) tries to send the ball in front of the goal, but the opposition's defence averts the threat. Now Dortmund have a corner."
        },
        {
            "gameTime": "1 - 41:39",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) swings a cross into the box, but it's far too close to Ralf Fahrmann, who smothers the ball."
        },
        {
            "gameTime": "1 - 40:16",
            "label": "",
            "description": "Max Meyer (Schalke) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 39:02",
            "label": "",
            "description": "Some patient build up play from Schalke as they look to unlock the defence."
        },
        {
            "gameTime": "1 - 38:45",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) sends a long ball across the pitch, but it misses its target. It's a throw in for Schalke."
        },
        {
            "gameTime": "1 - 37:42",
            "label": "y-card",
            "description": "What was Leon Goretzka (Schalke) thinking? He will not get away with that. The referee shows him a yellow card."
        },
        {
            "gameTime": "1 - 37:01",
            "label": "",
            "description": "Matthias Ginter (Dortmund) receives a lofted pass in the goal area and unleashes a dangerous header which sails a few inches over the bar!"
        },
        {
            "gameTime": "1 - 36:44",
            "label": "corner",
            "description": "Henrikh Mkhitaryan (Dortmund) takes a short corner kick."
        },
        {
            "gameTime": "1 - 36:10",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) attempts to find one of his teammates with a ball from a free kick outside the box. The goalkeeper climbs high above all the players in the box to intercept the cross and snuff out the opportunity. The referee and his assistant both point at the corner flag. Dortmund will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 36:04",
            "label": "",
            "description": "Dennis Aogo (Schalke) makes a rough challenge and Felix Brych blows his whistle for a foul. Dortmund earn a free kick which could lead to a goal scoring opportunity."
        },
        {
            "gameTime": "1 - 34:44",
            "label": "",
            "description": "What an opportunity! Ilkay Gundogan (Dortmund) picked the ball up and fired a projectile of a shot from long range which threatened the goalkeeper. The shot went painfully close to the right post!"
        },
        {
            "gameTime": "1 - 34:37",
            "label": "",
            "description": "Dortmund keep possession of the ball by producing short passes and one two passes from player to player."
        },
        {
            "gameTime": "1 - 33:07",
            "label": "",
            "description": "Leroy Sane (Schalke) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 32:27",
            "label": "soccer-ball",
            "description": "Goal! Leroy Sane puts the ball on a plate for Klaas Jan Huntelaar (Schalke), who scores with a simple close range finish. It's 1:1."
        },
        {
            "gameTime": "1 - 31:25",
            "label": "",
            "description": "Max Meyer (Schalke) races towards goal but the defender gets back well to make a challenge. The referee and the linesman both signal a throw in for Dortmund."
        },
        {
            "gameTime": "1 - 29:50",
            "label": "soccer-ball",
            "description": "Matthias Ginter produces a beautiful lofted cross into the box, where Shinji Kagawa (Dortmund) rises high to head the ball into the left side of the goal and beyond the goalkeeper. He makes it 1:0."
        },
        {
            "gameTime": "1 - 28:54",
            "label": "",
            "description": "Dortmund are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error."
        },
        {
            "gameTime": "1 - 27:46",
            "label": "corner",
            "description": "The resulting corner, taken by Henrikh Mkhitaryan (Dortmund), comes to nothing."
        },
        {
            "gameTime": "1 - 27:32",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it. Corner kick. Dortmund will have an opportunity."
        },
        {
            "gameTime": "1 - 26:41",
            "label": "",
            "description": "Dortmund decide to take a short pass from the free kick and the attacking effort continues."
        },
        {
            "gameTime": "1 - 26:28",
            "label": "",
            "description": "Dangerous play by Leon Goretzka (Schalke). Felix Brych blows his whistle for a foul. Dortmund earn a free kick."
        },
        {
            "gameTime": "1 - 25:19",
            "label": "",
            "description": "Matthias Ginter (Dortmund) sends a beautiful cross into the penalty area, but the opposition's defence manages to clear the ball to safety."
        },
        {
            "gameTime": "1 - 24:28",
            "label": "",
            "description": "Franco Di Santo (Schalke) skips past his man but can't keep the ball in play. The ball goes out of play and Dortmund will have a goal kick."
        },
        {
            "gameTime": "1 - 23:19",
            "label": "",
            "description": "Leroy Sane (Schalke) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 21:56",
            "label": "",
            "description": "Dennis Aogo (Schalke) sends in a lofted cross from a mid range free kick, but his poor effort goes out of play. The ball is off of the pitch and it's a goal kick for Dortmund."
        },
        {
            "gameTime": "1 - 20:28",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone. The ball is off of the pitch and it's a goal kick for Schalke."
        },
        {
            "gameTime": "1 - 19:10",
            "label": "",
            "description": "Leroy Sane (Schalke) comes close to scoring. He peels away from his marker and gets on the end of a cross from Dennis Aogo, but he hits a shot just wide of the left post."
        },
        {
            "gameTime": "1 - 18:27",
            "label": "",
            "description": "Marcel Schmelzer (Dortmund) sends a teasing cross into the area, but Ralf Fahrmann intercepts the ball."
        },
        {
            "gameTime": "1 - 17:52",
            "label": "",
            "description": "Dortmund exchange some short passes over a small area and control the game. Now they make a mistake and lose the ball and the whole situation changes completely."
        },
        {
            "gameTime": "1 - 16:38",
            "label": "",
            "description": "Dortmund try to speed play up by taking a quick free kick."
        },
        {
            "gameTime": "1 - 16:31",
            "label": "",
            "description": "Foul! Dennis Aogo (Schalke) is penalised for pulling back his opponent. Dortmund get a free kick."
        },
        {
            "gameTime": "1 - 15:45",
            "label": "",
            "description": "A pass from Sead Kolasinac (Schalke) is intercepted by Roman Burki and the move breaks down."
        },
        {
            "gameTime": "1 - 15:25",
            "label": "",
            "description": "Dennis Aogo (Schalke) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 14:26",
            "label": "",
            "description": "Schalke are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "1 - 13:44",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) sends a cross into the box, but Ralf Fahrmann comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 12:24",
            "label": "",
            "description": "Matthias Ginter (Dortmund) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Matthias Ginter (Dortmund). The ball is out of play. Dortmund will take a throw in."
        },
        {
            "gameTime": "1 - 11:31",
            "label": "",
            "description": "Dennis Aogo (Schalke) sends a long crossfield pass searching out one of his teammates, but his effort comes to nothing and they lose possession."
        },
        {
            "gameTime": "1 - 10:33",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) shows his brilliant passing ability after picking out Matthias Ginter with a fine lofted pass."
        },
        {
            "gameTime": "1 - 09:20",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 08:19",
            "label": "",
            "description": "Mats Hummels (Dortmund) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone. The ball goes out of play and Schalke will have a goal kick."
        },
        {
            "gameTime": "1 - 07:13",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) takes the resultant free kick from the edge of the box and tries to find one of his teammates with a cross, but the keeper climbs high and gets to it first, collecting the ball with ease."
        },
        {
            "gameTime": "1 - 06:46",
            "label": "",
            "description": "Klaas Jan Huntelaar (Schalke) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision! Dortmund have a free kick from a promising distance."
        },
        {
            "gameTime": "1 - 06:19",
            "label": "",
            "description": "The Dortmund players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 05:27",
            "label": "",
            "description": "Felix Brych has a clear sight and sees a foul from Max Meyer (Schalke)."
        },
        {
            "gameTime": "1 - 03:57",
            "label": "",
            "description": "Dortmund are bossing possession of the ball and make numerous short passes, but they finally lose possession after an error."
        },
        {
            "gameTime": "1 - 02:55",
            "label": "",
            "description": "Julian Weigl (Dortmund) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "1 - 01:51",
            "label": "corner",
            "description": "The resulting corner comes to nothing as Henrikh Mkhitaryan (Dortmund) sends it out of play."
        },
        {
            "gameTime": "1 - 01:37",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) looks to break free, but an opposing player clears the ball away. The ball goes out of play. Dortmund are awarded a corner kick."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Schalke will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Let us introduce today's referee to you, and it's Felix Brych."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What a thrilling encounter, there was plenty of goal mouth action. The home team had more of the game. Short passing and possession was the style of the home side, while the visiting side tried to hit their opposition on the break."
        }
    ],
    "gameAwayTeam": "Schalke",
    "gameDate": "08/11/2015 - 17:30",
    "gameHomeTeam": "Dortmund",
    "gameScore": "3 - 2"
}