{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-11-19 - 22-45 Atl. Madrid 0 - 3 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The Real Madrid fans must be pleased with the performance of their team. They were absolutely the better of the two sides. Both sides tried to prevail using combination football."
        },
        {
            "gameTime": "2 - 47:13",
            "label": "whistle",
            "description": "There will be no more action in this match as the referee signals full time."
        },
        {
            "gameTime": "2 - 46:50",
            "label": "",
            "description": "Keylor Navas pulls off a great save to deny Yannick Carrasco (Atl. Madrid) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "2 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 44:51",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) breaks into the penalty area but his shot is blocked."
        },
        {
            "gameTime": "2 - 43:30",
            "label": "attendance",
            "description": "The attendance is 53741."
        },
        {
            "gameTime": "2 - 43:10",
            "label": "",
            "description": "Luka Modric (Real Madrid) misses a good chance to score. A perfect cross into the box finds Luka Modric (Real Madrid) who rises for a header, but he sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 42:30",
            "label": "corner",
            "description": "Keylor Navas comes off his line to intercept the corner from Koke (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 42:20",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) tries to send a pass but it's blocked. The ball goes out of play. Atl. Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 41:59",
            "label": "corner",
            "description": "Koke (Atl. Madrid) takes the corner which is cleared."
        },
        {
            "gameTime": "2 - 41:48",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) hammers the ball goalwards from about 23 metres. The shot is directed to the left side of the target but is thwarted by a save from Keylor Navas. Now Atl. Madrid have a corner."
        },
        {
            "gameTime": "2 - 40:44",
            "label": "substitution",
            "description": "Substitution. Lucas makes his way off the pitch and Marco Asensio (Real Madrid) comes on as his replacement."
        },
        {
            "gameTime": "2 - 38:59",
            "label": "y-card",
            "description": "Angel Correa (Atl. Madrid) has received a yellow card for his foul."
        },
        {
            "gameTime": "2 - 37:57",
            "label": "substitution",
            "description": "Zinedine Zidane prepares a substitution. Cristiano Ronaldo is replaced by James Rodriguez (Real Madrid)."
        },
        {
            "gameTime": "2 - 35:55",
            "label": "corner",
            "description": "Yannick Carrasco (Atl. Madrid) takes the corner but fails to find any of his teammates."
        },
        {
            "gameTime": "2 - 35:40",
            "label": "",
            "description": "Angel Correa (Atl. Madrid) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance. The referee and his assistant both point at the corner flag. Atl. Madrid will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 34:30",
            "label": "corner",
            "description": "Koke (Atl. Madrid) sends the corner into the box, but Keylor Navas intercepts it and averts the threat."
        },
        {
            "gameTime": "2 - 34:10",
            "label": "",
            "description": "Koke (Atl. Madrid) puts a cross into the box from the free kick, but the defender gets there first. Atl. Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 33:40",
            "label": "substitution",
            "description": "Substitution. Karim Benzema (Real Madrid) on for Isco."
        },
        {
            "gameTime": "2 - 32:43",
            "label": "y-card",
            "description": "David Fernandez Borbalan shows the yellow card to Lucas (Real Madrid) for a heavy challenge. A free kick has been awarded to Atl. Madrid."
        },
        {
            "gameTime": "2 - 31:42",
            "label": "soccer-ball",
            "description": "Goal! Gareth Bale passes the ball to the feet of Cristiano Ronaldo (Real Madrid), who has an empty net in front of him and has no problems in tapping the ball in. 0:3."
        },
        {
            "gameTime": "2 - 30:56",
            "label": "",
            "description": "Filipe Luis (Atl. Madrid) sends a cross into the box, but the opposition's defence quickly intercepts the ball. It's a throw in for Atl. Madrid."
        },
        {
            "gameTime": "2 - 29:55",
            "label": "",
            "description": "Some great controlled play and passing in the middle of the pitch from Real Madrid."
        },
        {
            "gameTime": "2 - 25:47",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) smoothly converts the penalty with a beautiful low drive into the left side of the net."
        },
        {
            "gameTime": "2 - 25:20",
            "label": "y-card",
            "description": "Diego Godin (Atl. Madrid) attempts to discuss the decision with David Fernandez Borbalan, but he soon realises that it's not the right thing to do as he sees the yellow."
        },
        {
            "gameTime": "2 - 25:12",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is heading towards the penalty spot to take it."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "penalty",
            "description": "Stefan Savic (Atl. Madrid) fouls an opponent. At least that's what referee David Fernandez Borbalan signals. Penalty awarded! Real Madrid will take a penalty kick."
        },
        {
            "gameTime": "2 - 23:29",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) takes the corner but fails to find any of his teammates as he overhits the effort. The ball goes out of play and Atl. Madrid will have a goal kick."
        },
        {
            "gameTime": "2 - 23:15",
            "label": "",
            "description": "Luka Modric (Real Madrid) produces a dangerous lofted cross into the box which is intercepted. The referee signals a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 22:55",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 22:22",
            "label": "",
            "description": "Isco (Real Madrid) is unlucky with a goal bound effort from the edge of the box. A brilliant save by Jan Oblak stops the ball from hitting the bottom left corner. The referee points to the corner flag. It's a corner to Real Madrid."
        },
        {
            "gameTime": "2 - 21:36",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) tries his luck with a shot from 24 metres out. His effort, however, flies low to the middle of the target and Keylor Navas pulls off a comfortable save."
        },
        {
            "gameTime": "2 - 20:38",
            "label": "",
            "description": "Cristiano Ronaldo received a clever long ball from Luka Modric (Real Madrid) which could have put him in a promising position, but the defence was alert and managed to avert the threat."
        },
        {
            "gameTime": "2 - 17:56",
            "label": "y-card",
            "description": "The referee gives a yellow card to Koke (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 17:51",
            "label": "y-card",
            "description": "Cristiano Ronaldo (Real Madrid) is penalised."
        },
        {
            "gameTime": "2 - 16:35",
            "label": "substitution",
            "description": "Diego Simeone has decided to substitute Fernando Torres and he is replaced by Kevin Gameiro (Atl. Madrid)."
        },
        {
            "gameTime": "2 - 16:25",
            "label": "substitution",
            "description": "Gabi goes off the pitch and Angel Correa (Atl. Madrid) comes on."
        },
        {
            "gameTime": "2 - 13:59",
            "label": "funfact",
            "description": "The current number of shots on goal is 5:7."
        },
        {
            "gameTime": "2 - 12:00",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Koke (Atl. Madrid). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "2 - 09:47",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) tries to slide the ball through to a teammate but it's well blocked by a defender. Atl. Madrid earn a corner."
        },
        {
            "gameTime": "2 - 08:21",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) collects a pass on the edge of the box and unleashes a shot which is brilliantly blocked by a defender."
        },
        {
            "gameTime": "2 - 07:45",
            "label": "",
            "description": "The linesman signals that Cristiano Ronaldo (Real Madrid) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "2 - 05:59",
            "label": "",
            "description": "Antoine Griezmann (Atl. Madrid) hammers the ball goalwards from about 25 metres. The shot is directed to the middle of the target but is thwarted by a save from Keylor Navas."
        },
        {
            "gameTime": "2 - 05:30",
            "label": "",
            "description": "Koke (Atl. Madrid) takes the resultant free kick from the edge of the box and tries to find one of his teammates with a cross, but the keeper climbs high and gets to it first, collecting the ball with ease."
        },
        {
            "gameTime": "2 - 05:14",
            "label": "",
            "description": "One of the Real Madrid players unfairly tackled his opponent and conceded a foul. Atl. Madrid have a free kick."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) slams the ball goalwards from 22 metres out, but his decent effort flies a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 02:27",
            "label": "corner",
            "description": "Yannick Carrasco (Atl. Madrid) swings in a cross from the corner, but Keylor Navas reads it well and gathers the ball."
        },
        {
            "gameTime": "2 - 02:17",
            "label": "",
            "description": "Filipe Luis (Atl. Madrid) sends a lofted cross into the penalty area. Unfortunately for him, the opponent's defence deals with his cross comfortably and intercepts it. Good work from Atl. Madrid as they win a corner."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "Not the best game in the world so far but certainly not the worst either. Chances have been few. Neither team has really been able to control the flow of the game. Both sides are using combination football to try and gain the upper hand."
        },
        {
            "gameTime": "1 - 45:09",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 43:27",
            "label": "",
            "description": "David Fernandez Borbalan couldn't ignore the rough tackle by Gareth Bale (Real Madrid) and blew his whistle."
        },
        {
            "gameTime": "1 - 42:29",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) attempts to send over a cross in order to find one of his teammates, but an opposition defender averts the danger by intercepting the effort."
        },
        {
            "gameTime": "1 - 41:52",
            "label": "",
            "description": "One of the players from Atl. Madrid times his run too early and the referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 41:24",
            "label": "corner",
            "description": "Koke (Atl. Madrid) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 41:10",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) races towards goal but the defender gets back well to make a challenge. It will be a corner kick for Atl. Madrid."
        },
        {
            "gameTime": "1 - 39:16",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 38:58",
            "label": "",
            "description": "Marcelo (Real Madrid) dribbles into space and finds himself in a shooting position, but his shot from the edge of the box is bravely blocked. The ball goes out of play and Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 36:53",
            "label": "",
            "description": "Gabi (Atl. Madrid) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack."
        },
        {
            "gameTime": "1 - 34:50",
            "label": "",
            "description": "The Atl. Madrid players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 31:56",
            "label": "",
            "description": "Isco (Real Madrid) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 30:06",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Jan Oblak guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 29:17",
            "label": "",
            "description": "Gareth Bale (Real Madrid) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat. The ball is behind the touchline and Real Madrid will take a throw in."
        },
        {
            "gameTime": "1 - 27:34",
            "label": "",
            "description": "Koke (Atl. Madrid) swings a cross into the box, but it's far too close to Keylor Navas, who smothers the ball."
        },
        {
            "gameTime": "1 - 26:56",
            "label": "corner",
            "description": "The resulting corner from Koke (Atl. Madrid) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 26:42",
            "label": "",
            "description": "Yannick Carrasco (Atl. Madrid) looks to break free, but an opposing player clears the ball away. The ball is out of play. Atl. Madrid will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 25:37",
            "label": "y-card",
            "description": "Gabi (Atl. Madrid) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but David Fernandez Borbalan ignores the protests."
        },
        {
            "gameTime": "1 - 22:29",
            "label": "soccer-ball",
            "description": "Goal! The free kick is fired in by Cristiano Ronaldo (Real Madrid) and the ball inadvertently flicks off a defender and spins into the net, leaving Jan Oblak stranded. 0:1."
        },
        {
            "gameTime": "1 - 21:45",
            "label": "",
            "description": "Stefan Savic (Atl. Madrid) brings an opponent down and David Fernandez Borbalan interrupts the game. Real Madrid get a free kick."
        },
        {
            "gameTime": "1 - 20:22",
            "label": "",
            "description": "Luka Modric (Real Madrid) is unlucky with a goal bound effort from the edge of the box. Some classy goalkeeping by Jan Oblak stops the ball out of the bottom right corner."
        },
        {
            "gameTime": "1 - 19:58",
            "label": "corner",
            "description": "Isco (Real Madrid) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 19:54",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Isco (Real Madrid). Real Madrid will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 19:29",
            "label": "",
            "description": "Real Madrid enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 16:23",
            "label": "",
            "description": "Lucas (Real Madrid) attempted to create a dangerous situation in front of goal by sending a cross into the box, but the defence easily dealt with the threat."
        },
        {
            "gameTime": "1 - 15:09",
            "label": "",
            "description": "Neat passing move from Real Madrid in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 13:30",
            "label": "",
            "description": "The game is interrupted as Antoine Griezmann (Atl. Madrid) is flagged offside."
        },
        {
            "gameTime": "1 - 11:59",
            "label": "corner",
            "description": "The resulting corner from Luka Modric (Real Madrid) is cleared."
        },
        {
            "gameTime": "1 - 11:44",
            "label": "",
            "description": "Jan Oblak makes a superb save to deny a header which was nodded towards the bottom right corner by Cristiano Ronaldo (Real Madrid) after a cross from the side. The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "1 - 10:36",
            "label": "",
            "description": "David Fernandez Borbalan blows his whistle after Koke (Atl. Madrid) brings one of his opponents down with a strong tackle."
        },
        {
            "gameTime": "1 - 08:44",
            "label": "",
            "description": "Saul Niguez (Atl. Madrid) comes close to scoring. He peels away from his marker and gets on the end of a cross from Koke, but he hits a shot just wide of the left post."
        },
        {
            "gameTime": "1 - 06:51",
            "label": "",
            "description": "Fernando Torres (Atl. Madrid) finds himself in a promising position after receiving a beautiful cross from the side, but the opposition defence is ready and one of the defenders averts the threat with a quick interception."
        },
        {
            "gameTime": "1 - 05:12",
            "label": "",
            "description": "Isco (Real Madrid) whips a promising cross into the box, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 04:55",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) takes a short corner kick."
        },
        {
            "gameTime": "1 - 04:38",
            "label": "",
            "description": "Lucas (Real Madrid) crosses into the box from near the side line, but he doesn't connect as he wanted and it's cleared by the well organized defence. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "1 - 03:52",
            "label": "",
            "description": "Lucas (Real Madrid) attempts to send a low pass into the box from the edge of the penalty area, but the opposition's defence knocks the ball to safety."
        },
        {
            "gameTime": "1 - 03:15",
            "label": "",
            "description": "A cross from the free kick is whipped in by Koke (Atl. Madrid), but one of the defenders steps in and averts the threat."
        },
        {
            "gameTime": "1 - 02:30",
            "label": "",
            "description": "Gareth Bale (Real Madrid) should know this behaviour is beyond the rules. He was too careless with his challenge and left David Fernandez Borbalan no option but to blow his whistle. That's a free kick to Atl. Madrid."
        },
        {
            "gameTime": "1 - 02:08",
            "label": "",
            "description": "Marcelo (Real Madrid) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 01:34",
            "label": "",
            "description": "Atl. Madrid are passing the ball across the pitch and keep possession. However, an opponent intercepts a pass and the situation changes."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "David Fernandez Borbalan will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid have won 4 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last 7 Atl. Madrid matches finished without a draw."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Kevin Gameiro have rippled the net 6x and is the top scorer for Atl. Madrid this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "According to the statistics, the match was pretty entertaining. There were plenty of thrilling moments. The Real Madrid fans must be pleased with the performance of their team. They were absolutely the better of the two sides. Both sides tried to prevail using combination football."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "19/11/2016 - 22:45",
    "gameHomeTeam": "Atl. Madrid",
    "gameScore": "0 - 3"
}