{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2015-10-04 - 18-30 Bayern Munich 5 - 1 Dortmund/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. This has been a real cat and mouse game, with the hosts coming out on top. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        },
        {
            "gameTime": "2 - 45:17",
            "label": "whistle",
            "description": "The referee blows for the end of today's match."
        },
        {
            "gameTime": "2 - 44:01",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) latches on to a precise pass on the edge of the box, but miskicks his shot and the ball goes high over the bar. Poor effort!"
        },
        {
            "gameTime": "2 - 43:45",
            "label": "corner",
            "description": "Bayern Munich take a short corner kick."
        },
        {
            "gameTime": "2 - 43:15",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) tries to send a low pass into the box, but it's blocked and cleared. The ball goes out for a corner. Bayern Munich can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 41:18",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) shoots from the edge of the penalty area. The ball travels towards the bottom left corner, but Manuel Neuer easily deals with the threat."
        },
        {
            "gameTime": "2 - 39:43",
            "label": "",
            "description": "A lofted cross from Kingsley Coman (Bayern Munich) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 37:31",
            "label": "y-card",
            "description": "Marco Fritz shows a yellow card to Joshua Kimmich (Bayern Munich), who isn't surprised as the tackle was really hard and late."
        },
        {
            "gameTime": "2 - 34:57",
            "label": "substitution",
            "description": "It will be a substitution. Kingsley Coman (Bayern Munich) is ready to enter the pitch as Thomas Muller walks off."
        },
        {
            "gameTime": "2 - 34:46",
            "label": "y-card",
            "description": "Is that a yellow card in the referee's hand? It is! Pierre Emerick Aubameyang (Dortmund) gets booked."
        },
        {
            "gameTime": "2 - 34:24",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) was too forceful with his tackle and Marco Fritz interrupted the game to signal a free kick."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "",
            "description": "Adnan Januzaj (Dortmund) stands over the free kick and opts to take it himself, but his low effort is straight at Manuel Neuer."
        },
        {
            "gameTime": "2 - 32:57",
            "label": "y-card",
            "description": "Jerome Boateng (Bayern Munich) earns the yellow card."
        },
        {
            "gameTime": "2 - 32:56",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) is penalised for holding. Marco Fritz signals a set piece."
        },
        {
            "gameTime": "2 - 32:30",
            "label": "",
            "description": "A cross into the box from Adnan Januzaj (Dortmund) is cleared."
        },
        {
            "gameTime": "2 - 30:50",
            "label": "substitution",
            "description": "We are about to witness a substitution. Joshua Kimmich (Bayern Munich) is replacing Xabi Alonso."
        },
        {
            "gameTime": "2 - 30:23",
            "label": "",
            "description": "Marco Reus (Dortmund) fires the ball in from a mid range free kick, but it blazes over the bar."
        },
        {
            "gameTime": "2 - 29:24",
            "label": "",
            "description": "Marco Fritz blows his whistle and signals a foul after Arturo Vidal (Bayern Munich) brought his opponent down. Dortmund win a free kick."
        },
        {
            "gameTime": "2 - 28:35",
            "label": "",
            "description": "Bayern Munich string together a series of short passes."
        },
        {
            "gameTime": "2 - 25:44",
            "label": "corner",
            "description": "Marco Reus (Dortmund) takes a short corner kick."
        },
        {
            "gameTime": "2 - 25:43",
            "label": "",
            "description": "Manuel Neuer can hear the fans clapping for his superb goalkeeping after he magnificently stopped the close range effort from Henrikh Mkhitaryan (Dortmund). The ball would have probably ended up in the bottom right corner. Dortmund have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "2 - 25:19",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "2 - 22:37",
            "label": "substitution",
            "description": "Pep Guardiola prepares a substitution. Thiago Alcantara is replaced by Arturo Vidal (Bayern Munich)."
        },
        {
            "gameTime": "2 - 20:56",
            "label": "soccer-ball",
            "description": "Goal! Mario Gotze (Bayern Munich) pounced on a loose ball inside the box and beats the goalkeeper with a shot into the bottom left corner. He makes it 5:1."
        },
        {
            "gameTime": "2 - 19:13",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) threw away a promising scoring opportunity. He received a fine cross inside the 6 yard box, but his shot missed the target close to the right post."
        },
        {
            "gameTime": "2 - 17:49",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) wasted a huge opportunity! The fans already began to celebrate as he produced a shot from the edge of the box after a brilliant solo effort. The ball went towards the left side of the goal, but Roman Burki made an astonishing save!"
        },
        {
            "gameTime": "2 - 16:36",
            "label": "",
            "description": "The foul by Douglas Costa (Bayern Munich) was seen by Marco Fritz who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 16:19",
            "label": "attendance",
            "description": "The attendance for today's match is 75000."
        },
        {
            "gameTime": "2 - 14:21",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 13:49",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) crosses the ball into the box, but one of the defending players averts the threat. The ball goes out of play. Bayern Munich are awarded a corner kick."
        },
        {
            "gameTime": "2 - 12:41",
            "label": "soccer-ball",
            "description": "What a hit! Robert Lewandowski (Bayern Munich) shows good composure inside the box to fire a first time shot into the bottom right corner. 4:1."
        },
        {
            "gameTime": "2 - 11:35",
            "label": "",
            "description": "Marco Reus (Dortmund) darts into the box and immediately fires a first time effort that ends well wide of the right post."
        },
        {
            "gameTime": "2 - 11:02",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 09:54",
            "label": "",
            "description": "Thomas Muller sprays a pass out to Mario Gotze (Bayern Munich), but he produces a poor effort from inside the box which goes high over the bar."
        },
        {
            "gameTime": "2 - 07:26",
            "label": "substitution",
            "description": "Thomas Tuchel has decided to introduce fresh legs, with Marco Reus (Dortmund) replacing Shinji Kagawa."
        },
        {
            "gameTime": "2 - 07:20",
            "label": "substitution",
            "description": "Gonzalo Castro will be replaced by Adnan Januzaj (Dortmund)."
        },
        {
            "gameTime": "2 - 06:21",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) plays a dangerous chip pass into the box in an attempt to set up one of his teammates, but the effort is intercepted by one of the defenders."
        },
        {
            "gameTime": "2 - 04:18",
            "label": "",
            "description": "It's a throw in for Bayern Munich."
        },
        {
            "gameTime": "2 - 02:15",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) makes a rough challenge and the referee blows for a foul."
        },
        {
            "gameTime": "2 - 00:50",
            "label": "soccer-ball",
            "description": "GOAL! A terrible mistake leads to a goal. The defender ends up losing possession, allowing Robert Lewandowski (Bayern Munich) to pick up the ball before slotting it into the back of the net to make it 3:1."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Marco Fritz starts the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "This is how football should be full of action, thrilling moments and spectacular opportunities. And we have only had the first 45 minutes, so the expectations for the second half are high. The home side dominated the first half in most aspects of the game, but the visitors will surely attempt to turn the situation around in the second half. The home side attempts to hold onto the ball for as long as possible, while the away team's main weapon is fast counter attacks."
        },
        {
            "gameTime": "1 - 46:07",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 45:44",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "1 - 45:24",
            "label": "",
            "description": "A spell of possession for Bayern Munich in an attempt to control the game."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 43:13",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 42:27",
            "label": "",
            "description": "David Alaba (Bayern Munich) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. The referee points to the corner flag. It's a corner to Bayern Munich."
        },
        {
            "gameTime": "1 - 42:08",
            "label": "funfact",
            "description": "We can have a look at the statistics now, shots on target are 9:4."
        },
        {
            "gameTime": "1 - 40:55",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "1 - 39:54",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Pierre Emerick Aubameyang (Dortmund)."
        },
        {
            "gameTime": "1 - 39:10",
            "label": "",
            "description": "David Alaba (Bayern Munich) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 38:30",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) slaloms his way past challenges, but an opposing player does well to get the ball away. The ball goes out of play and Dortmund will have a goal kick."
        },
        {
            "gameTime": "1 - 37:31",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) makes a strong challenge and Marco Fritz blows for a foul."
        },
        {
            "gameTime": "1 - 35:26",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Gonzalo Castro is the provider as he slips the ball to Pierre Emerick Aubameyang (Dortmund) who simply steers it home from close range. It's 2:1."
        },
        {
            "gameTime": "1 - 34:12",
            "label": "soccer-ball",
            "description": "Thomas Muller (Bayern Munich) slots home the penalty after firing the ball in the opposite direction to which the goalkeeper dives!"
        },
        {
            "gameTime": "1 - 34:06",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 34:06",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 33:40",
            "label": "penalty",
            "description": "Henrikh Mkhitaryan (Dortmund) was trying to get to the ball but clattered into the legs of the opponent as well. Marco Fritz blows his whistle for an infringement. Penalty! A huge opportunity to score for Bayern Munich."
        },
        {
            "gameTime": "1 - 32:13",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "1 - 31:15",
            "label": "",
            "description": "Jerome Boateng (Bayern Munich) sends a chip pass into the box, but Roman Burki is quickest to intercept the ball."
        },
        {
            "gameTime": "1 - 30:31",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) sends a cross into the box, but the opposition's defence quickly intercepts the ball. Bayern Munich force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 29:13",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 27:47",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) makes a reckless foul in order to win the ball from his opponent. Marco Fritz has a clear sight of it and blows his whistle."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "soccer-ball",
            "description": "Jerome Boateng plays a terrific cross over to Thomas Muller (Bayern Munich), who finds some space inside the box and puts the ball into the back of the net."
        },
        {
            "gameTime": "1 - 23:18",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) takes the ball, nicely zig zags through the defence, but his shot to the left post is smartly dealt with by Roman Burki."
        },
        {
            "gameTime": "1 - 21:57",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) skips perfectly past challenges but misdirects his shot from the edge of the box. The ball flies a few yards over the bar."
        },
        {
            "gameTime": "1 - 20:20",
            "label": "",
            "description": "Gonzalo Castro (Dortmund) makes a slide tackle, but referee Marco Fritz blows for a foul."
        },
        {
            "gameTime": "1 - 18:21",
            "label": "",
            "description": "Xabi Alonso (Bayern Munich) strikes from the edge of the box, but hits it really poorly and sends the ball way wide of the right post."
        },
        {
            "gameTime": "1 - 18:06",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from David Alaba (Bayern Munich)."
        },
        {
            "gameTime": "1 - 17:37",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) stands over the free kick and opts to take it himself, sending it towards the top of net only for Roman Burki to dive and make a save."
        },
        {
            "gameTime": "1 - 16:35",
            "label": "",
            "description": "It looks like Julian Weigl (Dortmund) saw red with that tackle. Marco Fritz won't tolerate such behaviour on the pitch and blows for a foul. It's a free kick to Bayern Munich, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 15:12",
            "label": "corner",
            "description": "The corner by Ilkay Gundogan (Dortmund) lacks accuracy as it's hit with too much power."
        },
        {
            "gameTime": "1 - 14:52",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) sends a pass into the box, but the opposition's defence is alert to the danger and makes a clearance. The ball is out of play. A goal scoring opportunity from a corner for Dortmund."
        },
        {
            "gameTime": "1 - 14:31",
            "label": "",
            "description": "Marco Fritz blows the whistle, Thomas Muller (Bayern Munich) is penalised for a foul."
        },
        {
            "gameTime": "1 - 12:58",
            "label": "",
            "description": "Lukasz Piszczek (Dortmund) attempts to find one of his teammates, but puts far too much on the pass and the chance is gone."
        },
        {
            "gameTime": "1 - 11:29",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 10:18",
            "label": "corner",
            "description": "Xabi Alonso (Bayern Munich) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 09:54",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) looks to break free, but an opposing player clears the ball away. The ball is out of play. Bayern Munich will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 08:54",
            "label": "",
            "description": "Shinji Kagawa (Dortmund) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 07:55",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) sends a cross into the box, but Manuel Neuer comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 06:16",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) dinks a cross into the box in an attempt to find one of his teammates, but the defence manages to clear."
        },
        {
            "gameTime": "1 - 05:52",
            "label": "",
            "description": "Marco Fritz blows his whistle and it's Henrikh Mkhitaryan (Dortmund) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "1 - 04:54",
            "label": "corner",
            "description": "The resulting corner from Ilkay Gundogan (Dortmund) is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 04:46",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) unleashes a shot from a mid range free kick that crashes into the defensive wall. The opposition's goalkeeper set it up perfectly. Dortmund have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 03:44",
            "label": "",
            "description": "Ilkay Gundogan (Dortmund) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 03:11",
            "label": "y-card",
            "description": "Marco Fritz shows the yellow card to David Alaba (Bayern Munich) for a heavy challenge."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "",
            "description": "Henrikh Mkhitaryan (Dortmund) wins the ball after the corner kick and takes a shot from the edge of the box, but it's blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 01:57",
            "label": "corner",
            "description": "Corner kick. Ilkay Gundogan (Dortmund) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 01:44",
            "label": "",
            "description": "Pierre Emerick Aubameyang (Dortmund) sends a lofted cross into the box which is headed clear. The referee and one of his assistants signal for a corner kick to Dortmund."
        },
        {
            "gameTime": "1 - 01:02",
            "label": "",
            "description": "Mario Gotze (Bayern Munich) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "1 - 00:30",
            "label": "",
            "description": "The ball has crossed the sideline. Bayern Munich are taking a throw in."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund will kick the game off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Marco Fritz will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund have not yet been beaten away this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Dortmund's top scorer is Pierre Emerick Aubameyang with 25 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bayern Munich have won 15x at home this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bayern Munich's most prolific goal scorer is Robert Lewandowski with 30 goals in this competition so far."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. This has been a real cat and mouse game, with the hosts coming out on top. The home team played possession football, while the away team tried to find the weakness in their defence using mainly rapid counter attacks."
        }
    ],
    "gameAwayTeam": "Dortmund",
    "gameDate": "04/10/2015 - 18:30",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "5 - 1"
}