{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2015-2016/2015-09-12 - 17-00 Espanyol 0 - 6 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The Real Madrid fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        },
        {
            "gameTime": "2 - 45:12",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 44:06",
            "label": "",
            "description": "Felipe Caicedo (Espanyol) unleashes a shot, but it's well wide of the left hand post."
        },
        {
            "gameTime": "2 - 43:16",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) commits a foul after unfairly battling his opponent for the ball."
        },
        {
            "gameTime": "2 - 42:59",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Isco (Real Madrid), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 42:35",
            "label": "",
            "description": "goes on a mazy run through the defence and gets within shooting range inside the box, but his effort to the bottom right corner is thwarted by Pau Lopez (Espanyol). The ball goes out of play. Real Madrid are awarded a corner kick."
        },
        {
            "gameTime": "2 - 42:23",
            "label": "",
            "description": "Real Madrid are showing great team chemistry. They are passing the ball around seamlessly."
        },
        {
            "gameTime": "2 - 39:59",
            "label": "corner",
            "description": "Isco (Real Madrid) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "2 - 39:46",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The linesman makes the right call and Real Madrid will have a corner."
        },
        {
            "gameTime": "2 - 38:37",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) latches on to a lofted pass and strikes the ball! His attempt flies narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 37:35",
            "label": "",
            "description": "A pass from Salva Sevilla (Espanyol) is intercepted by Keylor Navas and the move breaks down."
        },
        {
            "gameTime": "2 - 35:41",
            "label": "soccer-ball",
            "description": "Goal! plays a pass to the feet of Cristiano Ronaldo (Real Madrid), and he shoots into the bottom right corner from inside the box. It's 0:6."
        },
        {
            "gameTime": "2 - 34:26",
            "label": "",
            "description": "Victor Alvarez (Espanyol) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "2 - 32:10",
            "label": "",
            "description": "The Espanyol players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 29:21",
            "label": "substitution",
            "description": "We are about to witness a substitution. Raphael Varane (Real Madrid) is replacing Sergio Ramos."
        },
        {
            "gameTime": "2 - 28:35",
            "label": "corner",
            "description": "The resulting corner from Isco (Real Madrid) is cleared by the opposition's defence."
        },
        {
            "gameTime": "2 - 28:32",
            "label": "",
            "description": "whips a promising cross into the box, but the opposition's defence intercepts the ball. Real Madrid have a corner."
        },
        {
            "gameTime": "2 - 27:27",
            "label": "",
            "description": "Salva Sevilla (Espanyol) blows a clear opportunity! He sends a rebound from close range narrowly wide of the left post."
        },
        {
            "gameTime": "2 - 27:04",
            "label": "",
            "description": "Gerard Moreno (Espanyol) attempts to convert a lofted cross as he jumps high and heads the ball to the bottom left corner. Keylor Navas shows his brilliant reflexes and pulls off a glorious save to stop the ball from hitting the net."
        },
        {
            "gameTime": "2 - 26:33",
            "label": "",
            "description": "Ruben Duarte (Espanyol) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. It's a throw in for Espanyol."
        },
        {
            "gameTime": "2 - 26:18",
            "label": "attendance",
            "description": "The attendance for today's match is 32155."
        },
        {
            "gameTime": "2 - 25:14",
            "label": "",
            "description": "Jose Canas (Espanyol) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "2 - 23:20",
            "label": "y-card",
            "description": "Mateo Kovacic (Real Madrid) tackles a bit over zealously and Inaki Bikandi blows for a foul. Mateo Kovacic (Real Madrid) is literally asking for a yellow card with his behaviour. The referee agrees and books him."
        },
        {
            "gameTime": "2 - 20:54",
            "label": "y-card",
            "description": "Jose Canas (Espanyol) is shown a yellow card by the referee for making a challenge on his opponent, but he looks angry with the decision."
        },
        {
            "gameTime": "2 - 19:29",
            "label": "substitution",
            "description": "Substitution. Victor Sanchez did his best and is replaced by Joan Jordan (Espanyol)."
        },
        {
            "gameTime": "2 - 19:06",
            "label": "corner",
            "description": "Salva Sevilla (Espanyol) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "2 - 18:41",
            "label": "",
            "description": "Victor Sanchez (Espanyol) delivers a low pass into the box which is intercepted. The ball goes behind for a corner. Espanyol will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 17:21",
            "label": "substitution",
            "description": "That's the end of the game for Karim Benzema, who is replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 15:50",
            "label": "soccer-ball",
            "description": "Goal! Gareth Bale puts the ball on a plate for Cristiano Ronaldo (Real Madrid), who scores with a simple close range finish. It's 0:5."
        },
        {
            "gameTime": "2 - 15:39",
            "label": "corner",
            "description": "The corner kick from Salva Sevilla (Espanyol) is headed out of the penalty area by one of the defenders."
        },
        {
            "gameTime": "2 - 15:24",
            "label": "",
            "description": "Salva Sevilla (Espanyol) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. Espanyol force their opponents to concede a corner."
        },
        {
            "gameTime": "2 - 15:00",
            "label": "corner",
            "description": "Isco (Real Madrid) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "2 - 14:16",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Daniel Carvajal (Real Madrid). The ball is out of play and the linesman points at the corner flag. Corner to Real Madrid."
        },
        {
            "gameTime": "2 - 13:29",
            "label": "",
            "description": "Another attempt to send the ball beyond the defence by Casemiro (Real Madrid) is thwarted and cleared to safety."
        },
        {
            "gameTime": "2 - 10:24",
            "label": "substitution",
            "description": "Rafael Benitez prepares a substitution. Luka Modric is replaced by Mateo Kovacic (Real Madrid)."
        },
        {
            "gameTime": "2 - 10:01",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball is off of the pitch and it's a goal kick for Espanyol."
        },
        {
            "gameTime": "2 - 05:51",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "2 - 05:38",
            "label": "",
            "description": "Gerard Moreno (Espanyol) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Inaki Bikandi with no other option than to blow for a foul."
        },
        {
            "gameTime": "2 - 04:56",
            "label": "corner",
            "description": "Isco (Real Madrid) lifts the ball into the box from the corner, but one of the defending players gets there first to head it clear."
        },
        {
            "gameTime": "2 - 04:54",
            "label": "",
            "description": "Casemiro (Real Madrid) gets to the rebound outside the box and doesn't hesitate to shoot on goal. It was a promising attempt, but one of the defending players got in the way and blocked it. The referee and one of his assistants signal for a corner kick to Real Madrid."
        },
        {
            "gameTime": "2 - 04:52",
            "label": "corner",
            "description": "Luka Modric (Real Madrid) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 04:34",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Gareth Bale (Real Madrid). Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 03:21",
            "label": "",
            "description": "A pass from Karim Benzema (Real Madrid) is intercepted by Pau Lopez and the move breaks down."
        },
        {
            "gameTime": "2 - 02:40",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) controls a cross inside the six yard box, but sends his shot slightly wide of the right post."
        },
        {
            "gameTime": "2 - 00:50",
            "label": "",
            "description": "Anaitz Arbilla (Espanyol) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "2 - 00:02",
            "label": "substitution",
            "description": "The need to improve in the second half has brought about a change. Michael Ciani comes off for Paco Montanes (Espanyol)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "The teams are back out for the second half and here is a change on the pitch. Sergio gives a chance to Jose Canas (Espanyol) and Javi Lopez is off."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The players are back out on the pitch following the half time break and the second half is about to start."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. Real Madrid have arguably been the better of the two sides in the first half. The home players attempt to beat the opposition's defence using mostly counter attacks. The away team tries to prevail using combination football."
        },
        {
            "gameTime": "1 - 46:02",
            "label": "whistle",
            "description": "Inaki Bikandi has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 45:39",
            "label": "",
            "description": "The ball is cleared after Gerard Moreno (Espanyol) attempted to dribble past an opposing player. The ball goes out of play and Real Madrid will have a goal kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 1 min. of added time."
        },
        {
            "gameTime": "1 - 44:54",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to send a pass into the box as his effort is cut out."
        },
        {
            "gameTime": "1 - 43:55",
            "label": "",
            "description": "Gerard Moreno (Espanyol) receives a precise pass inside the box and takes a shot that flies just wide of the right post."
        },
        {
            "gameTime": "1 - 43:19",
            "label": "",
            "description": "OFF THE POST! Karim Benzema (Real Madrid) drifts into the box to give his teammate support. He receives a fantastic pass and shoots from close range, but it crashes against the left post. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "1 - 42:39",
            "label": "",
            "description": "Javi Lopez (Espanyol) races towards goal but the defender gets back well to make a challenge."
        },
        {
            "gameTime": "1 - 40:01",
            "label": "",
            "description": "Luka Modric (Real Madrid) sends a long ball in, but Pau Lopez comfortably gathers the ball."
        },
        {
            "gameTime": "1 - 38:47",
            "label": "",
            "description": "Gareth Bale (Real Madrid) is caught offside!"
        },
        {
            "gameTime": "1 - 38:19",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) is moving okay again after that injury scare."
        },
        {
            "gameTime": "1 - 37:08",
            "label": "injury",
            "description": "Sergio Ramos (Real Madrid) requires medical treatment, so the referee stops play and signals for the physio to come onto the pitch."
        },
        {
            "gameTime": "1 - 36:47",
            "label": "",
            "description": "Victor Sanchez (Espanyol) receives the ball from the set piece on the edge of the box, but fails to score because his shot is blocked."
        },
        {
            "gameTime": "1 - 36:23",
            "label": "",
            "description": "Salva Sevilla (Espanyol) takes the ball and sets it for the free kick."
        },
        {
            "gameTime": "1 - 35:53",
            "label": "y-card",
            "description": "A yellow card is awarded to Karim Benzema (Real Madrid)."
        },
        {
            "gameTime": "1 - 35:29",
            "label": "",
            "description": "Karim Benzema (Real Madrid) was too fierce in his attempt to get the ball from his opponent and Inaki Bikandi blows for a foul. Espanyol have been awarded a free kick."
        },
        {
            "gameTime": "1 - 35:03",
            "label": "corner",
            "description": "A dangerous looking corner kick from Salva Sevilla (Espanyol) is cleared to safety by the defence."
        },
        {
            "gameTime": "1 - 34:48",
            "label": "",
            "description": "What a great touch by Gerard Moreno (Espanyol) as he controls a fine pass into the box and takes a shot to the right side of the goal, but an opposing player makes a clearance. Great defending. Espanyol have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 34:07",
            "label": "",
            "description": "Felipe Caicedo (Espanyol) unleashes a powerful shot towards goal, but it is bravely blocked by a self sacrificing defender."
        },
        {
            "gameTime": "1 - 33:18",
            "label": "",
            "description": "The foul by Gerard Moreno (Espanyol) was seen by Inaki Bikandi who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 32:07",
            "label": "",
            "description": "Casemiro (Real Madrid) receives a precise pass and threatens the keeper with a long range shot. His attempt goes miles wide of the left post."
        },
        {
            "gameTime": "1 - 31:36",
            "label": "",
            "description": "Luka Modric (Real Madrid) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 30:22",
            "label": "",
            "description": "Gerard Moreno (Espanyol) misses a good chance to score. A perfect cross into the box finds Gerard Moreno (Espanyol) who rises for a header, but he sends the ball well over the bar."
        },
        {
            "gameTime": "1 - 29:51",
            "label": "",
            "description": "The game is interrupted as Cristiano Ronaldo (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "1 - 27:42",
            "label": "soccer-ball",
            "description": "It's 0:4! Cristiano Ronaldo feeds Karim Benzema (Real Madrid) inside the box, who is unmarked and buries the ball in the bottom right corner."
        },
        {
            "gameTime": "1 - 27:40",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) latches on to a well placed cross from the free kick on the edge of the box and attempts to surprise the goalkeeper with a quick header towards the net. Unfortunately for him, the keeper was quicker and denies him."
        },
        {
            "gameTime": "1 - 26:02",
            "label": "",
            "description": "Anaitz Arbilla (Espanyol) makes a reckless foul in order to win the ball from his opponent. Inaki Bikandi has a clear sight of it and blows his whistle. A free kick has been awarded to Real Madrid."
        },
        {
            "gameTime": "1 - 24:57",
            "label": "",
            "description": "Salva Sevilla (Espanyol) fires a strong shot to the middle of the goal and the save is unexpectedly difficult for Keylor Navas."
        },
        {
            "gameTime": "1 - 23:27",
            "label": "",
            "description": "Salva Sevilla (Espanyol) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 22:22",
            "label": "",
            "description": "Casemiro (Real Madrid) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "1 - 21:00",
            "label": "",
            "description": "Victor Sanchez (Espanyol) commits a rough foul. Inaki Bikandi stops the game and makes a call."
        },
        {
            "gameTime": "1 - 19:55",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Gareth Bale plays it into the box, and Cristiano Ronaldo (Real Madrid) gets on the end of the cross to put it into the back of the net. 0:2."
        },
        {
            "gameTime": "1 - 18:58",
            "label": "",
            "description": "Luka Modric (Real Madrid) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 16:56",
            "label": "soccer-ball",
            "description": "Cristiano Ronaldo (Real Madrid) takes the penalty and scores! He buries the ball into the bottom the right corner!"
        },
        {
            "gameTime": "1 - 16:00",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) will take the responsibility and he is already preparing the ball."
        },
        {
            "gameTime": "1 - 15:10",
            "label": "y-card",
            "description": "Alvaro Gonzalez (Espanyol) got a yellow card."
        },
        {
            "gameTime": "1 - 15:05",
            "label": "penalty",
            "description": "Victor Alvarez (Espanyol) performs a sliding tackle but catches his opponent's legs. The referee blows his whistle for an infringement. The referee points to the penalty spot. Real Madrid are awarded a penalty kick!"
        },
        {
            "gameTime": "1 - 14:30",
            "label": "",
            "description": "Dangerous play by Victor Sanchez (Espanyol). Inaki Bikandi blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 14:03",
            "label": "",
            "description": "A crossfield pass from Ruben Duarte (Espanyol) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 13:28",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is in a clear offside position and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 12:45",
            "label": "",
            "description": "Luka Modric (Real Madrid) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "1 - 11:51",
            "label": "",
            "description": "Salva Sevilla (Espanyol) looks to break free, but an opposing player clears the ball away. The ball is out of play. Real Madrid will take a throw in."
        },
        {
            "gameTime": "1 - 10:50",
            "label": "",
            "description": "Inaki Bikandi blows for a foul after Javi Lopez (Espanyol) was too aggressive in the battle for the ball."
        },
        {
            "gameTime": "1 - 10:36",
            "label": "",
            "description": "Victor Alvarez (Espanyol) tries to send a pass but it's blocked."
        },
        {
            "gameTime": "1 - 10:12",
            "label": "",
            "description": "Gareth Bale (Real Madrid) finds himself beyond the last defender but the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 06:41",
            "label": "soccer-ball",
            "description": "Goal! Luka Modric sends a precise cross into the box, Cristiano Ronaldo (Real Madrid) latches on to it and puts the ball into the bottom right corner. He makes it 0:1."
        },
        {
            "gameTime": "1 - 06:32",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "1 - 05:43",
            "label": "",
            "description": "Felipe Caicedo (Espanyol) is penalised for a foul. Inaki Bikandi had a clear view and blows his whistle."
        },
        {
            "gameTime": "1 - 02:59",
            "label": "",
            "description": "Anaitz Arbilla (Espanyol) was too forceful with his tackle and Inaki Bikandi interrupted the game to signal a free kick."
        },
        {
            "gameTime": "1 - 02:50",
            "label": "",
            "description": "Salva Sevilla (Espanyol) will take the free kick."
        },
        {
            "gameTime": "1 - 02:20",
            "label": "corner",
            "description": "Salva Sevilla (Espanyol) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 02:18",
            "label": "",
            "description": "A lofted cross from Victor Alvarez (Espanyol) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area. The referee points to the corner flag. It's a corner to Espanyol."
        },
        {
            "gameTime": "1 - 01:37",
            "label": "corner",
            "description": "Salva Sevilla (Espanyol) launches an inaccurate corner kick into the penalty area."
        },
        {
            "gameTime": "1 - 01:15",
            "label": "",
            "description": "Felipe Caicedo (Espanyol) has a great chance inside the six yard box, shoots to the left side of the goal, but Keylor Navas pulls off an exquisite save to deny him. Espanyol earn a corner."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "",
            "description": "Espanyol will kick the game off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "",
            "description": "Inaki Bikandi is introduced as the referee for today's match."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "lineup1",
            "description": "The starting XIs were already announced and you can go through them in the Lineups section."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "",
            "description": "Welcome to our minute by minute commentary of today's clash. You can enjoy a written form of everything important that will be happening on the pitch. Have fun."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Today's match has just started, enjoy the game!"
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Mateo Kovacic (Inter) is Real Madrid's latest signing."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The last time the Real Madrid players celebrated a victory was on 14.5. against Dep. La Coruna (2:0)."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "You can check it out here to see which team is more successful in the head to head: 18.9.2016 0:2, 31.1.2016 0:6, 17.5.2015 1:4, 10.1.2015 0:3, 17.5.2014 1:3."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. The Real Madrid fans must be pleased with the performance of their team. They were absolutely the better of the two sides. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "12/09/2015 - 17:00",
    "gameHomeTeam": "Espanyol",
    "gameScore": "0 - 6"
}