{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/europe_uefa-champions-league/2016-2017/2017-02-15 - 22-45 Real Madrid 3 - 1 Napoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:06",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 46:41",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Lorenzo Insigne (Napoli)."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 3 min. of added time."
        },
        {
            "gameTime": "2 - 42:11",
            "label": "",
            "description": "Marcelo (Real Madrid) sends the ball into the box from the side of the pitch, but his cross is blocked."
        },
        {
            "gameTime": "2 - 39:36",
            "label": "",
            "description": "Marcelo (Real Madrid) makes a yard for himself inside the box after an accurate pass and takes a shot that goes just wide of the right post."
        },
        {
            "gameTime": "2 - 37:56",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to substitute Marek Hamsik and he is replaced by Arkadiusz Milik (Napoli)."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "",
            "description": "Luka Modric (Real Madrid) latched on to a fine cross from the corner kick on the edge of the box. His shot, however, flies narrowly over the bar."
        },
        {
            "gameTime": "2 - 37:40",
            "label": "corner",
            "description": "There's an opportunity for Toni Kroos (Real Madrid) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) tries to send a pass but it's blocked. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 35:56",
            "label": "substitution",
            "description": "It's time for a substitution. That's the last involvement from Karim Benzema as he is replaced by Alvaro Morata (Real Madrid)."
        },
        {
            "gameTime": "2 - 35:35",
            "label": "",
            "description": "A goal, which was scored by Jose Callejon (Napoli), was disallowed due to offside."
        },
        {
            "gameTime": "2 - 33:54",
            "label": "",
            "description": "Dries Mertens (Napoli) hammers the ball from far out, but his shot is blocked by an opposition player."
        },
        {
            "gameTime": "2 - 33:22",
            "label": "",
            "description": "Casemiro (Real Madrid) jumps into a tackle and Damir Skomina blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 33:02",
            "label": "",
            "description": "Real Madrid seem to be finding their feet as they enjoy some possession. They are waiting for the right moment to create new attacking opportunities."
        },
        {
            "gameTime": "2 - 30:46",
            "label": "substitution",
            "description": "Zinedine Zidane prepares a substitution. James Rodriguez is replaced by Lucas (Real Madrid)."
        },
        {
            "gameTime": "2 - 30:16",
            "label": "y-card",
            "description": "Damir Skomina shows the yellow card to Dries Mertens (Napoli) for a heavy challenge."
        },
        {
            "gameTime": "2 - 29:30",
            "label": "substitution",
            "description": "The referee signals that it is time for a substitution and Allan (Napoli) comes onto the pitch so that Piotr Zielinski can be given a rest."
        },
        {
            "gameTime": "2 - 27:55",
            "label": "",
            "description": "Pepe Reina pulls off a great save to deny James Rodriguez (Real Madrid) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "2 - 27:10",
            "label": "",
            "description": "Lorenzo Insigne (Napoli) gets a shot away from distance, but wasn't really set to take it and fires high and wide."
        },
        {
            "gameTime": "2 - 25:17",
            "label": "substitution",
            "description": "Zinedine Zidane has decided to make a change. Pepe (Real Madrid) replaces Sergio Ramos."
        },
        {
            "gameTime": "2 - 24:50",
            "label": "",
            "description": "Dries Mertens (Napoli) darts into the penalty area to latch on to a pass, and he unleashes a low drive towards the middle of the net, but Keylor Navas is alert and denies him."
        },
        {
            "gameTime": "2 - 23:57",
            "label": "",
            "description": "Toni Kroos (Real Madrid) sends a teasing cross into the area, but Pepe Reina intercepts the ball."
        },
        {
            "gameTime": "2 - 22:11",
            "label": "",
            "description": "Dries Mertens (Napoli) is afforded space inside the box after collecting a pass, but the chance is wasted as his shot goes harmlessly over the crossbar."
        },
        {
            "gameTime": "2 - 21:22",
            "label": "",
            "description": "That was close. Casemiro (Real Madrid) fires a shot from the edge of the box which goes a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 21:11",
            "label": "",
            "description": "Marcelo (Real Madrid) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "2 - 20:12",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) misses a sitter from inside the six yard box after striking the ball narrowly wide of the goal."
        },
        {
            "gameTime": "2 - 18:55",
            "label": "",
            "description": "Marcelo (Real Madrid) got on the ball on the edge of the box and blazed a first time shot well over the bar."
        },
        {
            "gameTime": "2 - 16:13",
            "label": "",
            "description": "Faouzi Ghoulam (Napoli) misses a great opportunity to convert the free kick from the edge of the penalty box after firing the ball high over the crossbar of the goal."
        },
        {
            "gameTime": "2 - 15:08",
            "label": "",
            "description": "A clumsy foul by Marcelo (Real Madrid) and Damir Skomina blows his whistle. Napoli win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 14:19",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) is flagged for offside."
        },
        {
            "gameTime": "2 - 13:27",
            "label": "",
            "description": "The foul by Dries Mertens (Napoli) was seen by Damir Skomina who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 10:39",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Faouzi Ghoulam (Napoli) takes it short."
        },
        {
            "gameTime": "2 - 10:12",
            "label": "",
            "description": "Dries Mertens (Napoli) fails to find any of his teammates inside the box as his pass is blocked. Napoli earn a corner."
        },
        {
            "gameTime": "2 - 08:55",
            "label": "soccer-ball",
            "description": "What an absolute cracking goal! Casemiro (Real Madrid) hits a perfect volley from far out and the ball flies inside the left post. Take a bow."
        },
        {
            "gameTime": "2 - 08:12",
            "label": "",
            "description": "Marcelo (Real Madrid) tries to hit a shot towards goal from long range, but he miskicks the ball and it flies high over the crossbar."
        },
        {
            "gameTime": "2 - 07:50",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 07:24",
            "label": "",
            "description": "Luka Modric (Real Madrid) tries to slide the ball through to a teammate but it's well blocked by a defender. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 06:42",
            "label": "y-card",
            "description": "Luka Modric (Real Madrid) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Damir Skomina ignores the protests."
        },
        {
            "gameTime": "2 - 06:09",
            "label": "",
            "description": "Jose Callejon (Napoli) tries his luck with and strikes the ball towards goal from long range, but it is blocked by one of the defenders."
        },
        {
            "gameTime": "2 - 03:10",
            "label": "soccer-ball",
            "description": "Goal! Cristiano Ronaldo provides Toni Kroos (Real Madrid) with a nice pass inside the box. It allows him to finish with a precise effort into the bottom right corner. 2:1."
        },
        {
            "gameTime": "2 - 01:24",
            "label": "",
            "description": "Napoli produce a short pass from the free kick."
        },
        {
            "gameTime": "2 - 01:05",
            "label": "",
            "description": "Marcelo (Real Madrid) commits an ugly challenge. The referee sees it and immediately blows his whistle."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Damir Skomina starts the second half."
        },
        {
            "gameTime": "1 - 45:13",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:41",
            "label": "",
            "description": "James Rodriguez (Real Madrid) delivers a fine lofted cross into the penalty area, but it's cleared by an opposing player."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "Raphael Varane (Real Madrid) wins himself just enough space inside the box to connect with the corner. His low header flies toward the middle of the goal, but the goalkeeper blocks the effort."
        },
        {
            "gameTime": "1 - 42:22",
            "label": "corner",
            "description": "Real Madrid have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 41:46",
            "label": "",
            "description": "Karim Benzema (Real Madrid) throws the chance away as he attempts to produce a shot from inside the box. His attempt simply rattles the right post. The goalkeeper can remain calm."
        },
        {
            "gameTime": "1 - 39:52",
            "label": "",
            "description": "Flag goes up against James Rodriguez (Real Madrid) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 38:47",
            "label": "corner",
            "description": "Real Madrid didn't take advantage of the corner and score as the opposition's defence was alert and averted the threat."
        },
        {
            "gameTime": "1 - 38:29",
            "label": "",
            "description": "Luka Modric (Real Madrid) pulls the trigger and strikes the ball towards goal from long range, but his effort is blocked by one of the defenders. Good work from Real Madrid as they win a corner."
        },
        {
            "gameTime": "1 - 37:33",
            "label": "y-card",
            "description": "Piotr Zielinski (Napoli) picks up a caution."
        },
        {
            "gameTime": "1 - 33:22",
            "label": "",
            "description": "Luka Modric (Real Madrid) tries to create a chance, but puts too much weight on his pass. The ball is off of the pitch and it's a goal kick for Napoli."
        },
        {
            "gameTime": "1 - 31:55",
            "label": "",
            "description": "Marek Hamsik (Napoli) misses the target from a promising position, sending the ball well wide of the left post."
        },
        {
            "gameTime": "1 - 31:08",
            "label": "",
            "description": "The game is interrupted as Marcelo (Real Madrid) is flagged offside."
        },
        {
            "gameTime": "1 - 30:43",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 30:12",
            "label": "",
            "description": "Luka Modric (Real Madrid) shoots from outside the box, but his effort is blocked. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 29:35",
            "label": "",
            "description": "Elseid Hysaj (Napoli) deprives his opponent of the ball, but the referee blows his whistle for a foul. He's not happy with the decision!"
        },
        {
            "gameTime": "1 - 29:08",
            "label": "",
            "description": "A cross from a mid range free kick, taken by Real Madrid, is intercepted by one of the defenders."
        },
        {
            "gameTime": "1 - 28:29",
            "label": "",
            "description": "Kalidou Koulibaly (Napoli) brings an opponent down and Damir Skomina interrupts the game. Real Madrid will take a free kick near the side line."
        },
        {
            "gameTime": "1 - 27:10",
            "label": "",
            "description": "Ambitious effort from Cristiano Ronaldo (Real Madrid). He finds himself in a great position after collecting a precise pass inside the penalty area and goes for goal, but it never troubles the goalkeeper and flies well over the bar."
        },
        {
            "gameTime": "1 - 26:08",
            "label": "",
            "description": "Flag up against Cristiano Ronaldo (Real Madrid). He had space to move into behind the defence, but he went too soon."
        },
        {
            "gameTime": "1 - 25:51",
            "label": "",
            "description": "Real Madrid enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 20:10",
            "label": "",
            "description": "Dries Mertens (Napoli) shows too much aggression while trying to break free from his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "1 - 17:59",
            "label": "soccer-ball",
            "description": "Daniel Carvajal showcases his great technique and produces a beautiful lofted cross into the box. Karim Benzema (Real Madrid) meets the cross and gets himself onto the scoresheet with a header into the middle of the goal. It's 1:1."
        },
        {
            "gameTime": "1 - 16:51",
            "label": "y-card",
            "description": "The foul by Sergio Ramos (Real Madrid) is worthy of a card and a yellow is duly shown by Damir Skomina."
        },
        {
            "gameTime": "1 - 14:26",
            "label": "",
            "description": "Damir Skomina blows his whistle. James Rodriguez (Real Madrid) commits a foul after dangerous play."
        },
        {
            "gameTime": "1 - 13:45",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 12:10",
            "label": "",
            "description": "Karim Benzema (Real Madrid) climbs high to connect with a cross near the penalty spot but plants a header high over the bar."
        },
        {
            "gameTime": "1 - 11:21",
            "label": "",
            "description": "Karim Benzema (Real Madrid) had a good opportunity when he latched on to a cross from the wing, but his header wasn't accurate at all and the ball went well wide of the right post."
        },
        {
            "gameTime": "1 - 09:11",
            "label": "",
            "description": "The linesman raises his flag as one of the players from Real Madrid was in an offside position."
        },
        {
            "gameTime": "1 - 07:58",
            "label": "soccer-ball",
            "description": "Lorenzo Insigne (Napoli) has a lot of space around him in the middle of the pitch and surprisingly decides to hammer the ball goalwards from long range. Even more surprising is the result of his attempt as it flies inside the right hand post."
        },
        {
            "gameTime": "1 - 05:47",
            "label": "",
            "description": "Marcelo (Real Madrid) smashes the ball towards goal from the edge of the penalty box, but it goes well wide of the right post."
        },
        {
            "gameTime": "1 - 03:30",
            "label": "",
            "description": "A pass from Dries Mertens (Napoli) is intercepted by Keylor Navas and the move breaks down."
        },
        {
            "gameTime": "1 - 03:12",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) blasts the ball from just outside the box, but his attempt is blocked by the defender."
        },
        {
            "gameTime": "1 - 01:57",
            "label": "",
            "description": "Karim Benzema (Real Madrid) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 01:13",
            "label": "",
            "description": "Karim Benzema (Real Madrid) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it."
        },
        {
            "gameTime": "1 - 00:30",
            "label": "",
            "description": "Karim Benzema (Real Madrid) receives a precise pass and is given time inside the box to send a promising strike towards the middle of the goal. Pepe Reina guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The referee of today's match will be Damir Skomina."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        }
    ],
    "gameAwayTeam": "Napoli",
    "gameDate": "15/02/2017 - 22:45",
    "gameHomeTeam": "Real Madrid",
    "gameScore": "3 - 1"
}