{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2017-03-12 - 22-45 Palermo 0 - 3 AS Roma/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:03",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        },
        {
            "gameTime": "2 - 45:49",
            "label": "soccer-ball",
            "description": "It's in the back of the net! Kevin Strootman picks out Bruno Peres (AS Roma) with a sweet pass, and he latches on to it deep inside the box and beats the goalkeeper. 0:3."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 39:30",
            "label": "",
            "description": "Edin Dzeko (AS Roma) commits a foul and Gianluca Rocchi immediately signals a free kick."
        },
        {
            "gameTime": "2 - 35:25",
            "label": "substitution",
            "description": "A substitution has been made. Mohamed Salah goes off and Daniele De Rossi (AS Roma) comes on."
        },
        {
            "gameTime": "2 - 34:39",
            "label": "corner",
            "description": "Alessandro Diamanti (Palermo) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "2 - 30:31",
            "label": "soccer-ball",
            "description": "Goal! Edin Dzeko (AS Roma) receives a well taken defence splitting pass inside the box and fires the ball past the goalkeeper."
        },
        {
            "gameTime": "2 - 28:56",
            "label": "corner",
            "description": "Alessandro Diamanti (Palermo) launches a powerful cross from the corner into the box, but the ball is intercepted by the defender."
        },
        {
            "gameTime": "2 - 28:30",
            "label": "substitution",
            "description": "Luis Diego Lopez Breijo has decided to introduce fresh legs, with Simone Lo Faso (Palermo) replacing Bruno Henrique."
        },
        {
            "gameTime": "2 - 26:43",
            "label": "substitution",
            "description": "The referee allows time for a substitution. Stephan El Shaarawy will be replaced by Kevin Strootman (AS Roma)."
        },
        {
            "gameTime": "2 - 23:57",
            "label": "corner",
            "description": "Leandro Paredes (AS Roma) sends a wonderful cross from the corner kick. However, the defence works perfectly to clear the ball and avert the threat."
        },
        {
            "gameTime": "2 - 22:00",
            "label": "y-card",
            "description": "Alessandro Gazzi (Palermo) gets a yellow card."
        },
        {
            "gameTime": "2 - 18:53",
            "label": "substitution",
            "description": "Luciano Spalletti has decided to make a change. Edin Dzeko (AS Roma) replaces Clement Grenier."
        },
        {
            "gameTime": "2 - 15:50",
            "label": "y-card",
            "description": "Yellow card. Clement Grenier (AS Roma) goes into the referee's book after a bad challenge."
        },
        {
            "gameTime": "2 - 13:10",
            "label": "corner",
            "description": "A dangerous looking corner kick from Alessandro Diamanti (Palermo) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 08:44",
            "label": "y-card",
            "description": "Leandro Paredes (AS Roma) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Gianluca Rocchi didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 06:49",
            "label": "corner",
            "description": "Clement Grenier (AS Roma) fails to deliver a decent cross from the corner and the ball goes out of play."
        },
        {
            "gameTime": "2 - 05:48",
            "label": "corner",
            "description": "Clement Grenier (AS Roma) swings in a dangerous cross from the resulting corner kick, but none of his teammates manage to outjump the defence."
        },
        {
            "gameTime": "2 - 05:41",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Antonio Rudiger (AS Roma), is intercepted by the opposition's defence. The ball goes out of play. AS Roma are awarded a corner kick."
        },
        {
            "gameTime": "2 - 00:17",
            "label": "substitution",
            "description": "There will be a change on the pitch for the second half. Luis Diego Lopez Breijo probably wasn't satisfied with the performance of Carlos Embalo. He is replaced by Alessandro Diamanti (Palermo)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Everything is set for the start of the second half."
        },
        {
            "gameTime": "1 - 45:54",
            "label": "whistle",
            "description": "The end of the first half."
        },
        {
            "gameTime": "1 - 44:24",
            "label": "corner",
            "description": "The corner from Bruno Henrique (Palermo) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 42:11",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) unleashes a decent effort from just outside the box which goes narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 40:41",
            "label": "corner",
            "description": "Bruno Henrique (Palermo) steps up to take the corner. He launches the ball into the penalty area, but it only finds the head of an opposing player who clears the danger."
        },
        {
            "gameTime": "1 - 37:39",
            "label": "",
            "description": "Clement Grenier (AS Roma) wastes a huge opportunity after receiving a fine cross from the free kick, but his close range shot goes well over the crossbar."
        },
        {
            "gameTime": "1 - 37:24",
            "label": "",
            "description": "It's a free kick to AS Roma in a dangerous position."
        },
        {
            "gameTime": "1 - 32:50",
            "label": "corner",
            "description": "Clement Grenier (AS Roma) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 28:51",
            "label": "",
            "description": "Stephan El Shaarawy (AS Roma) takes a shot from the edge of the area, but it goes harmlessly wide of the right post."
        },
        {
            "gameTime": "1 - 25:25",
            "label": "",
            "description": "Alessandro Gazzi (Palermo) fails to pick a body out in the box with an over hit chip pass."
        },
        {
            "gameTime": "1 - 21:54",
            "label": "soccer-ball",
            "description": "Goal! Clement Grenier puts a cross into the box and finds Stephan El Shaarawy (AS Roma), who latches on to it and strikes the ball low into the middle of the net. He makes it 0:1."
        },
        {
            "gameTime": "1 - 19:24",
            "label": "",
            "description": "A poorly executed mid range free kick by Bruno Henrique (Palermo) as he fails to deliver a decent cross."
        },
        {
            "gameTime": "1 - 18:00",
            "label": "y-card",
            "description": "Is that a yellow card in the referee's hand? It is! Bruno Henrique (Palermo) gets booked."
        },
        {
            "gameTime": "1 - 15:57",
            "label": "",
            "description": "Mohamed Salah (AS Roma) finds himself beyond the last defender, but the game is stopped by the referee after the linesman signals for offside."
        },
        {
            "gameTime": "1 - 14:23",
            "label": "y-card",
            "description": "Bruno Peres (AS Roma) picks up a yellow card."
        },
        {
            "gameTime": "1 - 10:43",
            "label": "",
            "description": "The foul by Carlos Embalo (Palermo) was seen by Gianluca Rocchi who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 09:00",
            "label": "",
            "description": "Radja Nainggolan (AS Roma) crosses the ball into the box, but one of the defending players averts the threat."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "",
            "description": "A goal, which was scored by Ilija Nestorovski (Palermo), was disallowed due to offside."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Palermo will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gianluca Rocchi will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Good afternoon, ladies and gentleman! Welcome to our live text commentary, where we will provide you with instant updates of everything that happens in the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "In the last 5 games between these two teams there were 1 matches with under 2.5 goals."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Palermo have a leaky defence as they have conceded 74 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "The referee blows his whistle for the final time to end this match."
        }
    ],
    "gameAwayTeam": "AS Roma",
    "gameDate": "12/03/2017 - 22:45",
    "gameHomeTeam": "Palermo",
    "gameScore": "0 - 3"
}