{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2017-03-18 - 18-15 Ath Bilbao 1 - 2 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:31",
            "label": "whistle",
            "description": "Santiago Jaime Latre is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:17",
            "label": "y-card",
            "description": "The referee Santiago Jaime Latre awards Keylor Navas (Real Madrid) a yellow card."
        },
        {
            "gameTime": "2 - 47:04",
            "label": "",
            "description": "Inaki Williams (Ath Bilbao) couldn't beat the offside trap and the flag goes up. The assistant referee quickly made a difficult call as it was a really tight offside."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 42:19",
            "label": "",
            "description": "The goalkeeper pulls off a decent save to deny Markel Susaeta (Ath Bilbao) as he jumps for a header from a brilliant cross into the penalty area."
        },
        {
            "gameTime": "2 - 42:07",
            "label": "attendance",
            "description": "The attendance for today's match is 49095."
        },
        {
            "gameTime": "2 - 40:36",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Markel Susaeta (Ath Bilbao) replaces Raul Garcia."
        },
        {
            "gameTime": "2 - 39:47",
            "label": "substitution",
            "description": "Karim Benzema comes off the pitch to be replaced by Alvaro Morata (Real Madrid)."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Benat trots off the pitch and is replaced by Mikel Rico (Ath Bilbao)."
        },
        {
            "gameTime": "2 - 33:01",
            "label": "substitution",
            "description": "Here is a change. Cristiano Ronaldo is going off and Zinedine Zidane gives the last tactical orders to Isco (Real Madrid)."
        },
        {
            "gameTime": "2 - 32:30",
            "label": "corner",
            "description": "There's an opportunity for Benat (Ath Bilbao) to deliver the ball into the box from a corner."
        },
        {
            "gameTime": "2 - 26:41",
            "label": "",
            "description": "Close! Marcelo (Real Madrid) is a whisker away from finishing off the move he started. His close range effort flies just over the bar."
        },
        {
            "gameTime": "2 - 25:36",
            "label": "y-card",
            "description": "This yellow card was deserved. The tackle by Toni Kroos (Real Madrid) was quite harsh and Santiago Jaime Latre didn't hesitate to show him a yellow card."
        },
        {
            "gameTime": "2 - 22:45",
            "label": "soccer-ball",
            "description": "GOAL 1:2! The corner comes over and Cristiano Ronaldo flicks on with his head to Casemiro (Real Madrid), who makes no mistake and fires the ball into the back of the net."
        },
        {
            "gameTime": "2 - 22:30",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) steps up to send the ball in."
        },
        {
            "gameTime": "2 - 19:37",
            "label": "soccer-ball",
            "description": "GOAL! Aritz Aduriz (Ath Bilbao) scores with a header from close range after Raul Garcia headed a pin point lofted cross into his path. It's 1:1."
        },
        {
            "gameTime": "2 - 17:30",
            "label": "",
            "description": "Inaki Williams (Ath Bilbao) came close to scoring. He connected with a pass inside the box and perhaps should have done better than direct his shot straight at Keylor Navas."
        },
        {
            "gameTime": "2 - 16:55",
            "label": "substitution",
            "description": "It will be a substitution. Lucas (Real Madrid) is ready to enter the pitch as Luka Modric walks off."
        },
        {
            "gameTime": "2 - 13:54",
            "label": "substitution",
            "description": "Ernesto Valverde Tejedor decides to make a substitution. Lekue will be replaced by Iker Muniain (Ath Bilbao)."
        },
        {
            "gameTime": "2 - 09:37",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "2 - 08:41",
            "label": "",
            "description": "Gareth Bale (Real Madrid) finds himself free inside the box and pulls the trigger, but his effort is brilliantly stopped by one of the defending players. The ball is out of play. A goal scoring opportunity from a corner for Real Madrid."
        },
        {
            "gameTime": "2 - 07:26",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "2 - 07:13",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) is heading toward the corner flag to take the set piece."
        },
        {
            "gameTime": "2 - 06:01",
            "label": "",
            "description": "Karim Benzema (Real Madrid) is adjudged offside."
        },
        {
            "gameTime": "2 - 03:30",
            "label": "corner",
            "description": "Benat (Ath Bilbao) will take a corner kick."
        },
        {
            "gameTime": "2 - 02:50",
            "label": "corner",
            "description": "Benat (Ath Bilbao) will deliver the corner kick."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Santiago Jaime Latre blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 46:15",
            "label": "whistle",
            "description": "The referee blows his whistle for half time, bringing to a close the first 45 minutes of the match."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 min. of stoppage time to be played."
        },
        {
            "gameTime": "1 - 44:42",
            "label": "",
            "description": "Mikel Balenziaga (Ath Bilbao) meets a cross just outside the area and gets in a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "1 - 40:29",
            "label": "",
            "description": "Ander Iturraspe (Ath Bilbao) smashes the ball upfield and Lekue controls it with a great first touch."
        },
        {
            "gameTime": "1 - 33:36",
            "label": "",
            "description": "A cross into the box finds the head of Raul Garcia (Ath Bilbao) who steers it goalwards, but Keylor Navas manages to pull off a decent save to thwart him."
        },
        {
            "gameTime": "1 - 30:06",
            "label": "y-card",
            "description": "Casemiro (Real Madrid) got a yellow card."
        },
        {
            "gameTime": "1 - 27:28",
            "label": "y-card",
            "description": "The referee gives a yellow card to Daniel Carvajal (Real Madrid)."
        },
        {
            "gameTime": "1 - 27:18",
            "label": "y-card",
            "description": "A yellow coloured card is received by Aritz Aduriz (Ath Bilbao)."
        },
        {
            "gameTime": "1 - 25:43",
            "label": "",
            "description": "Gareth Bale (Real Madrid) shoots from the edge of the penalty area. The ball travels towards the middle of the target, but Kepa Arrizabalaga easily deals with the threat."
        },
        {
            "gameTime": "1 - 24:26",
            "label": "soccer-ball",
            "description": "It's 0:1! Cristiano Ronaldo feeds Karim Benzema (Real Madrid) inside the box, who is unmarked and buries the ball in the bottom left corner."
        },
        {
            "gameTime": "1 - 23:32",
            "label": "",
            "description": "Luka Modric (Real Madrid) sends an accurate pass to Gareth Bale, who controls the ball with a fine first touch."
        },
        {
            "gameTime": "1 - 17:54",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) prepares to take a corner kick."
        },
        {
            "gameTime": "1 - 15:31",
            "label": "",
            "description": "Cristiano Ronaldo (Real Madrid) receives a precise low pass inside the box, controls the ball and drills it towards the right post. Unfortunately for him, Kepa Arrizabalaga makes a great save to stop his effort."
        },
        {
            "gameTime": "1 - 13:43",
            "label": "",
            "description": "Flag goes up against Casemiro (Real Madrid) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "1 - 12:26",
            "label": "corner",
            "description": "Benat (Ath Bilbao) will take the corner."
        },
        {
            "gameTime": "1 - 09:16",
            "label": "",
            "description": "Gooal! No wait, it's been ruled out for offside. Cristiano Ronaldo (Real Madrid) disagrees, but the linesman is sure about his call."
        },
        {
            "gameTime": "1 - 08:10",
            "label": "corner",
            "description": "Corner kick. Benat (Ath Bilbao) is ready to send the ball into the box."
        },
        {
            "gameTime": "1 - 06:33",
            "label": "",
            "description": "Raul Garcia (Ath Bilbao) plants a nice towering header goalwards, but one of the defenders is in the right place at the right time and makes a vital clearance. The ball is out of play and Ath Bilbao manage to earn a corner."
        },
        {
            "gameTime": "1 - 05:30",
            "label": "",
            "description": "Raul Garcia (Ath Bilbao) makes a good run inside the box to meet a precise cross. He latches on to it and shoots, but the goalkeeper pulls off an excellent save."
        },
        {
            "gameTime": "1 - 04:30",
            "label": "",
            "description": "Aymeric Laporte (Ath Bilbao) sends an accurate pass to Yerai Alvarez, who controls the ball with a fine first touch."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ath Bilbao will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "In the details of this match, you can glance at the lineups while the game is about to begin."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's referee will be Santiago Jaime Latre."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Welcome to our live text coverage. We will try to provide you with a detailed image of what's happening on the pitch. There are only few moments left to the beginning of the match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid have not lost for 4 games in a row."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Madrid have been awarded 7 penalties so far in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Ath Bilbao have gone 13 consecutive matches without a draw."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "whistle",
            "description": "Santiago Jaime Latre is looking at his watch and immediately ends this match."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "18/03/2017 - 18:15",
    "gameHomeTeam": "Ath Bilbao",
    "gameScore": "1 - 2"
}