{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2016-2017/2016-11-26 - 22-45 Empoli 1 - 4 AC Milan/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. AC Milan had more of the game and were superior. Their manager will certainly be the happier of the two managers. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "2 - 47:09",
            "label": "whistle",
            "description": "That's it for today, Gianpaolo Calvarese has blown his whistle and the game is over."
        },
        {
            "gameTime": "2 - 45:40",
            "label": "",
            "description": "Massimo Maccarone (Empoli) had a good opportunity when he latched on to a cross from the wing, but his header from the six yard box wasn't accurate enough and the ball glanced away off the bar!"
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "2 - 43:54",
            "label": "y-card",
            "description": "Giuseppe Bellusci (Empoli) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Gianpaolo Calvarese didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "corner",
            "description": "The resulting corner, taken by Suso (AC Milan), comes to nothing."
        },
        {
            "gameTime": "2 - 42:47",
            "label": "",
            "description": "M'Baye Niang (AC Milan) fails to find any of his teammates inside the box as his pass is blocked. The referee points to the corner flag. It's a corner to AC Milan."
        },
        {
            "gameTime": "2 - 41:33",
            "label": "",
            "description": "The Empoli players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 38:55",
            "label": "substitution",
            "description": "A substitution has been made. Gianluca Lapadula is replaced by Andrea Poli (AC Milan)."
        },
        {
            "gameTime": "2 - 37:25",
            "label": "",
            "description": "M'Baye Niang (AC Milan) makes his forward run a little too early and is caught in an offside position after his teammate tries to play a pass to him."
        },
        {
            "gameTime": "2 - 36:46",
            "label": "",
            "description": "Ignazio Abate (AC Milan) fouls an opponent. At least that's what referee Gianpaolo Calvarese signals."
        },
        {
            "gameTime": "2 - 35:34",
            "label": "corner",
            "description": "Empoli take a short corner kick."
        },
        {
            "gameTime": "2 - 35:19",
            "label": "",
            "description": "Manuel Pasqual (Empoli) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The linesman points to the corner flag, Empoli are going to take it."
        },
        {
            "gameTime": "2 - 34:52",
            "label": "corner",
            "description": "The corner from Manuel Pasqual (Empoli) is cleared away by the defence."
        },
        {
            "gameTime": "2 - 32:50",
            "label": "substitution",
            "description": "Here is a change. Mario Pasalic is going off and Vincenzo Montella gives the last tactical orders to M'Baye Niang (AC Milan)."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "soccer-ball",
            "description": "Goal 1:4! Suso laid the ball off to Gianluca Lapadula (AC Milan), who shot from close range into the bottom left corner, leaving the goalkeeper helpless."
        },
        {
            "gameTime": "2 - 31:50",
            "label": "",
            "description": "The game is interrupted as Suso (AC Milan) is flagged offside."
        },
        {
            "gameTime": "2 - 29:59",
            "label": "",
            "description": "An accurate pass to the edge of the box is well taken by Massimo Maccarone (Empoli), whose instinctive shot towards goal flashes inches over the top."
        },
        {
            "gameTime": "2 - 28:53",
            "label": "substitution",
            "description": "It is time for a substitution. Alberto Gilardino (Empoli) is on for Guido Marilungo."
        },
        {
            "gameTime": "2 - 28:32",
            "label": "",
            "description": "AC Milan are enjoying a spell of pressure at the moment, but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 26:41",
            "label": "",
            "description": "Daniele Croce (Empoli) shows too much aggression while trying to break free from his opponent and the referee blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 25:47",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) slides a pass forward, but one of the defenders cuts it out."
        },
        {
            "gameTime": "2 - 24:54",
            "label": "",
            "description": "The AC Milan players are exchanging some short passes to try and open up the opposition’s defence and hit them swiftly on the break."
        },
        {
            "gameTime": "2 - 22:59",
            "label": "substitution",
            "description": "Giovanni Martusciello has decided to make a change. Andres Tello (Empoli) replaces Rade Krunic."
        },
        {
            "gameTime": "2 - 22:37",
            "label": "substitution",
            "description": "Today's match ends for Frederic Veseli who will be replaced by Marco Zambelli (Empoli)."
        },
        {
            "gameTime": "2 - 21:12",
            "label": "",
            "description": "Assane Diousse (Empoli) plays a through ball which would have led to a great opportunity, if it hadn't been stopped by the defence."
        },
        {
            "gameTime": "2 - 19:00",
            "label": "soccer-ball-own",
            "description": "This is definitely not what Andrea Costa (Empoli) wanted. Attempting to intercept an offensive pass, he scored an own goal and made it 1:3."
        },
        {
            "gameTime": "2 - 17:45",
            "label": "",
            "description": "Manuel Pasqual (Empoli) is obviously not following the Golden Rule: „Treat others as you want to be treated.“ He makes a bad challenge and leaves Gianpaolo Calvarese with no other option than to blow for a foul."
        },
        {
            "gameTime": "2 - 15:58",
            "label": "soccer-ball",
            "description": "Goal Suso (AC Milan)! Suso (AC Milan) was put through by Ignazio Abate and he showed brilliant composure inside the box to fire into the bottom left corner. 1:2."
        },
        {
            "gameTime": "2 - 14:34",
            "label": "",
            "description": "Mario Pasalic (AC Milan) creates some space for himself to pick up a pass on the edge of the box and unleashes a decent strike which goes a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 13:45",
            "label": "",
            "description": "Riccardo Saponara (Empoli) is caught offside!"
        },
        {
            "gameTime": "2 - 13:22",
            "label": "",
            "description": "Juraj Kucka (AC Milan) brings his opponent down. Gianpaolo Calvarese has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 10:57",
            "label": "corner",
            "description": "Suso (AC Milan) works the corner short instead of sending the ball into the penalty area."
        },
        {
            "gameTime": "2 - 10:44",
            "label": "",
            "description": "Ignazio Abate (AC Milan) sends a cross into the box, but the opposition's defence quickly intercepts the ball. AC Milan have a corner."
        },
        {
            "gameTime": "2 - 10:12",
            "label": "funfact",
            "description": "39:61 – the ratio of ball possession."
        },
        {
            "gameTime": "2 - 08:37",
            "label": "",
            "description": "Gianpaolo Calvarese blows his whistle and it's Suso (AC Milan) who is penalised for an offensive foul. Good decision by the referee."
        },
        {
            "gameTime": "2 - 08:25",
            "label": "",
            "description": "Suso (AC Milan) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 07:20",
            "label": "",
            "description": "A pass from Manuel Pasqual (Empoli) is intercepted by Gianluigi Donnarumma and the move breaks down."
        },
        {
            "gameTime": "2 - 05:59",
            "label": "",
            "description": "Massimo Maccarone (Empoli) latches on to a pass on the edge of the box, but he can't get any power into the shot and fails to trouble Gianluigi Donnarumma."
        },
        {
            "gameTime": "2 - 05:50",
            "label": "",
            "description": "Riccardo Saponara (Empoli) receives a good pass just outside the box, unleashes a strike from a promising position, but the shot is blocked by the defender."
        },
        {
            "gameTime": "2 - 04:20",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) races towards goal but the defender gets back well to make a challenge. The ball goes out of play and Empoli will have a goal kick."
        },
        {
            "gameTime": "2 - 02:54",
            "label": "",
            "description": "Suso (AC Milan) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The second half gets underway."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "There was certainly plenty of action during that opening 45 minutes. Neither side has gained the upper hand as yet. The home team's main weapon is fast counter attacks, while the away side attempts to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:16",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 1 min. of added time."
        },
        {
            "gameTime": "1 - 42:56",
            "label": "y-card",
            "description": "Giacomo Bonaventura (AC Milan) is awarded a yellow card for his tackle. He doesn't seem to agree with the decision, but Gianpaolo Calvarese ignores the protests."
        },
        {
            "gameTime": "1 - 41:41",
            "label": "",
            "description": "That didn't go as planned! Massimo Maccarone (Empoli) tried his luck from the edge of the box, but his effort towards the middle of the goal was too weak to get past Gianluigi Donnarumma, who easily kept it out."
        },
        {
            "gameTime": "1 - 39:30",
            "label": "",
            "description": "Gianluca Lapadula (AC Milan) is flagged for offside."
        },
        {
            "gameTime": "1 - 37:10",
            "label": "corner",
            "description": "The corner from Suso (AC Milan) is intercepted by the defence."
        },
        {
            "gameTime": "1 - 36:50",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) stands over the free kick and opts to take it himself, sending it towards the right post only for Lukasz Skorupski to dive and make a save. The ball goes out for a corner. AC Milan can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 36:27",
            "label": "y-card",
            "description": "The foul by Rade Krunic (Empoli) is worthy of a card and a yellow is duly shown by Gianpaolo Calvarese. AC Milan win a free kick."
        },
        {
            "gameTime": "1 - 34:56",
            "label": "",
            "description": "Riccardo Saponara (Empoli) rips an amazing volley from deep inside the box that goes narrowly over the crossbar."
        },
        {
            "gameTime": "1 - 33:55",
            "label": "",
            "description": "Riccardo Saponara (Empoli) latches on to an accurate pass inside the box and immediately unleashes a shot towards goal, but it goes high over the crossbar."
        },
        {
            "gameTime": "1 - 32:50",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 32:30",
            "label": "",
            "description": "Suso (AC Milan) won himself some space after the corner kick and tries his luck with a shot from the edge of the box. His effort is directed to the top left corner, but the goalkeeper is alert and makes the save."
        },
        {
            "gameTime": "1 - 32:10",
            "label": "corner",
            "description": "Giacomo Bonaventura (AC Milan) looks like he will be the one to try and deliver a quality ball into the penalty box from the corner kick."
        },
        {
            "gameTime": "1 - 31:55",
            "label": "",
            "description": "Ignazio Abate (AC Milan) has a shot blocked from inside the box. AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 30:43",
            "label": "y-card",
            "description": "A yellow card for a tackle by Juraj Kucka (AC Milan). Gianpaolo Calvarese doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "1 - 29:52",
            "label": "",
            "description": "A beautiful low pass from the side is received by Manuel Pasqual (Empoli), who was waiting for his chance. However, the defence is alert and spanks the ball away."
        },
        {
            "gameTime": "1 - 27:25",
            "label": "",
            "description": "One of the AC Milan players unfairly tackled his opponent and conceded a foul."
        },
        {
            "gameTime": "1 - 26:58",
            "label": "",
            "description": "Neat passing move from AC Milan in order to create new attacking opportunities."
        },
        {
            "gameTime": "1 - 24:20",
            "label": "",
            "description": "Suso (AC Milan) goes on a solo run, but he fails to create a chance as an opposition player blocks him."
        },
        {
            "gameTime": "1 - 21:50",
            "label": "corner",
            "description": "Suso (AC Milan) takes the corner but fails to find any of his teammates. The ball is easily cleared out of danger."
        },
        {
            "gameTime": "1 - 21:30",
            "label": "",
            "description": "The defence had a hard time blocking out the strike from Juraj Kucka (AC Milan). He didn't hesitate and finished from outside the box right after he had received a pass from his teammate. The ball is out of play. A goal scoring opportunity from a corner for AC Milan."
        },
        {
            "gameTime": "1 - 17:50",
            "label": "",
            "description": "Gianpaolo Calvarese blows his whistle and signals a foul after Giuseppe Bellusci (Empoli) brought his opponent down."
        },
        {
            "gameTime": "1 - 16:27",
            "label": "soccer-ball",
            "description": "Goal! That was a fantastic finish by Riccardo Saponara (Empoli) from just outside the box. He wasted little time in getting away a bullet of a shot that flew past the goalkeeper."
        },
        {
            "gameTime": "1 - 16:20",
            "label": "",
            "description": "Guido Marilungo (Empoli) sends a teasing cross into the area, but Gianluigi Donnarumma intercepts the ball."
        },
        {
            "gameTime": "1 - 14:51",
            "label": "soccer-ball",
            "description": "Goal 0:1! Suso tees up Gianluca Lapadula (AC Milan) inside the box and he rolls the ball into the bottom left corner and past Lukasz Skorupski."
        },
        {
            "gameTime": "1 - 13:50",
            "label": "corner",
            "description": "Suso (AC Milan) works the corner short."
        },
        {
            "gameTime": "1 - 13:32",
            "label": "",
            "description": "Suso (AC Milan) delivers a promising cross into the box, but it's cleared. AC Milan have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 12:59",
            "label": "",
            "description": "AC Milan enjoy a period of possession as they are exchanging some passes and waiting for an opportunity to strike."
        },
        {
            "gameTime": "1 - 10:59",
            "label": "",
            "description": "Manuel Pasqual (Empoli) floats the free kick into the box, but it's easily cleared by the first man."
        },
        {
            "gameTime": "1 - 10:50",
            "label": "",
            "description": "Manuel Locatelli (AC Milan) gives away a foul for a clumsy challenge. Referee Gianpaolo Calvarese saw the whole situation. Empoli get a free kick."
        },
        {
            "gameTime": "1 - 09:57",
            "label": "substitution",
            "description": "Matias Fernandez is substituted due to injury. Vincenzo Montella gives a chance to Juraj Kucka (AC Milan)."
        },
        {
            "gameTime": "1 - 09:07",
            "label": "",
            "description": "Massimo Maccarone (Empoli) leaps high to meet a lofted pass inside the six yard box, but his header flies yards over the crossbar."
        },
        {
            "gameTime": "1 - 07:59",
            "label": "",
            "description": "AC Milan are bossing possession at the moment by exchanging some precise passes from player to player."
        },
        {
            "gameTime": "1 - 05:50",
            "label": "",
            "description": "Gianluigi Donnarumma pulls off a great save to deny Riccardo Saponara (Empoli), who makes himself some space inside the box and unleashes a quick shot towards the top of the net."
        },
        {
            "gameTime": "1 - 03:57",
            "label": "y-card",
            "description": "Gianpaolo Calvarese shows a yellow card to Alessio Romagnoli (AC Milan) for a tough tackle."
        },
        {
            "gameTime": "1 - 02:10",
            "label": "",
            "description": "Massimo Maccarone (Empoli) receives a precise pass inside the box and takes a shot that flies just wide of the right post."
        },
        {
            "gameTime": "1 - 01:52",
            "label": "",
            "description": "The AC Milan players are exchanging fine passes and are waiting for an opportunity to start an attack, but here's a mistake and a loss of possession."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half of this match is about to start."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Empoli will kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Gianpaolo Calvarese will officiate today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "We now know the starting lineups. You can find them in the match details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Bacca looks sharp as he's the top goal scorer for AC Milan with 12 goals in the competition."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has been more to see on the pitch than in most of the other games. AC Milan had more of the game and were superior. Their manager will certainly be the happier of the two managers. The home team's main weapon was fast counter attacks, while the away side attempted to hold onto the ball for as long as possible."
        }
    ],
    "gameAwayTeam": "AC Milan",
    "gameDate": "26/11/2016 - 22:45",
    "gameHomeTeam": "Empoli",
    "gameScore": "1 - 4"
}