{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2016-2017/2016-08-21 - 21-15 Real Sociedad 0 - 3 Real Madrid/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 49:59",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. The away team was superior today. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        },
        {
            "gameTime": "2 - 49:57",
            "label": "whistle",
            "description": "That's the end of the match."
        },
        {
            "gameTime": "2 - 49:00",
            "label": "soccer-ball",
            "description": "Goal! James Rodriguez displays great vision and sends a pass to Gareth Bale (Real Madrid), who shows brilliant composure inside the box to bury the ball from close range in the back of the net. The score is 0:3."
        },
        {
            "gameTime": "2 - 47:22",
            "label": "",
            "description": "James Rodriguez (Real Madrid) connected with a pass around the edge of the box, aimed and shot. His attempt went towards the bottom right corner, but Geronimo Rulli was alert and the score remained the same."
        },
        {
            "gameTime": "2 - 45:50",
            "label": "",
            "description": "The keeper doesn't have to worry about this one. Mateo Kovacic (Real Madrid) sacrificed accuracy for power, and thus his attempt went well over the bar."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "4 min. of stoppage time to be played."
        },
        {
            "gameTime": "2 - 42:00",
            "label": "y-card",
            "description": "Yuri Berchiche (Real Sociedad) is given a fully deserved yellow card."
        },
        {
            "gameTime": "2 - 41:48",
            "label": "y-card",
            "description": "Sergio Ramos (Real Madrid) violates the laws of the game and is shown a deserved yellow card by the referee."
        },
        {
            "gameTime": "2 - 40:48",
            "label": "",
            "description": "Da Silva Willian Jose (Real Sociedad) commits a foul and Juan Martinez Munuera immediately signals a free kick."
        },
        {
            "gameTime": "2 - 39:26",
            "label": "corner",
            "description": "A dangerous looking corner kick from Carlos Vela (Real Sociedad) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 38:15",
            "label": "",
            "description": "Wow, what an escape. Mikel Oyarzabal (Real Sociedad) has an effort from inside the box but it's brilliantly blocked. Real Sociedad earn a corner."
        },
        {
            "gameTime": "2 - 37:02",
            "label": "corner",
            "description": "James Rodriguez (Real Madrid) swings in a cross from the corner, but Geronimo Rulli reads it well and gathers the ball."
        },
        {
            "gameTime": "2 - 34:00",
            "label": "substitution",
            "description": "Substitution. Carlos Vela (Real Sociedad) in, Mikel Gonzalez out."
        },
        {
            "gameTime": "2 - 33:31",
            "label": "corner",
            "description": "The resulting corner from David Zurutuza (Real Sociedad) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 33:21",
            "label": "",
            "description": "Xabi Prieto (Real Sociedad) fires a shot at goal from a very promising position outside the penalty area, but it is blocked by a self sacrificing defender. Corner kick. Real Sociedad will have an opportunity."
        },
        {
            "gameTime": "2 - 31:55",
            "label": "substitution",
            "description": "Alvaro Morata goes off the pitch and James Rodriguez (Real Madrid) comes on."
        },
        {
            "gameTime": "2 - 30:30",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Asier Illarramendi (Real Sociedad), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 30:08",
            "label": "",
            "description": "Da Silva Willian Jose (Real Sociedad) looks to break free, but an opposing player clears the ball away. The ball goes behind for a corner. Real Sociedad will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 27:07",
            "label": "substitution",
            "description": "Zinedine Zidane decides to make a substitution. Toni Kroos will be replaced by Isco (Real Madrid)."
        },
        {
            "gameTime": "2 - 26:54",
            "label": "substitution",
            "description": "We are about to witness a subsitution. Xabi Prieto (Real Sociedad) for Juanmi."
        },
        {
            "gameTime": "2 - 25:28",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) puts a dangerous cross into the box, but the corner is cleared by the first man."
        },
        {
            "gameTime": "2 - 25:04",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) sends in the corner, but fails to find the head of any of his teammates, allowing the defence to clear."
        },
        {
            "gameTime": "2 - 24:34",
            "label": "",
            "description": "A big opportunity is wasted by Mateo Kovacic (Real Madrid), who makes a yard for himself and produces a mid range rocket of a shot towards the right side of the goal. Unfortunately for him, Geronimo Rulli pulls off a fantastic save to stop the effort. Real Madrid will take a corner kick."
        },
        {
            "gameTime": "2 - 24:03",
            "label": "",
            "description": "The goalkeeper is not tested by the free kick from 18 metres out by Gareth Bale (Real Madrid) as his effort only hit the wall."
        },
        {
            "gameTime": "2 - 23:29",
            "label": "",
            "description": "This a big chance for one of the playmakers, who should have no difficulties with this free kick. Gareth Bale (Real Madrid) will take the free kick around 18 metres from the goal."
        },
        {
            "gameTime": "2 - 23:00",
            "label": "y-card",
            "description": "The whistle blows and Joseba Zaldua (Real Sociedad) is booked for an infringement."
        },
        {
            "gameTime": "2 - 20:13",
            "label": "substitution",
            "description": "Lucas (Real Madrid) joins the action as a substitute, replacing Marco Asensio."
        },
        {
            "gameTime": "2 - 19:39",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) races towards goal but the defender gets back well to make a challenge. The ball goes out of play and Real Sociedad will have a goal kick."
        },
        {
            "gameTime": "2 - 16:52",
            "label": "",
            "description": "Da Silva Willian Jose (Real Sociedad) swings a cross into the box, but it's far too close to Francisco Casilla, who smothers the ball."
        },
        {
            "gameTime": "2 - 15:49",
            "label": "",
            "description": "Mateo Kovacic (Real Madrid) and Gareth Bale try to prise open the opposition with a series of short passes, but one of the defenders steps in and puts an end to the move."
        },
        {
            "gameTime": "2 - 15:03",
            "label": "",
            "description": "The Real Madrid players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 14:09",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) flights in the cross, but the defender is alert and clears to safety."
        },
        {
            "gameTime": "2 - 11:36",
            "label": "",
            "description": "Inigo Martinez (Real Sociedad) shows good awareness deep inside the box as he latches on to a cross from the resulting free kick. He jumps high but his towering header lacks accuracy and flies well over the crossbar."
        },
        {
            "gameTime": "2 - 10:59",
            "label": "substitution",
            "description": "Here comes a substitution. Da Silva Willian Jose (Real Sociedad) is brought on as a substitute for David Concha."
        },
        {
            "gameTime": "2 - 10:20",
            "label": "",
            "description": "What an opportunity! Toni Kroos (Real Madrid) smashed a first time shot from the edge of the box, but the ball only crashed against the crossbar!"
        },
        {
            "gameTime": "2 - 09:12",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) picks up the ball, dribbles to the edge of the penalty area and unleashes a brilliant shot to the right side of the goal, but is thwarted by a great save from Geronimo Rulli."
        },
        {
            "gameTime": "2 - 08:25",
            "label": "y-card",
            "description": "The referee demonstrates he won't tolerate this behaviour. Alvaro Morata (Real Madrid) is given a yellow card."
        },
        {
            "gameTime": "2 - 05:21",
            "label": "",
            "description": "Asier Illarramendi (Real Sociedad) puts a cross into the box from the free kick, but the defender gets there first."
        },
        {
            "gameTime": "2 - 04:36",
            "label": "y-card",
            "description": "Casemiro (Real Madrid) has tested the patience of referee Juan Martinez Munuera and goes into the book for a previous late challenge."
        },
        {
            "gameTime": "2 - 03:15",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "2 - 02:52",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger. Real Madrid force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Juan Martinez Munuera blows his whistle and the second half starts."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "Up to now it has been an action packed game full of wonderful movements and opportunities. The visitors were superior in their performance through the first half. They were more active and precise. The home team's main weapon is fast counter attacks, while the away side attempts to hold onto the ball for as long as possible."
        },
        {
            "gameTime": "1 - 46:09",
            "label": "whistle",
            "description": "The first half of today's match has just finished."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 1 min. of added time."
        },
        {
            "gameTime": "1 - 43:38",
            "label": "corner",
            "description": "Alvaro Morata (Real Madrid) decides to speed play up with a short corner kick."
        },
        {
            "gameTime": "1 - 42:57",
            "label": "",
            "description": "The ball is cleared after Alvaro Morata (Real Madrid) attempted to dribble past an opposing player. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "",
            "description": "David Concha (Real Sociedad) sends a cross into the box, but Francisco Casilla comes off his line to gather the ball."
        },
        {
            "gameTime": "1 - 40:00",
            "label": "soccer-ball",
            "description": "Raphael Varane sends a precise lofted cross into the box. Marco Asensio (Real Madrid) latches on to it and finishes with a quick shot inside the right post. The goalkeeper had no chance. The score changes to 0:2."
        },
        {
            "gameTime": "1 - 38:30",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "1 - 36:31",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) bursts inside the box, beats two defenders and produces a strike from the penalty spot. The shot has power, but lacks precision and the goalkeeper stops it easily. The scoreline remains the same."
        },
        {
            "gameTime": "1 - 35:17",
            "label": "",
            "description": "Asier Illarramendi (Real Sociedad) takes the free kick from a long way out but the defender manages to get it clear."
        },
        {
            "gameTime": "1 - 34:53",
            "label": "",
            "description": "Juan Martinez Munuera blows the whistle, Casemiro (Real Madrid) is penalised for a foul. It's a free kick to Real Sociedad, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 33:44",
            "label": "",
            "description": "Geronimo Rulli (Real Sociedad) is able to continue to play."
        },
        {
            "gameTime": "1 - 33:06",
            "label": "injury",
            "description": "The game is interrupted now, Geronimo Rulli (Real Sociedad) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "1 - 32:37",
            "label": "",
            "description": "Gareth Bale (Real Madrid) attempted to pick out a free teammate inside the box, but Geronimo Rulli comes off the line to clear the ball away."
        },
        {
            "gameTime": "1 - 31:13",
            "label": "",
            "description": "Sergio Ramos (Real Madrid) leaps high deep inside the box to meet a beautiful cross from the free kick and attempts to score with a header. His effort is not accurate at all and goes well wide of the right post."
        },
        {
            "gameTime": "1 - 30:28",
            "label": "",
            "description": "David Concha (Real Sociedad) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 25:22",
            "label": "",
            "description": "Marcelo (Real Madrid) fails to find a teammate across the pitch with a long ball."
        },
        {
            "gameTime": "1 - 23:50",
            "label": "",
            "description": "The foul by Juanmi (Real Sociedad) was seen by Juan Martinez Munuera who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "1 - 22:58",
            "label": "",
            "description": "Toni Kroos (Real Madrid) displays his superb passing ability after picking out Daniel Carvajal with a fine lofted pass to continue their attacking move."
        },
        {
            "gameTime": "1 - 22:08",
            "label": "attendance",
            "description": "The attendance is 27720."
        },
        {
            "gameTime": "1 - 20:03",
            "label": "",
            "description": "Marcelo (Real Madrid) hits a first time volley towards goal from the edge of the penalty box, but his effort is way off target and the ball goes well wide of the right post."
        },
        {
            "gameTime": "1 - 19:52",
            "label": "corner",
            "description": "The corner from Toni Kroos (Real Madrid) is hurriedly cleared."
        },
        {
            "gameTime": "1 - 19:18",
            "label": "",
            "description": "Toni Kroos (Real Madrid) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the bottom left corner. Geronimo Rulli has a clear sight of it makes a comfortable save. Real Madrid have been awarded a corner kick."
        },
        {
            "gameTime": "1 - 18:11",
            "label": "",
            "description": "Marcelo (Real Madrid) attempts to slip the ball through the defence, but is unable to find any of his teammates."
        },
        {
            "gameTime": "1 - 17:09",
            "label": "",
            "description": "Mikel Oyarzabal (Real Sociedad) has a sight of goal and shoots from distance, but Francisco Casilla is equal to it."
        },
        {
            "gameTime": "1 - 15:15",
            "label": "corner",
            "description": "Toni Kroos (Real Madrid) steps up to take the corner, but the ball just sails in among the defenders."
        },
        {
            "gameTime": "1 - 14:36",
            "label": "",
            "description": "Alvaro Morata (Real Madrid) breaks into the penalty area but his shot is blocked. The ball is out of play. Real Madrid win a corner kick."
        },
        {
            "gameTime": "1 - 13:10",
            "label": "",
            "description": "Daniel Carvajal (Real Madrid) produces a dangerous lofted cross into the box which is intercepted. It's a throw in for Real Madrid."
        },
        {
            "gameTime": "1 - 09:46",
            "label": "",
            "description": "David Concha (Real Sociedad) sends a teasing cross into the area, but Francisco Casilla intercepts the ball."
        },
        {
            "gameTime": "1 - 06:24",
            "label": "corner",
            "description": "Asier Illarramendi (Real Sociedad) takes the corner which is cleared by the opposition's defence."
        },
        {
            "gameTime": "1 - 06:08",
            "label": "",
            "description": "The Real Sociedad players find the open spaces by moving the ball around, but the move ends with an involuntarily pass to the opposition. The referee signals a corner kick to Real Sociedad."
        },
        {
            "gameTime": "1 - 03:50",
            "label": "",
            "description": "Markel Bergara (Real Sociedad) swings in a cross, but the ball is cleared to safety by one of the defending players."
        },
        {
            "gameTime": "1 - 01:34",
            "label": "soccer-ball",
            "description": "Daniel Carvajal shows his great technique and produces a beautiful cross into the box. Gareth Bale (Real Madrid) gets on the scoresheet by heading the ball precisely inside the right post. It's now 0:1."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are out and the match is about to start. Real Madrid will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Juan Martinez Munuera is the one to supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Real Sociedad have made some new signings: ."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Several players have joined Real Madrid in the latest transfer window: . Certainly, some of them will participate in the upcoming clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "This is what football should look like. Full of action, thrilling moments and spectacular opportunities. The expectations for the next games will be high. The away team was superior today. The home side was creating their opportunities using lightning fast counter attacks. The tactic of the away side was slow build up play."
        }
    ],
    "gameAwayTeam": "Real Madrid",
    "gameDate": "21/08/2016 - 21:15",
    "gameHomeTeam": "Real Sociedad",
    "gameScore": "0 - 3"
}