{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/spain_laliga/2014-2015/2015-05-23 - 19-30 Barcelona 2 - 2 Dep. La Coruna/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 50:59",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. The hosts were largely in control of the game today. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        },
        {
            "gameTime": "2 - 50:49",
            "label": "whistle",
            "description": "Carlos Clos Gomez is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 49:28",
            "label": "y-card",
            "description": "It's a yellow card for Haris Medunjanin (Dep. La Coruna)."
        },
        {
            "gameTime": "2 - 48:44",
            "label": "corner",
            "description": "Alex Bergantinos (Dep. La Coruna) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "2 - 48:21",
            "label": "",
            "description": "Oriol Riera (Dep. La Coruna) delivers a low pass into the box which is intercepted. The ball goes out of play and Dep. La Coruna have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "y-card",
            "description": "The game is interrupted. Alex Bergantinos (Dep. La Coruna) is given a yellow card. He has to be more careful now."
        },
        {
            "gameTime": "2 - 47:15",
            "label": "",
            "description": "Andres Iniesta (Barcelona) trips an opposition player and Carlos Clos Gomez signals a foul. Dep. La Coruna have a free kick."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "We will have 5 min. of added time."
        },
        {
            "gameTime": "2 - 42:58",
            "label": "",
            "description": "Neymar (Barcelona) creates a good chance for himself and goes for goal from mid range, but the effort is well over the bar."
        },
        {
            "gameTime": "2 - 40:59",
            "label": "substitution",
            "description": "Victor Sanchez has decided to make a change. Jose Rodriguez (Dep. La Coruna) replaces Lucas Perez."
        },
        {
            "gameTime": "2 - 40:45",
            "label": "substitution",
            "description": "The manager makes a subsitution with Andres Iniesta (Barcelona) coming on for Xavi."
        },
        {
            "gameTime": "2 - 38:57",
            "label": "",
            "description": "Lionel Messi (Barcelona) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "2 - 38:50",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Xavi (Barcelona) takes it short."
        },
        {
            "gameTime": "2 - 38:40",
            "label": "",
            "description": "Rafinha (Barcelona) races towards goal but the defender gets back well to make a challenge. Barcelona have been awarded a corner kick."
        },
        {
            "gameTime": "2 - 37:14",
            "label": "",
            "description": "Lionel Messi (Barcelona) slaloms his way past challenges, but an opposing player does well to get the ball away."
        },
        {
            "gameTime": "2 - 36:32",
            "label": "",
            "description": "Barcelona slow the tempo of the game down by exchanging a combination of one or two touch passes. The opposition's players are finding it very difficult at the moment, very physically demanding to run without the ball."
        },
        {
            "gameTime": "2 - 33:20",
            "label": "",
            "description": "Barcelona control the tempo of the game by exchanging some accurate short passes."
        },
        {
            "gameTime": "2 - 30:51",
            "label": "soccer-ball",
            "description": "Goal! Diogo Salomao (Dep. La Coruna) fires the rebound inside the right post after the ball breaks to him in the box. The score is 2:2."
        },
        {
            "gameTime": "2 - 30:50",
            "label": "",
            "description": "Haris Medunjanin (Dep. La Coruna) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "2 - 30:48",
            "label": "",
            "description": "Haris Medunjanin (Dep. La Coruna) takes the resulting free kick from the edge of the box, but it's blocked by the players standing in the wall, saving the goalkeeper a lot of effort."
        },
        {
            "gameTime": "2 - 29:52",
            "label": "y-card",
            "description": "Carlos Clos Gomez has issued a yellow card to Jeremy Mathieu (Barcelona)."
        },
        {
            "gameTime": "2 - 29:25",
            "label": "",
            "description": "The referee blows his whistle after Jeremy Mathieu (Barcelona) does a good impression of a basketball player and handles the ball. Dep. La Coruna win a free kick. It's a promising situation for a direct shot."
        },
        {
            "gameTime": "2 - 29:11",
            "label": "",
            "description": "Neymar (Barcelona) produces a cunning chipped pass for Rafinha, who takes it down well but fails to get past the defenders and loses the ball. The ball is off of the pitch and it's a goal kick for Dep. La Coruna."
        },
        {
            "gameTime": "2 - 27:50",
            "label": "attendance",
            "description": "The attendance is 93743."
        },
        {
            "gameTime": "2 - 24:57",
            "label": "",
            "description": "Haris Medunjanin (Dep. La Coruna) takes a mid range free kick and his stunning strike crashes against the crossbar."
        },
        {
            "gameTime": "2 - 24:43",
            "label": "substitution",
            "description": "The substitution has been made. Javier Mascherano (Barcelona) has replaced Marc Bartra."
        },
        {
            "gameTime": "2 - 24:12",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Adriano (Barcelona). Dep. La Coruna are awarded the free kick."
        },
        {
            "gameTime": "2 - 23:30",
            "label": "",
            "description": "Flag goes up against Pedro (Barcelona) and the referee blows his whistle for offside. The referee blows his whistle for offside."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "",
            "description": "One of the defenders reacts at the last minute to brilliantly block a pass from Celso Borges (Dep. La Coruna)."
        },
        {
            "gameTime": "2 - 21:05",
            "label": "soccer-ball",
            "description": "The ball rebounds and arrives at the feet of Lucas Perez (Dep. La Coruna) just outside the box. He doesn't think twice and fires a magnificent shot into the top left corner. His attempt was beyond the reach of Jordi Masip, so the score changes to 1:0."
        },
        {
            "gameTime": "2 - 20:45",
            "label": "funfact",
            "description": "The shots on goal statistics – 7:2."
        },
        {
            "gameTime": "2 - 19:57",
            "label": "",
            "description": "Oriol Riera (Dep. La Coruna) commits a rough challenge and Carlos Clos Gomez blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 18:59",
            "label": "",
            "description": "Douglas Pereira (Barcelona) sends a pass into the box, but his attempt is thwarted and cleared."
        },
        {
            "gameTime": "2 - 18:12",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) goes on a mazy run and tries his luck with a mid range strike, but one of the defending players steps in and makes a block."
        },
        {
            "gameTime": "2 - 17:45",
            "label": "substitution",
            "description": "Luis Enrique prepares a substitution. Thomas Vermaelen is replaced by Douglas Pereira (Barcelona)."
        },
        {
            "gameTime": "2 - 17:08",
            "label": "",
            "description": "Ivan Cavaleiro (Dep. La Coruna) is caught offside!"
        },
        {
            "gameTime": "2 - 16:35",
            "label": "substitution",
            "description": "Today's match ends for Juan Dominguez who will be replaced by Oriol Riera (Dep. La Coruna)."
        },
        {
            "gameTime": "2 - 15:45",
            "label": "",
            "description": "Neymar (Barcelona) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 13:55",
            "label": "soccer-ball",
            "description": "Goal! Neymar puts the ball on a plate for Lionel Messi (Barcelona), who scores with a simple close range finish. It's 2:0."
        },
        {
            "gameTime": "2 - 12:55",
            "label": "",
            "description": "Xavi (Barcelona) fires in an effort from the free kick from some 25 metres. His strike is very inaccurate and ends in row Z. The ball is off of the pitch and it's a goal kick for Dep. La Coruna."
        },
        {
            "gameTime": "2 - 12:05",
            "label": "y-card",
            "description": "A yellow card for a tackle by Juan Dominguez (Dep. La Coruna). Carlos Clos Gomez doesn't hesitate at all to make this decision. Barcelona have a free kick from a promising distance."
        },
        {
            "gameTime": "2 - 11:21",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes and control the game at the moment, but one of the defending players steps in and intercepts the ball."
        },
        {
            "gameTime": "2 - 09:03",
            "label": "corner",
            "description": "Barcelona work the corner short. The ball is passed to a nearby teammate."
        },
        {
            "gameTime": "2 - 08:32",
            "label": "",
            "description": "Neymar (Barcelona) produces a lovely chip pass into the box, but one of the opposition players cuts it out. The ball is out of play. A goal scoring opportunity from a corner for Barcelona."
        },
        {
            "gameTime": "2 - 07:36",
            "label": "",
            "description": "Diogo Salomao (Dep. La Coruna) plays a terrific long ball forward to Ivan Cavaleiro, but he can't beat his man and the move breaks down."
        },
        {
            "gameTime": "2 - 07:04",
            "label": "",
            "description": "Neymar (Barcelona) looks to break free, but an opposing player clears the ball away."
        },
        {
            "gameTime": "2 - 06:10",
            "label": "funfact",
            "description": "Here's the current ball possession statistics for both teams – 69:31."
        },
        {
            "gameTime": "2 - 04:33",
            "label": "",
            "description": "Haris Medunjanin (Dep. La Coruna) has proven his good peripheral vision as he picks out Laure with a lovely through ball."
        },
        {
            "gameTime": "2 - 03:40",
            "label": "",
            "description": "Adriano (Barcelona) sends a cross into the box, but Fabri comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 01:53",
            "label": "",
            "description": "Barcelona are showing great team chemistry. They are passing it around beautifully. Excellent team work."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The whistle blows and Carlos Clos Gomez starts the second half."
        },
        {
            "gameTime": "1 - 48:59",
            "label": "",
            "description": "The fans must be pleased so far with the entertainment on the pitch. Let's hope the players don't lose their passion and determination during the half time break. The host team has dominated the game in almost all aspects so far and their opponents have struggled to keep up. The home team makes a lot of passes and attempts to maintain possession. As for the away side, it's obvious that defence has the highest priority for them."
        },
        {
            "gameTime": "1 - 48:02",
            "label": "whistle",
            "description": "There will be nothing more to see in the first half. The whistle blowing of Carlos Clos Gomez has ended it."
        },
        {
            "gameTime": "1 - 47:42",
            "label": "",
            "description": "Neymar (Barcelona) once again attempts to send a defence splitting pass, but the opposition's defence is alert and intercepts the ball."
        },
        {
            "gameTime": "1 - 46:40",
            "label": "",
            "description": "Ivan Cavaleiro (Dep. La Coruna) connects with a pass inside the box, but his effort goes well wide of the left post. The ball goes out of play and Barcelona will have a goal kick."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "Fourth official shows 3 min. of added time."
        },
        {
            "gameTime": "1 - 44:47",
            "label": "",
            "description": "Decent spell from Barcelona here and they keep the pressure on until one of the defending players steps in. It's a throw in for Barcelona."
        },
        {
            "gameTime": "1 - 43:41",
            "label": "",
            "description": "The linesman signals that Lucas Perez (Dep. La Coruna) is offside and the referee confirms the decision."
        },
        {
            "gameTime": "1 - 43:01",
            "label": "corner",
            "description": "The resulting corner from Xavi (Barcelona) is cleared."
        },
        {
            "gameTime": "1 - 42:30",
            "label": "",
            "description": "Xavi (Barcelona) gets on the end of a pass and takes a shot from the edge of the box, but it's blocked by one of the defending players. Barcelona earn a corner."
        },
        {
            "gameTime": "1 - 40:52",
            "label": "",
            "description": "Celso Borges (Dep. La Coruna) gives away a foul for a clumsy challenge. Referee Carlos Clos Gomez saw the whole situation."
        },
        {
            "gameTime": "1 - 40:06",
            "label": "",
            "description": "The Barcelona players keep hold of the ball by exchanging some long passes. One inaccurate pass, however, surrenders possession."
        },
        {
            "gameTime": "1 - 39:45",
            "label": "",
            "description": "Ivan Cavaleiro (Dep. La Coruna) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 38:44",
            "label": "",
            "description": "Half chance! Rafinha (Barcelona) plays a pass into the box, but Fabri reacts well to snuff out the attack."
        },
        {
            "gameTime": "1 - 38:32",
            "label": "substitution",
            "description": "Roberto Canella is substituted due to injury. Victor Sanchez gives a chance to Haris Medunjanin (Dep. La Coruna)."
        },
        {
            "gameTime": "1 - 35:20",
            "label": "injury",
            "description": "Roberto Canella (Dep. La Coruna) picks up an injury."
        },
        {
            "gameTime": "1 - 34:59",
            "label": "",
            "description": "Rafinha (Barcelona) reacts well to get to the rebound and takes a shot from the edge of the box, but he fails to get the ball through the players standing between him and the goal."
        },
        {
            "gameTime": "1 - 34:27",
            "label": "",
            "description": "Jeremy Mathieu (Barcelona) gets to the rebound just outside the box, but his attempt is blocked by one of the defending players."
        },
        {
            "gameTime": "1 - 34:05",
            "label": "",
            "description": "An attempted cross from Adriano (Barcelona) is cleared."
        },
        {
            "gameTime": "1 - 33:42",
            "label": "",
            "description": "The Barcelona players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 32:38",
            "label": "",
            "description": "Marc Bartra (Barcelona) breaks past challenges inside the box, but puts too much pace on his pass to Lionel Messi."
        },
        {
            "gameTime": "1 - 30:45",
            "label": "",
            "description": "Adriano (Barcelona) is flagged for offside."
        },
        {
            "gameTime": "1 - 30:10",
            "label": "",
            "description": "Alberto Lopo (Dep. La Coruna) makes a reckless foul in order to win the ball from his opponent. Carlos Clos Gomez has a clear vision and blows his whistle. A free kick to Barcelona. Xavi (Barcelona) tries to take his opponent by surprise with a quick free kick."
        },
        {
            "gameTime": "1 - 29:30",
            "label": "",
            "description": "Jeremy Mathieu (Barcelona) sends in a pass which fails to reach any of his teammates."
        },
        {
            "gameTime": "1 - 27:51",
            "label": "",
            "description": "Lionel Messi (Barcelona) takes the free kick from a long way out but the defender manages to get it clear."
        },
        {
            "gameTime": "1 - 27:25",
            "label": "",
            "description": "Alex Bergantinos (Dep. La Coruna) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Carlos Clos Gomez blows for the foul but keeps his cards in his pocket on this occasion. Barcelona are awarded a free kick."
        },
        {
            "gameTime": "1 - 25:44",
            "label": "",
            "description": "Marc Bartra (Barcelona) receives a reproachful look from his teammates after he attempted to surprise the goalkeeper with a shot from long distance. The ball flew far wide of the right post. The ball is off of the pitch and it's a goal kick for Dep. La Coruna."
        },
        {
            "gameTime": "1 - 24:02",
            "label": "",
            "description": "Long passes, short passes and one two passes. Barcelona are showcasing great team work by keeping possession and producing pin point passes from player to player. The opposition's players are finding it very difficult to intercept at the moment."
        },
        {
            "gameTime": "1 - 23:28",
            "label": "",
            "description": "Neymar (Barcelona) picks up a lofted cross inside the box and fires a quick shot to the middle of the goal. His promising effort is kept out by Fabricio, who pulls off a stunning save!"
        },
        {
            "gameTime": "1 - 23:17",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Adriano (Barcelona)."
        },
        {
            "gameTime": "1 - 22:20",
            "label": "",
            "description": "Lionel Messi (Barcelona) and Neymar attempt to exchange short two yard passes, but the opposition's defence intercepts the ball."
        },
        {
            "gameTime": "1 - 22:00",
            "label": "",
            "description": "A cross from Diogo Salomao (Dep. La Coruna) fails to reach the box as the defence clears the ball away to safety."
        },
        {
            "gameTime": "1 - 20:57",
            "label": "",
            "description": "A cross is clipped into the penalty area by Xavi (Barcelona) but poses no threat. The ball goes out of play and Dep. La Coruna will have a goal kick."
        },
        {
            "gameTime": "1 - 19:51",
            "label": "corner",
            "description": "Lucas Perez (Dep. La Coruna) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 19:44",
            "label": "",
            "description": "Laure (Dep. La Coruna) attempts to find his teammate with a pass from outside the box, but the opposition's defence is quick to react and thwarts the attack. The referee points to the corner flag. It's a corner to Dep. La Coruna."
        },
        {
            "gameTime": "1 - 18:30",
            "label": "",
            "description": "Adriano (Barcelona) fails to pick a body out in the box with an over hit chip pass. The ball goes out of play and Dep. La Coruna will have a goal kick."
        },
        {
            "gameTime": "1 - 16:55",
            "label": "corner",
            "description": "Xavi (Barcelona) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 16:42",
            "label": "",
            "description": "Pedro (Barcelona) fails to turn the rebound in from a promising position. The goalkeeper pulls off a superb save and denies his effort. The ball is out of play. Barcelona will have a chance to score from a corner."
        },
        {
            "gameTime": "1 - 16:30",
            "label": "",
            "description": "Lionel Messi (Barcelona) produces a ferocious strike from the edge of the box. His dangerous effort towards the bottom left corner is blocked by Fabricio, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 14:51",
            "label": "",
            "description": "Lionel Messi (Barcelona) is strong enough to get to the ball and produces a header from close range. Even though it was aimed precisely towards the middle of the goal, Fabri didn't have a hard time stopping the attempt as it wasn't powerful enough."
        },
        {
            "gameTime": "1 - 13:36",
            "label": "",
            "description": "The assistant referee raises his flag and the referee blows his whistle. Lionel Messi (Barcelona) puts the ball into the net, but he is flagged for offside."
        },
        {
            "gameTime": "1 - 12:33",
            "label": "",
            "description": "Pedro (Barcelona) attempts to set up his teammate with a scoring opportunity by chipping in a fine pass from the edge of the box, but one of the defenders intercepts his effort."
        },
        {
            "gameTime": "1 - 11:25",
            "label": "",
            "description": "Adriano (Barcelona) produces a lovely ball into the penalty area but the defender manages to intercept and comfortably averts the danger."
        },
        {
            "gameTime": "1 - 09:54",
            "label": "corner",
            "description": "Lucas Perez (Dep. La Coruna) sends in the corner, but the keeper steps in and makes a save."
        },
        {
            "gameTime": "1 - 09:30",
            "label": "",
            "description": "Lucas Perez (Dep. La Coruna) wastes a good opportunity as his pass into the box is blocked by the defence. Now Dep. La Coruna have a corner."
        },
        {
            "gameTime": "1 - 08:51",
            "label": "",
            "description": "That's a well taken pass by Jeremy Mathieu (Barcelona). He unleashes a strike from the edge of the box, but blazes it high over the bar. The ball is off of the pitch and it's a goal kick for Dep. La Coruna."
        },
        {
            "gameTime": "1 - 08:33",
            "label": "",
            "description": "Nice passing game by Barcelona. They are increasing their possession with a series of long passes and waiting for the right moment to create an attacking opportunity."
        },
        {
            "gameTime": "1 - 06:50",
            "label": "",
            "description": "Carlos Clos Gomez blows the whistle, Laure (Dep. La Coruna) is penalised for a foul."
        },
        {
            "gameTime": "1 - 04:50",
            "label": "soccer-ball",
            "description": "Goal! Rafinha picks out Lionel Messi (Barcelona) with a perfect cross, and he has no problem to nod the ball into an empty net. It's 1:0."
        },
        {
            "gameTime": "1 - 04:30",
            "label": "",
            "description": "Jeremy Mathieu (Barcelona) sends a teasing cross into the area, but Fabri intercepts the ball."
        },
        {
            "gameTime": "1 - 04:10",
            "label": "corner",
            "description": "The resulting corner from Lucas Perez (Dep. La Coruna) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "1 - 03:40",
            "label": "",
            "description": "The ball is cleared after Ivan Cavaleiro (Dep. La Coruna) attempted to dribble past an opposing player. Dep. La Coruna force a corner. Their opponents will face another attacking threat."
        },
        {
            "gameTime": "1 - 02:28",
            "label": "",
            "description": "Rafinha (Barcelona) put a cross into the box which wasn't a bad decision, but he failed to achieve what he wanted as none of his teammates managed to meet it. The ball goes out of play and Dep. La Coruna will have a goal kick."
        },
        {
            "gameTime": "1 - 01:05",
            "label": "",
            "description": "The Barcelona players are exchanging some short passes."
        },
        {
            "gameTime": "1 - 00:12",
            "label": "",
            "description": "The players are out and the match is about to start. Dep. La Coruna will have the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "Here we go, today's match is starting right now."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Both teams starting lineups are available now, so you can have a look at them."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Carlos Clos Gomez will referee today's match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello to all football fans, we are here to bring you a live commentary of the following match, describing all the most interesting and important moments. We'll make sure you won't miss a thing, so just sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players of both teams deserve praise from their managers and supporters for their performance on the pitch. If they carry on playing this exciting brand of football in future games, then the fans will surely be right behind them. The hosts were largely in control of the game today. The home side's strategy was to maintain possession and put the opponent out of the game. While the visitors focused more on defence and catching their opponent on the break."
        }
    ],
    "gameAwayTeam": "Dep. La Coruna",
    "gameDate": "23/05/2015 - 19:30",
    "gameHomeTeam": "Barcelona",
    "gameScore": "2 - 2"
}