{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/england_epl/2016-2017/2016-12-11 - 19-30 Liverpool 2 - 2 West Ham/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 47:59",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The superiority of the home team was evident on the pitch today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        },
        {
            "gameTime": "2 - 47:50",
            "label": "whistle",
            "description": "Mark Clattenburg is looking at his watch and immediately ends this match."
        },
        {
            "gameTime": "2 - 47:37",
            "label": "corner",
            "description": "A dangerous looking corner kick from James Milner (Liverpool) is cleared to safety by the defence."
        },
        {
            "gameTime": "2 - 47:28",
            "label": "",
            "description": "A cross from James Milner (Liverpool) fails to reach the box as the defence clears the ball away to safety. The referee and his assistant both point at the corner flag. Liverpool will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "2 - 46:08",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) sends a chip pass into the box, but Darren Randolph is quickest to intercept the ball."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "3 additional min. will be played."
        },
        {
            "gameTime": "2 - 42:53",
            "label": "",
            "description": "James Milner (Liverpool) sends a long ball in, but Darren Randolph comfortably gathers the ball."
        },
        {
            "gameTime": "2 - 40:07",
            "label": "corner",
            "description": "James Milner (Liverpool) swings in the corner, but fails to find any of his teammates. One of the defenders reacts superbly to get it clear."
        },
        {
            "gameTime": "2 - 39:40",
            "label": "",
            "description": "James Milner (Liverpool) strikes a volley towards goal from long range, but one of the defenders blocks his effort. Liverpool force a corner. They send men into the box."
        },
        {
            "gameTime": "2 - 37:27",
            "label": "",
            "description": "It wasn't the best example of how to strike the ball. Nathaniel Clyne (Liverpool) unleashed a first time shot from the edge of the box that went high over the crossbar."
        },
        {
            "gameTime": "2 - 37:00",
            "label": "attendance",
            "description": "The attendance for today's match is 53068."
        },
        {
            "gameTime": "2 - 34:33",
            "label": "",
            "description": "Nathaniel Clyne (Liverpool) produces a dangerous lofted cross into the box which is intercepted."
        },
        {
            "gameTime": "2 - 32:07",
            "label": "substitution",
            "description": "It is time for a substitution. Edimilson Fernandes (West Ham) is on for Manuel Lanzini."
        },
        {
            "gameTime": "2 - 31:00",
            "label": "y-card",
            "description": "Sadio Mane (Liverpool) got a yellow card."
        },
        {
            "gameTime": "2 - 30:34",
            "label": "corner",
            "description": "The corner from Jordan Henderson (Liverpool) is hurriedly cleared."
        },
        {
            "gameTime": "2 - 30:21",
            "label": "",
            "description": "James Milner (Liverpool) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away. The referee and one of his assistants signal for a corner kick to Liverpool."
        },
        {
            "gameTime": "2 - 27:32",
            "label": "",
            "description": "James Milner (Liverpool) whips in the resulting free kick but one of the defenders heads the ball to safety."
        },
        {
            "gameTime": "2 - 27:03",
            "label": "",
            "description": "The referee blows his whistle after Winston Reid (West Ham) does a good impression of a basketball player and handles the ball. Liverpool have a free kick."
        },
        {
            "gameTime": "2 - 25:14",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) takes the corner but fails to find any of his teammates as he overhits the effort."
        },
        {
            "gameTime": "2 - 24:54",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) puts a dangerous cross into the box, but the corner is cleared by the first man. Liverpool win a corner."
        },
        {
            "gameTime": "2 - 24:29",
            "label": "",
            "description": "Jordan Henderson (Liverpool) had a good opportunity from long range. His shot was directed towards the top right corner, but Darren Randolph was alert and made a comfortable save. Liverpool earn a corner."
        },
        {
            "gameTime": "2 - 21:50",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) misses a good chance to score. An inch perfect cross into the box finds Georginio Wijnaldum (Liverpool) who rises for a header, but sends the ball well over the bar."
        },
        {
            "gameTime": "2 - 20:00",
            "label": "",
            "description": "James Milner (Liverpool) delivers a lovely cross into the penalty area. Nevertheless, an opposition defender is alert and averts the danger with a brilliant clearance."
        },
        {
            "gameTime": "2 - 17:50",
            "label": "",
            "description": "Divock Origi (Liverpool) is adjudged to have been offside when making his run."
        },
        {
            "gameTime": "2 - 17:10",
            "label": "substitution",
            "description": "The referee stops play so that a substitution can be made and Andre Ayew trots off the pitch and is replaced by Andrew Carroll (West Ham)."
        },
        {
            "gameTime": "2 - 16:32",
            "label": "",
            "description": "A brilliant individual effort! Georginio Wijnaldum (Liverpool) tricks his way past challenges into the box and drags his shot narrowly wide of the right post."
        },
        {
            "gameTime": "2 - 15:01",
            "label": "corner",
            "description": "The resulting corner from Jordan Henderson (Liverpool) only finds one of the defenders, who heads it out of danger."
        },
        {
            "gameTime": "2 - 14:37",
            "label": "",
            "description": "Roberto Firmino (Liverpool) delivers a long ball, but it lacks enough power to reach his teammates and is intercepted by one of the defenders. Good work from Liverpool as they win a corner."
        },
        {
            "gameTime": "2 - 13:51",
            "label": "",
            "description": "Michail Antonio (West Ham) tries to latch onto a through ball, but it's too long."
        },
        {
            "gameTime": "2 - 11:58",
            "label": "",
            "description": "The Liverpool players keep the ball and are exchanging a combination of passes. They are waiting for gaps in the defence to open up."
        },
        {
            "gameTime": "2 - 08:19",
            "label": "",
            "description": "Dimitri Payet (West Ham) sends a lofted pass into the penalty area from a free kick, but the opposition's defence manages to control all the attacking players and thwart the threat."
        },
        {
            "gameTime": "2 - 08:05",
            "label": "",
            "description": "It's a free kick to West Ham in a dangerous position."
        },
        {
            "gameTime": "2 - 07:48",
            "label": "y-card",
            "description": "Roberto Firmino (Liverpool) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Mark Clattenburg didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 06:20",
            "label": "corner",
            "description": "The ball is whipped in from the corner by Jordan Henderson (Liverpool), but one of the defenders gets it clear."
        },
        {
            "gameTime": "2 - 05:51",
            "label": "",
            "description": "Divock Origi (Liverpool) misses a good chance to score. An inch perfect cross into the box finds Divock Origi (Liverpool) who rises for a header, but sends the ball well over the bar. The ball goes out for a corner. Liverpool can continue in their attacking effort."
        },
        {
            "gameTime": "2 - 04:12",
            "label": "",
            "description": "What a chance that is! Georginio Wijnaldum (Liverpool) finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 02:18",
            "label": "soccer-ball",
            "description": "Goal! A mistake from the defence gifted a chance to a lurking Divock Origi (Liverpool), who keeps his cool and rolls the ball into the net from close range. 2:2."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Jurgen Klopp has decided to make a substitution during the half time break. Ragnar Klavan (Liverpool) comes on the pitch for Dejan Lovren."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Mark Clattenburg blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 47:59",
            "label": "",
            "description": "The fans can't complain about what they have been seeing so far on the pitch as both sides are playing highly attractive football. The home side were more active and dominant in the first half. The opposition found it tough to keep up. The tactic of the home side is slow build up play and the away side is creating their opportunities using lightning fast counter attacks."
        },
        {
            "gameTime": "1 - 47:36",
            "label": "whistle",
            "description": "Mark Clattenburg has ended the first half by blowing the whistle."
        },
        {
            "gameTime": "1 - 47:10",
            "label": "",
            "description": "Joel Matip (Liverpool) rises high to connect with a cross from the corner kick, but his powerful header from near the penalty spot crashes against the crossbar!"
        },
        {
            "gameTime": "1 - 47:03",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 46:19",
            "label": "",
            "description": "The ball is cleared after Adam Lallana (Liverpool) attempted to dribble past an opposing player. The referee points to the corner flag. It's a corner to Liverpool."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "We will have 2 min. of added time."
        },
        {
            "gameTime": "1 - 42:31",
            "label": "",
            "description": "Referee Mark Clattenburg sees the trip by Dimitri Payet (West Ham) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "1 - 41:32",
            "label": "",
            "description": "What a chance that is! Roberto Firmino (Liverpool) displays good awareness near the penalty spot to get on the end of a cross, but he sends his header narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 38:49",
            "label": "soccer-ball",
            "description": "GOAL! A terrible mistake leads to a goal. The defender ends up losing possession, allowing Michail Antonio (West Ham) to pick up the ball before slotting it into the back of the net to make it 1:2."
        },
        {
            "gameTime": "1 - 37:24",
            "label": "",
            "description": "Adam Lallana (Liverpool) fails to beat the offside trap and the linesman puts his flag up."
        },
        {
            "gameTime": "1 - 36:31",
            "label": "",
            "description": "Roberto Firmino (Liverpool) unleashes a superb first time shot from the edge of the box, but it flies narrowly wide of the left post."
        },
        {
            "gameTime": "1 - 33:47",
            "label": "",
            "description": "Joel Matip (Liverpool) jumps for a header from the resulting set piece, but it goes way wide of the right post."
        },
        {
            "gameTime": "1 - 33:10",
            "label": "corner",
            "description": "James Milner (Liverpool) takes the corner."
        },
        {
            "gameTime": "1 - 32:58",
            "label": "",
            "description": "Roberto Firmino (Liverpool) looks to break free, but an opposing player clears the ball away. Liverpool get a corner."
        },
        {
            "gameTime": "1 - 32:05",
            "label": "corner",
            "description": "Nothing comes of the resulting corner from Dimitri Payet (West Ham). The defence is alert and manages to cut it out."
        },
        {
            "gameTime": "1 - 31:35",
            "label": "",
            "description": "The defence is alert as they clear a dangerous cross from Mark Noble (West Ham). The ball is out of play. West Ham win a corner kick."
        },
        {
            "gameTime": "1 - 29:05",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety."
        },
        {
            "gameTime": "1 - 28:47",
            "label": "",
            "description": "Jordan Henderson (Liverpool) collects a pass inside the box and unleashes a shot which is brilliantly blocked by a defender. Now Liverpool have a corner."
        },
        {
            "gameTime": "1 - 27:00",
            "label": "soccer-ball",
            "description": "Dimitri Payet (West Ham) beats the goalkeeper with a superb 22 metre free kick. His shot goes inside the left hand post and ends in the back of the net."
        },
        {
            "gameTime": "1 - 25:42",
            "label": "",
            "description": "Mark Clattenburg blows his whistle and signals a foul after Adam Lallana (Liverpool) brought his opponent down. West Ham win a free kick."
        },
        {
            "gameTime": "1 - 23:57",
            "label": "",
            "description": "Roberto Firmino (Liverpool) is offside and the linesman raises his flag."
        },
        {
            "gameTime": "1 - 23:27",
            "label": "",
            "description": "Michail Antonio (West Ham) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 21:07",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) swings in the corner, but it's comfortably cleared away."
        },
        {
            "gameTime": "1 - 20:46",
            "label": "",
            "description": "Michail Antonio (West Ham) swings in a cross, but the ball is cleared to safety by one of the defending players. West Ham will take a corner kick."
        },
        {
            "gameTime": "1 - 17:36",
            "label": "",
            "description": "A cross is clipped into the penalty area by Mark Noble (West Ham) but poses no threat."
        },
        {
            "gameTime": "1 - 14:33",
            "label": "corner",
            "description": "Jordan Henderson (Liverpool) takes the corner, but one of the defenders reacts well and rises highest to head the ball away."
        },
        {
            "gameTime": "1 - 14:13",
            "label": "",
            "description": "Roberto Firmino (Liverpool) meets a cross just outside the area and gets in a strike from a promising position, but the shot is blocked by the defender. Corner kick. Liverpool will have an opportunity."
        },
        {
            "gameTime": "1 - 11:12",
            "label": "",
            "description": "James Milner (Liverpool) attempts to find the head of one of his teammates with a promising cross into the box, but a defender outjumps the attackers and averts the threat."
        },
        {
            "gameTime": "1 - 08:19",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) puts a cross into the box from the corner but there is no panic from the opposition and they easily clear."
        },
        {
            "gameTime": "1 - 07:42",
            "label": "",
            "description": "Loris Karius pulls off a great save to deny Michail Antonio (West Ham), who makes himself some space inside the box and unleashes a quick shot to the right side of the goal. The ball is out of play and the linesman points at the corner flag. Corner to West Ham."
        },
        {
            "gameTime": "1 - 05:42",
            "label": "corner",
            "description": "Dimitri Payet (West Ham) swings in the corner, but the goalkeeper does a brilliant job to intercept the effort."
        },
        {
            "gameTime": "1 - 05:31",
            "label": "",
            "description": "Michail Antonio (West Ham) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The ball goes behind for a corner. West Ham will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 04:21",
            "label": "soccer-ball",
            "description": "Goal! Sadio Mane sends a precise cross into the box, Adam Lallana (Liverpool) latches on to it and puts the ball into the bottom right corner. He makes it 1:0."
        },
        {
            "gameTime": "1 - 03:23",
            "label": "",
            "description": "Georginio Wijnaldum (Liverpool) is adjudged offside."
        },
        {
            "gameTime": "1 - 02:03",
            "label": "",
            "description": "Jordan Henderson (Liverpool) sends a teasing cross into the area, but Darren Randolph intercepts the ball."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The first half has just begun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and Liverpool will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Mark Clattenburg will supervise the game today."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "Before the start of the game, you can see the starting lineups for today's clash."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our live text commentary! We will provide you with instant updates of everything that happens in the match. The starting lineups will be announced very soon."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "West Ham are now without a win in their last 5 games."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It finished 3:4 in the last game between Liverpool and Bournemouth."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "35 the number of times Liverpool have found the back of the net this season."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "What an entertaining encounter between these two teams. Let's hope there will more of the same in their other games. The superiority of the home team was evident on the pitch today. The hosts displayed good teamplay with a lot of passes. The visiting side patiently waited in their own half to dispossess the opponent and hit them on the break."
        }
    ],
    "gameAwayTeam": "West Ham",
    "gameDate": "11/12/2016 - 19:30",
    "gameHomeTeam": "Liverpool",
    "gameScore": "2 - 2"
}