{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/germany_bundesliga/2015-2016/2015-11-07 - 17-30 Bayern Munich 4 - 0 VfB Stuttgart/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 45:59",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. Bayern Munich were better today and displayed masterful control and movement. The visitors couldn't keep pace with the hosts, who excelled in virtually every aspect of the game. They fully deserved their win."
        },
        {
            "gameTime": "2 - 45:15",
            "label": "whistle",
            "description": "Nothing more will happen in this game as the referee blows for full time."
        },
        {
            "gameTime": "2 - 44:26",
            "label": "",
            "description": "David Alaba (Bayern Munich) steps up to take a free kick and sends it in, but the opposition's defence is alert and clears the ball to safety."
        },
        {
            "gameTime": "2 - 43:48",
            "label": "",
            "description": "Bastian Dankert blows his whistle and signals a foul after Daniel Schwaab (VfB Stuttgart) brought his opponent down. Bayern Munich have a free kick."
        },
        {
            "gameTime": "2 - 42:04",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) fails to time his run beyond the last defender and the linesman makes a good call by signalling for offside after seeing the whole situation unfold."
        },
        {
            "gameTime": "2 - 41:03",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) sends a long ball across the pitch, but it misses its target."
        },
        {
            "gameTime": "2 - 39:38",
            "label": "substitution",
            "description": "Substitution. Serey Die will be replaced by Mart Ristl (VfB Stuttgart)."
        },
        {
            "gameTime": "2 - 39:11",
            "label": "",
            "description": "Good movement by Kingsley Coman (Bayern Munich), but he can't find any of his teammates as the cross is poor."
        },
        {
            "gameTime": "2 - 37:27",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) fails to find any of his teammates inside the box as his pass is blocked."
        },
        {
            "gameTime": "2 - 37:00",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) unleashes a powerful shot towards goal from a mid range free kick, but the ball is blocked by the defensive wall."
        },
        {
            "gameTime": "2 - 36:07",
            "label": "",
            "description": "Bastian Dankert interrupts the game for a tactical foul by Serey Die (VfB Stuttgart). Bayern Munich win a free kick."
        },
        {
            "gameTime": "2 - 34:53",
            "label": "",
            "description": "That was close by Thiago Alcantara (Bayern Munich)! He receives a pass on the edge of the box and shoots, but the ball goes by a whisker over the crossbar."
        },
        {
            "gameTime": "2 - 34:17",
            "label": "attendance",
            "description": "The attendance for today's match is 75000."
        },
        {
            "gameTime": "2 - 32:13",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) has picked up a minor injury, but it looks like he will be able to continue."
        },
        {
            "gameTime": "2 - 32:00",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) is flagged for offside."
        },
        {
            "gameTime": "2 - 30:26",
            "label": "injury",
            "description": "The game is interrupted now, Arturo Vidal (Bayern Munich) picks up a knock and the physio has to come on."
        },
        {
            "gameTime": "2 - 29:23",
            "label": "",
            "description": "Thiago Alcantara (Bayern Munich) attempts to find one of his teammates with a cross from the resultant free kick, but he fails to hit the ball properly and sends it off the pitch."
        },
        {
            "gameTime": "2 - 29:09",
            "label": "",
            "description": "Serey Die (VfB Stuttgart) does well to dispossess the attacker with a slide tackle, but the referee blows his whistle for a foul. Bayern Munich are awarded a free kick. Let's see what they create from this."
        },
        {
            "gameTime": "2 - 28:08",
            "label": "",
            "description": "Rafinha (Bayern Munich) brings his opponent down. Bastian Dankert has a clear sight of it and blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 27:31",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) gets on the ball and beats an opponent, but his run is stopped by the referee Bastian Dankert who sees an offensive foul."
        },
        {
            "gameTime": "2 - 25:48",
            "label": "",
            "description": "Arturo Vidal slides a brilliant pass into Arjen Robben (Bayern Munich), but his shot from inside the box goes a whisker wide of the left post."
        },
        {
            "gameTime": "2 - 25:33",
            "label": "",
            "description": "Philip Heise (VfB Stuttgart) is caught in the offside trap."
        },
        {
            "gameTime": "2 - 24:59",
            "label": "",
            "description": "Timo Werner (VfB Stuttgart) is flagged offside not for the first time in this match."
        },
        {
            "gameTime": "2 - 24:32",
            "label": "",
            "description": "Timo Werner (VfB Stuttgart) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 23:31",
            "label": "substitution",
            "description": "Substitution. Thiago Alcantara (Bayern Munich) replaces Douglas Costa."
        },
        {
            "gameTime": "2 - 22:54",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) reacts well and displays good awareness near the penalty spot to get on the end of a cross from the free kick. He jumps high and produces a header which goes well over the crossbar."
        },
        {
            "gameTime": "2 - 22:45",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) takes a direct free kick."
        },
        {
            "gameTime": "2 - 21:59",
            "label": "",
            "description": "Adam Hlousek (VfB Stuttgart) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. Bayern Munich win a free kick and will be able to apply some pressure on the opposition goal."
        },
        {
            "gameTime": "2 - 19:59",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) produced a promising shot towards the bottom left corner after his wonderful solo run, but Przemyslaw Tyton thwarted him with a fabulous save and the score remains the same."
        },
        {
            "gameTime": "2 - 18:01",
            "label": "",
            "description": "Manuel Neuer pulls off a great save to deny Philip Heise (VfB Stuttgart) after receiving a precise defence splitting pass. The effort is headed for the left side of the goal, but the goalkeeper dives superbly to stop it. Definitely the best save of this match so far!"
        },
        {
            "gameTime": "2 - 17:30",
            "label": "substitution",
            "description": "Substitution. Toni Sunjic makes way for Philip Heise (VfB Stuttgart)."
        },
        {
            "gameTime": "2 - 17:13",
            "label": "corner",
            "description": "Arjen Robben (Bayern Munich) quickly takes the corner kick with a short pass."
        },
        {
            "gameTime": "2 - 16:35",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) receives a low pass just outside the box and unleashes a fine strike towards the right post. Przemyslaw Tyton pulls off a reflexive save to block his effort. Nice goalkeeping skill, indeed. The referee signals a corner kick to Bayern Munich."
        },
        {
            "gameTime": "2 - 16:14",
            "label": "",
            "description": "Referee Bastian Dankert sees the trip by Daniel Schwaab (VfB Stuttgart) and doesn't hesitate to blow his whistle. A free kick has been awarded to Bayern Munich."
        },
        {
            "gameTime": "2 - 14:53",
            "label": "",
            "description": "Przemyslaw Tyton pulls off a great save to deny Kingsley Coman (Bayern Munich) who, makes himself some space inside the box and unleashes a quick low drive towards the middle of the goal."
        },
        {
            "gameTime": "2 - 14:03",
            "label": "",
            "description": "Daniel Didavi (VfB Stuttgart) latches on to a lovely pass inside the box and fires towards the left side of the net, but the effort is smothered by the keeper."
        },
        {
            "gameTime": "2 - 13:21",
            "label": "substitution",
            "description": "Substitution. Thomas Muller did his best and is replaced by Holger Badstuber (Bayern Munich)."
        },
        {
            "gameTime": "2 - 12:46",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) clips a neat ball into the box in the direction of Robert Lewandowski, but he can't get on the end of the pass."
        },
        {
            "gameTime": "2 - 11:52",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) did his best to latch on to a crossfield pass, but it was too long and it goes out of play."
        },
        {
            "gameTime": "2 - 10:39",
            "label": "",
            "description": "Timo Werner (VfB Stuttgart) is forced to stop his attacking move after the linesman signals for offside."
        },
        {
            "gameTime": "2 - 10:00",
            "label": "",
            "description": "Rafinha (Bayern Munich) is penalised for holding. Bastian Dankert signals a set piece."
        },
        {
            "gameTime": "2 - 08:54",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance."
        },
        {
            "gameTime": "2 - 06:38",
            "label": "",
            "description": "What a big chance! Arjen Robben (Bayern Munich) picks up an inch perfect pass inside the box and fires the ball a whisker wide of the right post."
        },
        {
            "gameTime": "2 - 06:07",
            "label": "",
            "description": "Adam Hlousek (VfB Stuttgart) finds himself behind the opposition's defence, but the game is stopped for offside."
        },
        {
            "gameTime": "2 - 03:45",
            "label": "",
            "description": "A lofted cross from David Alaba (Bayern Munich) is unsuccessful as the opponent's defence quickly clears the ball out of the penalty area."
        },
        {
            "gameTime": "2 - 03:07",
            "label": "",
            "description": "The foul by Timo Werner (VfB Stuttgart) was seen by Bastian Dankert who didn't hesitate to blow the whistle."
        },
        {
            "gameTime": "2 - 01:59",
            "label": "",
            "description": "Daniel Didavi (VfB Stuttgart) is forced to stop his forward run after being caught in an offside position by the linesman."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Jerome Boateng is replaced by Mehdi Benatia (Bayern Munich)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "substitution",
            "description": "Half time substitution. Alexander Zorniger decided to make a change. Filip Kostic is replaced by Adam Hlousek (VfB Stuttgart)."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "Referee Bastian Dankert blows his whistle to start the second half."
        },
        {
            "gameTime": "1 - 45:59",
            "label": "",
            "description": "It was a good decision to watch today's encounter. There has already been more to see prior to the half time break than there is in most games during the full 90 minutes. It was a fairly one sided opening 45 minutes, with Bayern Munich much the better side better so far. The visitors have been very flat and lacked creativity in their attack. Let's see if they change something in the second period."
        },
        {
            "gameTime": "1 - 45:14",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 44:31",
            "label": "",
            "description": "Florian Klein (VfB Stuttgart) delivers a promising cross into the box, but it's cleared."
        },
        {
            "gameTime": "1 - 43:20",
            "label": "",
            "description": "He should have done better. Arjen Robben (Bayern Munich) is afforded space to connect with a Kingsley Coman cross, but his header from the centre of the box flies well over the crossbar."
        },
        {
            "gameTime": "1 - 42:20",
            "label": "",
            "description": "Timo Werner (VfB Stuttgart) was all set to receive a beautiful pass into a promising position. However, one of the defenders makes a timely clearance."
        },
        {
            "gameTime": "1 - 39:59",
            "label": "soccer-ball",
            "description": "Thomas Muller (Bayern Munich) scores with a header from inside the box after a goalmouth scramble."
        },
        {
            "gameTime": "1 - 39:40",
            "label": "",
            "description": "What a chance that is! Arturo Vidal (Bayern Munich) leaps high to meet a lofted pass inside the six yard box, but his header crashes off the crossbar!"
        },
        {
            "gameTime": "1 - 39:20",
            "label": "",
            "description": "Przemyslaw Tyton hears the fans clapping his superb goalkeeping. Kingsley Coman (Bayern Munich) shoots from the edge of the box towards the right side of the goal, but the goalkeeper makes a magnificent save."
        },
        {
            "gameTime": "1 - 36:49",
            "label": "soccer-ball",
            "description": "Goal! Robert Lewandowski (Bayern Munich) scores after an assist by Thomas Muller that allowed him to tap in the ball into an empty net. The score is 3:0."
        },
        {
            "gameTime": "1 - 36:11",
            "label": "",
            "description": "CHANCE! Timo Werner (VfB Stuttgart) picks up a perfect pass inside the box, makes himself some space for a shot, but his effort goes just over the crossbar."
        },
        {
            "gameTime": "1 - 35:40",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 34:50",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) produces a ferocious strike from the edge of the box. His dangerous low effort towards the middle of the goal is blocked by Przemyslaw Tyton, who pulls off a superb save to keep the ball out of the net."
        },
        {
            "gameTime": "1 - 33:12",
            "label": "",
            "description": "Filip Kostic (VfB Stuttgart) picks up a pass inside the box and unleashes a shot goalwards that crashes against the bar. It could have been a brilliant goal, unlucky."
        },
        {
            "gameTime": "1 - 32:36",
            "label": "",
            "description": "Great teamplay by Bayern Munich as they control the ball with a lot of short passes. Patience is the key if they want to find a gap in the defence to score."
        },
        {
            "gameTime": "1 - 32:05",
            "label": "funfact",
            "description": "The total number of attempts is 33:5."
        },
        {
            "gameTime": "1 - 30:06",
            "label": "",
            "description": "A dangerous towering header by Thomas Muller (Bayern Munich) from around the penalty spot goes just wide of the right post. This corner kick didn't change the score."
        },
        {
            "gameTime": "1 - 29:55",
            "label": "corner",
            "description": "Joshua Kimmich (Bayern Munich) is about to take a corner kick."
        },
        {
            "gameTime": "1 - 29:29",
            "label": "",
            "description": "Przemyslaw Tyton pulls off a great save to deny Robert Lewandowski (Bayern Munich), who makes himself some space inside the box and unleashes a quick shot towards the middle of the goal. The referee points to the corner flag. It's a corner to Bayern Munich."
        },
        {
            "gameTime": "1 - 28:02",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) makes a yard for himself on the edge of the box after picking up a pass, but produces a poor effort that sails high over the bar."
        },
        {
            "gameTime": "1 - 27:45",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes the resulting corner which is well defended."
        },
        {
            "gameTime": "1 - 27:22",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) connects with a pass but sees his shot from the edge of the box blocked. The ball is out of play. Bayern Munich win a corner kick."
        },
        {
            "gameTime": "1 - 26:03",
            "label": "",
            "description": "Arturo Vidal (Bayern Munich) produces a killer pass onto Robert Lewandowski, who loses the ball to one of the defenders."
        },
        {
            "gameTime": "1 - 24:49",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) shows off his amazing technique to get to the edge of the box by himself. He pulls the trigger but sends the ball miles wide of the right post. Nice run, but poor finish!"
        },
        {
            "gameTime": "1 - 22:37",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) meets a pass on the edge of the penalty area and shoots towards right side of the goal. He didn't put enough power into the effort, though, and Przemyslaw Tyton pulls off an easy save."
        },
        {
            "gameTime": "1 - 21:00",
            "label": "",
            "description": "A beautiful low pass from the side is received by Robert Lewandowski (Bayern Munich), who was waiting for his chance. However, the defence is alert and spanks the ball away."
        },
        {
            "gameTime": "1 - 18:50",
            "label": "corner",
            "description": "Daniel Didavi (VfB Stuttgart) swings in the corner kick, but one of the defenders leaps highest to head the ball away."
        },
        {
            "gameTime": "1 - 18:24",
            "label": "",
            "description": "Daniel Didavi (VfB Stuttgart) sends a pass into the box, but his attempt is thwarted and cleared. The ball goes out of play. VfB Stuttgart are awarded a corner kick."
        },
        {
            "gameTime": "1 - 16:18",
            "label": "soccer-ball",
            "description": "Goal! Thomas Muller slips it to Douglas Costa (Bayern Munich) on the edge of the box and he finds the right side of the net with a great effort. The score is 2:0."
        },
        {
            "gameTime": "1 - 15:51",
            "label": "corner",
            "description": "The resulting corner from Arjen Robben (Bayern Munich) is cleared by the defence."
        },
        {
            "gameTime": "1 - 15:29",
            "label": "",
            "description": "Thomas Muller (Bayern Munich) collects a great pass inside the box and misses a golden opportunity. His low drive is headed for the bottom left corner, but the goalkeeper pulls off a marvellous diving save and denies him. Bayern Munich have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 14:38",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) receives a precise pass and is given time inside the box to send a low strike towards the middle of the goal. Przemyslaw Tyton guesses his intention and denies him with a fine save."
        },
        {
            "gameTime": "1 - 13:53",
            "label": "",
            "description": "Arjen Robben (Bayern Munich) received a pass inside the box and sent a dangerous shot in on goal, but keep the champagne on ice as one of the defenders stepped in and blocked the effort. It's hard to say whether the keeper would have stopped it."
        },
        {
            "gameTime": "1 - 12:56",
            "label": "corner",
            "description": "The resulting corner from Filip Kostic (VfB Stuttgart) is cleared."
        },
        {
            "gameTime": "1 - 12:37",
            "label": "",
            "description": "A fine lofted pass into the box, sent by Serey Die (VfB Stuttgart), is intercepted by the opposition's defence. The referee and one of his assistants signal for a corner kick to VfB Stuttgart."
        },
        {
            "gameTime": "1 - 10:25",
            "label": "soccer-ball",
            "description": "Goal! Douglas Costa puts the ball across the area and Arjen Robben (Bayern Munich) has the easiest task in the world to tuck the ball into an empty net. 1:0."
        },
        {
            "gameTime": "1 - 10:00",
            "label": "corner",
            "description": "Filip Kostic (VfB Stuttgart) decides to take a short corner instead of crossing into the box."
        },
        {
            "gameTime": "1 - 09:34",
            "label": "",
            "description": "Emiliano Insua (VfB Stuttgart) fails to send a pass into the box as his effort is cut out. Corner kick. VfB Stuttgart will have an opportunity."
        },
        {
            "gameTime": "1 - 08:26",
            "label": "",
            "description": "Kingsley Coman (Bayern Munich) looks to break free, but his touch lets him down and he loses the ball."
        },
        {
            "gameTime": "1 - 07:28",
            "label": "",
            "description": "Daniel Schwaab (VfB Stuttgart) plays a long ball to Timo Werner, but the defence is well organised and manages to get it clear."
        },
        {
            "gameTime": "1 - 05:27",
            "label": "",
            "description": "A cross is clipped into the penalty area by Emiliano Insua (VfB Stuttgart) but poses no threat."
        },
        {
            "gameTime": "1 - 04:11",
            "label": "",
            "description": "Robert Lewandowski (Bayern Munich) reacts well near the penalty spot to connect with the resulting corner, but fails to direct his header into the back of the net. The ball floats high over the bar."
        },
        {
            "gameTime": "1 - 03:48",
            "label": "corner",
            "description": "The referee awards a corner and Douglas Costa (Bayern Munich) goes over to take it."
        },
        {
            "gameTime": "1 - 03:22",
            "label": "",
            "description": "Douglas Costa (Bayern Munich) latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the bottom left corner. Przemyslaw Tyton has a clear sight of it makes a comfortable save. Bayern Munich will have a chance to score from a corner kick."
        },
        {
            "gameTime": "1 - 03:10",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Douglas Costa (Bayern Munich) takes it short."
        },
        {
            "gameTime": "1 - 02:38",
            "label": "corner",
            "description": "Douglas Costa (Bayern Munich) takes the corner kick and sends a lovely ball into the penalty area, but the opposition's defence is ready and knocks the ball to safety. Bayern Munich force a corner. They send men into the box."
        },
        {
            "gameTime": "1 - 02:02",
            "label": "",
            "description": "Joshua Kimmich (Bayern Munich) puts a cross into the box from the free kick, but the defender gets there first. The ball is out of play. A goal scoring opportunity from a corner for Bayern Munich."
        },
        {
            "gameTime": "1 - 01:31",
            "label": "",
            "description": "Emiliano Insua (VfB Stuttgart) brings an opponent down and Bastian Dankert interrupts the game. It's a free kick to Bayern Munich, but they probably won't attempt a direct shot on goal from here."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "",
            "description": "The players are out and the match is about to start. VfB Stuttgart will have the kick off."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The match has just started."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Bastian Dankert was nominated as the referee for this game."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "The starting lineups for this match have been revealed."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello, welcome to our live play by play commentaries. You will be able to see a written form of all the interesting moments of the game, so you won't miss a thing. Sit back and have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "It was an attractive offensive game and the fans have no reason to be upset. Bayern Munich were better today and displayed masterful control and movement. The visitors couldn't keep pace with the hosts, who excelled in virtually every aspect of the game. They fully deserved their win."
        }
    ],
    "gameAwayTeam": "VfB Stuttgart",
    "gameDate": "07/11/2015 - 17:30",
    "gameHomeTeam": "Bayern Munich",
    "gameScore": "4 - 0"
}