{
    "UrlLocal": "/media/giancos/Football/dataset_test//media/giancos/Football/dataset_test/italy_serie-a/2014-2015/2015-02-15 - 14-30 AC Milan 1 - 1 Empoli/",
    "UrlYoutube": "",
    "annotations": [
        {
            "gameTime": "2 - 48:59",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The visitors played the better football overall. The home side's tactic was kick and rush football, the exact opposite of the away team who made a lot of passes and attempted to maintain possession."
        },
        {
            "gameTime": "2 - 48:09",
            "label": "whistle",
            "description": "The match has just finished."
        },
        {
            "gameTime": "2 - 46:28",
            "label": "",
            "description": "Paolo Valeri blows his whistle after Alessio Cerci (AC Milan) kicks an opponent's legs instead of the ball."
        },
        {
            "gameTime": "2 - 45:39",
            "label": "y-card",
            "description": "Lorenzo Tonelli (Empoli) gets a yellow card."
        },
        {
            "gameTime": "2 - 45:00",
            "label": "time",
            "description": "There will be a minimum of 3 min. of added time."
        },
        {
            "gameTime": "2 - 42:25",
            "label": "injury",
            "description": "Gabriel Paletta (AC Milan) is asking for medical treatment, but he will have to leave the pitch in order to receive help from the physio."
        },
        {
            "gameTime": "2 - 39:55",
            "label": "substitution",
            "description": "The substitution has been made. Christian Abbiati (AC Milan) has replaced Mattia Destro."
        },
        {
            "gameTime": "2 - 37:55",
            "label": "r-card",
            "description": "A strict call by Paolo Valeri! He pulls out the red card and sends Diego Lopez (AC Milan) off the pitch."
        },
        {
            "gameTime": "2 - 37:50",
            "label": "",
            "description": "The referee blows his whistle, a clear handball by Diego Lopez (AC Milan)."
        },
        {
            "gameTime": "2 - 36:55",
            "label": "substitution",
            "description": "Maurizio Sarri has decided to make a change. Franco Signorelli (Empoli) replaces Daniele Croce."
        },
        {
            "gameTime": "2 - 34:58",
            "label": "y-card",
            "description": "Today's referee Paolo Valeri rightly decides to book Gabriel Paletta (AC Milan) for his harsh tackle."
        },
        {
            "gameTime": "2 - 33:50",
            "label": "substitution",
            "description": "Today's match ends for Keisuke Honda who will be replaced by Alessio Cerci (AC Milan)."
        },
        {
            "gameTime": "2 - 33:41",
            "label": "",
            "description": "Mattia Destro (AC Milan) in a great chance! He climbs highest deep in the penalty box and strikes with a powerful header towards the net. Next time he should aim better. His effort ends wide of the right post."
        },
        {
            "gameTime": "2 - 32:55",
            "label": "y-card",
            "description": "Simone Verdi (Empoli) can't expect anything else than a yellow card for his hard tackle. And a yellow it is. Paolo Valeri didn't think twice about pulling it out of his pocket."
        },
        {
            "gameTime": "2 - 31:35",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) trips an opponent with a slide tackle. Paolo Valeri stops the game and he could give him a card, but eventually decides on just a warning."
        },
        {
            "gameTime": "2 - 29:50",
            "label": "",
            "description": "Mario Rui (Empoli) commits a minor foul to interrupt the attacking move of his opponent and is warned by the referee that he will get a yellow card if he does it again."
        },
        {
            "gameTime": "2 - 28:35",
            "label": "",
            "description": "Luca Antonelli (AC Milan) is penalised for tripping, a poor challenge. Paolo Valeri, blowing his whistle for a foul, makes it clear he won't tolerate such behaviour. A free kick to Empoli."
        },
        {
            "gameTime": "2 - 26:06",
            "label": "",
            "description": "Mirko Valdifiori (Empoli) commits an ugly tackle on his opponent, but there is no caution from the referee."
        },
        {
            "gameTime": "2 - 22:26",
            "label": "soccer-ball",
            "description": "Goal – 1:1! Elseid Hysaj sends a precise lofted pass into the box, Massimo Maccarone (Empoli) rises above the defenders to meet the ball near the penalty spot and heads it straight into the bottom left corner."
        },
        {
            "gameTime": "2 - 22:07",
            "label": "",
            "description": "An attempted cross from Mario Rui (Empoli) is cleared."
        },
        {
            "gameTime": "2 - 18:48",
            "label": "substitution",
            "description": "The game has come to an end for Manuel Pucciarelli. He has contributed as much as he could today. He will be replaced by the fresh legs of Francesco Tavano (Empoli)."
        },
        {
            "gameTime": "2 - 18:33",
            "label": "y-card",
            "description": "Luca Antonelli (AC Milan) will have to be careful for the rest of the match as he is shown a yellow card."
        },
        {
            "gameTime": "2 - 17:11",
            "label": "",
            "description": "Daniele Croce (Empoli) swings a cross into the box, but it's far too close to Diego Lopez, who smothers the ball."
        },
        {
            "gameTime": "2 - 14:23",
            "label": "",
            "description": "Simone Verdi (Empoli) wastes a huge opportunity! He receives a precise cross inside the penalty area and releases a quick shot that sails towards the right post. His effort, however, lacks power and the goalkeeper dives to make a stunning save."
        },
        {
            "gameTime": "2 - 13:47",
            "label": "",
            "description": "Keisuke Honda (AC Milan) tackles a bit over zealously and Paolo Valeri blows for a foul."
        },
        {
            "gameTime": "2 - 12:36",
            "label": "",
            "description": "Referee Paolo Valeri sees the trip by Mario Rui (Empoli) and doesn't hesitate to blow his whistle."
        },
        {
            "gameTime": "2 - 11:38",
            "label": "corner",
            "description": "Mirko Valdifiori (Empoli) takes the corner, but the opposition's defence is ready and clears the ball to safety."
        },
        {
            "gameTime": "2 - 11:20",
            "label": "",
            "description": "Elseid Hysaj (Empoli) races towards goal but the defender gets back well to make a challenge. The ball is out of play and the linesman points at the corner flag. Corner to Empoli."
        },
        {
            "gameTime": "2 - 08:55",
            "label": "substitution",
            "description": "The manager makes a subsitution with Simone Verdi (Empoli) coming on for Matias Vecino."
        },
        {
            "gameTime": "2 - 08:11",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) wastes a good opportunity as his pass into the box is blocked by the defence."
        },
        {
            "gameTime": "2 - 05:47",
            "label": "",
            "description": "A clumsy foul by Mattia Destro (AC Milan) and Paolo Valeri blows his whistle."
        },
        {
            "gameTime": "2 - 02:55",
            "label": "y-card",
            "description": "A yellow card for a tackle by Adil Rami (AC Milan). Paolo Valeri doesn't hesitate at all to make this decision."
        },
        {
            "gameTime": "2 - 02:39",
            "label": "",
            "description": "Luca Antonelli (AC Milan) sends a cross into the box, but Luigi Sepe comes off his line to gather the ball."
        },
        {
            "gameTime": "2 - 01:36",
            "label": "",
            "description": "Andrea Poli (AC Milan) brings his opponent down with a tackle and Paolo Valeri blows his whistle for a foul."
        },
        {
            "gameTime": "2 - 01:05",
            "label": "",
            "description": "That's a well taken pass by Adil Rami (AC Milan). He unleashes a strike from the edge of the box, but blazes it high over the bar."
        },
        {
            "gameTime": "2 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle to signal the start of the second half."
        },
        {
            "gameTime": "1 - 46:59",
            "label": "",
            "description": "The opening 45 minutes weren't very eventful and the game could be described as an average one. Neither side has gained the upper hand as yet. The home side are attempting to create scoring opportunities mainly with long balls, while the away team are trying to prevail using combination football."
        },
        {
            "gameTime": "1 - 46:02",
            "label": "whistle",
            "description": "The match has reached half time."
        },
        {
            "gameTime": "1 - 45:00",
            "label": "time",
            "description": "1 additional min. will be played."
        },
        {
            "gameTime": "1 - 42:55",
            "label": "",
            "description": "Matias Vecino (Empoli) manages to dispossess his opponent of the ball, but he commits a foul in the process and the referee blows his whistle. AC Milan get a free kick."
        },
        {
            "gameTime": "1 - 39:32",
            "label": "soccer-ball",
            "description": "Mattia Destro (AC Milan) receives a precise pass inside the box from Giacomo Bonaventura and he beats the goalkeeper with a neat finish into the left side of the net. 1:0."
        },
        {
            "gameTime": "1 - 38:51",
            "label": "",
            "description": "Mirko Valdifiori (Empoli) delivers a poor cross from a free kick as one of the defenders comfortably clears it away."
        },
        {
            "gameTime": "1 - 38:18",
            "label": "",
            "description": "Salvatore Bocchetti (AC Milan) changes the direction of the ball using his hand, but he is angry when the referee gives a foul against him. Empoli have a free kick."
        },
        {
            "gameTime": "1 - 36:58",
            "label": "corner",
            "description": "Mirko Valdifiori (Empoli) takes the corner with a short pass."
        },
        {
            "gameTime": "1 - 36:41",
            "label": "",
            "description": "Mario Rui (Empoli) receives a precise low pass inside the box, controls the ball and releases it towards the left post. Unfortunately for him, Diego Lopez makes a great save to stop his effort. Empoli have been awarded a corner kick. The referee and one of his assistants both point at the corner flag."
        },
        {
            "gameTime": "1 - 33:46",
            "label": "corner",
            "description": "A horde of players are waiting inside the penalty area for a cross from the corner, but Keisuke Honda (AC Milan) takes it short."
        },
        {
            "gameTime": "1 - 33:35",
            "label": "",
            "description": "A cross into the box from Giacomo Bonaventura (AC Milan) is cleared. The ball is out of play. AC Milan win a corner kick."
        },
        {
            "gameTime": "1 - 33:03",
            "label": "",
            "description": "Elseid Hysaj (Empoli) sends a teasing cross into the area, but Diego Lopez intercepts the ball."
        },
        {
            "gameTime": "1 - 29:34",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) times his run too early and the linesman raises his flag for offside."
        },
        {
            "gameTime": "1 - 28:52",
            "label": "",
            "description": "meets a cross inside the box, but Diego Lopez (AC Milan) wins the battle for the ball and the chance is gone."
        },
        {
            "gameTime": "1 - 25:24",
            "label": "corner",
            "description": "Keisuke Honda (AC Milan) rolls the ball short to a teammate from the corner instead of sending a cross into the box."
        },
        {
            "gameTime": "1 - 25:12",
            "label": "",
            "description": "Keisuke Honda (AC Milan) flights in the cross, but the defender is alert and clears to safety. The ball goes out for a corner. AC Milan can continue in their attacking effort."
        },
        {
            "gameTime": "1 - 24:10",
            "label": "",
            "description": "Nigel De Jong (AC Milan) commits a foul after making a slide tackle on his opponent."
        },
        {
            "gameTime": "1 - 22:16",
            "label": "",
            "description": "Keisuke Honda (AC Milan) carelessly slides into the feet of his opponent and he'll be lucky to avoid punishment. Paolo Valeri blows for the foul but keeps his cards in his pocket on this occasion. Empoli have been awarded a free kick."
        },
        {
            "gameTime": "1 - 21:47",
            "label": "",
            "description": "The Empoli players are displaying brilliant short passes and great ball movement. They are waiting to open the opposition's defence and hit them swiftly on the break."
        },
        {
            "gameTime": "1 - 18:35",
            "label": "",
            "description": "is penalised after knocking an opponent down."
        },
        {
            "gameTime": "1 - 17:12",
            "label": "",
            "description": "Giacomo Bonaventura (AC Milan) probably handled the ball."
        },
        {
            "gameTime": "1 - 16:03",
            "label": "",
            "description": "Luca Antonelli (AC Milan) produces a quality cross into the box, but the opposition's defence intercepts the ball and spanks it away."
        },
        {
            "gameTime": "1 - 13:43",
            "label": "",
            "description": "Paolo Valeri blows his whistle and signals a foul after Daniele Croce (Empoli) brought his opponent down."
        },
        {
            "gameTime": "1 - 12:10",
            "label": "",
            "description": "The game is interrupted as Daniele Croce (Empoli) is flagged offside."
        },
        {
            "gameTime": "1 - 10:30",
            "label": "",
            "description": "What a chance that is! finds himself unmarked in a promising position after receiving a cross on the edge of the box and his attempt sails a whisker wide of the left post."
        },
        {
            "gameTime": "1 - 07:58",
            "label": "corner",
            "description": "Mirko Valdifiori (Empoli) attempts to find a teammate with the corner, but the effort is snuffed out by the goalkeeper."
        },
        {
            "gameTime": "1 - 07:23",
            "label": "substitution",
            "description": "Alex is substituted due to injury. Filippo Inzaghi gives a chance to Salvatore Bocchetti (AC Milan)."
        },
        {
            "gameTime": "1 - 07:15",
            "label": "",
            "description": "Daniele Croce (Empoli) goes on a solo run, but he fails to create a chance as an opposition player blocks him. The referee and his assistant both point at the corner flag. Empoli will have an opportunity to threaten the opposition's goal."
        },
        {
            "gameTime": "1 - 06:01",
            "label": "",
            "description": "latches on to a precise defence splitting pass and fires a nice strike from a promising distance towards the bottom left corner. Diego Lopez (AC Milan) has a clear sight of it makes a comfortable save."
        },
        {
            "gameTime": "1 - 05:27",
            "label": "",
            "description": "A crossfield pass from Mattia Destro (AC Milan) fails to find any of his teammates."
        },
        {
            "gameTime": "1 - 02:32",
            "label": "",
            "description": "Manuel Pucciarelli (Empoli) misses a great chance! He latches on to a fine cross into the box, but his effort misses the right post by a whisker."
        },
        {
            "gameTime": "1 - 01:35",
            "label": "",
            "description": "Gabriel Paletta (AC Milan) serves up a nice cross, but the defence clears the danger."
        },
        {
            "gameTime": "1 - 00:01",
            "label": "whistle",
            "description": "The referee blows his whistle and we are underway."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "The players are on the pitch and AC Milan will have the kick off."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Paolo Valeri got the nomination for today's game and will try his best to be a fair judge and not make any mistakes."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "lineup1",
            "description": "You can have a look at the starting XIs of both teams in the details of this match."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Hello and welcome to our minute by minute commentary of the upcoming clash. We will try to provide you with as accurate as possible picture of the happenings on the pitch. Have fun."
        },
        {
            "gameTime": "0 - 00:00",
            "label": "",
            "description": "Today's game was very poor. There weren't many thrilling moments. The visitors played the better football overall. The home side's tactic was kick and rush football, the exact opposite of the away team who made a lot of passes and attempted to maintain possession."
        }
    ],
    "gameAwayTeam": "Empoli",
    "gameDate": "15/02/2015 - 14:30",
    "gameHomeTeam": "AC Milan",
    "gameScore": "1 - 1"
}